[
    {
        "title": "Prediction of treatment outcome in clinical trials under a personalized medicine perspective",
        "link": "https://www.nature.com/articles/s41598-022-07801-4",
        "publication_date": "08 Mar 2022",
        "abstract": "A central problem in most data-driven personalized medicine scenarios is the estimation of heterogeneous treatment effects to stratify individuals into subpopulations that differ in their susceptibility to a particular disease or response to a specific treatment. In this work, with an illustrative example on type 2 diabetes we showed how the increasing ability to access and analyzed open data from randomized clinical trials (RCTs) allows to build Machine Learning applications in a framework of personalized medicine. An ensemble machine learning predictive model is first developed and then applied to estimate the expected treatment response according to the medication that would be prescribed. Machine learning is quickly becoming indispensable to bridge science and clinical practice, but it is not sufficient on its own. A collaborative effort is requested to clinicians, statisticians, and computer scientists to strengthen tools built on machine learning to take advantage of this evidence flow.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The image-based preoperative fistula risk score (preFRS) predicts postoperative pancreatic fistula in patients undergoing pancreatic head resection",
        "link": "https://www.nature.com/articles/s41598-022-07970-2",
        "publication_date": "08 Mar 2022",
        "abstract": "Clinically relevant postoperative pancreatic fistula (CR-POPF) is a common severe surgical complication after pancreatic surgery. Current risk stratification systems mostly rely on intraoperatively assessed factors like manually determined gland texture or blood loss. We developed a preoperatively available image-based risk score predicting CR-POPF as a complication of pancreatic head resection. Frequency of CR-POPF and occurrence of salvage completion pancreatectomy during the hospital stay were associated with an intraoperative surgical (sFRS) and image-based preoperative CT-based (rFRS) fistula risk score, both considering pancreatic gland texture, pancreatic duct diameter and pathology, in 195 patients undergoing pancreatic head resection. Based on its association with fistula-related outcome, radiologically estimated pancreatic remnant volume was included in a preoperative (preFRS) score for POPF risk stratification. Intraoperatively assessed pancreatic duct diameter (p < 0.001), gland texture (p < 0.001) and high-risk pathology (p < 0.001) as well as radiographically determined pancreatic duct diameter (p < 0.001), gland texture (p < 0.001), high-risk pathology (p = 0.001), and estimated pancreatic remnant volume (p < 0.001) correlated with the risk of CR-POPF development. PreFRS predicted the risk of CR-POPF development (AUC = 0.83) and correlated with the risk of rescue completion pancreatectomy. In summary, preFRS facilitates preoperative POPF risk stratification in patients undergoing pancreatic head resection, enabling individualized therapeutic approaches and optimized perioperative management.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning based sarcopenia prediction from shear-wave ultrasonographic elastography and gray scale ultrasonography of rectus femoris muscle",
        "link": "https://www.nature.com/articles/s41598-022-07683-6",
        "publication_date": "04 Mar 2022",
        "abstract": "We aim to evaluate the performance of a deep convolutional neural network (DCNN) in predicting the presence or absence of sarcopenia using shear-wave elastography (SWE) and gray-scale ultrasonography (GSU) of rectus femoris muscle as an imaging biomarker. This retrospective study included 160 pair sets of GSU and SWE images (n = 160) from December 2018 and July 2019. Two radiologists scored the echogenicity of muscle on GSU (4-point score). Among them, 141 patients underwent CT and their L3 skeletal muscle index (SMI) were measured to categorize the presence or absence of sarcopenia. For DCNN, we used three CNN architectures (VGG19, ResNet-50, DenseNet 121). The accuracies of DCNNs for sarcopenia classification were 70.0–80.0% (based on SWE) and 65.0–75.0% (based on GSU). The DCNN application to SWE images highlights the utility of deep-learning base SWE for sarcopenia prediction. DCNN application to SWE images might be a potentially useful biomarker to predict sarcopenic status.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A reference set of clinically relevant adverse drug-drug interactions",
        "link": "https://www.nature.com/articles/s41597-022-01159-y",
        "publication_date": "04 Mar 2022",
        "abstract": "The accurate and timely detection of adverse drug-drug interactions (DDIs) during the postmarketing phase is an important yet complex task with potentially major clinical implications. The development of data mining methodologies that scan healthcare databases for drug safety signals requires appropriate reference sets for performance evaluation. Methodologies for establishing DDI reference sets are limited in the literature, while there is no publicly available resource simultaneously focusing on clinical relevance of DDIs and individual behaviour of interacting drugs. By automatically extracting and aggregating information from multiple clinical resources, we provide a scalable approach for generating a reference set for DDIs that could support research in postmarketing safety surveillance. CRESCENDDI contains 10,286 positive and 4,544 negative controls, covering 454 drugs and 179 adverse events mapped to RxNorm and MedDRA concepts, respectively. It also includes single drug information for the included drugs (i.e., adverse drug reactions, indications, and negative drug-event associations). We demonstrate usability of the resource by scanning a spontaneous reporting system database for signals of DDIs using traditional signal detection algorithms.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of antimicrobial peptides from the human gut microbiome using deep learning",
        "link": "https://www.nature.com/articles/s41587-022-01226-0",
        "publication_date": "03 Mar 2022",
        "abstract": "The human gut microbiome encodes a large variety of antimicrobial peptides (AMPs), but the short lengths of AMPs pose a challenge for computational prediction. Here we combined multiple natural language processing neural network models, including LSTM, Attention and BERT, to form a unified pipeline for candidate AMP identification from human gut microbiome data. Of 2,349 sequences identified as candidate AMPs, 216 were chemically synthesized, with 181 showing antimicrobial activity (a positive rate of >83%). Most of these peptides have less than 40% sequence homology to AMPs in the training set. Further characterization of the 11 most potent AMPs showed high efficacy against antibiotic-resistant, Gram-negative pathogens and demonstrated significant efficacy in lowering bacterial load by more than tenfold against a mouse model of bacterial lung infection. Our study showcases the potential of machine learning approaches for mining functional peptides from metagenome data and accelerating the discovery of promising AMP candidate molecules for in-depth investigations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Federated learning for multi-center imaging diagnostics: a simulation study in cardiovascular disease",
        "link": "https://www.nature.com/articles/s41598-022-07186-4",
        "publication_date": "03 Mar 2022",
        "abstract": "Deep learning models can enable accurate and efficient disease diagnosis, but have thus far been hampered by the data scarcity present in the medical world. Automated diagnosis studies have been constrained by underpowered single-center datasets, and although some results have shown promise, their generalizability to other institutions remains questionable as the data heterogeneity between institutions is not taken into account. By allowing models to be trained in a distributed manner that preserves patients’ privacy, federated learning promises to alleviate these issues, by enabling diligent multi-center studies. We present the first simulated federated learning study on the modality of cardiovascular magnetic resonance and use four centers derived from subsets of the M&M and ACDC datasets, focusing on the diagnosis of hypertrophic cardiomyopathy. We adapt a 3D-CNN network pretrained on action recognition and explore two different ways of incorporating shape prior information to the model, and four different data augmentation set-ups, systematically analyzing their impact on the different collaborative learning choices. We show that despite the small size of data (180 subjects derived from four centers), the privacy preserving federated learning achieves promising results that are competitive with traditional centralized learning. We further find that federatively trained models exhibit increased robustness and are more sensitive to domain shift effects.",
        "conclusions": "In conclusion, through extensive analysis and experiments, we demonstrated that, even with a small sample size of 180 subjects derived from four centers, federated learning for Cardiac MRI diagnosis achieves promising performance that is comparable to collaborative data sharing. We highlighted the importance of a principled evaluation that accounts for both in and out of site performance and showed how models trained under a federated learning framework exhibit increased robustness and can be more sensitive to domain shift effects. As different centers seem to benefit in different ways from the interplay of augmentations and the collaborative learning frameworks, we believe that further research is required to delineate the underlying factors. In the future, bigger datasets with a wider diversity of centers should be used to systematically analyze and further verify these effects. Furthermore, our study was constrained to binary classification, but in the future semi-supervised federated learning methods will be needed to integrate labels that don’t fully overlap between centers to enable multi-label classification. Also, as we used segmentation masks supplied by clinicians, the current pipeline still relies on expert support to provide these segmentations and could be replaced by an automated federated segmentation pipeline, appended as a first step to the current pipeline.There is still a lot of fields in automated image-based diagnosis where federated learning has yet to make a presence, including prediction of prevalent diseases like retinopathy, diabetes, neurological disorders and cases of cancer in breast, liver or colon. Tangential fields like that of survival and treatment outcome prediction that are still underdeveloped due to the lack of data would also stand to benefit from the impact of federated learning and warrant similar exploration. We firmly believe that such studies will be a fundamental step to pave the way for multi-center studies going forward.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Detection of COVID-19 using multimodal data from a wearable device: results from the first TemPredict Study",
        "link": "https://www.nature.com/articles/s41598-022-07314-0",
        "publication_date": "02 Mar 2022",
        "abstract": "Early detection of diseases such as COVID-19 could be a critical tool in reducing disease transmission by helping individuals recognize when they should self-isolate, seek testing, and obtain early medical intervention. Consumer wearable devices that continuously measure physiological metrics hold promise as tools for early illness detection. We gathered daily questionnaire data and physiological data using a consumer wearable (Oura Ring) from 63,153 participants, of whom 704 self-reported possible COVID-19 disease. We selected 73 of these 704 participants with reliable confirmation of COVID-19 by PCR testing and high-quality physiological data for algorithm training to identify onset of COVID-19 using machine learning classification. The algorithm identified COVID-19 an average of 2.75 days before participants sought diagnostic testing with a sensitivity of 82% and specificity of 63%. The receiving operating characteristic (ROC) area under the curve (AUC) was 0.819 (95% CI [0.809, 0.830]). Including continuous temperature yielded an AUC 4.9% higher than without this feature. For further validation, we obtained SARS CoV-2 antibody in a subset of participants and identified 10 additional participants who self-reported COVID-19 disease with antibody confirmation. The algorithm had an overall ROC AUC of 0.819 (95% CI [0.809, 0.830]), with a sensitivity of 90% and specificity of 80% in these additional participants. Finally, we observed substantial variation in accuracy based on age and biological sex. Findings highlight the importance of including temperature assessment, using continuous physiological features for alignment, and including diverse populations in algorithm development to optimize accuracy in COVID-19 detection from wearables.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring polygenic contributors to subgroups of comorbid conditions in autism spectrum disorder",
        "link": "https://www.nature.com/articles/s41598-022-07399-7",
        "publication_date": "01 Mar 2022",
        "abstract": "Individuals with autism spectrum disorder (ASD) have heterogeneous comorbid conditions. This study examined whether comorbid conditions in ASD are associated with polygenic risk scores (PRS) of ASD or PRS of comorbid conditions in non-ASD specific populations. Genome-wide single nucleotide polymorphism (SNP) data were obtained from 1386 patients with ASD from the Autism Genetic Resource Exchange (AGRE) study. After excluding individuals with missing clinical information concerning comorbid conditions, a total of 707 patients were included in the study. A total of 18 subgroups of comorbid conditions (‘topics’) were identified using a machine learning algorithm, topic modeling. PRS for ASD were computed using a genome-wide association meta-analysis of 18,381 cases and 27,969 controls. From these 18 topics, Topic 6 (over-represented by allergies) (p = 1.72 × 10−3) and Topic 17 (over-represented by sensory processing issues such as low pain tolerance) (p = 0.037) were associated with PRS of ASD. The associations between these two topics and the multi-locus contributors to their corresponding comorbid conditions based on non-ASD specific populations were further explored. The results suggest that these two topics were not associated with the PRS of allergies and chronic pain disorder, respectively. Note that characteristics of the present AGRE sample and those samples used in the original GWAS for ASD, allergies, and chronic pain disorder, may differ due to significant clinical heterogeneity that exists in the ASD population. Additionally, the AGRE sample may be underpowered and therefore insensitive to weak PRS associations due to a relatively small sample size. Findings imply that susceptibility genes of ASD may contribute more to the occurrence of allergies and sensory processing issues in individuals with ASD, compared with the susceptibility genes for their corresponding phenotypes in non-ASD individuals. Since these comorbid conditions (i.e., allergies and pain sensory issues) may not be attributable to the corresponding comorbidity-specific biological factors in non-ASD individuals, clinical management for these comorbid conditions may still depend on treatments for core symptoms of ASD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A COVID-19 mortality prediction model for Korean patients using nationwide Korean disease control and prevention agency database",
        "link": "https://www.nature.com/articles/s41598-022-07051-4",
        "publication_date": "28 Feb 2022",
        "abstract": "The experience of the early nationwide COVID-19 pandemic in South Korea led to an early shortage of medical resources. For efficient resource allocation, accurate prediction of the prognosis or mortality of confirmed patients is essential. Therefore, the aim of this study was to develop an accurate model for predicting COVID-19 mortality using epidemiolocal and clinical variables and for identifying a high-risk group of confirmed patients. Clinical and epidemiolocal variables of 4049 patients with confirmed COVID-19 between January 20, 2020 and April 30, 2020 collected by the Korean Disease Control and Prevention Agency were used. Among the 4049 total confirmed patients, 223 patients died, while 3826 patients were released from isolation. Patients who had the following risk factors showed significantly higher risk scores: age over 60 years, male sex, difficulty breathing, diabetes, cancer, dementia, change of consciousness, and hospitalization in the intensive care unit. High accuracy was shown for both the development set (n = 2467) and the validation set (n = 1582), with AUCs of 0.96 and 0.97, respectively. The prediction model developed in this study based on clinical features and epidemiological factors could be used for screening high-risk groups of patients and for evidence-based allocation of medical resources.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Intestinal microbiota signatures of clinical response and immune-related adverse events in melanoma patients treated with anti-PD-1",
        "link": "https://www.nature.com/articles/s41591-022-01698-2",
        "publication_date": "28 Feb 2022",
        "abstract": "Ample evidence indicates that the gut microbiome is a tumor-extrinsic factor associated with antitumor response to anti-programmed cell death protein-1 (PD-1) therapy, but inconsistencies exist between published microbial signatures associated with clinical outcomes. To resolve this, we evaluated a new melanoma cohort, along with four published datasets. Time-to-event analysis showed that baseline microbiota composition was optimally associated with clinical outcome at approximately 1 year after initiation of treatment. Meta-analysis and other bioinformatic analyses of the combined data show that bacteria associated with favorable response are confined within the Actinobacteria phylum and the Lachnospiraceae/Ruminococcaceae families of Firmicutes. Conversely, Gram-negative bacteria were associated with an inflammatory host intestinal gene signature, increased blood neutrophil-to-lymphocyte ratio, and unfavorable outcome. Two microbial signatures, enriched for Lachnospiraceae spp. and Streptococcaceae spp., were associated with favorable and unfavorable clinical response, respectively, and with distinct immune-related adverse effects. Despite between-cohort heterogeneity, optimized all-minus-one supervised learning algorithms trained on batch-corrected microbiome data consistently predicted outcomes to programmed cell death protein-1 therapy in all cohorts. Gut microbial communities (microbiotypes) with nonuniform geographical distribution were associated with favorable and unfavorable outcomes, contributing to discrepancies between cohorts. Our findings shed new light on the complex interaction between the gut microbiome and response to cancer immunotherapy, providing a roadmap for future studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Intra-topic latency as an automated behavioral marker of treatment response in autism spectrum disorder",
        "link": "https://www.nature.com/articles/s41598-022-07299-w",
        "publication_date": "28 Feb 2022",
        "abstract": "Data science advances in behavioral signal processing and machine learning hold the promise to automatically quantify clinically meaningful behaviors that can be applied to a large amount of data. The objective of this study was to identify an automated behavioral marker of treatment response in social communication in children with autism spectrum disorder (ASD). First, using an automated computational method, we successfully derived the amount of time it took for a child with ASD and an adult social partner (N pairs = 210) to respond to each other while they were engaged in conversation bits (“latency”) using recordings of brief, natural social interactions. Then, we measured changes in latency at pre- and post-interventions. Children with ASD who were receiving interventions showed significantly larger reduction in latency compared to those who were not receiving interventions. There was also a significant group difference in the changes in latency for adult social partners. Results suggest that the automated measure of latency derived from natural social interactions is a scalable and objective method to quantify treatment response in children with ASD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "MIXTURE of human expertise and deep learning—developing an explainable model for predicting pathological diagnosis and survival in patients with interstitial lung disease",
        "link": "https://www.nature.com/articles/s41379-022-01025-7",
        "publication_date": "23 Feb 2022",
        "abstract": "Interstitial pneumonia is a heterogeneous disease with a progressive course and poor prognosis, at times even worse than those in the main cancer types. Histopathological examination is crucial for its diagnosis and estimation of prognosis. However, the evaluation strongly depends on the experience of pathologists, and the reproducibility of diagnosis is low. Herein, we propose MIXTURE (huMan-In-the-loop eXplainable artificial intelligence Through the Use of REcurrent training), an original method to develop deep learning models for extracting pathologically significant findings based on an expert pathologist’s perspective with a small annotation effort. The procedure of MIXTURE consists of three steps as follows. First, we created feature extractors for tiles from whole slide images using self-supervised learning. The similar looking tiles were clustered based on the output features and then pathologists integrated the pathologically synonymous clusters. Using the integrated clusters as labeled data, deep learning models to classify the tiles into pathological findings were created by transfer-learning the feature extractors. We developed three models for different magnifications. Using these extracted findings, our model was able to predict the diagnosis of usual interstitial pneumonia, a finding suggestive of progressive disease, with high accuracy (AUC 0.90 in validation set and AUC 0.86 in test set). This high accuracy could not be achieved without the integration of findings by pathologists. The patients predicted as UIP had poorer prognosis (5-year overall survival [OS]: 55.4%) than those predicted as non-UIP (OS: 95.2%). The Cox proportional hazards model for each microscopic finding and prognosis pointed out dense fibrosis, fibroblastic foci, elastosis, and lymphocyte aggregation as independent risk factors. We suggest that MIXTURE may serve as a model approach to different diseases evaluated by medical imaging, including pathology and radiology, and be the prototype for explainable artificial intelligence that can collaborate with humans.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Segmentation of pancreatic ductal adenocarcinoma (PDAC) and surrounding vessels in CT images using deep convolutional neural networks and texture descriptors",
        "link": "https://www.nature.com/articles/s41598-022-07111-9",
        "publication_date": "23 Feb 2022",
        "abstract": "Fully automated and volumetric segmentation of critical tumors may play a crucial role in diagnosis and surgical planning. One of the most challenging tumor segmentation tasks is localization of pancreatic ductal adenocarcinoma (PDAC). Exclusive application of conventional methods does not appear promising. Deep learning approaches has achieved great success in the computer aided diagnosis, especially in biomedical image segmentation. This paper introduces a framework based on convolutional neural network (CNN) for segmentation of PDAC mass and surrounding vessels in CT images by incorporating powerful classic features, as well. First, a 3D-CNN architecture is used to localize the pancreas region from the whole CT volume using 3D Local Binary Pattern (LBP) map of the original image. Segmentation of PDAC mass is subsequently performed using 2D attention U-Net and Texture Attention U-Net (TAU-Net). TAU-Net is introduced by fusion of dense Scale-Invariant Feature Transform (SIFT) and LBP descriptors into the attention U-Net. An ensemble model is then used to cumulate the advantages of both networks using a 3D-CNN. In addition, to reduce the effects of imbalanced data, a multi-objective loss function is proposed as a weighted combination of three classic losses including Generalized Dice Loss (GDL), Weighted Pixel-Wise Cross Entropy loss (WPCE) and boundary loss. Due to insufficient sample size for vessel segmentation, we used the above-mentioned pre-trained networks and fine-tuned them. Experimental results show that the proposed method improves the Dice score for PDAC mass segmentation in portal-venous phase by 7.52% compared to state-of-the-art methods in term of DSC. Besides, three dimensional visualization of the tumor and surrounding vessels can facilitate the evaluation of PDAC treatment response.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Radiomics and machine learning for the diagnosis of pediatric cervical non-tuberculous mycobacterial lymphadenitis",
        "link": "https://www.nature.com/articles/s41598-022-06884-3",
        "publication_date": "22 Feb 2022",
        "abstract": "Non-tuberculous mycobacterial (NTM) infection is an emerging infectious entity that often presents as lymphadenitis in the pediatric age group. Current practice involves invasive testing and excisional biopsy to diagnose NTM lymphadenitis. In this study, we performed a retrospective analysis of 249 lymph nodes selected from 143 CT scans of pediatric patients presenting with lymphadenopathy at the Montreal Children’s Hospital between 2005 and 2018. A Random Forest classifier was trained on the ten most discriminative features from a set of 1231 radiomic features. The model classifying nodes as pyogenic, NTM, reactive, or proliferative lymphadenopathy achieved an accuracy of 72%, a precision of 68%, and a recall of 70%. Between NTM and all other causes of lymphadenopathy, the model achieved an area under the curve (AUC) of 89%. Between NTM and pyogenic lymphadenitis, the model achieved an AUC of 90%. Between NTM and the reactive and proliferative lymphadenopathy groups, the model achieved an AUC of 93%. These results indicate that radiomics can achieve a high accuracy for classification of NTM lymphadenitis. Such a non-invasive highly accurate diagnostic approach has the potential to reduce the need for invasive procedures in the pediatric population.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Patient-specific 3D-printed shelf implant for the treatment of hip dysplasia tested in an experimental animal pilot in canines",
        "link": "https://www.nature.com/articles/s41598-022-06989-9",
        "publication_date": "22 Feb 2022",
        "abstract": "The concept of a novel patient-specific 3D-printed shelf implant should be evaluated in a relevant large animal model with hip dysplasia. Therefore, three dogs with radiographic bilateral hip dysplasia and a positive subluxation test underwent unilateral acetabular augmentation with a 3D-printed dog-specific titanium implant. The contralateral side served as control. The implants were designed on CT-based pelvic bone segmentations and extended the dysplastic acetabular rim to increase the weight bearing surface without impairing the range of motion. Outcome was assessed by clinical observation, manual subluxation testing, radiography, CT, and gait analysis from 6 weeks preoperatively until termination at 26 weeks postoperatively. Thereafter, all hip joints underwent histopathological examination. The implantation and recovery from surgery was uneventful. Clinical subluxation tests at the intervention side became negative. Imaging showed medialization of the femoral head at the intervention side and the mean (range) CE-angle increased from 94° (84°–99°) preoperative to 119° (117°–120°) postoperative. Gait analysis parameters returned to pre-operative levels after an average follow-up of 6 weeks. Histology showed a thickened synovial capsule between the implant and the femoral head without any evidence of additional damage to the articular cartilage compared to the control side. The surgical implantation of the 3D shelf was safe and feasible. The patient-specific 3D-printed shelf implants restored the femoral head coverage and stability of dysplastic hips without complications. The presented approach holds promise to treat residual hip dysplasia justifying future veterinary clinical trials to establish clinical effectiveness in a larger cohort to prepare for translation to human clinic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Application of 3-dimensional printing guide template and pointed lotus-style regulator in percutaneous pedicle screw fixation for thoracolumbar fractures",
        "link": "https://www.nature.com/articles/s41598-022-06256-x",
        "publication_date": "21 Feb 2022",
        "abstract": "This study aims to analysis the efficacy of the 3D printing percutaneous guide template in combination with the pointed lotus-style regulator in percutaneous pedicle screw fixation. 60 thoracolumbar fractures patients receiving percutaneous pedicle screw fixation (PPSF) were enrolled and randomly divided into 3 groups. Patients in Group A received traditional PPSF, while patients in Group B received PPSF with flat end lotus-style regulator and patients in Group C received PPSF with pointed lotus-style regulator. The experimental results showed that the highest number of pedicle screw successfully inserted by the first time was in group C, while lowest in group A (P < 0.05). The total time of fluoroscopy and operation were lower in group C, and higher in group A (P < 0.05). VAS and ODI scores were all lower after surgery than before surgery in 3groups. VAS and ODI scores were lower in group B and C, compared with group A at day 1, 7 after surgery (P < 0.05). KA decreased significantly in 3 groups after surgery and no difference in KA change between 3 groups (P > 0.05). Taken together, Application of the 3D printing guide template in combination with pointed lotus-style regulator improved the accuracy of pedicle insertion.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Preliminary evidence of contextual factors’ influence on weight loss treatment outcomes: implications for future research",
        "link": "https://www.nature.com/articles/s41366-022-01070-x",
        "publication_date": "19 Feb 2022",
        "abstract": "Behavioral health interventions, including behavioral obesity treatment, typically target psychosocial qualities of the individual (e.g., knowledge, self-efficacy) that are largely treated as persistent, over momentary contextual factors (e.g., affect, environmental conditions). The variance in treatment outcomes that can be attributable to these two sources is rarely quantified but may help inform future research and treatment development efforts.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning methods to predict presence of residual cancer following hysterectomy",
        "link": "https://www.nature.com/articles/s41598-022-06585-x",
        "publication_date": "17 Feb 2022",
        "abstract": "Surgical management for gynecologic malignancies often involves hysterectomy, often constituting the most common gynecologic surgery worldwide. Despite maximal surgical and medical care, gynecologic malignancies have a high rate of recurrence following surgery. Current machine learning models use advanced pathology data that is often inaccessible within low-resource settings and are specific to singular cancer types. There is currently a need for machine learning models to predict non-clinically evident residual disease using only clinically available health data. Here we developed and tested multiple machine learning models to assess the risk of residual disease post-hysterectomy based on clinical and operative parameters. Data from 3656 hysterectomy patients from the NSQIP dataset over 14 years were used to develop models with a training set of 2925 patients and a validation set of 731 patients. Our models revealed the top postoperative predictors of residual disease were the initial presence of gross abdominal disease on the diaphragm, disease located on the bowel mesentery, located on the bowel serosa, and disease located within the adjacent pelvis prior to resection. There were no statistically significant differences in performances of the top three models. Extreme gradient Boosting, Random Forest, and Logistic Regression models had comparable AUC ROC (0.90) and accuracy metrics (87–88%). Using these models, physicians can identify gynecologic cancer patients post-hysterectomy that may benefit from additional treatment. For patients at high risk for disease recurrence despite adequate surgical intervention, machine learning models may lay the basis for potential prospective trials with prophylactic/adjuvant therapy for non-clinically evident residual disease, particularly in under-resourced settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Teaching home tonometry using a remote video link",
        "link": "https://www.nature.com/articles/s41433-022-01966-y",
        "publication_date": "17 Feb 2022",
        "abstract": "Intraocular pressure (IOP) is the primary modifiable risk factor in the progression of glaucoma. The ICare HOME is a self-tonometer which empowers patients to measure their own IOP and allows a more complete picture of diurnal IOP. This project aims to determine the feasibility of teaching patients to perform self-tonometry remotely using a remote video link.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A multimodal deep learning system to distinguish late stages of AMD and to compare expert vs. AI ocular biomarkers",
        "link": "https://www.nature.com/articles/s41598-022-06273-w",
        "publication_date": "16 Feb 2022",
        "abstract": "Within the next 1.5 decades, 1 in 7 U.S. adults is anticipated to suffer from age-related macular degeneration (AMD), a degenerative retinal disease which leads to blindness if untreated. Optical coherence tomography angiography (OCTA) has become a prime technique for AMD diagnosis, specifically for late-stage neovascular (NV) AMD. Such technologies generate massive amounts of data, challenging to parse by experts alone, transforming artificial intelligence into a valuable partner. We describe a deep learning (DL) approach which achieves multi-class detection of non-AMD vs. non-neovascular (NNV) AMD vs. NV AMD from a combination of OCTA, OCT structure, 2D b-scan flow images, and high definition (HD) 5-line b-scan cubes; DL also detects ocular biomarkers indicative of AMD risk. Multimodal data were used as input to 2D-3D Convolutional Neural Networks (CNNs). Both for CNNs and experts, choroidal neovascularization and geographic atrophy were found to be important biomarkers for AMD. CNNs predict biomarkers with accuracy up to 90.2% (positive-predictive-value up to 75.8%). Just as experts rely on multimodal data to diagnose AMD, CNNs also performed best when trained on multiple inputs combined. Detection of AMD and its biomarkers from OCTA data via CNNs has tremendous potential to expedite screening of early and late-stage AMD patients.",
        "conclusions": "All models described here achieved above-chance multi-class performance at detection of Non-AMD vs. early and late stages of NNV AMD vs. NV AMD, suggesting promise for translating our approach to the clinic. By leveraging existing strengths of state-of-the-art CNN architectures, such as feature concatenation via long skip connections, our study paves the way for optimization of our top-performing CNN architectures [models (4) and (9)] for the best input modalities discovered here (combining OCTA, OCT structure, and b-scans). Model (4), combining OCTA, OCT structure, and HD 5-line b-scans and model (9), combining OCTA, OCT structure, HD 5-line b-scans, and 2D b-scan flow images exhibited best performance compared to single and dual modality combinations of OCTA, OCT structure, and b-scan information. Current limitations in the form of overfitting of our models could potentially be improved by using an asymmetric loss function25, customized for handling class imbalance by more heavily weighting samples of a class present in lower quantity. Adding residual blocks or replacing conventional convolutional kernels with spatial or depth-wise separable kernels may help improve accuracy26,27. Attempting to leverage knowledge gained from low-resolution 2D b-scan flow images to inform utility of HD 5-line b-scan cubes (or vice versa) may further help to reduce the parameter space and thus prevent overfitting, by enhancing emphasis on the most critical layers/images. Salvi and colleagues28 describe a number of pre-processing as well as post-processing techniques (including de-speckling) that help improve deep learning model performance. Although speckle noise is typically the predominant source of noise in OCT, we did not observe speckle noise as a significant issue in our data; we anticipate that incorporation of pre-processing approaches such as data augmentation may potentially improve model performance in future iterations of this work. Among biomarkers included in our labeling analysis, experts and CNNs agree on CNV and GA as the top two with highest odds for any (NNV + NV) AMD diagnosis when present and agree on CNV presence as indicating high odds of NV AMD diagnosis, helping to build trust/credibility in such AI technology. Consistency between experts and CNNs for features predictive of NV AMD may be enhanced by segmentation/localization of image biomarkers within b-scans beyond simply detection of biomarker presence. Using CNN feature predictions in tandem with the clinical algorithm enabled improvement in sensitivity and specificity of NV AMD detection, compared to CNN image-level disease classification. Grad-CAMs serve a valuable role to further explain CNN mechanism of function, as they showed that CNNs are detecting CNV presence in true positive OCTA, structural, and b-scan images. Detection of late-stage AMD and presence of AMD biomarkers from OCTA/OCT structural images and b-scans via CNNs has tremendous potential for translation to the clinic to expedite workflow for screening of early and late-stage AMD patients.",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Early heart rate variability evaluation enables to predict ICU patients’ outcome",
        "link": "https://www.nature.com/articles/s41598-022-06301-9",
        "publication_date": "15 Feb 2022",
        "abstract": "Heart rate variability (HRV) is a mean to evaluate cardiac effects of autonomic nervous system activity, and a relation between HRV and outcome has been proposed in various types of patients. We attempted to evaluate the best determinants of such variation in survival prediction using a physiological data-warehousing program. Plethysmogram tracings (PPG) were recorded at 75 Hz from the standard monitoring system, for a 2 h period, during the 24 h following ICU admission. Physiological data recording was associated with metadata collection. HRV was derived from PPG in either the temporal and non-linear domains. 540 consecutive patients were recorded. A lower LF/HF, SD2/SD1 ratios and Shannon entropy values on admission were associated with a higher ICU mortality. SpO2/FiO2 ratio and HRV parameters (LF/HF and Shannon entropy) were independent correlated with mortality in the multivariate analysis. Machine-learning using neural network (kNN) enabled to determine a simple decision tree combining the three best determinants (SDNN, Shannon Entropy, SD2/SD1 ratio) of a composite outcome index. HRV measured on admission enables to predict outcome in the ICU or at Day-28, independently of the admission diagnosis, treatment and mechanical ventilation requirement.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Care-seeking and delay of care during COPD exacerbations",
        "link": "https://www.nature.com/articles/s41533-022-00269-9",
        "publication_date": "15 Feb 2022",
        "abstract": "Patients who receive earlier treatment for acute exacerbations of chronic obstructive pulmonary disease (COPD) have a better prognosis, including earlier symptom resolution and reduced risk of future emergency-department visits (ED) or hospitalizations. However, many patients delay seeking care or do not report worsening symptoms to their healthcare provider. In this study, we aimed to understand how patients perceived their breathing symptoms and identify factors that led to seeking or delaying care for an acute exacerbation of COPD. We conducted semistructured interviews with 60 individuals following a recent COPD exacerbation. Participants were identified from a larger study of outpatients with COPD by purposive sampling by exacerbation type: 15 untreated, 15 treated with prednisone and/or antibiotics in the outpatient setting, 16 treated in an urgent care or ED setting, and 14 hospitalized. Data were analyzed using inductive content analysis. Participants were primarily male (97%) with a mean age of 69.1 ± 6.9 years, mean FEV1 1.42 (±0.63), and mean mMRC dyspnea of 2.7 (±1.1). We identified 4 primary themes: (i) access and attitudinal barriers contribute to reluctance to seek care, (ii) waiting is a typical response to new exacerbations, (iii) transitioning from waiting to care-seeking: the tipping point, and (iv) learning from and avoiding worse outcomes. Interventions to encourage earlier care-seeking for COPD exacerbations should consider individuals’ existing self-management approaches, address attitudinal barriers to seeking care, and consider health-system changes to increase access to non-emergent outpatient treatment for exacerbations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Gut metagenome associations with extensive digital health data in a volunteer-based Estonian microbiome cohort",
        "link": "https://www.nature.com/articles/s41467-022-28464-9",
        "publication_date": "15 Feb 2022",
        "abstract": "Microbiome research is starting to move beyond the exploratory phase towards interventional trials and therefore well-characterized cohorts will be instrumental for generating hypotheses and providing new knowledge. As part of the Estonian Biobank, we established the Estonian Microbiome Cohort which includes stool, oral and plasma samples from 2509 participants and is supplemented with multi-omic measurements, questionnaires, and regular linkages to national electronic health records. Here we analyze stool data from deep metagenomic sequencing together with rich phenotyping, including 71 diseases, 136 medications, 21 dietary questions, 5 medical procedures, and 19 other factors. We identify numerous relationships (n = 3262) with different microbiome features. In this study, we extend the understanding of microbiome-host interactions using electronic health data and show that long-term antibiotic usage, independent from recent administration, has a significant impact on the microbiome composition, partly explaining the common associations between diseases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence in positioning between mandibular third molar and inferior alveolar nerve on panoramic radiography",
        "link": "https://www.nature.com/articles/s41598-022-06483-2",
        "publication_date": "14 Feb 2022",
        "abstract": "Determining the exact positional relationship between mandibular third molar (M3) and inferior alveolar nerve (IAN) is important for surgical extractions. Panoramic radiography is the most common dental imaging test. The purposes of this study were to develop an artificial intelligence (AI) model to determine two positional relationships (true contact and bucco-lingual position) between M3 and IAN when they were overlapped in panoramic radiographs and compare its performance with that of oral and maxillofacial surgery (OMFS) specialists. A total of 571 panoramic images of M3 from 394 patients was used for this study. Among the images, 202 were classified as true contact, 246 as intimate, 61 as IAN buccal position, and 62 as IAN lingual position. A deep convolutional neural network model with ResNet-50 architecture was trained for each task. We randomly split the dataset into 75% for training and validation and 25% for testing. Model performance was superior in bucco-lingual position determination (accuracy 0.76, precision 0.83, recall 0.67, and F1 score 0.73) to true contact position determination (accuracy 0.63, precision 0.62, recall 0.63, and F1 score 0.61). AI exhibited much higher accuracy in both position determinations compared to OMFS specialists. In determining true contact position, OMFS specialists demonstrated an accuracy of 52.68% to 69.64%, while the AI showed an accuracy of 72.32%. In determining bucco-lingual position, OMFS specialists showed an accuracy of 32.26% to 48.39%, and the AI showed an accuracy of 80.65%. Moreover, Cohen’s kappa exhibited a substantial level of agreement for the AI (0.61) and poor agreements for OMFS specialists in bucco-lingual position determination. Determining the position relationship between M3 and IAN is possible using AI, especially in bucco-lingual positioning. The model could be used to support clinicians in the decision-making process for M3 treatment.",
        "conclusions": "In this study, we developed and validated a deep learning algorithm that determined positional relationship between M3 and IAN canal at a performance level superior to that of experts. Once tested prospectively in clinical settings, the algorithm could have the potential to narrow patient access to CBCT or prepare for surgical extraction.",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning-based high-accuracy quantitation for lumbar intervertebral disc degeneration from MRI",
        "link": "https://www.nature.com/articles/s41467-022-28387-5",
        "publication_date": "11 Feb 2022",
        "abstract": "To help doctors and patients evaluate lumbar intervertebral disc degeneration (IVDD) accurately and efficiently, we propose a segmentation network and a quantitation method for IVDD from T2MRI. A semantic segmentation network (BianqueNet) composed of three innovative modules achieves high-precision segmentation of IVDD-related regions. A quantitative method is used to calculate the signal intensity and geometric features of IVDD. Manual measurements have excellent agreement with automatic calculations, but the latter have better repeatability and efficiency. We investigate the relationship between IVDD parameters and demographic information (age, gender, position and IVDD grade) in a large population. Considering these parameters present strong correlation with IVDD grade, we establish a quantitative criterion for IVDD. This fully automated quantitation system for IVDD may provide more precise information for clinical practice, clinical trials, and mechanism investigation. It also would increase the number of patients that can be monitored.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-aided risk prediction for metabolic syndrome based on 3 years study",
        "link": "https://www.nature.com/articles/s41598-022-06235-2",
        "publication_date": "10 Feb 2022",
        "abstract": "Metabolic syndrome (MetS) is a group of physiological states of metabolic disorders, which may increase the risk of diabetes, cardiovascular and other diseases. Therefore, it is of great significance to predict the onset of MetS and the corresponding risk factors. In this study, we investigate the risk prediction for MetS using a data set of 67,730 samples with physical examination records of three consecutive years provided by the Department of Health Management, Nanfang Hospital, Southern Medical University, P.R. China. Specifically, the prediction for MetS takes the numerical features of examination records as well as the differential features by using the examination records over the past two consecutive years, namely, the differential numerical feature (DNF) and the differential state feature (DSF), and the risk factors of the above features w.r.t different ages and genders are statistically analyzed. From numerical results, it is shown that the proposed DSF in addition to the numerical feature of examination records, significantly contributes to the risk prediction of MetS. Additionally, the proposed scheme, by using the proposed features, yields a superior performance to the state-of-the-art MetS prediction model, which provides the potential of effective prescreening the occurrence of MetS.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based diagnosis and risk factor analysis of cardiocerebrovascular disease based on KNHANES",
        "link": "https://www.nature.com/articles/s41598-022-06333-1",
        "publication_date": "10 Feb 2022",
        "abstract": "The prevalence of cardiocerebrovascular disease (CVD) is continuously increasing, and it is the leading cause of human death. Since it is difficult for physicians to screen thousands of people, high-accuracy and interpretable methods need to be presented. We developed four machine learning-based CVD classifiers (i.e., multi-layer perceptron, support vector machine, random forest, and light gradient boosting) based on the Korea National Health and Nutrition Examination Survey. We resampled and rebalanced KNHANES data using complex sampling weights such that the rebalanced dataset mimics a uniformly sampled dataset from overall population. For clear risk factor analysis, we removed multicollinearity and CVD-irrelevant variables using VIF-based filtering and the Boruta algorithm. We applied synthetic minority oversampling technique and random undersampling before ML training. We demonstrated that the proposed classifiers achieved excellent performance with AUCs over 0.853. Using Shapley value-based risk factor analysis, we identified that the most significant risk factors of CVD were age, sex, and the prevalence of hypertension. Additionally, we identified that age, hypertension, and BMI were positively correlated with CVD prevalence, while sex (female), alcohol consumption and, monthly income were negative. The results showed that the feature selection and the class balancing technique effectively improve the interpretability of models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "GestaltMatcher facilitates rare disease matching using facial phenotype descriptors",
        "link": "https://www.nature.com/articles/s41588-021-01010-x",
        "publication_date": "10 Feb 2022",
        "abstract": "Many monogenic disorders cause a characteristic facial morphology. Artificial intelligence can support physicians in recognizing these patterns by associating facial phenotypes with the underlying syndrome through training on thousands of patient photographs. However, this ‘supervised’ approach means that diagnoses are only possible if the disorder was part of the training set. To improve recognition of ultra-rare disorders, we developed GestaltMatcher, an encoder for portraits that is based on a deep convolutional neural network. Photographs of 17,560 patients with 1,115 rare disorders were used to define a Clinical Face Phenotype Space, in which distances between cases define syndromic similarity. Here we show that patients can be matched to others with the same molecular diagnosis even when the disorder was not included in the training set. Together with mutation data, GestaltMatcher could not only accelerate the clinical diagnosis of patients with ultra-rare disorders and facial dysmorphism but also enable the delineation of new phenotypes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Foudroyant cerebral venous (sinus) thrombosis triggered through CLEC-2 and GPIIb/IIIa dependent platelet activation",
        "link": "https://www.nature.com/articles/s44161-021-00017-1",
        "publication_date": "10 Feb 2022",
        "abstract": "Cerebral venous (sinus) thrombosis (CVT) is an unusual manifestation of venous thrombosis causing severe neurological impairment and seizures1,2. Molecular mechanisms underlying CVT, potentially involving pathological platelet activation, are unknown. Here we show that antibody-(INU1-fab)-induced cooperative signaling of two platelet receptors, C-type lectin-like receptor-2 (CLEC-2) and GPIIb/IIIa, triggers within minutes a CVT-like thrombotic syndrome in mice, characterized by tonic–myoclonic seizures, platelet consumption and death. Brain autopsy showed thrombi mainly in the cortical venules, but no intracranial hemorrhages or edema formation. Transcranial intravital microscopy revealed rapidly progressing thrombosis in the superior sagittal sinus, a main site of CVT in humans. Interfering with CLEC-2 signaling or inhibition of GPIIb/IIIa completely blocked platelet activation and CVT. Blocking GPIIb/IIIa after onset of neurological symptoms protected mice from platelet consumption, CVT and death, which was not seen after treatment with heparin. These results point to aberrant platelet activation as a major trigger of CVT and potential target for treatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Convolutional mesh autoencoders for the 3-dimensional identification of FGFR-related craniosynostosis",
        "link": "https://www.nature.com/articles/s41598-021-02411-y",
        "publication_date": "09 Feb 2022",
        "abstract": "Clinical diagnosis of craniofacial anomalies requires expert knowledge. Recent studies have shown that artificial intelligence (AI) based facial analysis can match the diagnostic capabilities of expert clinicians in syndrome identification. In general, these systems use 2D images and analyse texture and colour. They are powerful tools for photographic analysis but are not suitable for use with medical imaging modalities such as ultrasound, MRI or CT, and are unable to take shape information into consideration when making a diagnostic prediction. 3D morphable models (3DMMs), and their recently proposed successors, mesh autoencoders, analyse surface topography rather than texture enabling analysis from photography and all common medical imaging modalities and present an alternative to image-based analysis. We present a craniofacial analysis framework for syndrome identification using Convolutional Mesh Autoencoders (CMAs). The models were trained using 3D photographs of the general population (LSFM and LYHM), computed tomography data (CT) scans from healthy infants and patients with 3 genetically distinct craniofacial syndromes (Muenke, Crouzon, Apert). Machine diagnosis outperformed expert clinical diagnosis with an accuracy of 99.98%, sensitivity of 99.95% and specificity of 100%. The diagnostic precision of this technique supports its potential inclusion in clinical decision support systems. Its reliance on 3D topography characterisation make it suitable for AI assisted diagnosis in medical imaging as well as photographic analysis in the clinical setting.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A platform for oncogenomic reporting and interpretation",
        "link": "https://www.nature.com/articles/s41467-022-28348-y",
        "publication_date": "09 Feb 2022",
        "abstract": "Manual interpretation of variants remains rate limiting in precision oncology. The increasing scale and complexity of molecular data generated from comprehensive sequencing of cancer samples requires advanced interpretative platforms as precision oncology expands beyond individual patients to entire populations. To address this unmet need, we introduce a Platform for Oncogenomic Reporting and Interpretation (PORI), comprising an analytic framework that facilitates the interpretation and reporting of somatic variants in cancer. PORI integrates reporting and graph knowledge base tools combined with support for manual curation at the reporting stage. PORI represents an open-source platform alternative to commercial reporting solutions suitable for comprehensive genomic data sets in precision oncology. We demonstrate the utility of PORI by matching 9,961 pan-cancer genome atlas tumours to the graph knowledge base, calculating therapeutically informative alterations, and making available reports describing select individual samples.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Volatile organic compound profiling to explore primary graft dysfunction after lung transplantation",
        "link": "https://www.nature.com/articles/s41598-022-05994-2",
        "publication_date": "08 Feb 2022",
        "abstract": "Primary graft dysfunction (PGD) is a major determinant of morbidity and mortality following lung transplantation. Delineating basic mechanisms and molecular signatures of PGD remain a fundamental challenge. This pilot study examines if the pulmonary volatile organic compound (VOC) spectrum relate to PGD and postoperative outcomes. The VOC profiles of 58 bronchoalveolar lavage fluid (BALF) and blind bronchial aspirate samples from 35 transplant patients were extracted using solid-phase-microextraction and analyzed with comprehensive two-dimensional gas chromatography coupled to time-of-flight mass spectrometry. The support vector machine algorithm was used to identify VOCs that could differentiate patients with severe from lower grade PGD. Using 20 statistically significant VOCs from the sample headspace collected immediately after transplantation (< 6 h), severe PGD was differentiable from low PGD with an AUROC of 0.90 and an accuracy of 0.83 on test set samples. The model was somewhat effective for later time points with an AUROC of 0.80. Three major chemical classes in the model were dominated by alkylated hydrocarbons, linear hydrocarbons, and aldehydes in severe PGD samples. These VOCs may have important clinical and mechanistic implications, therefore large-scale study and potential translation to breath analysis is recommended.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A pilot study for the prediction of liver function related scores using breath biomarkers and machine learning",
        "link": "https://www.nature.com/articles/s41598-022-05808-5",
        "publication_date": "07 Feb 2022",
        "abstract": "Volatile organic compounds (VOCs) present in exhaled breath can help in analysing biochemical processes in the human body. Liver diseases can be traced using VOCs as biomarkers for physiological and pathophysiological conditions. In this work, we propose non-invasive and quick breath monitoring approach for early detection and progress monitoring of liver diseases using Isoprene, Limonene, and Dimethyl sulphide (DMS) as potential biomarkers. A pilot study is performed to design a dataset that includes the biomarkers concentration analysed from the breath sample before and after study subjects performed an exercise. A machine learning approach is applied for the prediction of scores for liver function diagnosis. Four regression methods are performed to predict the clinical scores using breath biomarkers data as features set by the machine learning techniques. A significant difference was observed for isoprene concentration (p < 0.01) and for DMS concentration (p < 0.0001) between liver patients and healthy subject’s breath sample. The R-square value between actual clinical score and predicted clinical score is found to be 0.78, 0.82, and 0.85 for CTP score, APRI score, and MELD score, respectively. Our results have shown a promising result with significant different breath profiles between liver patients and healthy volunteers. The use of machine learning for the prediction of scores is found very promising for use of breath biomarkers for liver function diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical data classification with noisy intermediate scale quantum computers",
        "link": "https://www.nature.com/articles/s41598-022-05971-9",
        "publication_date": "03 Feb 2022",
        "abstract": "Quantum machine learning has experienced significant progress in both software and hardware development in the recent years and has emerged as an applicable area of near-term quantum computers. In this work, we investigate the feasibility of utilizing quantum machine learning (QML) on real clinical datasets. We propose two QML algorithms for data classification on IBM quantum hardware: a quantum distance classifier (qDS) and a simplified quantum-kernel support vector machine (sqKSVM). We utilize these different methods using the linear time quantum data encoding technique (\\({\\mathrm{log}}_{2}N\\)) for embedding classical data into quantum states and estimating the inner product on the 15-qubit IBMQ Melbourne quantum computer. We match the predictive performance of our QML approaches with prior QML methods and with their classical counterpart algorithms for three open-access clinical datasets. Our results imply that the qDS in small sample and feature count datasets outperforms kernel-based methods. In contrast, quantum kernel approaches outperform qDS in high sample and feature count datasets. We demonstrate that the \\({\\mathrm{log}}_{2}N\\) encoding increases predictive performance with up to + 2% area under the receiver operator characteristics curve across all quantum machine learning approaches, thus, making it ideal for machine learning tasks executed in Noisy Intermediate Scale Quantum computers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Incorporating uncertainty in learning to defer algorithms for safe computer-aided diagnosis",
        "link": "https://www.nature.com/articles/s41598-022-05725-7",
        "publication_date": "02 Feb 2022",
        "abstract": "Deep neural networks are increasingly being used for computer-aided diagnosis, but erroneous diagnoses can be extremely costly for patients. We propose a learning to defer with uncertainty (LDU) algorithm which identifies patients for whom diagnostic uncertainty is high and defers them for evaluation by human experts. LDU was evaluated on the diagnosis of myocardial infarction (using discharge summaries), the diagnosis of any comorbidities (using structured data), and the diagnosis of pleural effusion and pneumothorax (using chest x-rays), and compared with ‘learning to defer without uncertainty information’ (LD) and ‘direct triage by uncertainty’ (DT) methods. LDU achieved the same F1 score as LD but deferred considerably fewer patients (e.g. 36% vs. 69% deferral rate for diagnosing pleural effusion with an F1 score of 0.96). Furthermore, even when many patients were assigned the wrong diagnosis with high confidence (e.g. for the diagnosis of any comorbidities) LDU achieved a 17% increase in F1 score, whereas DT was not applicable. Importantly, the weight of the defer loss in LDU can be easily adjusted to obtain the desired trade-off between diagnostic accuracy and deferral rate. In conclusion, LDU can readily augment any existing diagnostic network to reduce the risk of erroneous diagnoses in clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Dynamic Bayesian networks for prediction of health status and treatment effect in patients with chronic lymphocytic leukemia",
        "link": "https://www.nature.com/articles/s41598-022-05813-8",
        "publication_date": "02 Feb 2022",
        "abstract": "Chronic lymphocytic leukemia (CLL) is the most common blood cancer in adults. The course of CLL and patients' response to treatment are varied. This variability makes it difficult to select the most appropriate treatment regimen and predict the progression of the disease. This work was aimed at developing and validating dynamic Bayesian networks (DBNs) to predict changes of the health status of patients with CLL and progression of the disease over time. Two DBNs were developed and implemented i.e. Health Status Network (HSN) and Treatment Effect Network (TEN). Based on the literature data and expert knowledge we identified relationships linking the most important factors influencing the health status and treatment effects in patients with CLL. The developed networks, and in particular TEN, were able to predict probability of survival in patients with CLL, which was in line with the survival data collected in large medical registries. The networks can be used to personalize the predictions, taking into account a priori knowledge concerning a particular patient with CLL. The proposed approach can serve as a basis for the development of artificial intelligence systems that facilitate the choice of treatment that maximizes the chances of survival in patients with CLL.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sensory stimulation-based protection from impending stroke following MCA occlusion is correlated with desynchronization of widespread spontaneous local field potentials",
        "link": "https://www.nature.com/articles/s41598-022-05604-1",
        "publication_date": "02 Feb 2022",
        "abstract": "In a rat model of ischemic stroke by permanent occlusion of the medial cerebral artery (pMCAo), we have demonstrated using continuous recordings by microelectrode array at the depth of the ischemic territory that there is an immediate wide-spread increase in spontaneous local field potential synchrony following pMCAo that was correlated with ischemic stroke damage, but such increase was not seen in control sham-surgery rats. We further found that the underpinning source of the synchrony increase is intermittent bursts of low multi-frequency oscillations. Here we show that such increase in spontaneous LFP synchrony after pMCAo can be reduced to pre-pMCAo baseline level by delivering early (immediately after pMCAo) protective sensory stimulation that reduced the underpinning bursts. However, the delivery of a late (3 h after pMCAo) destructive sensory stimulation had no influence on the elevated LFP synchrony and its underpinning bursts. Histology confirmed both protection for the early stimulation group and an infarct for the late stimulation group. These findings highlight the unexpected importance of spontaneous LFP and its synchrony as a predictive correlate of cerebral protection or stroke infarct during the hyperacute state following pMCAo and the potential clinical relevance of stimulation to reduce EEG synchrony in acute stroke.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Determining clinical course of diffuse large B-cell lymphoma using targeted transcriptome and machine learning algorithms",
        "link": "https://www.nature.com/articles/s41408-022-00617-5",
        "publication_date": "01 Feb 2022",
        "abstract": "Multiple studies have demonstrated that diffuse large B-cell lymphoma (DLBCL) can be divided into subgroups based on their biology; however, these biological subgroups overlap clinically. Using machine learning, we developed an approach to stratify patients with DLBCL into four subgroups based on survival characteristics. This approach uses data from the targeted transcriptome to predict these survival subgroups. Using the expression levels of 180 genes, our model reliably predicted the four survival subgroups and was validated using independent groups of patients. Multivariate analysis showed that this patient stratification strategy encompasses various biological characteristics of DLBCL, and only TP53 mutations remained an independent prognostic biomarker. This novel approach for stratifying patients with DLBCL, based on the clinical outcome of rituximab, cyclophosphamide, doxorubicin, vincristine, and prednisone therapy, can be used to identify patients who may not respond well to these types of therapy, but would otherwise benefit from alternative therapy and clinical trials.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparison of clinical outcomes between cystotome-assisted prechop phacoemulsification surgery and femtosecond laser-assisted cataract surgery for hard nucleus cataracts",
        "link": "https://www.nature.com/articles/s41433-021-01900-8",
        "publication_date": "29 Jan 2022",
        "abstract": "To compare the safety and efficacy of cystotome-assisted prechop phacoemulsification surgery (CAPPS) and femtosecond laser-assisted cataract surgery (FLACS) in patients with hard nucleus cataract.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sounds of COVID-19: exploring realistic performance of audio-based digital testing",
        "link": "https://www.nature.com/articles/s41746-021-00553-x",
        "publication_date": "28 Jan 2022",
        "abstract": "To identify Coronavirus disease (COVID-19) cases efficiently, affordably, and at scale, recent work has shown how audio (including cough, breathing and voice) based approaches can be used for testing. However, there is a lack of exploration of how biases and methodological decisions impact these tools’ performance in practice. In this paper, we explore the realistic performance of audio-based digital testing of COVID-19. To investigate this, we collected a large crowdsourced respiratory audio dataset through a mobile app, alongside symptoms and COVID-19 test results. Within the collected dataset, we selected 5240 samples from 2478 English-speaking participants and split them into participant-independent sets for model development and validation. In addition to controlling the language, we also balanced demographics for model training to avoid potential acoustic bias. We used these audio samples to construct an audio-based COVID-19 prediction model. The unbiased model took features extracted from breathing, coughs and voice signals as predictors and yielded an AUC-ROC of 0.71 (95% CI: 0.65–0.77). We further explored several scenarios with different types of unbalanced data distributions to demonstrate how biases and participant splits affect the performance. With these different, but less appropriate, evaluation strategies, the performance could be overestimated, reaching an AUC up to 0.90 (95% CI: 0.85–0.95) in some circumstances. We found that an unrealistic experimental setting can result in misleading, sometimes over-optimistic, performance. Instead, we reported complete and reliable results on crowd-sourced data, which would allow medical professionals and policy makers to accurately assess the value of this technology and facilitate its deployment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Asymmetry between right and left fundus images identified using convolutional neural networks",
        "link": "https://www.nature.com/articles/s41598-021-04323-3",
        "publication_date": "27 Jan 2022",
        "abstract": "We analyzed fundus images to identify whether convolutional neural networks (CNNs) can discriminate between right and left fundus images. We gathered 98,038 fundus photographs from the Gyeongsang National University Changwon Hospital, South Korea, and augmented these with the Ocular Disease Intelligent Recognition dataset. We created eight combinations of image sets to train CNNs. Class activation mapping was used to identify the discriminative image regions used by the CNNs. CNNs identified right and left fundus images with high accuracy (more than 99.3% in the Gyeongsang National University Changwon Hospital dataset and 91.1% in the Ocular Disease Intelligent Recognition dataset) regardless of whether the images were flipped horizontally. The depth and complexity of the CNN affected the accuracy (DenseNet121: 99.91%, ResNet50: 99.86%, and VGG19: 99.37%). DenseNet121 did not discriminate images composed of only left eyes (55.1%, p = 0.548). Class activation mapping identified the macula as the discriminative region used by the CNNs. Several previous studies used the flipping method to augment data in fundus photographs. However, such photographs are distinct from non-flipped images. This asymmetry could result in undesired bias in machine learning. Therefore, when developing a CNN with fundus photographs, care should be taken when applying data augmentation with flipping.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive structured–unstructured interactions in EHR models: A case study of suicide prediction",
        "link": "https://www.nature.com/articles/s41746-022-00558-0",
        "publication_date": "27 Jan 2022",
        "abstract": "Clinical risk prediction models powered by electronic health records (EHRs) are becoming increasingly widespread in clinical practice. With suicide-related mortality rates rising in recent years, it is becoming increasingly urgent to understand, predict, and prevent suicidal behavior. Here, we compare the predictive value of structured and unstructured EHR data for predicting suicide risk. We find that Naive Bayes Classifier (NBC) and Random Forest (RF) models trained on structured EHR data perform better than those based on unstructured EHR data. An NBC model trained on both structured and unstructured data yields similar performance (AUC = 0.743) to an NBC model trained on structured data alone (0.742, p = 0.668), while an RF model trained on both data types yields significantly better results (AUC = 0.903) than an RF model trained on structured data alone (0.887, p < 0.001), likely due to the RF model’s ability to capture interactions between the two data types. To investigate these interactions, we propose and implement a general framework for identifying specific structured-unstructured feature pairs whose interactions differ between case and non-case cohorts, and thus have the potential to improve predictive performance and increase understanding of clinical risk. We find that such feature pairs tend to capture heterogeneous pairs of general concepts, rather than homogeneous pairs of specific concepts. These findings and this framework can be used to improve current and future EHR-based clinical modeling efforts.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Quality assessment standards in artificial intelligence diagnostic accuracy systematic reviews: a meta-research study",
        "link": "https://www.nature.com/articles/s41746-021-00544-y",
        "publication_date": "27 Jan 2022",
        "abstract": "Artificial intelligence (AI) centred diagnostic systems are increasingly recognised as robust solutions in healthcare delivery pathways. In turn, there has been a concurrent rise in secondary research studies regarding these technologies in order to influence key clinical and policymaking decisions. It is therefore essential that these studies accurately appraise methodological quality and risk of bias within shortlisted trials and reports. In order to assess whether this critical step is performed, we undertook a meta-research study evaluating adherence to the Quality Assessment of Diagnostic Accuracy Studies 2 (QUADAS-2) tool within AI diagnostic accuracy systematic reviews. A literature search was conducted on all studies published from 2000 to December 2020. Of 50 included reviews, 36 performed the quality assessment, of which 27 utilised the QUADAS-2 tool. Bias was reported across all four domains of QUADAS-2. Two hundred forty-three of 423 studies (57.5%) across all systematic reviews utilising QUADAS-2 reported a high or unclear risk of bias in the patient selection domain, 110 (26%) reported a high or unclear risk of bias in the index test domain, 121 (28.6%) in the reference standard domain and 157 (37.1%) in the flow and timing domain. This study demonstrates the incomplete uptake of quality assessment tools in reviews of AI-based diagnostic accuracy studies and highlights inconsistent reporting across all domains of quality assessment. Poor standards of reporting act as barriers to clinical implementation. The creation of an AI-specific extension for quality assessment tools of diagnostic accuracy AI studies may facilitate the safe translation of AI tools into clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Attention-guided deep learning for gestational age prediction using fetal brain MRI",
        "link": "https://www.nature.com/articles/s41598-022-05468-5",
        "publication_date": "26 Jan 2022",
        "abstract": "Magnetic resonance imaging offers unrivaled visualization of the fetal brain, forming the basis for establishing age-specific morphologic milestones. However, gauging age-appropriate neural development remains a difficult task due to the constantly changing appearance of the fetal brain, variable image quality, and frequent motion artifacts. Here we present an end-to-end, attention-guided deep learning model that predicts gestational age with R2 score of 0.945, mean absolute error of 6.7 days, and concordance correlation coefficient of 0.970. The convolutional neural network was trained on a heterogeneous dataset of 741 developmentally normal fetal brain images ranging from 19 to 39 weeks in gestational age. We also demonstrate model performance and generalizability using independent datasets from four academic institutions across the U.S. and Turkey with R2 scores of 0.81–0.90 after minimal fine-tuning. The proposed regression algorithm provides an automated machine-enabled tool with the potential to better characterize in utero neurodevelopment and guide real-time gestational age estimation after the first trimester.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Intranasal insulin modulates cerebrospinal fluid markers of neuroinflammation in mild cognitive impairment and Alzheimer’s disease: a randomized trial",
        "link": "https://www.nature.com/articles/s41598-022-05165-3",
        "publication_date": "25 Jan 2022",
        "abstract": "Intranasal insulin (INI) has shown promise as a treatment for Alzheimer’s disease (AD) in pilot clinical trials. In a recent phase 2 trial, participants with mild cognitive impairment (MCI) or AD who were treated with INI with one of two delivery devices showed improved cerebral spinal fluid (CSF) biomarker profiles and slower symptom progression compared with placebo. In the cohort which showed benefit, we measured changes in CSF markers of inflammation, immune function and vascular integrity and assessed their relationship with changes in cognition, brain volume, and CSF amyloid and tau concentrations. The insulin-treated group had increased CSF interferon-γ (p = 0.032) and eotaxin (p = 0.049), and reduced interleukin-6 (p = 0.048) over the 12 month trial compared to placebo. Trends were observed for increased CSF macrophage-derived chemokine for the placebo group (p = 0.083), and increased interleukin-2 in the insulin-treated group (p = 0.093). Insulin-treated and placebo groups showed strikingly different patterns of associations between changes in CSF immune/inflammatory/vascular markers and changes in cognition, brain volume, and amyloid and tau concentrations. In summary, INI treatment altered the typical progression of markers of inflammation and immune function seen in AD, suggesting that INI may promote a compensatory immune response associated with therapeutic benefit.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction and recommendation by machine learning through repetitive internal validation for hepatic veno-occlusive disease/sinusoidal obstruction syndrome and early death after allogeneic hematopoietic cell transplantation",
        "link": "https://www.nature.com/articles/s41409-022-01583-z",
        "publication_date": "24 Jan 2022",
        "abstract": "Using traditional statistical methods, we previously analyzed the risk factors and treatment outcomes of veno-occlusive disease/sinusoidal obstruction syndrome (VOD/SOS) after allogeneic hematopoietic cell transplantation. Within the same cohort, we applied machine learning to create prediction and recommendation models. We analyzed 2572 transplants using eXtreme Gradient Boosting (XGBoost) to predict post-transplant VOD/SOS and early death. Using the XGBoost and SHapley Additive exPlanations (SHAP), we found influential factors and devised recommendation models, which were internally verified by repetitive ten-fold cross-validation. SHAP values suggested that gender, busulfan dosage, age, forced expiratory volume, and Disease Risk Index were significant factors for VOD/SOS. The areas under the receiver operating characteristic curves and the areas under the precision-recall curve of the models were 0.740, 0.144 for all VOD/SOS, 0.793, 0.793 for severe to very severe VOD/SOS, and 0.746, 0.304 for early death. According to our single feature recommendation, following the busulfan dosage was the most effective for preventing VOD/SOS. The recommendation method for six adjustable feature sets was also validated, and a subgroup corresponding to five to six features showed significant preventive power for VOD/SOS and early death. Our personalized treatment set recommendation showed reproducibility in repetitive internal validation, but large external cohorts should prospectively validate our model.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "External validation of deep learning-based bone-age software: a preliminary study with real world data",
        "link": "https://www.nature.com/articles/s41598-022-05282-z",
        "publication_date": "24 Jan 2022",
        "abstract": "Artificial intelligence (AI) is increasingly being used in bone-age (BA) assessment due to its complicated and lengthy nature. We aimed to evaluate the clinical performance of a commercially available deep learning (DL)–based software for BA assessment using a real-world data. From Nov. 2018 to Feb. 2019, 474 children (35 boys, 439 girls, age 4–17 years) were enrolled. We compared the BA estimated by DL software (DL-BA) with that independently estimated by 3 reviewers (R1: Musculoskeletal radiologist, R2: Radiology resident, R3: Pediatric endocrinologist) using the traditional Greulich–Pyle atlas, then to his/her chronological age (CA). A paired t-test, Pearson’s correlation coefficient, Bland–Altman plot, mean absolute error (MAE) and root mean square error (RMSE) were used for the statistical analysis. The intraclass correlation coefficient (ICC) was used for inter-rater variation. There were significant differences between DL-BA and each reviewer’s BA (P < 0.025), but the correlation was good with one another (r = 0.983, P < 0.025). RMSE (MAE) values were 10.09 (7.21), 10.76 (7.88) and 13.06 (10.06) months between DL-BA and R1, R2, R3 BA. Compared with the CA, RMSE (MAE) values were 13.54 (11.06), 15.18 (12.11), 16.19 (12.78) and 19.53 (17.71) months for DL-BA, R1, R2, R3 BA, respectively. Bland–Altman plots revealed the software and reviewers’ tendency to overestimate the BA in general. ICC values between 3 reviewers were 0.97, 0.85 and 0.86, and the overall ICC value was 0.93. The BA estimated by DL-based software showed statistically similar, or even better performance than that of reviewers’ compared to the chronological age in the real world clinic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The application of a deep learning system developed to reduce the time for RT-PCR in COVID-19 detection",
        "link": "https://www.nature.com/articles/s41598-022-05069-2",
        "publication_date": "24 Jan 2022",
        "abstract": "Reducing the time to diagnose COVID-19 helps to manage insufficient isolation-bed resources and adequately accommodate critically ill patients. There is currently no alternative method to real-time reverse transcriptase polymerase chain reaction (RT-PCR), which requires 40 cycles to diagnose COVID-19. We propose a deep learning (DL) model to improve the speed of COVID-19 RT-PCR diagnosis. We developed and tested a DL model using the long short-term memory method with a dataset of fluorescence values measured in each cycle of 5810 RT-PCR tests. Among the DL models developed here, the diagnostic performance of the 21st model showed an area under the receiver operating characteristic (AUROC), sensitivity, and specificity of 84.55%, 93.33%, and 75.72%, respectively. The diagnostic performance of the 24th model showed an AUROC, sensitivity, and specificity of 91.27%, 90.00%, and 92.54%, respectively.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Application of ensemble machine learning algorithms on lifestyle factors and wearables for cardiovascular risk prediction",
        "link": "https://www.nature.com/articles/s41598-021-04649-y",
        "publication_date": "20 Jan 2022",
        "abstract": "This study looked at novel data sources for cardiovascular risk prediction including detailed lifestyle questionnaire and continuous blood pressure monitoring, using ensemble machine learning algorithms (MLAs). The reference conventional risk score compared against was the Framingham Risk Score (FRS). The outcome variables were low or high risk based on calcium score 0 or calcium score 100 and above. Ensemble MLAs were built based on naive bayes, random forest and support vector classifier for low risk and generalized linear regression, support vector regressor and stochastic gradient descent regressor for high risk categories. MLAs were trained on 600 Southeast Asians aged 21 to 69 years free of cardiovascular disease. All MLAs outperformed the FRS for low and high-risk categories. MLA based on lifestyle questionnaire only achieved AUC of 0.715 (95% CI 0.681, 0.750) and 0.710 (95% CI 0.653, 0.766) for low and high risk respectively. Combining all groups of risk factors (lifestyle survey questionnaires, clinical blood tests, 24-h ambulatory blood pressure and heart rate monitoring) along with feature selection, prediction of low and high CVD risk groups were further enhanced to 0.791 (95% CI 0.759, 0.822) and 0.790 (95% CI 0.745, 0.836). Besides conventional predictors, self-reported physical activity, average daily heart rate, awake blood pressure variability and percentage time in diastolic hypertension were important contributors to CVD risk classification.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An integrated framework for identifying clinical-laboratory indicators for novel pandemics: COVID-19 and MIS-C",
        "link": "https://www.nature.com/articles/s41746-021-00547-9",
        "publication_date": "20 Jan 2022",
        "abstract": "During the critical early stages of an emerging pandemic, limited availability of pathogen-specific testing can severely inhibit individualized risk screening and pandemic tracking. Standard clinical laboratory tests offer a widely available complementary data source for first-line risk screening and pandemic surveillance. Here, we propose an integrated framework for developing clinical-laboratory indicators for novel pandemics that combines population-level and individual-level analyses. We apply this framework to 7,520,834 clinical laboratory tests recorded over five years and find clinical-lab-test combinations that are strongly associated with SARS-CoV-2 PCR test results and Multisystem Inflammatory Syndrome in Children (MIS-C) diagnoses: Interleukin-related tests (e.g. IL4, IL10) were most strongly associated with SARS-CoV-2 infection and MIS-C, while other more widely available tests (ferritin, D-dimer, fibrinogen, alanine transaminase, and C-reactive protein) also had strong associations. When novel pandemics emerge, this framework can be used to identify specific combinations of clinical laboratory tests for public health tracking and first-line individualized risk screening.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]