[
    {
        "title": "An individualized protein-based prognostic model to stratify pediatric patients with papillary thyroid carcinoma",
        "link": "https://www.nature.com/articles/s41467-024-47926-w",
        "publication_date": "26 Apr 2024",
        "abstract": "Pediatric papillary thyroid carcinomas (PPTCs) exhibit high inter-tumor heterogeneity and currently lack widely adopted recurrence risk stratification criteria. Hence, we propose a machine learning-based objective method to individually predict their recurrence risk. We retrospectively collect and evaluate the clinical factors and proteomes of 83 pediatric benign (PB), 85 pediatric malignant (PM) and 66 adult malignant (AM) nodules, and quantify 10,426 proteins by mass spectrometry. We find 243 and 121 significantly dysregulated proteins from PM vs. PB and PM vs. AM, respectively. Function and pathway analyses show the enhanced activation of the inflammatory and immune system in PM patients compared with the others. Nineteen proteins are selected to predict recurrence using a machine learning model with an accuracy of 88.24%. Our study generates a protein-based personalized prognostic prediction model that can stratify PPTC patients into high- or low-recurrence risk groups, providing a reference for clinical decision-making and individualized treatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparing various AI approaches to traditional quantitative assessment of the myocardial perfusion in [82Rb] PET for MACE prediction",
        "link": "https://www.nature.com/articles/s41598-024-60095-6",
        "publication_date": "26 Apr 2024",
        "abstract": "Assessing the individual risk of Major Adverse Cardiac Events (MACE) is of major importance as cardiovascular diseases remain the leading cause of death worldwide. Quantitative Myocardial Perfusion Imaging (MPI) parameters such as stress Myocardial Blood Flow (sMBF) or Myocardial Flow Reserve (MFR) constitutes the gold standard for prognosis assessment. We propose a systematic investigation of the value of Artificial Intelligence (AI) to leverage [\\(^{82}\\)Rb] Silicon PhotoMultiplier (SiPM) PET MPI for MACE prediction. We establish a general pipeline for AI model validation to assess and compare the performance of global (i.e. average of the entire MPI signal), regional (17 segments), radiomics and Convolutional Neural Network (CNN) models leveraging various MPI signals on a dataset of 234 patients. Results showed that all regional AI models significantly outperformed the global model (\\(p<0.001\\)), where the best AUC of 73.9% (CI 72.5–75.3) was obtained with a CNN model. A regional AI model based on MBF averages from 17 segments fed to a Logistic Regression (LR) constituted an excellent trade-off between model simplicity and performance, achieving an AUC of 73.4% (CI 72.3–74.7). A radiomics model based on intensity features revealed that the global average was the least important feature when compared to other aggregations of the MPI signal over the myocardium. We conclude that AI models can allow better personalized prognosis assessment for MACE.",
        "conclusions": "Our study demonstrates for the first time the feasibility of AI-based approaches using dynamic [\\(^{82}\\)Rb] PET/CT data in the assessment of MACE, using quantitative MBF parameters as gold standard. Radiomics intensity and CNN 2 models achieved promising results with observed average AUCs of 73.8% and 73.9%, respectively. Overall we conclude that the regional model constitutes an excellent trade-off between model simplicity and performance, achieving high AUC (73.4%) and best specificity (72%). In comparison, CNN 2 (best AUC of 73.9%) favors sensitivity over specificity. The results are promising, and the moderate diagnostic accuracy achieved by the models could be explained by the following limitations.This study is based on a single center with a relatively limited sample size. It would be of interest to apply this pipeline to a larger database collected across multiple centers. We used normalizing resting flow according to the pressure-rate product, which could inherently reduce the prognostic value of flow reserve to predict MACE risk. While this first study focused on traditional AI methods (i.e. radiomics with LR and simple NNs), more advanced AI methods will be investigated in future work. In particular, the tabular representation (i.e. MFB matrix) used as input to the models suffers from spatial distortion. It is worth noting that using PMs as input would also involve spatial distortions in the apex region. Nevertheless, future work will consider analyzing the 3D PET images or graph-based CNNs as this approach showed to better leverage the spatially distorted content of PMs for MPI abnormality classification in SPECT-based MPI38. Other quantitative measurement from [\\(^{82}\\)Rb] PET can also be considered such as left ventricular ejection fraction61. Another limitation of this study lies in the imbalance of the data, even though we reduce its impact by addressing the lack of positive cases with the oversampling of the minority class.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a smartwatch algorithm for differentiating physical activity intensity in health monitoring",
        "link": "https://www.nature.com/articles/s41598-024-59602-6",
        "publication_date": "25 Apr 2024",
        "abstract": "To develop and validate a machine learning based algorithm to estimate physical activity (PA) intensity using the smartwatch with the capacity to record PA and determine outdoor state. Two groups of participants, including 24 adults (13 males) and 18 children (9 boys), completed a sequential activity trial. During each trial, participants wore a smartwatch, and energy expenditure was measured using indirect calorimetry as gold standard. The support vector machine algorithm and the least squares regression model were applied for the metabolic equivalent (MET) estimation using raw data derived from the smartwatch. Exercise intensity was categorized based on MET values into sedentary activity (SED), light activity (LPA), moderate activity (MPA), and vigorous activity (VPA). The classification accuracy was evaluated using area under the ROC curve (AUC). The METs estimation accuracy were assessed via the mean absolute error (MAE), the correlation coefficient, Bland–Altman plots, and intraclass correlation (ICC). A total of 24 adults aged 21–34 years and 18 children aged 9–13 years participated in the study, yielding 1790 and 1246 data points for adults and children respectively for model building and validation. For adults, the AUC for classifying SED, MVPA, and VPA were 0.96, 0.88, and 0.86, respectively. The MAE between true METs and estimated METs was 0.75 METs. The correlation coefficient and ICC were 0.87 (p < 0.001) and 0.89, respectively. For children, comparable levels of accuracy were demonstrated, with the AUC for SED, MVPA, and VPA being 0.98, 0.89, and 0.85, respectively. The MAE between true METs and estimated METs was 0.80 METs. The correlation coefficient and ICC were 0.79 (p < 0.001) and 0.84, respectively. The developed model successfully estimated PA intensity with high accuracy in both adults and children. The application of this model enables independent investigation of PA intensity, facilitating research in health monitoring and potentially in areas such as myopia prevention and control.",
        "conclusions": "Our smartwatch machine learning based model can estimate and classify PA intensity with high accuracy in both adults and children. With the addition of the outdoor state discrimination algorithm, the effect of PA intensity and outdoor time on myopia can be investigated independently by using the smartwatch. So far, the smartwatch has been applied in large-scale research to investigate the relationship between daily activities and myopia25,54. Based on the device-based method and large quantity of data, these studies can optimize our understanding of behavioral interventions in myopia onset and progression.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Large language models for preventing medication direction errors in online pharmacies",
        "link": "https://www.nature.com/articles/s41591-024-02933-8",
        "publication_date": "25 Apr 2024",
        "abstract": "Errors in pharmacy medication directions, such as incorrect instructions for dosage or frequency, can increase patient safety risk substantially by raising the chances of adverse drug events. This study explores how integrating domain knowledge with large language models (LLMs)—capable of sophisticated text interpretation and generation—can reduce these errors. We introduce MEDIC (medication direction copilot), a system that emulates the reasoning of pharmacists by prioritizing precise communication of core clinical components of a prescription, such as dosage and frequency. It fine-tunes a first-generation LLM using 1,000 expert-annotated and augmented directions from Amazon Pharmacy to extract the core components and assembles them into complete directions using pharmacy logic and safety guardrails. We compared MEDIC against two LLM-based benchmarks: one leveraging 1.5 million medication directions and the other using state-of-the-art LLMs. On 1,200 expert-reviewed prescriptions, the two benchmarks respectively recorded 1.51 (confidence interval (CI) 1.03, 2.31) and 4.38 (CI 3.13, 6.64) times more near-miss events—errors caught and corrected before reaching the patient—than MEDIC. Additionally, we tested MEDIC by deploying within the production system of an online pharmacy, and during this experimental period, it reduced near-miss events by 33% (CI 26%, 40%). This study shows that LLMs, with domain expertise and safeguards, improve the accuracy and efficiency of pharmacy operations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Gut microbiome composition reveals the distinctiveness between the Bengali people and the Indigenous ethnicities in Bangladesh",
        "link": "https://www.nature.com/articles/s42003-024-06191-9",
        "publication_date": "25 Apr 2024",
        "abstract": "Ethnicity has a significant role in shaping the composition of the gut microbiome, which has implications in human physiology. This study intends to investigate the gut microbiome of Bengali people as well as several indigenous ethnicities (Chakma, Marma, Khyang, and Tripura) residing in the Chittagong Hill Tracts areas of Bangladesh. Following fecal sample collection from each population, part of the bacterial 16 s rRNA gene was amplified and sequenced using Illumina NovaSeq platform. Our findings indicated that Bangladeshi gut microbiota have a distinct diversity profile when compared to other countries. We also found out that Bangladeshi indigenous communities had a higher Firmicutes to Bacteroidetes ratio than the Bengali population. The investigation revealed an unclassified bacterium that was differentially abundant in Bengali samples while the genus Alistipes was found to be prevalent in Chakma samples. Further research on these bacteria might help understand diseases associated with these populations. Also, the current small sample-sized pilot study hindered the comprehensive understanding of the gut microbial diversity of the Bangladeshi population and its potential health implications. However, our study will help establish a basic understanding of the gut microbiome of the Bangladeshi population.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Use of the flat panel detector fluoroscope reduces radiation exposure during periacetabular osteotomy",
        "link": "https://www.nature.com/articles/s41598-024-58314-1",
        "publication_date": "24 Apr 2024",
        "abstract": "The Periacetabular Osteotomy is a technically demanding procedure that requires precise intraoperative evaluation of pelvic anatomy. Fluoroscopic images pose a radiation risk to operating room staff, scrubbed personnel, and the patient. Most commonly, a Standard Fluoroscope with an Image Intensifier is used. Our institution recently implemented the novel Fluoroscope with a Flat Panel Detector. The purpose of this study was to compare radiation dosage and accuracy between the two fluoroscopes. A retrospective review of a consecutive series of patients who underwent Periacetabular Osteotomy for symptomatic hip dysplasia was completed. The total radiation exposure dose (mGy) was recorded and compared for each case from the standard fluoroscope (n = 27) and the flat panel detector (n = 26) cohorts. Lateral center edge angle was measured and compared intraoperatively and at the six-week postoperative visit. A total of 53 patients (96% female) with a mean age and BMI of 17.84 (± 6.84) years and 22.66 (± 4.49) kg/m2 (standard fluoroscope) and 18.23 (± 4.21) years and 21.99 (± 4.00) kg/m2 (flat panel detector) were included. The standard fluoroscope averaged total radiation exposure to be 410.61(± 193.02) mGy, while the flat panel detector averaged 91.12 (± 49.64) mGy (p < 0.0001). The average difference (bias) between intraoperative and 6-week postoperative lateral center edge angle measurement was 0.36° (limits of agreement: − 3.19 to 2.47°) for the standard fluoroscope and 0.27° (limits of agreement: − 2.05 to 2.59°) for the flat panel detector cohort. Use of fluoroscopy with flat panel detector technology decreased the total radiation dose exposure intraoperatively and produced an equivalent assessment of intraoperative lateral center edge angle. Decreasing radiation exposure to young patients is imperative to reduce the risk of future comorbidities.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Trained neural networking framework based skin cancer diagnosis and categorization using grey wolf optimization",
        "link": "https://www.nature.com/articles/s41598-024-59979-4",
        "publication_date": "24 Apr 2024",
        "abstract": "Skin Cancer is caused due to the mutational differences in epidermis hormones and patch appearances. Many studies are focused on the design and development of effective approaches in diagnosis and categorization of skin cancer. The decisions are made on independent training dataset under limited editions and scenarios. In this research, the kaggle based datasets are optimized and categorized into a labeled data array towards indexing using Federated learning (FL). The technique is developed on grey wolf optimization algorithm to assure the dataset attribute dependencies are extracted and dimensional mapping is processed. The threshold value validation of the dimensional mapping datasets is effectively optimized and trained under the neural networking framework further expanded via federated learning standards. The technique has demonstrated 95.82% accuracy under GWO technique and 94.9% on inter-combination of Trained Neural Networking (TNN) framework and Recessive Learning (RL) in accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A novel SpaSA based hyper-parameter optimized FCEDN with adaptive CNN classification for skin cancer detection",
        "link": "https://www.nature.com/articles/s41598-024-57393-4",
        "publication_date": "23 Apr 2024",
        "abstract": "Skin cancer is the most prevalent kind of cancer in people. It is estimated that more than 1 million people get skin cancer every year in the world. The effectiveness of the disease’s therapy is significantly impacted by early identification of this illness. Preprocessing is the initial detecting stage in enhancing the quality of skin images by removing undesired background noise and objects. This study aims is to compile preprocessing techniques for skin cancer imaging that are currently accessible. Researchers looking into automated skin cancer diagnosis might use this article as an excellent place to start. The fully convolutional encoder–decoder network and Sparrow search algorithm (FCEDN-SpaSA) are proposed in this study for the segmentation of dermoscopic images. The individual wolf method and the ensemble ghosting technique are integrated to generate a neighbour-based search strategy in SpaSA for stressing the correct balance between navigation and exploitation. The classification procedure is accomplished by using an adaptive CNN technique to discriminate between normal skin and malignant skin lesions suggestive of disease. Our method provides classification accuracies comparable to commonly used incremental learning techniques while using less energy, storage space, memory access, and training time (only network updates with new training samples, no network sharing). In a simulation, the segmentation performance of the proposed technique on the ISBI 2017, ISIC 2018, and PH2 datasets reached accuracies of 95.28%, 95.89%, 92.70%, and 98.78%, respectively, on the same dataset and assessed the classification performance. It is accurate 91.67% of the time. The efficiency of the suggested strategy is demonstrated through comparisons with cutting-edge methodologies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Potential therapeutic targets for COVID-19 complicated with pulmonary hypertension: a bioinformatics and early validation study",
        "link": "https://www.nature.com/articles/s41598-024-60113-7",
        "publication_date": "23 Apr 2024",
        "abstract": "Coronavirus disease (COVID-19) and pulmonary hypertension (PH) are closely correlated. However, the mechanism is still poorly understood. In this article, we analyzed the molecular action network driving the emergence of this event. Two datasets (GSE113439 and GSE147507) from the GEO database were used for the identification of differentially expressed genes (DEGs).Common DEGs were selected by VennDiagram and their enrichment in biological pathways was analyzed. Candidate gene biomarkers were selected using three different machine-learning algorithms (SVM-RFE, LASSO, RF).The diagnostic efficacy of these foundational genes was validated using independent datasets. Eventually, we validated molecular docking and medication prediction. We found 62 common DEGs, including several ones that could be enriched for Immune Response and Inflammation. Two DEGs (SELE and CCL20) could be identified by machine-learning algorithms. They performed well in diagnostic tests on independent datasets. In particular, we observed an upregulation of functions associated with the adaptive immune response, the leukocyte-lymphocyte-driven immunological response, and the proinflammatory response. Moreover, by ssGSEA, natural killer T cells, activated dendritic cells, activated CD4 T cells, neutrophils, and plasmacytoid dendritic cells were correlated with COVID-19 and PH, with SELE and CCL20 showing the strongest correlation with dendritic cells. Potential therapeutic compounds like FENRETI-NIDE, AFLATOXIN B1 and 1-nitropyrene were predicted. Further molecular docking and molecular dynamics simulations showed that 1-nitropyrene had the most stable binding with SELE and CCL20.The findings indicated that SELE and CCL20 were identified as novel diagnostic biomarkers for COVID-19 complicated with PH, and the target of these two key genes, FENRETI-NIDE and 1-nitropyrene, was predicted to be a potential therapeutic target, thus providing new insights into the prediction and treatment of COVID-19 complicated with PH in clinical practice.",
        "conclusions": "In this research, SELE and CCL20 were found to be indicators of COVID-19 and PH co-pathogenesis by various bioinformatics analyse and machine learning algorithms. Adaptive immune response, leukocyte, lymphocyte mediated immune responses, and proinflammatory response mediated by cytokines like IL-12, TNF-a were functionally enriched in these two hub genes. These two hub genes were selected for nomogram construction and their diagnostic value evaluated by machine learning. The nomogram was found to have high diagnostic value. Dendritic cells had the strongest connection with SELE and CCL20, followed by activated CD4 T cells, active dendritic cells, natural killer T cells, neutrophils, and plasmacytoid dendritic cells. Using only 2 reference genes, we were able to isolate 12 shared TFs and 25 shared TF-miRNAs.by FFL tool, This FFL among CCL20, miR-1256 and PPARG may be a novel regulatory module in COVID-19 complicated with pulmonary hypertension. It was hypothesized that FENRETINIDE, 1-NITROPYRENE, and AFLATOXIN B1would be useful in treating COVID-19 complicated by PH. Further molecular docking and molecular dynamics simulations showed that 1-nitropyrene had the most stable binding with SELE and CCL20. Understanding the comorbidity of COVID-19 and PH may be aided by these biomarkers and the connection between COVID-19 and PH and angiogenesis.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparative analysis of feature-based ML and CNN for binucleated erythroblast quantification in myelodysplastic syndrome patients using imaging flow cytometry data",
        "link": "https://www.nature.com/articles/s41598-024-59875-x",
        "publication_date": "23 Apr 2024",
        "abstract": "Myelodysplastic syndrome is primarily characterized by dysplasia in the bone marrow (BM), presenting a challenge in consistent morphology interpretation. Accurate diagnosis through traditional slide-based analysis is difficult, necessitating a standardized objective technique. Over the past two decades, imaging flow cytometry (IFC) has proven effective in combining image-based morphometric analyses with high-parameter phenotyping. We have previously demonstrated the effectiveness of combining IFC with a feature-based machine learning algorithm to accurately identify and quantify rare binucleated erythroblasts (BNEs) in dyserythropoietic BM cells. However, a feature-based workflow poses challenges requiring software-specific expertise. Here we employ a Convolutional Neural Network (CNN) algorithm for BNE identification and differentiation from doublets and cells with irregular nuclear morphology in IFC data. We demonstrate that this simplified AI workflow, coupled with a powerful CNN algorithm, achieves comparable BNE quantification accuracy to manual and feature-based analysis with substantial time savings, eliminating workflow complexity. This streamlined approach holds significant clinical value, enhancing IFC accessibility for routine diagnostic purposes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Assessing ChatGPT 4.0’s test performance and clinical diagnostic accuracy on USMLE STEP 2 CK and clinical case reports",
        "link": "https://www.nature.com/articles/s41598-024-58760-x",
        "publication_date": "23 Apr 2024",
        "abstract": "While there is data assessing the test performance of artificial intelligence (AI) chatbots, including the Generative Pre-trained Transformer 4.0 (GPT 4) chatbot (ChatGPT 4.0), there is scarce data on its diagnostic accuracy of clinical cases. We assessed the large language model (LLM), ChatGPT 4.0, on its ability to answer questions from the United States Medical Licensing Exam (USMLE) Step 2, as well as its ability to generate a differential diagnosis based on corresponding clinical vignettes from published case reports. A total of 109 Step 2 Clinical Knowledge (CK) practice questions were inputted into both ChatGPT 3.5 and ChatGPT 4.0, asking ChatGPT to pick the correct answer. Compared to its previous version, ChatGPT 3.5, we found improved accuracy of ChatGPT 4.0 when answering these questions, from 47.7 to 87.2% (p = 0.035) respectively. Utilizing the topics tested on Step 2 CK questions, we additionally found 63 corresponding published case report vignettes and asked ChatGPT 4.0 to come up with its top three differential diagnosis. ChatGPT 4.0 accurately created a shortlist of differential diagnoses in 74.6% of the 63 case reports (74.6%). We analyzed ChatGPT 4.0’s confidence in its diagnosis by asking it to rank its top three differentials from most to least likely. Out of the 47 correct diagnoses, 33 were the first (70.2%) on the differential diagnosis list, 11 were second (23.4%), and three were third (6.4%). Our study shows the continued iterative improvement in ChatGPT’s ability to answer standardized USMLE questions accurately and provides insights into ChatGPT’s clinical diagnostic accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cross-sectional associations between multisensory impairment and brain volumes in older adults: Baltimore Longitudinal Study of Aging",
        "link": "https://www.nature.com/articles/s41598-024-59965-w",
        "publication_date": "23 Apr 2024",
        "abstract": "Sensory impairment and brain atrophy is common among older adults, increasing the risk of dementia. Yet, the degree to which multiple co-occurring sensory impairments (MSI across vision, proprioception, vestibular function, olfactory, and hearing) are associated with brain morphometry remain unexplored. Data were from 208 cognitively unimpaired participants (mean age 72 ± 10 years; 59% women) enrolled in the Baltimore Longitudinal Study of Aging. Multiple linear regression models were used to estimate cross-sectional associations between MSI and regional brain imaging volumes. For each additional sensory impairment, there were associated lower orbitofrontal gyrus and entorhinal cortex volumes but higher caudate and putamen volumes. Participants with MSI had lower mean volumes in the superior frontal gyrus, orbitofrontal gyrus, superior parietal lobe, and precuneus compared to participants with < 2 impairments. While MSI was largely associated with lower brain volumes, our results suggest the possibility that MSI was associated with higher basal ganglia volumes. Longitudinal analyses are needed to evaluate the temporality and directionality of these associations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Behavioral difficulties and associated factors among the ‘lost generation’ of Syrian children and adolescents",
        "link": "https://www.nature.com/articles/s41598-024-59784-z",
        "publication_date": "23 Apr 2024",
        "abstract": "Childhood and adolescence, vital in shaping adult life and society, are profoundly impacted during conflicts like Syria’s devastating war. This study explores the prevalence of behavioral disorders in Syrian children and adolescents, examining the influence of war and family-related factors. This cross-sectional study was conducted on children aged 2–17 years at a children’s outpatient clinic in Damascus, Syria. We assessed parents’ quality of life, war and family-related factors, and behavioral difficulties through parental interviews using two questionnaires: the Arabic version of the Strengths & Difficulties Questionnaire (SDQ) and the brief Arabic version of the World Health Organization Quality of Life Questionnaire (WHOQOL-BREF). 74.67% of children aged 2–4 years and 61.29% of children aged 5–17 years were experiencing behavioral difficulties, with emotional difficulties being the most prevalent ones. Children exposed to kidnapping, family losses, lack of school enrollment, and those with parents having lower education, lower socioeconomic status, and poorer quality of life exhibited higher Total SDQ scores. The high prevalence of behavioral difficulties among children and adolescents in Syria is a major concern, with both direct and indirect war-related factors contributing to this issue.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Practical approaches in evaluating validation and biases of machine learning applied to mobile health studies",
        "link": "https://www.nature.com/articles/s43856-024-00468-0",
        "publication_date": "22 Apr 2024",
        "abstract": "Machine learning (ML) models are evaluated in a test set to estimate model performance after deployment. The design of the test set is therefore of importance because if the data distribution after deployment differs too much, the model performance decreases. At the same time, the data often contains undetected groups. For example, multiple assessments from one user may constitute a group, which is usually the case in mHealth scenarios.",
        "conclusions": "A simple heuristic is not always trivial to beat by an ML model, depending on the use case and the complexity of the search space. Thinking of the complexity that a ML model adds to a project, a heuristic might be a valuable start to see how well the model fits into the workflow and improves the outcome. A frequent communication with the domain expert of the use case helps to set up a heuristic as a baseline heuristic. In a second step, it can be evaluated whether the performance gain from an ML model justifies the additional development effort.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Real-time near infrared artificial intelligence using scalable non-expert crowdsourcing in colorectal surgery",
        "link": "https://www.nature.com/articles/s41746-024-01095-8",
        "publication_date": "22 Apr 2024",
        "abstract": "Surgical artificial intelligence (AI) has the potential to improve patient safety and clinical outcomes. To date, training such AI models to identify tissue anatomy requires annotations by expensive and rate-limiting surgical domain experts. Herein, we demonstrate and validate a methodology to obtain high quality surgical tissue annotations through crowdsourcing of non-experts, and real-time deployment of multimodal surgical anatomy AI model in colorectal surgery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of sensor system and data analytic framework for non-invasive blood glucose prediction",
        "link": "https://www.nature.com/articles/s41598-024-59744-7",
        "publication_date": "22 Apr 2024",
        "abstract": "Periodic quantification of blood glucose levels is performed using painful, invasive methods. The proposed work presents the development of a noninvasive glucose-monitoring device with two sensors, i.e., finger and wrist bands. The sensor system was designed with a near-infrared (NIR) wavelength of 940 nm emitter and a 900–1700 nm detector. This study included 101 diabetic and non-diabetic volunteers. The obtained dataset was subjected to pre-processing, exploratory data analysis (EDA), data visualization, and integration methods. Ambiguities such as the effects of skin color, ambient light, and finger pressure on the sensor were overcome in the proposed ‘niGLUC-2.0v’. niGLUC-2.0v was validated with performance metrics where accuracy of 99.02%, mean absolute error (MAE) of 0.15, mean square error (MSE) of 0.22 for finger, and accuracy of 99.96%, MAE of 0.06, MSE of 0.006 for wrist prototype with ridge regression (RR) were achieved. Bland–Altman analysis was performed, where 98% of the data points were within ± 1.96 standard deviation (SD), 100% were under zone A of the Clarke Error Grid (CEG), and statistical analysis showed p < 0.05 on evaluated accuracy. Thus, niGLUC-2.0v is suitable in the medical and personal care fields for continuous real-time blood glucose monitoring.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Measuring algorithmic bias to analyze the reliability of AI tools that predict depression risk using smartphone sensed-behavioral data",
        "link": "https://www.nature.com/articles/s44184-024-00057-y",
        "publication_date": "22 Apr 2024",
        "abstract": "AI tools intend to transform mental healthcare by providing remote estimates of depression risk using behavioral data collected by sensors embedded in smartphones. While these tools accurately predict elevated depression symptoms in small, homogenous populations, recent studies show that these tools are less accurate in larger, more diverse populations. In this work, we show that accuracy is reduced because sensed-behaviors are unreliable predictors of depression across individuals: sensed-behaviors that predict depression risk are inconsistent across demographic and socioeconomic subgroups. We first identified subgroups where a developed AI tool underperformed by measuring algorithmic bias, where subgroups with depression were incorrectly predicted to be at lower risk than healthier subgroups. We then found inconsistencies between sensed-behaviors predictive of depression across these subgroups. Our findings suggest that researchers developing AI tools predicting mental health from sensed-behaviors should think critically about the generalizability of these tools, and consider tailored solutions for targeted populations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The Mexican dataset of a repetitive transcranial magnetic stimulation clinical trial on cocaine use disorder patients: SUDMEX TMS",
        "link": "https://www.nature.com/articles/s41597-024-03242-y",
        "publication_date": "22 Apr 2024",
        "abstract": "Cocaine use disorder (CUD) is a global health problem with severe consequences, leading to behavioral, cognitive, and neurobiological disturbances. While consensus on treatments is still ongoing, repetitive transcranial magnetic stimulation (rTMS) has emerged as a promising approach for medication-resistant disorders, including substance use disorders. In this context, here we present the SUDMEX-TMS, a Mexican dataset from an rTMS clinical trial involving CUD patients. This longitudinal dataset comprises 54 CUD patients (including 8 females) with data collected at five time points: baseline (T0), two weeks (T1), three months (T2), six months (T3) follow-up, and twelve months (T4) follow-up. The clinical rTMS treatment followed a double-blinded randomized clinical trial design (n = 24 sham/30 active) for 2 weeks, followed by an open-label phase. The dataset includes demographic, clinical, and cognitive measures, as well as magnetic resonance imaging (MRI) data collected at all time points, encompassing structural (T1-weighted), functional (resting-state fMRI), and multishell diffusion-weighted (DWI-HARDI) sequences. This dataset offers the opportunity to investigate the impact of rTMS on CUD participants, considering clinical, cognitive, and multimodal MRI metrics in a longitudinal framework.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Optimizing vitiligo diagnosis with ResNet and Swin transformer deep learning models: a study on performance and interpretability",
        "link": "https://www.nature.com/articles/s41598-024-59436-2",
        "publication_date": "21 Apr 2024",
        "abstract": "Vitiligo is a hypopigmented skin disease characterized by the loss of melanin. The progressive nature and widespread incidence of vitiligo necessitate timely and accurate detection. Usually, a single diagnostic test often falls short of providing definitive confirmation of the condition, necessitating the assessment by dermatologists who specialize in vitiligo. However, the current scarcity of such specialized medical professionals presents a significant challenge. To mitigate this issue and enhance diagnostic accuracy, it is essential to build deep learning models that can support and expedite the detection process. This study endeavors to establish a deep learning framework to enhance the diagnostic accuracy of vitiligo. To this end, a comparative analysis of five models including ResNet (ResNet34, ResNet50, and ResNet101 models) and Swin Transformer series (Swin Transformer Base, and Swin Transformer Large models), were conducted under the uniform condition to identify the model with superior classification capabilities. Moreover, the study sought to augment the interpretability of these models by selecting one that not only provides accurate diagnostic outcomes but also offers visual cues highlighting the regions pertinent to vitiligo. The empirical findings reveal that the Swin Transformer Large model achieved the best performance in classification, whose AUC, accuracy, sensitivity, and specificity are 0.94, 93.82%, 94.02%, and 93.5%, respectively. In terms of interpretability, the highlighted regions in the class activation map correspond to the lesion regions of the vitiligo images, which shows that it effectively indicates the specific category regions associated with the decision-making of dermatological diagnosis. Additionally, the visualization of feature maps generated in the middle layer of the deep learning model provides insights into the internal mechanisms of the model, which is valuable for improving the interpretability of the model, tuning performance, and enhancing clinical applicability. The outcomes of this study underscore the significant potential of deep learning models to revolutionize medical diagnosis by improving diagnostic accuracy and operational efficiency. The research highlights the necessity for ongoing exploration in this domain to fully leverage the capabilities of deep learning technologies in medical diagnostics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Employing supervised machine learning algorithms for classification and prediction of anemia among youth girls in Ethiopia",
        "link": "https://www.nature.com/articles/s41598-024-60027-4",
        "publication_date": "20 Apr 2024",
        "abstract": "In developing countries, one-quarter of young women have suffered from anemia. However, the available studies in Ethiopia have been usually used the traditional stastical methods. Therefore, this study aimed to employ multiple machine learning algorithms to identify the most effective model for the prediction of anemia among youth girls in Ethiopia. A total of 5642 weighted samples of young girls from the 2016 Ethiopian Demographic and Health Survey dataset were utilized. The data underwent preprocessing, with 80% of the observations used for training the model and 20% for testing. Eight machine learning algorithms were employed to build and compare models. The model performance was assessed using evaluation metrics in Python software. Various data balancing techniques were applied, and the Boruta algorithm was used to select the most relevant features. Besides, association rule mining was conducted using the Apriori algorithm in R software. The random forest classifier with an AUC value of 82% outperformed in predicting anemia among all the tested classifiers. Region, poor wealth index, no formal education, unimproved toilet facility, rural residence, not used contraceptive method, religion, age, no media exposure, occupation, and having more than 5 family size were the top attributes to predict anemia. Association rule mining was identified the top seven best rules that most frequently associated with anemia. The random forest classifier is the best for predicting anemia. Therefore, making it potentially valuable as decision-support tools for the relevant stakeholders and giving emphasis for the identified predictors could be an important intervention to halt anemia among youth girls.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Eye movement function captured via an electronic tablet informs on cognition and disease severity in Parkinson’s disease",
        "link": "https://www.nature.com/articles/s41598-024-59750-9",
        "publication_date": "20 Apr 2024",
        "abstract": "Studying the oculomotor system provides a unique window to assess brain health and function in various clinical populations. Although the use of detailed oculomotor parameters in clinical research has been limited due to the scalability of the required equipment, the development of novel tablet-based technologies has created opportunities for fast, easy, cost-effective, and reliable eye tracking. Oculomotor measures captured via a mobile tablet-based technology have previously been shown to reliably discriminate between Parkinson’s Disease (PD) patients and healthy controls. Here we further investigate the use of oculomotor measures from tablet-based eye-tracking to inform on various cognitive abilities and disease severity in PD patients. When combined using partial least square regression, the extracted oculomotor parameters can explain up to 71% of the variance in cognitive test scores (e.g. Trail Making Test). Moreover, using a receiver operating characteristics (ROC) analysis we show that eye-tracking parameters can be used in a support vector classifier to discriminate between individuals with mild PD from those with moderate PD (based on UPDRS cut-off scores) with an accuracy of 90%. Taken together, our findings highlight the potential usefulness of mobile tablet-based technology to rapidly scale eye-tracking use and usefulness in both research and clinical settings by informing on disease stage and cognitive outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Analysis of the fatigue status of medical security personnel during the closed-loop period using multiple machine learning methods: a case study of the Beijing 2022 Olympic Winter Games",
        "link": "https://www.nature.com/articles/s41598-024-59397-6",
        "publication_date": "18 Apr 2024",
        "abstract": "Using machine learning methods to analyze the fatigue status of medical security personnel and the factors influencing fatigue (such as BMI, gender, and wearing protective clothing working hours), with the goal of identifying the key factors contributing to fatigue. By validating the predicted outcomes, actionable and practical recommendations can be offered to enhance fatigue status, such as reducing wearing protective clothing working hours. A questionnaire was designed to assess the fatigue status of medical security personnel during the closed-loop period, aiming to capture information on fatigue experienced during work and disease recovery. The collected data was then preprocessed and used to determine the structural parameters for each machine learning algorithm. To evaluate the prediction performance of different models, the mean relative error (MRE) and goodness of fit (R2) between the true and predicted values were calculated. Furthermore, the importance rankings of various parameters in relation to fatigue status were determined using the RF feature importance analysis method. The fatigue status of medical security personnel during the closed-loop period was analyzed using multiple machine learning methods. The prediction performance of these methods was ranked from highest to lowest as follows: Gradient Boosting Regression (GBM) > Random Forest (RF) > Adaptive Boosting (AdaBoost) > K-Nearest Neighbors (KNN) > Support Vector Regression (SVR). Among these algorithms, four out of the five achieved good prediction results, with the GBM method performing the best. The five most critical parameters influencing fatigue status were identified as working hours in protective clothing, a customized symptom and disease score (CSDS), physical exercise, body mass index (BMI), and age, all of which had importance scores exceeding 0.06. Notably, working hours in protective clothing obtained the highest importance score of 0.54, making it the most critical factor impacting fatigue status. Fatigue is a prevalent and pressing issue among medical security personnel operating in closed-loop environments. In our investigation, we observed that the GBM method exhibited superior predictive performance in determining the fatigue status of medical security personnel during the closed-loop period, surpassing other machine learning techniques. Notably, our analysis identified several critical factors influencing the fatigue status of medical security personnel, including the duration of working hours in protective clothing, CSDS, and engagement in physical exercise. These findings shed light on the multifaceted nature of fatigue among healthcare workers and emphasize the importance of considering various contributing factors. To effectively alleviate fatigue, prudent management of working hours for security personnel, along with minimizing the duration of wearing protective clothing, proves to be promising strategies. Furthermore, promoting regular physical exercise among medical security personnel can significantly impact fatigue reduction. Additionally, the exploration of medication interventions and the adoption of innovative protective clothing options present potential avenues for mitigating fatigue. The insights derived from this study offer valuable guidance to management personnel involved in organizing large-scale events, enabling them to make informed decisions and implement targeted interventions to address fatigue among medical security personnel. In our upcoming research, we will further expand the fatigue dataset while considering higher precisionprediction algorithms, such as XGBoost model, ensemble model, etc., and explore their potential contributions to our research.",
        "conclusions": "Fatigue is a prevalent and pressing issue among medical security personnel operating in closed-loop environments. In our investigation, we observed that the GBM method exhibited superior predictive performance in determining the fatigue status of medical security personnel during the closed-loop period, surpassing other machine learning techniques. The GBM model achieved impressive performance metrics, with an MRE of 0.207 and an R2 of 0.812.Notably, our analysis identified several critical factors influencing the fatigue status of medical security personnel, including the duration of wearing protective clothing, CSDS, and engagement in physical exercise. These findings shed light on the multifaceted nature of fatigue among healthcare workers and emphasize the importance of considering various contributing factors. To effectively alleviate fatigue, prudent management of working hours for security personnel, along with minimizing the duration of wearing protective clothing, proves to be promising strategies. Furthermore, promoting regular physical exercise among medical security personnel can significantly impact fatigue reduction.Additionally, the exploration of medication interventions and the adoption of innovative protective clothing options present potential avenues for mitigating fatigue. The insights derived from this study offer valuable guidance to management personnel involved in organizing large-scale events, enabling them to make informed decisions and implement targeted interventions to address fatigue among medical security personnel (Supplementary Information).In our upcoming research, we will further expand the fatigue dataset while considering higher precision prediction algorithms, such as XGBoost model, ensemble model, etc., and explore their potential contributions to our research.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A machine-learning algorithm using claims data to identify patients with homozygous familial hypercholesterolemia",
        "link": "https://www.nature.com/articles/s41598-024-58719-y",
        "publication_date": "17 Apr 2024",
        "abstract": "Homozygous familial hypercholesterolemia (HoFH) is an underdiagnosed and undertreated ultra-rare disease. We utilized claims data from the Komodo Healthcare Map database to develop a machine-learning model to identify potential HoFH patients. We tokenized patients enrolled in MyRARE (patient support program for those prescribed evinacumab-dgnb in the United States) and linked them with their Komodo claims. A true positive HoFH cohort (n = 331) was formed by including patients from MyRARE and patients with prescriptions for evinacumab-dgnb or lomitapide. The negative cohort (n = 1423) comprised patients with or at risk for cardiovascular disease. We divided the cohort into an 80% training and 20% testing set. Overall, 10,616 candidate features were investigated; 87 were selected due to clinical relevance and importance on prediction performance. Different machine-learning algorithms were explored, with fast interpretable greedy-tree sums selected as the final machine-learning tool. This selection was based on its satisfactory performance and its easily interpretable nature. The model identified four useful features and yielded precision (positive predicted value) of 0.98, recall (sensitivity) of 0.88, area under the receiver operating characteristic curve of 0.98, and accuracy of 0.97. The model performed well in identifying HoFH patients in the testing set, providing a useful tool to facilitate HoFH screening and diagnosis via healthcare claims data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "ANTsX neuroimaging-derived structural phenotypes of UK Biobank",
        "link": "https://www.nature.com/articles/s41598-024-59440-6",
        "publication_date": "17 Apr 2024",
        "abstract": "UK Biobank is a large-scale epidemiological resource for investigating prospective correlations between various lifestyle, environmental, and genetic factors with health and disease progression. In addition to individual subject information obtained through surveys and physical examinations, a comprehensive neuroimaging battery consisting of multiple modalities provides imaging-derived phenotypes (IDPs) that can serve as biomarkers in neuroscience research. In this study, we augment the existing set of UK Biobank neuroimaging structural IDPs, obtained from well-established software libraries such as FSL and FreeSurfer, with related measurements acquired through the Advanced Normalization Tools Ecosystem. This includes previously established cortical and subcortical measurements defined, in part, based on the Desikan-Killiany-Tourville atlas. Also included are morphological measurements from two recent developments: medial temporal lobe parcellation of hippocampal and extra-hippocampal regions in addition to cerebellum parcellation and thickness based on the Schmahmann anatomical labeling. Through predictive modeling, we assess the clinical utility of these IDP measurements, individually and in combination, using commonly studied phenotypic correlates including age, fluid intelligence, numeric memory, and several other sociodemographic variables. The predictive accuracy of these IDP-based models, in terms of root-mean-squared-error or area-under-the-curve for continuous and categorical variables, respectively, provides comparative insights between software libraries as well as potential clinical interpretability. Results demonstrate varied performance between package-based IDP sets and their combination, emphasizing the need for careful consideration in their selection and utilization.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Randomized feature selection based semi-supervised latent Dirichlet allocation for microbiome analysis",
        "link": "https://www.nature.com/articles/s41598-024-59682-4",
        "publication_date": "17 Apr 2024",
        "abstract": "Health and disease are fundamentally influenced by microbial communities and their genes (the microbiome). An in-depth analysis of microbiome structure that enables the classification of individuals based on their health can be crucial in enhancing diagnostics and treatment strategies to improve the overall well-being of an individual. In this paper, we present a novel semi-supervised methodology known as Randomized Feature Selection based Latent Dirichlet Allocation (RFSLDA) to study the impact of the gut microbiome on a subject’s health status. Since the data in our study consists of fuzzy health labels, which are self-reported, traditional supervised learning approaches may not be suitable. As a first step, based on the similarity between documents in text analysis and gut-microbiome data, we employ Latent Dirichlet Allocation (LDA), a topic modeling approach which uses microbiome counts as features to group subjects into relatively homogeneous clusters, without invoking any knowledge of observed health status (labels) of subjects. We then leverage information from the observed health status of subjects to associate these clusters with the most similar health status making it a semi-supervised approach. Finally, a feature selection technique is incorporated into the model to improve the overall classification performance. The proposed method provides a semi-supervised topic modelling approach that can help handle the high dimensionality of the microbiome data in association studies. Our experiments reveal that our semi-supervised classification algorithm is effective and efficient in terms of high classification accuracy compared to popular supervised learning approaches like SVM and multinomial logistic model. The RFSLDA framework is attractive because it (i) enhances clustering accuracy by identifying key bacteria types as indicators of health status, (ii) identifies key bacteria types within each group based on estimates of the proportion of bacteria types within the groups, and (iii) computes a measure of within-group similarity to identify highly similar subjects in terms of their health status.",
        "conclusions": "The current study using subject-specific data reveals that gut microbes play a fundamental role in human health. As an initial data preprocessing, we determine the top bacteria levels from the zero-inflated microbiome data based on abundance and prevalence to filter out potentially uninformative bacteria types using the tau-path method. The RFSLDA method then uses a semi-supervised LDA model to classify subjects based on the health status. Through a feature selection incorporated in our framework, we identify significant bacteria types that can accurately distinguish between different health statuses and enhance the accuracy of classification. We identify the top bacteria types in each class. Unclassified_Proteobacteria, for instance, is predominant in subjects classified as infected, but rare in subjects classified as healthy and stress. Further, using the estimated topic structure we obtain a within group similarity of subjects by the health status levels. In addition, since the observed data is imbalanced in the levels of the response variable health status, we perform data balancing using SCUT hybrid sampling technique and perform RFSLDA on the balanced data to identify the top bacteria types across each level of the health status.The results of a comparative study demonstrate that our RFSLDA method, despite being a semi-supervised approach, outperforms traditional supervised methods, such as SVM and Multinomial logit in identifying rare yet crucial health levels (infected, stress) in the test data. This is an important finding. In comparison to extensions of LDA in microbiome studies discussed in11,12 that identifies important microbial sub-communities, our method associates the latent microbial sub-communities obtained from LDA with the subject’s health status. Our results enable practitioners to identify the specific types of bacteria associated with each health status, providing valuable insight into the intricate connections between gut microbiome and human health. Under the balanced data, while the multinomial logit outperforms the RFSLDA in the test data, the RFSLDA performs reasonably well on the test data in comparison to neural network, XGBoost and SVM models.The present study has some limitations. First, despite showing a significant relationship between gut microbiome profiles and health status, our model misclassifies \\(25\\%\\) of healthy people as infected or stressed. Although we acknowledge this shortcoming, since the model is able to detect 4 out of 6 infected subjects correctly, we are willing to accommodate these false negatives. Moreover, since fuzzy labels are considered to represent the true observed health status of subjects, it could be possible for them to self-report themselves as healthy when they are not. Thus, it is imperative to investigate these misclassifications more closely in order to gain a deeper understanding of their health condition. Future research can also further investigate the causal relationship between the gut microbiome and human health using a supervised topic modeling approach. Our RFSLDA approach can also be extended to a longitudinal data setup, where subjects visit the facility at different times.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Refining the impact of genetic evidence on clinical success",
        "link": "https://www.nature.com/articles/s41586-024-07316-0",
        "publication_date": "17 Apr 2024",
        "abstract": "The cost of drug discovery and development is driven primarily by failure1, with only about 10% of clinical programmes eventually receiving approval2,3,4. We previously estimated that human genetic evidence doubles the success rate from clinical development to approval5. In this study we leverage the growth in genetic evidence over the past decade to better understand the characteristics that distinguish clinical success and failure. We estimate the probability of success for drug mechanisms with genetic support is 2.6 times greater than those without. This relative success varies among therapy areas and development phases, and improves with increasing confidence in the causal gene, but is largely unaffected by genetic effect size, minor allele frequency or year of discovery. These results indicate we are far from reaching peak genetic insights to aid the discovery of targets for more effective drugs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Genetic evidence for involvement of β2-adrenergic receptor in brown adipose tissue thermogenesis in humans",
        "link": "https://www.nature.com/articles/s41366-024-01522-6",
        "publication_date": "17 Apr 2024",
        "abstract": "Sympathetic activation of brown adipose tissue (BAT) thermogenesis can ameliorate obesity and related metabolic abnormalities. However, crucial subtypes of the β-adrenergic receptor (AR), as well as effects of its genetic variants on functions of BAT, remains unclear in humans. We conducted association analyses of genes encoding β-ARs and BAT activity in human adults.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring fetal brain tumor glioblastoma symptom verification with self organizing maps and vulnerability data analysis",
        "link": "https://www.nature.com/articles/s41598-024-59111-6",
        "publication_date": "16 Apr 2024",
        "abstract": "Brain tumor glioblastoma is a disease that is caused for a child who has abnormal cells in the brain, which is found using MRI “Magnetic Resonance Imaging” brain image using a powerful magnetic field, radio waves, and a computer to produce detailed images of the body's internal structures it is a standard diagnostic tool for a wide range of medical conditions, from detecting brain and spinal cord injuries to identifying tumors and also in evaluating joint problems. This is treatable, and by enabling the factor for happening, the factor for dissolving the dead tissues. If the brain tumor glioblastoma is untreated, the child will go to death; to avoid this, the child has to treat the brain problem using the scan of MRI images. Using the neural network, brain-related difficulties have to be resolved. It is identified to make the diagnosis of glioblastoma. This research deals with the techniques of max rationalizing and min rationalizing images, and the method of boosted division time attribute extraction has been involved in diagnosing glioblastoma. The process of maximum and min rationalization is used to recognize the Brain tumor glioblastoma in the brain images for treatment efficiency. The image segment is created for image recognition. The method of boosted division time attribute extraction is used in image recognition with the help of MRI for image extraction. The proposed boosted division time attribute extraction method helps to recognize the fetal images and find Brain tumor glioblastoma with feasible accuracy using image rationalization against the brain tumor glioblastoma diagnosis. In addition, 45% of adults are affected by the tumor, 40% of children and 5% are in death situations. To reduce this ratio, in this study, the Brain tumor glioblastoma is identified and segmented to recognize the fetal images and find the Brain tumor glioblastoma diagnosis. Then the tumor grades were analyzed using the efficient method for the imaging MRI with the diagnosis result of partially high. The accuracy of the proposed TAE-PIS system is 98.12% which is higher when compared to other methods like Genetic algorithm, Convolution neural network, fuzzy-based minimum and maximum neural network and kernel-based support vector machine respectively. Experimental results show that the proposed method archives rate of 98.12% accuracy with low response time and compared with the Genetic algorithm (GA), Convolutional Neural Network (CNN), fuzzy-based minimum and maximum neural network (Fuzzy min–max NN), and kernel-based support vector machine. Specifically, the proposed method achieves a substantial improvement of 80.82%, 82.13%, 85.61%, and 87.03% compared to GA, CNN, Fuzzy min–max NN, and kernel-based support vector machine, respectively.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Visual interpretable MRI fine grading of meniscus injury for intelligent assisted diagnosis and treatment",
        "link": "https://www.nature.com/articles/s41746-024-01082-z",
        "publication_date": "15 Apr 2024",
        "abstract": "Meniscal injury represents a common type of knee injury, accounting for over 50% of all knee injuries. The clinical diagnosis and treatment of meniscal injury heavily rely on magnetic resonance imaging (MRI). However, accurately diagnosing the meniscus from a comprehensive knee MRI is challenging due to its limited and weak signal, significantly impeding the precise grading of meniscal injuries. In this study, a visual interpretable fine grading (VIFG) diagnosis model has been developed to facilitate intelligent and quantified grading of meniscal injuries. Leveraging a multilevel transfer learning framework, it extracts comprehensive features and incorporates an attributional attention module to precisely locate the injured positions. Moreover, the attention-enhancing feedback module effectively concentrates on and distinguishes regions with similar grades of injury. The proposed method underwent validation on FastMRI_Knee and Xijing_Knee dataset, achieving mean grading accuracies of 0.8631 and 0.8502, surpassing the state-of-the-art grading methods notably in error-prone Grade 1 and Grade 2 cases. Additionally, the visually interpretable heatmaps generated by VIFG provide accurate depictions of actual or potential meniscus injury areas beyond human visual capability. Building upon this, a novel fine grading criterion was introduced for subtypes of meniscal injury, further classifying Grade 2 into 2a, 2b, and 2c, aligning with the anatomical knowledge of meniscal blood supply. It can provide enhanced injury-specific details, facilitating the development of more precise surgical strategies. The efficacy of this subtype classification was evidenced in 20 arthroscopic cases, underscoring the potential enhancement brought by intelligent-assisted diagnosis and treatment for meniscal injuries.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Non-invasive biomarkers for detecting progression toward hypovolemic cardiovascular instability in a lower body negative pressure model",
        "link": "https://www.nature.com/articles/s41598-024-59139-8",
        "publication_date": "15 Apr 2024",
        "abstract": "Occult hemorrhages after trauma can be present insidiously, and if not detected early enough can result in patient death. This study evaluated a hemorrhage model on 18 human subjects, comparing the performance of traditional vital signs to multiple off-the-shelf non-invasive biomarkers. A validated lower body negative pressure (LBNP) model was used to induce progression towards hypovolemic cardiovascular instability. Traditional vital signs included mean arterial pressure (MAP), electrocardiography (ECG), plethysmography (Pleth), and the test systems utilized electrical impedance via commercial electrical impedance tomography (EIT) and multifrequency electrical impedance spectroscopy (EIS) devices. Absolute and relative metrics were used to evaluate the performance in addition to machine learning-based modeling. Relative EIT-based metrics measured on the thorax outperformed vital sign metrics (MAP, ECG, and Pleth) achieving an area-under-the-curve (AUC) of 0.99 (CI 0.95–1.00, 100% sensitivity, 87.5% specificity) at the smallest LBNP change (0–15 mmHg). The best vital sign metric (MAP) at this LBNP change yielded an AUC of 0.6 (CI 0.38–0.79, 100% sensitivity, 25% specificity). Out-of-sample predictive performance from machine learning models were strong, especially when combining signals from multiple technologies simultaneously. EIT, alone or in machine learning-based combination, appears promising as a technology for early detection of progression toward hemodynamic instability.",
        "conclusions": "Impedance-based noninvasive technologies appear to have promising diagnostic performance in the early detection of hypovolemia in a LBNP model. This is especially true when evaluated as a change with respect to baseline, and when incorporated in a multivariate machine learning algorithm.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Estimation of haemoglobin using non-invasive portable device with spectroscopic signal application",
        "link": "https://www.nature.com/articles/s41598-024-58990-z",
        "publication_date": "15 Apr 2024",
        "abstract": "An estimated 52% of non-pregnant women of reproductive age in India are estimated to be affected by anaemia, which is categorised as a chronic condition. In 2019–2021, the National Family Health Survey–5 (NFHS–5) which was undertaken revealed the following statistics about the prevalence of anaemia in the state of Karnataka. To estimate haemoglobin levels using non-invasive portable device among nursing students. A cross sectional study was done among students of Nursing college in central Karnataka for a period of 3 months. Total of 140 students were included in the study. EzeCheck haemoglobin estimation was done twice and was recorded in the same Google form. The frequency and percentage of variation of results between Haematology Analyzer and EzeCheck devices was presented with a range of difference such as 0, less than 1, 1.0 to 1.9, 2.0 to 2.9, 3.0 to 3.9, and 4.0 and above. The total prevalence of anaemia among nursing students was 57.8% and most of the students had moderate degree of anaemia (28.6%). Two readings of haemoglobin were taken and difference of readings were calculated and majority of the students had difference of < 0.5 gm/dl (61.4%) and only 1.4% of the students had difference of > 2 gm/dl. The mean difference of haemoglobin of two readings was 0.5 ± 0.5 gm/dl. The technology employed in this study bridges the gap between patients and anaemia diagnosis by providing screening services. The device provides the diagnosis via a non-invasive, IoT-enabled service at a low cost.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Influenza antibody breadth and effector functions are immune correlates from acquisition of pandemic infection of children",
        "link": "https://www.nature.com/articles/s41467-024-47590-0",
        "publication_date": "13 Apr 2024",
        "abstract": "Cross-reactive antibodies with Fc receptor (FcR) effector functions may mitigate pandemic virus impact in the absence of neutralizing antibodies. In this exploratory study, we use serum from a randomized placebo-controlled trial of seasonal trivalent influenza vaccination in children (NCT00792051) conducted at the onset of the 2009 H1N1 pandemic (pH1N1) and monitored for infection. We found that seasonal vaccination increases pH1N1 specific antibodies and FcR effector functions. Furthermore, prospective baseline antibody profiles after seasonal vaccination, prior to pH1N1 infection, show that unvaccinated uninfected children have elevated ADCC effector function, FcγR3a and FcγR2a binding antibodies to multiple pH1N1 proteins, past seasonal and avian (H5, H7 and H9) strains. Whereas, children that became pH1N1 infected after seasonal vaccination have antibodies focussed to seasonal strains without FcR functions, and greater aggregated HA-specific profiles for IgM and IgG3. Modeling to predict infection susceptibility, ranked baseline hemagglutination antibody inhibition as the highest contributor to lack of pH1N1 infection, in combination with features that include pH1-IgG1, H1-stem responses and FcR binding to seasonal vaccine and pH1 proteins. Thus, seasonal vaccination can have benefits against pandemic influenza viruses, and some children already have broadly reactive antibodies with Fc potential without vaccination and may be considered ‘elite influenza controllers’.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Epidemiological, clinical, and genomic landscape of coccidioidomycosis in northeastern Brazil",
        "link": "https://www.nature.com/articles/s41467-024-47388-0",
        "publication_date": "12 Apr 2024",
        "abstract": "Coccidioidomycosis, listed as a priority mycosis by the WHO, is endemic in the United States but often overlooked in Central and South America. Employing a multi-institutional approach, we investigate how disease characteristics, pathogen genetic variation, and environmental factors impact coccidioidomycosis epidemiology and outcomes in South America. We identified 292 cases (1978–2021) and 42 outbreaks in Piauí and Maranhão states, Brazil, the largest series outside the US/Mexico epidemic zone. The male-to-female ratio was 57.4:1 and the most common activity was armadillo hunting (91.1%) 4 to 30 days before symptom onset. Most patients (92.8%) exhibited typical acute pulmonary disease, with cough (93%), fever (90%), and chest pain (77%) as predominant symptoms. The case fatality rate was 8%. Our negative binomial regression model indicates that reduced precipitation levels in the current (p = 0.015) and preceding year (p = 0.001) predict heightened incidence. Unlike other hotspots, acidic soil characterizes this region. Brazilian strains differ genomically from other C. posadasii lineages. Northeastern Brazil presents a distinctive coccidioidomycosis profile, with armadillo hunters facing elevated risks. Low annual rainfall emerges as a key factor in increasing cases. A unique C. posadasii lineage in Brazil suggests potential differences in environmental, virulence, and/or pathogenesis traits compared to other Coccidioides genotypes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive modeling for breast cancer classification in the context of Bangladeshi patients by use of machine learning approach with explainable AI",
        "link": "https://www.nature.com/articles/s41598-024-57740-5",
        "publication_date": "11 Apr 2024",
        "abstract": "Breast cancer has rapidly increased in prevalence in recent years, making it one of the leading causes of mortality worldwide. Among all cancers, it is by far the most common. Diagnosing this illness manually requires significant time and expertise. Since detecting breast cancer is a time-consuming process, preventing its further spread can be aided by creating machine-based forecasts. Machine learning and Explainable AI are crucial in classification as they not only provide accurate predictions but also offer insights into how the model arrives at its decisions, aiding in the understanding and trustworthiness of the classification results. In this study, we evaluate and compare the classification accuracy, precision, recall, and F1 scores of five different machine learning methods using a primary dataset (500 patients from Dhaka Medical College Hospital). Five different supervised machine learning techniques, including decision tree, random forest, logistic regression, naive bayes, and XGBoost, have been used to achieve optimal results on our dataset. Additionally, this study applied SHAP analysis to the XGBoost model to interpret the model’s predictions and understand the impact of each feature on the model’s output. We compared the accuracy with which several algorithms classified the data, as well as contrasted with other literature in this field. After final evaluation, this study found that XGBoost achieved the best model accuracy, which is 97%.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "AI and narrative embeddings detect PTSD following childbirth via birth stories",
        "link": "https://www.nature.com/articles/s41598-024-54242-2",
        "publication_date": "11 Apr 2024",
        "abstract": "Free-text analysis using machine learning (ML)-based natural language processing (NLP) shows promise for diagnosing psychiatric conditions. Chat Generative Pre-trained Transformer (ChatGPT) has demonstrated preliminary initial feasibility for this purpose; however, whether it can accurately assess mental illness remains to be determined. This study evaluates the effectiveness of ChatGPT and the text-embedding-ada-002 (ADA) model in detecting post-traumatic stress disorder following childbirth (CB-PTSD), a maternal postpartum mental illness affecting millions of women annually, with no standard screening protocol. Using a sample of 1295 women who gave birth in the last six months and were 18+ years old, recruited through hospital announcements, social media, and professional organizations, we explore ChatGPT’s and ADA’s potential to screen for CB-PTSD by analyzing maternal childbirth narratives. The PTSD Checklist for DSM-5 (PCL-5; cutoff 31) was used to assess CB-PTSD. By developing an ML model that utilizes numerical vector representation of the ADA model, we identify CB-PTSD via narrative classification. Our model outperformed (F1 score: 0.81) ChatGPT and six previously published large text-embedding models trained on mental health or clinical domains data, suggesting that the ADA model can be harnessed to identify CB-PTSD. Our modeling approach could be generalized to assess other mental health disorders.",
        "conclusions": "In this investigation, we examine the utility of variations of the ChatGPT pre-trained large language model (PLM), and text embeddings of different language models to assess mental health using text-based personal narratives as the exclusive data source. Harnessing advanced natural language processing (NLP) and machine learning (ML) analysis strategies, we present the potential of these methods for analyzing narratives to advance maternal mental health assessment. We find that a ChatGPT model untrained on a specific clinical task shows inadequate performance in the task of identifying childbirth-related post-traumatic stress disorder (CB-PTSD), while our model trained on the embeddings of OpenAI’s text-embeddings-ada-002 model yields the best performance to date for this task, representing good performance. With refinements and enhancements pending in future work, this textual personal narrative-based assessment strategy employing NLP analysis has the potential to become an accurate, efficient, low-cost, and patient-friendly strategy for identifying CB-PTSD in the clinic, and facilitating timely interventions to mitigate this maternal mental health disorder. The PLM analysis strategies presented here hold promise for potential use in assessing diverse additional mental health disorders, and consequently improving outcomes.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Convolutional neural network algorithm trained on lumbar spine radiographs to predict outcomes of transforaminal epidural steroid injection for lumbosacral radicular pain from spinal stenosis",
        "link": "https://www.nature.com/articles/s41598-024-59288-w",
        "publication_date": "11 Apr 2024",
        "abstract": "Little is known about the therapeutic outcomes of transforaminal epidural steroid injection (TFESI) in patients with lumbosacral radicular pain due to lumbar spinal stenosis (LSS). Using lumbar spine radiographs as input data, we trained a convolutional neural network (CNN) to predict therapeutic outcomes after lumbar TFESI in patients with lumbosacral radicular pain caused by LSS. We retrospectively recruited 193 patients for this study. The lumbar spine radiographs included anteroposterior, lateral, and bilateral (left and right) oblique views. We cut each lumbar spine radiograph image into a square shape that included the vertebra corresponding to the level at which the TFESI was performed and the vertebrae juxta below and above that level. Output data were divided into “favorable outcome” (≥ 50% reduction in the numeric rating scale [NRS] score at 2 months post-TFESI) and “poor outcome” (< 50% reduction in the NRS score at 2 months post-TFESI). Using these input and output data, we developed a CNN model for predicting TFESI outcomes. The area under the curve of our model was 0.920. Its accuracy was 87.2%. Our CNN model has an excellent capacity for predicting therapeutic outcomes after lumbar TFESI in patients with lumbosacral radicular pain induced by LSS.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Reporting guidelines in medical artificial intelligence: a systematic review and meta-analysis",
        "link": "https://www.nature.com/articles/s43856-024-00492-0",
        "publication_date": "11 Apr 2024",
        "abstract": "The field of Artificial Intelligence (AI) holds transformative potential in medicine. However, the lack of universal reporting guidelines poses challenges in ensuring the validity and reproducibility of published research studies in this field.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Interpretable detection of epiretinal membrane from optical coherence tomography with deep neural networks",
        "link": "https://www.nature.com/articles/s41598-024-57798-1",
        "publication_date": "11 Apr 2024",
        "abstract": "This study aimed to automatically detect epiretinal membranes (ERM) in various OCT-scans of the central and paracentral macula region and classify them by size using deep-neural-networks (DNNs). To this end, 11,061 OCT-images were included and graded according to the presence of an ERM and its size (small 100–1000 µm, large > 1000 µm). The data set was divided into training, validation and test sets (75%, 10%, 15% of the data, respectively). An ensemble of DNNs was trained and saliency maps were generated using Guided-Backprob. OCT-scans were also transformed into a one-dimensional-value using t-SNE analysis. The DNNs’ receiver-operating-characteristics on the test set showed a high performance for no-ERM, small-ERM and large-ERM cases (AUC: 0.99, 0.92, 0.99, respectively; 3-way accuracy: 89%), with small-ERMs being the most difficult ones to detect. t-SNE analysis sorted cases by size and, in particular, revealed increased classification uncertainty at the transitions between groups. Saliency maps reliably highlighted ERM, regardless of the presence of other OCT features (i.e. retinal-thickening, intraretinal pseudo-cysts, epiretinal-proliferation) and entities such as ERM-retinoschisis, macular-pseudohole and lamellar-macular-hole. This study showed therefore that DNNs can reliably detect and grade ERMs according to their size not only in the fovea but also in the paracentral region. This is also achieved in cases of hard-to-detect, small-ERMs. In addition, the generated saliency maps can be used to highlight small-ERMs that might otherwise be missed. The proposed model could be used for screening-programs or decision-support-systems in the future.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Next-generation sequencing of host genetics risk factors associated with COVID-19 severity and long-COVID in Colombian population",
        "link": "https://www.nature.com/articles/s41598-024-57982-3",
        "publication_date": "11 Apr 2024",
        "abstract": "Coronavirus disease 2019 (COVID-19) was considered a major public health burden worldwide. Multiple studies have shown that susceptibility to severe infections and the development of long-term symptoms is significantly influenced by viral and host factors. These findings have highlighted the potential of host genetic markers to identify high-risk individuals and develop target interventions to reduce morbimortality. Despite its importance, genetic host factors remain largely understudied in Latin-American populations. Using a case–control design and a custom next-generation sequencing (NGS) panel encompassing 81 genetic variants and 74 genes previously associated with COVID-19 severity and long-COVID, we analyzed 56 individuals with asymptomatic or mild COVID-19 and 56 severe and critical cases. In agreement with previous studies, our results support the association between several clinical variables, including male sex, obesity and common symptoms like cough and dyspnea, and severe COVID-19. Remarkably, thirteen genetic variants showed an association with COVID-19 severity. Among these variants, rs11385942 (p < 0.01; OR = 10.88; 95% CI = 1.36–86.51) located in the LZTFL1 gene, and rs35775079 (p = 0.02; OR = 8.53; 95% CI = 1.05–69.45) located in CCR3 showed the strongest associations. Various respiratory and systemic symptoms, along with the rs8178521 variant (p < 0.01; OR = 2.51; 95% CI = 1.27–4.94) in the IL10RB gene, were significantly associated with the presence of long-COVID. The results of the predictive model comparison showed that the mixed model, which incorporates genetic and non-genetic variables, outperforms clinical and genetic models. To our knowledge, this is the first study in Colombia and Latin-America proposing a predictive model for COVID-19 severity and long-COVID based on genomic analysis. Our study highlights the usefulness of genomic approaches to studying host genetic risk factors in specific populations. The methodology used allowed us to validate several genetic variants previously associated with COVID-19 severity and long-COVID. Finally, the integrated model illustrates the importance of considering genetic factors in precision medicine of infectious diseases.",
        "conclusions": "This study analyzed the association between genetic and non-genetic factors with COVID-19 severity and the presence of long-COVID in a sample of the Colombian population. We found an association between these two outcomes and several genetic and non-genetic factors. The risk genetic variants are located in genes whose products participate in immunological signaling and humoral response against microorganisms. We highlight the usefulness of combining clinical and genomics data to develop models to predict COVID-19 response. Applying these predictive models in the clinical setting can help to identify high-risk individuals and focus resources and actions to reduce morbidity and mortality.LimitationsAmong the limitations of this study, we should mention that although the sample size might be sufficient to identify genetic variants with a medium or large effect, it may have been underpowered to detect the association of low-effect variants. The sample size, also, was calculated based on the available information on allele frequency. Third, we noticed that after the custom panel was designed and the probes were synthesized, novel candidate variants and genes were described in the literature. These were not included in this study and this fact highlights the importance of periodically updating NGS custom panel with clinical applications. On the other hand, although we took several measures to reduce potential bias, this may have been introduced during the interviews or clinical data collection. Finally, we should underline that the proposed models were not validated in a larger cohort, thus, more studies will be necessary to evaluate their accuracy and precision.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Reduction in limb-movement complexity at term-equivalent age is associated with motor developmental delay in very-preterm or very-low-birth-weight infants",
        "link": "https://www.nature.com/articles/s41598-024-59125-0",
        "publication_date": "10 Apr 2024",
        "abstract": "Reduced complexity during the writhing period can be crucial in the spontaneous movements of high-risk infants for neurologic impairment. This study aimed to verify the association between quantified complexity of upper and lower-limb movements at term-equivalent age and motor development in very-preterm or very-low-birth-weight infants. Video images of spontaneous movements at term-equivalent age were collected from very-preterm or very-low-birth-weight infants. A pretrained pose-estimation model and sample entropy (SE) quantified the complexity of the upper- and lower-limb movements. Motor development was evaluated at 9 months of corrected age using Bayley Scales of Infant and Toddler Development, Third Edition. The SE measures were compared between infants with and without motor developmental delay (MDD). Among 90 infants, 11 exhibited MDD. SE measures at most of the upper and lower limbs were significantly reduced in infants with MDD compared to those without MDD (p < 0.05). Composite scores in the motor domain showed significant positive correlations with SE measures at most upper and lower limbs (p < 0.05). The results show that limb-movement complexity at term-equivalent age is reduced in infants with MDD at 9 months of corrected age. SE of limb movements can be a potentially useful kinematic parameter to detect high-risk infants for MDD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Combination p53 activation and BCL-xL/BCL-2 inhibition as a therapeutic strategy in high-risk and relapsed acute lymphoblastic leukemia",
        "link": "https://www.nature.com/articles/s41375-024-02241-7",
        "publication_date": "10 Apr 2024",
        "abstract": "Due to the rarity of TP53 mutations in acute lymphoblastic leukemia (ALL), p53 re-activation by antagonism of the p53-MDM2 interaction represents a potential therapeutic strategy for the majority of ALL. Here, we demonstrate the potent antileukemic activity of the MDM2 antagonist idasanutlin in high-risk and relapsed ex vivo coculture models of TP53 wildtype ALL (n = 40). Insufficient clinical responses to monotherapy MDM2 inhibitors in other cancers prompted us to explore optimal drugs for combination therapy. Utilizing high-throughput combination screening of 1971 FDA-approved and clinically advanced compounds, we identified BCL-xL/BCL-2 inhibitor navitoclax as the most promising idasanutlin combination partner. The idasanutlin-navitoclax combination was synergistically lethal to prognostically-poor, primary-derived and primary patient blasts in ex vivo coculture, and reduced leukemia burden in two very high-risk ALL xenograft models at drug concentrations safely attained in patients; in fact, the navitoclax plasma concentrations were equivalent to those attained in contemporary “low-dose” navitoclax clinical trials. We demonstrate a preferential engagement of cell death over G1 cell cycle arrest, mechanistically implicating MCL-1-binding pro-apoptotic sensitizer NOXA. The proposed combination of two clinical-stage compounds independently under clinical evaluation for ALL is of high clinical relevance and warrants consideration for the treatment of patients with high-risk and relapsed ALL.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting the complexity and mortality of polytrauma patients with machine learning models",
        "link": "https://www.nature.com/articles/s41598-024-58830-0",
        "publication_date": "09 Apr 2024",
        "abstract": "We aim to develop machine learning (ML) models for predicting the complexity and mortality of polytrauma patients using clinical features, including physician diagnoses and physiological data. We conducted a retrospective analysis of a cohort comprising 756 polytrauma patients admitted to the intensive care unit (ICU) at Pizhou People’s Hospital Trauma Center, Jiangsu, China between 2020 and 2022. Clinical parameters encompassed demographics, vital signs, laboratory values, clinical scores and physician diagnoses. The two primary outcomes considered were mortality and complexity. We developed ML models to predict polytrauma mortality or complexity using four ML algorithms, including Support Vector Machine (SVM), Random Forest (RF), Artificial Neural Network (ANN) and eXtreme Gradient Boosting (XGBoost). We assessed the models’ performance and compared the optimal ML model against three existing trauma evaluation scores, including Injury Severity Score (ISS), Trauma Index (TI) and Glasgow Coma Scale (GCS). In addition, we identified several important clinical predictors that made contributions to the prognostic models. The XGBoost-based polytrauma mortality prediction model demonstrated a predictive ability with an accuracy of 90% and an F-score of 88%, outperforming SVM, RF and ANN models. In comparison to conventional scoring systems, the XGBoost model had substantial improvements in predicting the mortality of polytrauma patients. External validation yielded strong stability and generalization with an accuracy of up to 91% and an AUC of 82%. To predict polytrauma complexity, the XGBoost model maintained its performance over other models and scoring systems with good calibration and discrimination abilities. Feature importance analysis highlighted several clinical predictors of polytrauma complexity and mortality, such as Intracranial hematoma (ICH). Leveraging ML algorithms in polytrauma care can enhance the prognostic estimation of polytrauma patients. This approach may have potential value in the management of polytrauma patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The algorithm journey map: a tangible approach to implementing AI solutions in healthcare",
        "link": "https://www.nature.com/articles/s41746-024-01061-4",
        "publication_date": "09 Apr 2024",
        "abstract": "When integrating AI tools in healthcare settings, complex interactions between technologies and primary users are not always fully understood or visible. This deficient and ambiguous understanding hampers attempts by healthcare organizations to adopt AI/ML, and it also creates new challenges for researchers to identify opportunities for simplifying adoption and developing best practices for the use of AI-based solutions. Our study fills this gap by documenting the process of designing, building, and maintaining an AI solution called SepsisWatch at Duke University Health System. We conducted 20 interviews with the team of engineers and scientists that led the multi-year effort to build the tool, integrate it into practice, and maintain the solution. This “Algorithm Journey Map” enumerates all social and technical activities throughout the AI solution’s procurement, development, integration, and full lifecycle management. In addition to mapping the “who?” and “what?” of the adoption of the AI tool, we also show several ‘lessons learned’ throughout the algorithm journey maps including modeling assumptions, stakeholder inclusion, and organizational structure. In doing so, we identify generalizable insights about how to recognize and navigate barriers to AI/ML adoption in healthcare settings. We expect that this effort will further the development of best practices for operationalizing and sustaining ethical principles—in algorithmic systems.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Image-based consensus molecular subtyping in rectal cancer biopsies and response to neoadjuvant chemoradiotherapy",
        "link": "https://www.nature.com/articles/s41698-024-00580-3",
        "publication_date": "09 Apr 2024",
        "abstract": "The development of deep learning (DL) models to predict the consensus molecular subtypes (CMS) from histopathology images (imCMS) is a promising and cost-effective strategy to support patient stratification. Here, we investigate whether imCMS calls generated from whole slide histopathology images (WSIs) of rectal cancer (RC) pre-treatment biopsies are associated with pathological complete response (pCR) to neoadjuvant long course chemoradiotherapy (LCRT) with single agent fluoropyrimidine. DL models were trained to classify WSIs of colorectal cancers stained with hematoxylin and eosin into one of the four CMS classes using a multi-centric dataset of resection and biopsy specimens (n = 1057 WSIs) with paired transcriptional data. Classifiers were tested on a held out RC biopsy cohort (ARISTOTLE) and correlated with pCR to LCRT in an independent dataset merging two RC cohorts (ARISTOTLE, n = 114 and SALZBURG, n = 55 patients). DL models predicted CMS with high classification performance in multiple comparative analyses. In the independent cohorts (ARISTOTLE, SALZBURG), cases with WSIs classified as imCMS1 had a significantly higher likelihood of achieving pCR (OR = 2.69, 95% CI 1.01–7.17, p = 0.048). Conversely, imCMS4 was associated with lack of pCR (OR = 0.25, 95% CI 0.07–0.88, p = 0.031). Classification maps demonstrated pathologist-interpretable associations with high stromal content in imCMS4 cases, associated with poor outcome. No significant association was found in imCMS2 or imCMS3. imCMS classification of pre-treatment biopsies is a fast and inexpensive solution to identify patient groups that could benefit from neoadjuvant LCRT. The significant associations between imCMS1/imCMS4 with pCR suggest the existence of predictive morphological features that could enhance standard pathological assessment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Concept-drifts adaptation for machine learning EEG epilepsy seizure prediction",
        "link": "https://www.nature.com/articles/s41598-024-57744-1",
        "publication_date": "08 Apr 2024",
        "abstract": "Seizure prediction remains a challenge, with approximately 30% of patients unresponsive to conventional treatments. Addressing this issue is crucial for improving patients’ quality of life, as timely intervention can mitigate the impact of seizures. In this research field, it is critical to identify the preictal interval, the transition from regular brain activity to a seizure. While previous studies have explored various Electroencephalogram (EEG) based methodologies for prediction, few have been clinically applicable. Recent studies have underlined the dynamic nature of EEG data, characterised by data changes with time, known as concept drifts, highlighting the need for automated methods to detect and adapt to these changes. In this study, we investigate the effectiveness of automatic concept drift adaptation methods in seizure prediction. Three patient-specific seizure prediction approaches with a 10-minute prediction horizon are compared: a seizure prediction algorithm incorporating a window adjustment method by optimising performance with Support Vector Machines (Backwards-Landmark Window), a seizure prediction algorithm incorporating a data-batch (seizures) selection method using a logistic regression (Seizure-batch Regression), and a seizure prediction algorithm with a dynamic integration of classifiers (Dynamic Weighted Ensemble). These methods incorporate a retraining process after each seizure and use a combination of univariate linear features and SVM classifiers. The Firing Power was used as a post-processing technique to generate alarms before seizures. These methodologies were compared with a control approach based on the typical machine learning pipeline, considering a group of 37 patients with Temporal Lobe Epilepsy from the EPILEPSIAE database. The best-performing approach (Backwards-Landmark Window) achieved results of 0.75 ± 0.33 for sensitivity and 1.03 ± 1.00 for false positive rate per hour. This new strategy performed above chance for 89% of patients with the surrogate predictor, whereas the control approach only validated 46%.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting which patients with cancer will see a psychiatrist or counsellor from their initial oncology consultation document using natural language processing",
        "link": "https://www.nature.com/articles/s43856-024-00495-x",
        "publication_date": "08 Apr 2024",
        "abstract": "Patients with cancer often have unmet psychosocial needs. Early detection of who requires referral to a counsellor or psychiatrist may improve their care. This work used natural language processing to predict which patients will see a counsellor or psychiatrist from a patient’s initial oncology consultation document. We believe this is the first use of artificial intelligence to predict psychiatric outcomes from non-psychiatric medical documents.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Refining outcome prediction after traumatic brain injury with machine learning algorithms",
        "link": "https://www.nature.com/articles/s41598-024-58527-4",
        "publication_date": "05 Apr 2024",
        "abstract": "Outcome after traumatic brain injury (TBI) is typically assessed using the Glasgow outcome scale extended (GOSE) with levels from 1 (death) to 8 (upper good recovery). Outcome prediction has classically been dichotomized into either dead/alive or favorable/unfavorable outcome. Binary outcome prediction models limit the possibility of detecting subtle yet significant improvements. We set out to explore different machine learning methods with the purpose of mapping their predictions to the full 8 grade scale GOSE following TBI. The models were set up using the variables: age, GCS-motor score, pupillary reaction, and Marshall CT score. For model setup and internal validation, a total of 866 patients could be included. For external validation, a cohort of 369 patients were included from Leuven, Belgium, and a cohort of 573 patients from the US multi-center ProTECT III study. Our findings indicate that proportional odds logistic regression (POLR), random forest regression, and a neural network model achieved accuracy values of 0.3–0.35 when applied to internal data, compared to the random baseline which is 0.125 for eight categories. The models demonstrated satisfactory performance during external validation in the data from Leuven, however, their performance were not satisfactory when applied to the ProTECT III dataset.",
        "conclusions": "This is the first study predicting full scale GOSE outcome after TBI that includes external validation of the models in international cohorts. Furthermore, the POLR model have been made easily available as an online application. Our findings demonstrate the feasibility of developing and evaluating multicategory prediction models. However, achieving high accuracy in predicting all eight categories of the Glasgow Outcome Scale-Extended (GOSE) solely based on admission variables may not be possible. We also found that employing a confusion matrix is highly beneficial for presenting a concise visual representation of the overall performance of a multicategory prediction model. Additionally, considering accuracy within 1 and 2 categories as complementary measures can provide easily interpretable values that encompass predictions close to the observed outcome. For future studies on traumatic brain injury (TBI) outcome prediction and evaluating specific TBI interventions, neural networks, random forests, and ordinal regression models hold promise as potential approaches to explore. These models can help enhance the accuracy and effectiveness of TBI outcome prediction. It should be noted that great care should be taken when applying prognostic models that were developed from large patient cohorts into the clinical settings and when making decisions in the care of individual patients. Nevertheless, the fact is that clinicians make prognostic predictions using their clinical experience in everyday care. Tools that standardize these predictions would therefore be desirable, even though much work remains to realize this aspiration.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Use of artificial intelligence to develop predictive algorithms of cough and PCR-confirmed COVID-19 infections based on inputs from clinical-grade wearable sensors",
        "link": "https://www.nature.com/articles/s41598-024-57830-4",
        "publication_date": "05 Apr 2024",
        "abstract": "There have been over 769 million cases of COVID-19, and up to 50% of infected individuals are asymptomatic. The purpose of this study aimed to assess the use of a clinical-grade physiological wearable monitoring system, ANNE One, to develop an artificial intelligence algorithm for (1) cough detection and (2) early detection of COVID-19, through the retrospective analysis of prospectively collected physiological data from longitudinal wear of ANNE sensors in a multicenter single arm study of subjects at high risk for COVID-19 due to occupational or home exposures. The study employed a two-fold approach: cough detection algorithm development and COVID-19 detection algorithm development. For cough detection, healthy individuals wore an ANNE One chest sensor during scripted activity. The final performance of the algorithm achieved an F-1 score of 83.3% in twenty-seven healthy subjects during biomarker validation. In the COVID-19 detection algorithm, individuals at high-risk for developing COVID-19 because of recent exposures received ANNE One sensors and completed daily symptom surveys. An algorithm analyzing vital parameters (heart rate, respiratory rate, cough count, etc.) for early COVID-19 detection was developed. The COVID-19 detection algorithm exhibited a sensitivity of 0.47 and specificity of 0.72 for detecting COVID-19 in 325 individuals with recent exposures. Participants demonstrated high adherence (≥ 4 days of wear per week). ANNE One shows promise for detection of COVID-19. Inclusion of respiratory biomarkers (e.g., cough count) enhanced the algorithm's predictive ability. These findings highlight the potential value of wearable devices in early disease detection and monitoring.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "VISTA checkpoint inhibition by pH-selective antibody SNS-101 with optimized safety and pharmacokinetic profiles enhances PD-1 response",
        "link": "https://www.nature.com/articles/s41467-024-47256-x",
        "publication_date": "04 Apr 2024",
        "abstract": "VISTA, an inhibitory myeloid-T-cell checkpoint, holds promise as a target for cancer immunotherapy. However, its effective targeting has been impeded by issues such as rapid clearance and cytokine release syndrome observed with previous VISTA antibodies. Here we demonstrate that SNS-101, a newly developed pH-selective VISTA antibody, addresses these challenges. Structural and biochemical analyses confirmed the pH-selectivity and unique epitope targeted by SNS-101. These properties confer favorable pharmacokinetic and safety profiles on SNS-101. In syngeneic tumor models utilizing human VISTA knock-in mice, SNS-101 shows in vivo efficacy when combined with a PD-1 inhibitor, modulates cytokine and chemokine signaling, and alters the tumor microenvironment. In summary, SNS-101, currently in Phase I clinical trials, emerges as a promising therapeutic biologic for a wide range of patients whose cancer is refractory to current immunotherapy regimens.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The application value of deep learning-based nomograms in benign–malignant discrimination of TI-RADS category 4 thyroid nodules",
        "link": "https://www.nature.com/articles/s41598-024-58668-6",
        "publication_date": "03 Apr 2024",
        "abstract": "Thyroid nodules are a common occurrence, and although most are non-cancerous, some can be malignant. The American College of Radiology has developed the Thyroid Imaging Reporting and Data System (TI-RADS) to standardize the interpretation and reporting of thyroid ultrasound results. Within TI-RADS, a category 4 designation signifies a thyroid nodule with an intermediate level of suspicion for malignancy. Accurate classification of these nodules is crucial for proper management, as it can potentially reduce unnecessary surgeries and improve patient outcomes. This study utilized deep learning techniques to effectively classify TI-RADS category 4 thyroid nodules as either benign or malignant. A total of 500 patients were included in the study and randomly divided into a training group (350 patients) and a test group (150 patients). The YOLOv3 model was constructed and evaluated using various metrics, achieving an 84% accuracy in the classification of TI-RADS category 4 thyroid nodules. Based on the predictions of the model, along with clinical and ultrasound data, a nomogram was developed. The performance of the nomogram was superior in both the training and testing groups. Furthermore, the calibration curve demonstrated good agreement between predicted probabilities and actual outcomes. Decision curve analysis further confirmed that the nomogram provided greater net benefits. Ultimately, the YOLOv3 model and nomogram successfully improved the accuracy of distinguishing between benign and malignant TI-RADS category 4 thyroid nodules, which is crucial for proper management and improved patient outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]