[
    {
        "title": "Concomitant drugs associated with increased mortality for MDMA users reported in a drug safety surveillance database",
        "link": "https://www.nature.com/articles/s41598-021-85389-x",
        "publication_date": "16 Mar 2021",
        "abstract": "3,4-Methylenedioxymethamphetamine (MDMA) is currently being evaluated by the Food and Drug Administration (FDA) for the treatment of post-traumatic stress disorder (PTSD). If MDMA is FDA-approved it will be important to understand what medications may pose a risk of drug–drug interactions. The goal of this study was to evaluate the risks due to MDMA ingestion alone or in combination with other common medications and drugs of abuse using the FDA drug safety surveillance data. To date, nearly one thousand reports of MDMA use have been reported to the FDA. The majority of these reports include covariates such as co-ingested substances and demographic parameters. Univariate and multivariate logistic regression was employed to uncover the contributing factors to the reported risk of death among MDMA users. Several drug classes (MDMA metabolites or analogs, anesthetics, muscle relaxants, amphetamines and stimulants, benzodiazepines, ethanol, opioids), four antidepressants (bupropion, sertraline, venlafaxine and citalopram) and olanzapine demonstrated increased odds ratios for the reported risk of death. Future drug–drug interaction clinical trials should evaluate if any of the other drug–drug interactions described in our results actually pose a risk of morbidity or mortality in controlled medical settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Validating machine learning approaches for prediction of donor related complication in microsurgical breast reconstruction: a retrospective cohort study",
        "link": "https://www.nature.com/articles/s41598-021-85155-z",
        "publication_date": "10 Mar 2021",
        "abstract": "Autologous reconstruction using abdominal flaps remains the most popular method for breast reconstruction worldwide. We aimed to evaluate a prediction model using machine-learning methods and to determine which factors increase abdominal flap donor site complications with logistic regression. We evaluated the predictive ability of different machine learning packages, reviewing a cohort of breast reconstruction patients who underwent abdominal flaps. We analyzed 13 treatment variables for effects on the abdominal donor site complication rates. To overcome data imbalances, random over sampling example (ROSE) method was used. Data were divided into training and testing sets. Prediction accuracy, sensitivity, specificity, and predictive power (AUC) were measured by applying neuralnet, nnet, and RSNNS machine learning packages. A total of 568 patients were analyzed. The supervised learning package that performed the most effective prediction was neuralnet. Factors that significantly affected donor-related complication was size of the fascial defect, history of diabetes, muscle sparing type, and presence or absence of adjuvant chemotherapy. The risk cutoff value for fascial defect was 37.5 cm2. High-risk group complication rates analyzed by statistical method were significant compared to the low-risk group (26% vs 1.7%). These results may help surgeons to achieve better surgical outcomes and reduce postoperative burden.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive model for the 5-year survival status of osteosarcoma patients based on the SEER database and XGBoost algorithm",
        "link": "https://www.nature.com/articles/s41598-021-85223-4",
        "publication_date": "10 Mar 2021",
        "abstract": "Osteosarcoma is the most common bone malignancy, with the highest incidence in children and adolescents. Survival rate prediction is important for improving prognosis and planning therapy. However, there is still no prediction model with a high accuracy rate for osteosarcoma. Therefore, we aimed to construct an artificial intelligence (AI) model for predicting the 5-year survival of osteosarcoma patients by using extreme gradient boosting (XGBoost), a large-scale machine-learning algorithm. We identified cases of osteosarcoma in the Surveillance, Epidemiology, and End Results (SEER) Research Database and excluded substandard samples. The study population was 835 and was divided into the training set (n = 668) and validation set (n = 167). Characteristics selected via survival analyses were used to construct the model. Receiver operating characteristic (ROC) curve and decision curve analyses were performed to evaluate the prediction. The accuracy of the prediction model was excellent both in the training set (area under the ROC curve [AUC] = 0.977) and the validation set (AUC = 0.911). Decision curve analyses proved the model could be used to support clinical decisions. XGBoost is an effective algorithm for predicting 5-year survival of osteosarcoma patients. Our prediction model had excellent accuracy and is therefore useful in clinical settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Whole-brain tissue mapping toolkit using large-scale highly multiplexed immunofluorescence imaging and deep neural networks",
        "link": "https://www.nature.com/articles/s41467-021-21735-x",
        "publication_date": "10 Mar 2021",
        "abstract": "Mapping biological processes in brain tissues requires piecing together numerous histological observations of multiple tissue samples. We present a direct method that generates readouts for a comprehensive panel of biomarkers from serial whole-brain slices, characterizing all major brain cell types, at scales ranging from subcellular compartments, individual cells, local multi-cellular niches, to whole-brain regions from each slice. We use iterative cycles of optimized 10-plex immunostaining with 10-color epifluorescence imaging to accumulate highly enriched image datasets from individual whole-brain slices, from which seamless signal-corrected mosaics are reconstructed. Specific fluorescent signals of interest are isolated computationally, rejecting autofluorescence, imaging noise, cross-channel bleed-through, and cross-labeling. Reliable large-scale cell detection and segmentation are achieved using deep neural networks. Cell phenotyping is performed by analyzing unique biomarker combinations over appropriate subcellular compartments. This approach can accelerate pre-clinical drug evaluation and system-level brain histology studies by simultaneously profiling multiple biological processes in their native anatomical context.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Data-driven curation process for describing the blood glucose management in the intensive care unit",
        "link": "https://www.nature.com/articles/s41597-021-00864-4",
        "publication_date": "10 Mar 2021",
        "abstract": "Analysis of real-world glucose and insulin clinical data recorded in electronic medical records can provide insights into tailored approaches to clinical care, yet presents many analytic challenges. This work makes publicly available a dataset that contains the curated entries of blood glucose readings and administered insulin on a per-patient basis during ICU admissions in the Medical Information Mart for Intensive Care (MIMIC-III) database version 1.4. Also, the present study details the data curation process used to extract and match glucose values to insulin therapy. The curation process includes the creation of glucose-insulin pairing rules according to clinical expert-defined physiologic and pharmacologic parameters. Through this approach, it was possible to align nearly 76% of insulin events to a preceding blood glucose reading for nearly 9,600 critically ill patients. This work has the potential to reveal trends in real-world practice for the management of blood glucose. This data extraction and processing serve as a framework for future studies of glucose and insulin in the intensive care unit.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparative analysis of machine learning algorithms for computer-assisted reporting based on fully automated cross-lingual RadLex mappings",
        "link": "https://www.nature.com/articles/s41598-021-85016-9",
        "publication_date": "09 Mar 2021",
        "abstract": "Computer-assisted reporting (CAR) tools were suggested to improve radiology report quality by context-sensitively recommending key imaging biomarkers. However, studies evaluating machine learning (ML) algorithms on cross-lingual ontological (RadLex) mappings for developing embedded CAR algorithms are lacking. Therefore, we compared ML algorithms developed on human expert-annotated features against those developed on fully automated cross-lingual (German to English) RadLex mappings using 206 CT reports of suspected stroke. Target label was whether the Alberta Stroke Programme Early CT Score (ASPECTS) should have been provided (yes/no:154/52). We focused on probabilistic outputs of ML-algorithms including tree-based methods, elastic net, support vector machines (SVMs) and fastText (linear classifier), which were evaluated in the same 5 × fivefold nested cross-validation framework. This allowed for model stacking and classifier rankings. Performance was evaluated using calibration metrics (AUC, brier score, log loss) and -plots. Contextual ML-based assistance recommending ASPECTS was feasible. SVMs showed the highest accuracies both on human-extracted- (87%) and RadLex features (findings:82.5%; impressions:85.4%). FastText achieved the highest accuracy (89.3%) and AUC (92%) on impressions. Boosted trees fitted on findings had the best calibration profile. Our approach provides guidance for choosing ML classifiers for CAR tools in fully automated and language-agnostic fashion using bag-of-RadLex terms on limited expert-labelled training data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Amide proton transfer weighted (APTw) imaging based radiomics allows for the differentiation of gliomas from metastases",
        "link": "https://www.nature.com/articles/s41598-021-85168-8",
        "publication_date": "09 Mar 2021",
        "abstract": "Error fetching abstract: 'NoneType' object has no attribute 'lower'",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Single cell transcriptomics of primate sensory neurons identifies cell types associated with chronic pain",
        "link": "https://www.nature.com/articles/s41467-021-21725-z",
        "publication_date": "08 Mar 2021",
        "abstract": "Distinct types of dorsal root ganglion sensory neurons may have unique contributions to chronic pain. Identification of primate sensory neuron types is critical for understanding the cellular origin and heritability of chronic pain. However, molecular insights into the primate sensory neurons are missing. Here we classify non-human primate dorsal root ganglion sensory neurons based on their transcriptome and map human pain heritability to neuronal types. First, we identified cell correlates between two major datasets for mouse sensory neuron types. Machine learning exposes an overall cross-species conservation of somatosensory neurons between primate and mouse, although with differences at individual gene level, highlighting the importance of primate data for clinical translation. We map genomic loci associated with chronic pain in human onto primate sensory neuron types to identify the cellular origin of chronic pain. Genome-wide associations for chronic pain converge on two different neuronal types distributed between pain disorders that display different genetic susceptibilities, suggesting both unique and shared mechanisms between different pain conditions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Expanding the drug discovery space with predicted metabolite–target interactions",
        "link": "https://www.nature.com/articles/s42003-021-01822-x",
        "publication_date": "05 Mar 2021",
        "abstract": "Metabolites produced in the human gut are known modulators of host immunity. However, large-scale identification of metabolite–host receptor interactions remains a daunting challenge. Here, we employed computational approaches to identify 983 potential metabolite–target interactions using the Inflammatory Bowel Disease (IBD) cohort dataset of the Human Microbiome Project 2 (HMP2). Using a consensus of multiple machine learning methods, we ranked metabolites based on importance to IBD, followed by virtual ligand-based screening to identify possible human targets and adding evidence from compound assay, differential gene expression, pathway enrichment, and genome-wide association studies. We confirmed known metabolite–target pairs such as nicotinic acid–GPR109a or linoleoyl ethanolamide–GPR119 and inferred interactions of interest including oleanolic acid–GABRG2 and alpha-CEHC–THRB. Eleven metabolites were tested for bioactivity in vitro using human primary cell-types. By expanding the universe of possible microbial metabolite–host protein interactions, we provide multiple drug targets for potential immune-therapies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automation of surgical skill assessment using a three-stage machine learning algorithm",
        "link": "https://www.nature.com/articles/s41598-021-84295-6",
        "publication_date": "04 Mar 2021",
        "abstract": "Surgical skills are associated with clinical outcomes. To improve surgical skills and thereby reduce adverse outcomes, continuous surgical training and feedback is required. Currently, assessment of surgical skills is a manual and time-consuming process which is prone to subjective interpretation. This study aims to automate surgical skill assessment in laparoscopic cholecystectomy videos using machine learning algorithms. To address this, a three-stage machine learning method is proposed: first, a Convolutional Neural Network was trained to identify and localize surgical instruments. Second, motion features were extracted from the detected instrument localizations throughout time. Third, a linear regression model was trained based on the extracted motion features to predict surgical skills. This three-stage modeling approach achieved an accuracy of 87 ± 0.2% in distinguishing good versus poor surgical skill. While the technique cannot reliably quantify the degree of surgical skill yet it represents an important advance towards automation of surgical skill assessment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Semi-automated tracking of pain in critical care patients using artificial intelligence: a retrospective observational study",
        "link": "https://www.nature.com/articles/s41598-021-84714-8",
        "publication_date": "04 Mar 2021",
        "abstract": "Monitoring the pain intensity in critically ill patients is crucial because intense pain can cause adverse events, including poor survival rates; however, continuous pain evaluation is difficult. Vital signs have traditionally been considered ineffective in pain assessment; nevertheless, the use of machine learning may automate pain assessment using vital signs. This retrospective observational study was performed at a university hospital in Sendai, Japan. Objective pain assessments were performed in eligible patients using the Critical-Care Pain Observation Tool (CPOT). Three machine-learning methods—random forest (RF), support vector machine (SVM), and logistic regression (LR)—were employed to predict pain using parameters, such as vital signs, age group, and sedation levels. Prediction accuracy was calculated as the harmonic mean of sensitivity, specificity, and area under the receiver operating characteristic curve (AUROC). Furthermore, 117,190 CPOT assessments were performed in 11,507 eligible patients (median age: 65 years; 58.0% males). We found that pain prediction was possible with all three machine-learning methods. RF demonstrated the highest AUROC for the test data (RF: 0.853, SVM: 0.823, and LR: 0.787). With this method, pain can be objectively, continuously, and semi-automatically evaluated in critically ill patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Adjustment of high flow nasal cannula rates using real-time work of breathing indices in premature infants with respiratory insufficiency",
        "link": "https://www.nature.com/articles/s41372-021-00977-z",
        "publication_date": "04 Mar 2021",
        "abstract": "To assess the feasibility of real-time monitoring of work of breathing (WOB) indices and the impact of adjusting HFNC flow on breathing synchrony and oxygen stability in premature infants.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A survey of clinicians on the use of artificial intelligence in ophthalmology, dermatology, radiology and radiation oncology",
        "link": "https://www.nature.com/articles/s41598-021-84698-5",
        "publication_date": "04 Mar 2021",
        "abstract": "Artificial intelligence technology has advanced rapidly in recent years and has the potential to improve healthcare outcomes. However, technology uptake will be largely driven by clinicians, and there is a paucity of data regarding the attitude that clinicians have to this new technology. In June–August 2019 we conducted an online survey of fellows and trainees of three specialty colleges (ophthalmology, radiology/radiation oncology, dermatology) in Australia and New Zealand on artificial intelligence. There were 632 complete responses (n = 305, 230, and 97, respectively), equating to a response rate of 20.4%, 5.1%, and 13.2% for the above colleges, respectively. The majority (n = 449, 71.0%) believed artificial intelligence would improve their field of medicine, and that medical workforce needs would be impacted by the technology within the next decade (n = 542, 85.8%). Improved disease screening and streamlining of monotonous tasks were identified as key benefits of artificial intelligence. The divestment of healthcare to technology companies and medical liability implications were the greatest concerns. Education was identified as a priority to prepare clinicians for the implementation of artificial intelligence in healthcare. This survey highlights parallels between the perceptions of different clinician groups in Australia and New Zealand about artificial intelligence in medicine. Artificial intelligence was recognized as valuable technology that will have wide-ranging impacts on healthcare.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of digital measures for nighttime scratch and sleep using wrist-worn wearable devices",
        "link": "https://www.nature.com/articles/s41746-021-00402-x",
        "publication_date": "03 Mar 2021",
        "abstract": "Patients with atopic dermatitis experience increased nocturnal pruritus which leads to scratching and sleep disturbances that significantly contribute to poor quality of life. Objective measurements of nighttime scratching and sleep quantity can help assess the efficacy of an intervention. Wearable sensors can provide novel, objective measures of nighttime scratching and sleep; however, many current approaches were not designed for passive, unsupervised monitoring during daily life. In this work, we present the development and analytical validation of a method that sequentially processes epochs of sample-level accelerometer data from a wrist-worn device to provide continuous digital measures of nighttime scratching and sleep quantity. This approach uses heuristic and machine learning algorithms in a hierarchical paradigm by first determining when the patient intends to sleep, then detecting sleep–wake states along with scratching episodes, and lastly deriving objective measures of both sleep and scratch. Leveraging reference data collected in a sleep laboratory (NCT ID: NCT03490877), results show that sensor-derived measures of total sleep opportunity (TSO; time when patient intends to sleep) and total sleep time (TST) correlate well with reference polysomnography data (TSO: r = 0.72, p < 0.001; TST: r = 0.76, p < 0.001; N = 32). Log transformed sensor derived measures of total scratching duration achieve strong agreement with reference annotated video recordings (r = 0.82, p < 0.001; N = 25). These results support the use of wearable sensors for objective, continuous measurement of nighttime scratching and sleep during daily life.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based prediction model using clinico-pathologic factors for papillary thyroid carcinoma recurrence",
        "link": "https://www.nature.com/articles/s41598-021-84504-2",
        "publication_date": "02 Mar 2021",
        "abstract": "This study analyzed the prognostic significance of clinico-pathologic factors, including the number of metastatic lymph nodes (LNs) and lymph node ratio (LNR), in patients with papillary thyroid carcinoma (PTC), and attempted to construct a disease recurrence prediction model using machine learning techniques. We retrospectively analyzed clinico-pathologic data from 1040 patients diagnosed with PTC between 2003 and 2009. We analyzed clinico-pathologic factors related to recurrence through logistic regression analysis. Among the factors that we included, only sex and tumor size were significantly correlated with disease recurrence. Parameters such as age, sex, tumor size, tumor multiplicity, ETE, ENE, pT, pN, ipsilateral central LN metastasis, contralateral central LNs metastasis, number of metastatic LNs, and LNR were input for construction of a machine learning prediction model. The performance of five machine learning models related to recurrence prediction was compared based on accuracy. The Decision Tree model showed the best accuracy at 95%, and the lightGBM and stacking model together showed 93% accuracy. Among those factors mentioned above, LNR and contralateral LN metastasis were used as important features in all machine learning prediction models. We confirmed that all machine learning prediction models showed an accuracy of 90% or more for predicting disease recurrence in PTC. LNR and contralateral LN metastasis were used as important features for constructing a robust machine learning prediction model. In the future, we have a plan to perform large-scale multicenter clinical studies to improve the performance of our prediction models and verify their clinical effectiveness.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning approaches for challenging species and gender identification of mosquito vectors",
        "link": "https://www.nature.com/articles/s41598-021-84219-4",
        "publication_date": "01 Mar 2021",
        "abstract": "Microscopic observation of mosquito species, which is the basis of morphological identification, is a time-consuming and challenging process, particularly owing to the different skills and experience of public health personnel. We present deep learning models based on the well-known you-only-look-once (YOLO) algorithm. This model can be used to simultaneously classify and localize the images to identify the species of the gender of field-caught mosquitoes. The results indicated that the concatenated two YOLO v3 model exhibited the optimal performance in identifying the mosquitoes, as the mosquitoes were relatively small objects compared with the large proportional environment image. The robustness testing of the proposed model yielded a mean average precision and sensitivity of 99% and 92.4%, respectively. The model exhibited high performance in terms of the specificity and accuracy, with an extremely low rate of misclassification. The area under the receiver operating characteristic curve (AUC) was 0.958 ± 0.011, which further demonstrated the model accuracy. Thirteen classes were detected with an accuracy of 100% based on a confusion matrix. Nevertheless, the relatively low detection rates for the two species were likely a result of the limited number of wild-caught biological samples available. The proposed model can help establish the population densities of mosquito vectors in remote areas to predict disease outbreaks in advance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Hospitalization and mortality associated with SARS-CoV-2 viral clades in COVID-19",
        "link": "https://www.nature.com/articles/s41598-021-82850-9",
        "publication_date": "26 Feb 2021",
        "abstract": "The COVID-19 epidemic of 2019–20 is due to the novel coronavirus SARS-CoV-2. Following first case description in December, 2019 this virus has infected over 10 million individuals and resulted in at least 500,000 deaths world-wide. The virus is undergoing rapid mutation, with two major clades of sequence variants emerging. This study sought to determine whether SARS-CoV-2 sequence variants are associated with differing outcomes among COVID-19 patients in a single medical system. Whole genome SARS-CoV-2 RNA sequence was obtained from isolates collected from patients registered in the University of Washington Medicine health system between March 1 and April 15, 2020. Demographic and baseline clinical characteristics of patients and their outcome data including their hospitalization and death were collected. Statistical and machine learning models were applied to determine if viral genetic variants were associated with specific outcomes of hospitalization or death. Full length SARS-CoV-2 sequence was obtained 190 subjects with clinical outcome data. 35 (18.4%) were hospitalized and 14 (7.4%) died from complications of infection. A total of 289 single nucleotide variants were identified. Clustering methods demonstrated two major viral clades, which could be readily distinguished by 12 polymorphisms in 5 genes. A trend toward higher rates of hospitalization of patients with Clade 2 infections was observed (p = 0.06, Fisher’s exact). Machine learning models utilizing patient demographics and co-morbidities achieved area-under-the-curve (AUC) values of 0.93 for predicting hospitalization. Addition of viral clade or sequence information did not significantly improve models for outcome prediction. In summary, SARS-CoV-2 shows substantial sequence diversity in a community-based sample. Two dominant clades of virus are in circulation. Among patients sufficiently ill to warrant testing for virus, no significant difference in outcomes of hospitalization or death could be discerned between clades in this sample. Major risk factors for hospitalization and death for either major clade of virus include patient age and comorbid conditions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning based predictors for COVID-19 disease severity",
        "link": "https://www.nature.com/articles/s41598-021-83967-7",
        "publication_date": "25 Feb 2021",
        "abstract": "Predictors of the need for intensive care and mechanical ventilation can help healthcare systems in planning for surge capacity for COVID-19. We used socio-demographic data, clinical data, and blood panel profile data at the time of initial presentation to develop machine learning algorithms for predicting the need for intensive care and mechanical ventilation. Among the algorithms considered, the Random Forest classifier performed the best with \\(\\text {AUC} = 0.80\\) for predicting ICU need and \\(\\text {AUC} = 0.82\\) for predicting the need for mechanical ventilation. We also determined the most influential features in making this prediction, and concluded that all three categories of data are important. We determined the relative importance of blood panel profile data and noted that the AUC dropped by 0.12 units when this data was not included, thus indicating that it provided valuable information in predicting disease severity. Finally, we generated RF predictors with a reduced set of five features that retained the performance of the predictors trained on all features. These predictors, which rely only on quantitative data, are less prone to errors and subjectivity.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Novel diagnostic and therapeutic techniques reveal changed metabolic profiles in recurrent focal segmental glomerulosclerosis",
        "link": "https://www.nature.com/articles/s41598-021-83883-w",
        "publication_date": "25 Feb 2021",
        "abstract": "Idiopathic forms of Focal Segmental Glomerulosclerosis (FSGS) are caused by circulating permeability factors, which can lead to early recurrence of FSGS and kidney failure after kidney transplantation. In the past three decades, many research endeavors were undertaken to identify these unknown factors. Even though some potential candidates have been recently discussed in the literature, “the” actual factor remains elusive. Therefore, there is an increased demand in FSGS research for the use of novel technologies that allow us to study FSGS from a yet unexplored angle. Here, we report the successful treatment of recurrent FSGS in a patient after living-related kidney transplantation by removal of circulating factors with CytoSorb apheresis. Interestingly, the classical published circulating factors were all in normal range in this patient but early disease recurrence in the transplant kidney and immediate response to CytoSorb apheresis were still suggestive for pathogenic circulating factors. To proof the functional effects of the patient’s serum on podocytes and the glomerular filtration barrier we used a podocyte cell culture model and a proteinuria model in zebrafish to detect pathogenic effects on the podocytes actin cytoskeleton inducing a functional phenotype and podocyte effacement. We then performed Raman spectroscopy in the < 50 kDa serum fraction, on cultured podocytes treated with the FSGS serum and in kidney biopsies of the same patient at the time of transplantation and at the time of disease recurrence. The analysis revealed changes in podocyte metabolome induced by the FSGS serum as well as in focal glomerular and parietal epithelial cell regions in the FSGS biopsy. Several altered Raman spectra were identified in the fractionated serum and metabolome analysis by mass spectrometry detected lipid profiles in the FSGS serum, which were supported by disturbances in the Raman spectra. Our novel innovative analysis reveals changed lipid metabolome profiles associated with idiopathic FSGS that might reflect a new subtype of the disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Recursive ensemble feature selection provides a robust mRNA expression signature for myalgic encephalomyelitis/chronic fatigue syndrome",
        "link": "https://www.nature.com/articles/s41598-021-83660-9",
        "publication_date": "25 Feb 2021",
        "abstract": "Myalgic encephalomyelitis/chronic fatigue syndrome (ME/CFS) is a chronic disorder characterized by disabling fatigue. Several studies have sought to identify diagnostic biomarkers, with varying results. Here, we innovate this process by combining both mRNA expression and DNA methylation data. We performed recursive ensemble feature selection (REFS) on publicly available mRNA expression data in peripheral blood mononuclear cells (PBMCs) of 93 ME/CFS patients and 25 healthy controls, and found a signature of 23 genes capable of distinguishing cases and controls. REFS highly outperformed other methods, with an AUC of 0.92. We validated the results on a different platform (AUC of 0.95) and in DNA methylation data obtained from four public studies on ME/CFS (99 patients and 50 controls), identifying 48 gene-associated CpGs that predicted disease status as well (AUC of 0.97). Finally, ten of the 23 genes could be interpreted in the context of the derailed immune system of ME/CFS.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning approaches for the prediction of bone mineral density by using genomic and phenotypic data of 5130 older men",
        "link": "https://www.nature.com/articles/s41598-021-83828-3",
        "publication_date": "24 Feb 2021",
        "abstract": "The study aimed to utilize machine learning (ML) approaches and genomic data to develop a prediction model for bone mineral density (BMD) and identify the best modeling approach for BMD prediction. The genomic and phenotypic data of Osteoporotic Fractures in Men Study (n = 5130) was analyzed. Genetic risk score (GRS) was calculated from 1103 associated SNPs for each participant after a comprehensive genotype imputation. Data were normalized and divided into a training set (80%) and a validation set (20%) for analysis. Random forest, gradient boosting, neural network, and linear regression were used to develop BMD prediction models separately. Ten-fold cross-validation was used for hyper-parameters optimization. Mean square error and mean absolute error were used to assess model performance. When using GRS and phenotypic covariates as the predictors, all ML models’ performance and linear regression in BMD prediction were similar. However, when replacing GRS with the 1103 individual SNPs in the model, ML models performed significantly better than linear regression (with lasso regularization), and the gradient boosting model performed the best. Our study suggested that ML models, especially gradient boosting, can improve BMD prediction in genomic data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a reinforcement learning algorithm to dynamically optimize mechanical ventilation in critical care",
        "link": "https://www.nature.com/articles/s41746-021-00388-6",
        "publication_date": "19 Feb 2021",
        "abstract": "The aim of this work was to develop and evaluate the reinforcement learning algorithm VentAI, which is able to suggest a dynamically optimized mechanical ventilation regime for critically-ill patients. We built, validated and tested its performance on 11,943 events of volume-controlled mechanical ventilation derived from 61,532 distinct ICU admissions and tested it on an independent, secondary dataset (200,859 ICU stays; 25,086 mechanical ventilation events). A patient “data fingerprint” of 44 features was extracted as multidimensional time series in 4-hour time steps. We used a Markov decision process, including a reward system and a Q-learning approach, to find the optimized settings for positive end-expiratory pressure (PEEP), fraction of inspired oxygen (FiO2) and ideal body weight-adjusted tidal volume (Vt). The observed outcome was in-hospital or 90-day mortality. VentAI reached a significantly increased estimated performance return of 83.3 (primary dataset) and 84.1 (secondary dataset) compared to physicians’ standard clinical care (51.1). The number of recommended action changes per mechanically ventilated patient constantly exceeded those of the clinicians. VentAI chose 202.9% more frequently ventilation regimes with lower Vt (5–7.5 mL/kg), but 50.8% less for regimes with higher Vt (7.5–10 mL/kg). VentAI recommended 29.3% more frequently PEEP levels of 5–7 cm H2O and 53.6% more frequently PEEP levels of 7–9 cmH2O. VentAI avoided high (>55%) FiO2 values (59.8% decrease), while preferring the range of 50–55% (140.3% increase). In conclusion, VentAI provides reproducible high performance by dynamically choosing an optimized, individualized ventilation strategy and thus might be of benefit for critically ill patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning based automated diagnosis of bone metastases with SPECT thoracic bone images",
        "link": "https://www.nature.com/articles/s41598-021-83083-6",
        "publication_date": "19 Feb 2021",
        "abstract": "SPECT nuclear medicine imaging is widely used for treating, diagnosing, evaluating and preventing various serious diseases. The automated classification of medical images is becoming increasingly important in developing computer-aided diagnosis systems. Deep learning, particularly for the convolutional neural networks, has been widely applied to the classification of medical images. In order to reliably classify SPECT bone images for the automated diagnosis of metastasis on which the SPECT imaging solely focuses, in this paper, we present several deep classifiers based on the deep networks. Specifically, original SPECT images are cropped to extract the thoracic region, followed by a geometric transformation that contributes to augment the original data. We then construct deep classifiers based on the widely used deep networks including VGG, ResNet and DenseNet by fine-tuning their parameters and structures or self-defining new network structures. Experiments on a set of real-world SPECT bone images show that the proposed classifiers perform well in identifying bone metastasis with SPECT imaging. It achieves 0.9807, 0.9900, 0.9830, 0.9890, 0.9802 and 0.9933 for accuracy, precision, recall, specificity, F-1 score and AUC, respectively, on the test samples from the augmented dataset without normalization.",
        "conclusions": "Targeting at the automated diagnosis of bone metastasis in SPECT nuclear medicine domain, in this work, we have developed several deep classifiers based on the famous CNN models to separate the thoracic SPECT bone images into the categories with the automatically extracted features by deep learning models. Specifically, the original SPECT images was preprocessed by using standard image mirroring, translation, and rotation operations, enabling to generate an augmented dataset. Famous CNN models were introduced to develop deep classifiers, which could classify an image by analyzing from the low level to high level features from this image. A set of real-world SPECT bone images were employed to evaluate the trained classifiers. The experimental results have demonstrated that our deep classifiers perform well on classifying thoracic SPECT bone images, with huge potentials to automatically diagnose bone metastasis in SPECT imaging.Our future work is in the following directions. First, a larger number of images of real-world SPECT bone scans will be collected to further evaluate the proposed deep classifiers. Second, we attempt to develop multi-class, multi-disease classifiers to identify lesions of various diseases with SPECT bone images. Finally, we will construct self-defined deep networks, specifically targeting at the automated classification of SPECT bone images for contributing to the current research of medical image analysis.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cellular correlates of gray matter volume changes in magnetic resonance morphometry identified by two-photon microscopy",
        "link": "https://www.nature.com/articles/s41598-021-83491-8",
        "publication_date": "19 Feb 2021",
        "abstract": "Magnetic resonance imaging (MRI) of the brain combined with voxel-based morphometry (VBM) revealed changes in gray matter volume (GMV) in various disorders. However, the cellular basis of GMV changes has remained largely unclear. We correlated changes in GMV with cellular metrics by imaging mice with MRI and two-photon in vivo microscopy at three time points within 12 weeks, taking advantage of age-dependent changes in brain structure. Imaging fluorescent cell nuclei allowed inferences on (i) physical tissue volume as determined from reference spaces outlined by nuclei, (ii) cell density, (iii) the extent of cell clustering, and (iv) the volume of cell nuclei. Our data indicate that physical tissue volume alterations only account for 13.0% of the variance in GMV change. However, when including comprehensive measurements of nucleus volume and cell density, 35.6% of the GMV variance could be explained, highlighting the influence of distinct cellular mechanisms on VBM results.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Early risk assessment for COVID-19 patients from emergency department data using machine learning",
        "link": "https://www.nature.com/articles/s41598-021-83784-y",
        "publication_date": "18 Feb 2021",
        "abstract": "Since its emergence in late 2019, the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) has caused a pandemic with more than 55 million reported cases and 1.3 million estimated deaths worldwide. While epidemiological and clinical characteristics of COVID-19 have been reported, risk factors underlying the transition from mild to severe disease among patients remain poorly understood. In this retrospective study, we analysed data of 879 confirmed SARS-CoV-2 positive patients admitted to a two-site NHS Trust hospital in London, England, between January 1st and May 26th, 2020, with a majority of cases occurring in March and April. We extracted anonymised demographic data, physiological clinical variables and laboratory results from electronic healthcare records (EHR) and applied multivariate logistic regression, random forest and extreme gradient boosted trees. To evaluate the potential for early risk assessment, we used data available during patients’ initial presentation at the emergency department (ED) to predict deterioration to one of three clinical endpoints in the remainder of the hospital stay: admission to intensive care, need for invasive mechanical ventilation and in-hospital mortality. Based on the trained models, we extracted the most informative clinical features in determining these patient trajectories. Considering our inclusion criteria, we have identified 129 of 879 (15%) patients that required intensive care, 62 of 878 (7%) patients needing mechanical ventilation, and 193 of 619 (31%) cases of in-hospital mortality. Our models learned successfully from early clinical data and predicted clinical endpoints with high accuracy, the best model achieving area under the receiver operating characteristic (AUC-ROC) scores of 0.76 to 0.87 (F1 scores of 0.42–0.60). Younger patient age was associated with an increased risk of receiving intensive care and ventilation, but lower risk of mortality. Clinical indicators of a patient’s oxygen supply and selected laboratory results, such as blood lactate and creatinine levels, were most predictive of COVID-19 patient trajectories. Among COVID-19 patients machine learning can aid in the early identification of those with a poor prognosis, using EHR data collected during a patient’s first presentation at ED. Patient age and measures of oxygenation status during ED stay are primary indicators of poor patient outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Correlation between corneal thickness, keratometry, age, and differential pressure difference in healthy eyes",
        "link": "https://www.nature.com/articles/s41598-021-83683-2",
        "publication_date": "18 Feb 2021",
        "abstract": "To determine the use of differential pressure difference (DPD), in air-puff differential tonometry, as a potential biomechanical measure of the cornea and elucidate its relationship with the intraocular pressure (IOP), central corneal thickness, corneal curvature, and age. This study comprised 396 eyes from 198 patients and was conducted at Acibadem University, School of Medicine, Department of Ophthalmology, Istanbul, Turkey. The central corneal curvature and refraction of the eyes were measured using an Auto Kerato-Refractometer (KR-1; Topcon Corporation, Tokyo, Japan). IOP and central corneal thickness were measured using a tono-pachymeter (CT-1P; Topcon Corporation, Tokyo, Japan), wherein two separate readings of IOP were obtained using two different modes: 1–30 and 1–60. The difference between these two readings was recorded as the DPD. The factors affecting the DPD were determined by stepwise multiple linear regression analysis. DPD varied over a dynamic range of − 3.0 to + 5.0 mmHg and was weakly correlated with the central corneal thickness (r = 0.115, p < 0.05). DPD showed no significant correlation with IOP 1–30 (p > 0.05). A weak but statistically significant (p < 0.05) positive correlation of DPD was observed with age (r = 0.123), Kavg (r = 0.102), and the CCT (r = 0.115). There was a significant correlation between DPD and Kavg, CCT, and age. There was no significant correlation between DPD and IOP 1–30. Age-related changes in the corneal ultrastructure may be a plausible explanation for the weak positive association between age and DPD. The proposed method may prove a valid non-invasive tool for the evaluation of corneal biomechanics and introduce DPD in the decision-making of routine clinical practice.",
        "conclusions": "We presented a parameter, DPD, utilized to evaluate the in vivo biomechanical response of normal cornea derived from tono-pachymeter-derived measurements. DPD can be used as a potential parameter following modification of tono-pachymeter software and simply converting the device into a tonopacho-biomechanometer. The usefulness of DPD in determining corneal pathologies is yet to be assessed. However, the method employed to obtain DPD by air-puff tonometry is user-friendly, low cost, and of non-invasive nature. DPD may be an alternative and potentially useful biophysical variable for evaluating ocular bio-properties. Further studies are required to infer what biomechanical properties are delineated by this parameter and propose more clinical applications based on its use.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Zero-crossing patterns reveal subtle epileptiform discharges in the scalp EEG",
        "link": "https://www.nature.com/articles/s41598-021-83337-3",
        "publication_date": "18 Feb 2021",
        "abstract": "Clinical diagnosis of epilepsy depends heavily on the detection of interictal epileptiform discharges (IEDs) from scalp electroencephalographic (EEG) signals, which by purely visual means is far from straightforward. Here, we introduce a simple signal analysis procedure based on scalp EEG zero-crossing patterns which can extract the spatiotemporal structure of scalp voltage fluctuations. We analyzed simultaneous scalp and intracranial EEG recordings from patients with pharmacoresistant temporal lobe epilepsy. Our data show that a large proportion of intracranial IEDs manifest only as subtle, low-amplitude waveforms below scalp EEG background and could, therefore, not be detected visually. We found that scalp zero-crossing patterns allow detection of these intracranial IEDs on a single-trial level with millisecond temporal precision and including some mesial temporal discharges that do not propagate to the neocortex. Applied to an independent dataset, our method discriminated accurately between patients with epilepsy and normal subjects, confirming its practical applicability.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Temporal bias in case-control design: preventing reliable predictions of the future",
        "link": "https://www.nature.com/articles/s41467-021-21390-2",
        "publication_date": "17 Feb 2021",
        "abstract": "One of the primary tools that researchers use to predict risk is the case-control study. We identify a flaw, temporal bias, that is specific to and uniquely associated with these studies that occurs when the study period is not representative of the data that clinicians have during the diagnostic process. Temporal bias acts to undermine the validity of predictions by over-emphasizing features close to the outcome of interest. We examine the impact of temporal bias across the medical literature, and highlight examples of exaggerated effect sizes, false-negative predictions, and replication failure. Given the ubiquity and practical advantages of case-control studies, we discuss strategies for estimating the influence of and preventing temporal bias where it exists.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Breath analysis based early gastric cancer classification from deep stacked sparse autoencoder neural network",
        "link": "https://www.nature.com/articles/s41598-021-83184-2",
        "publication_date": "17 Feb 2021",
        "abstract": "Deep learning is an emerging tool, which is regularly used for disease diagnosis in the medical field. A new research direction has been developed for the detection of early-stage gastric cancer. The computer-aided diagnosis (CAD) systems reduce the mortality rate due to their effectiveness. In this study, we proposed a new method for feature extraction using a stacked sparse autoencoder to extract the discriminative features from the unlabeled data of breath samples. A Softmax classifier was then integrated to the proposed method of feature extraction, to classify gastric cancer from the breath samples. Precisely, we identified fifty peaks in each spectrum to distinguish the EGC, AGC, and healthy persons. This CAD system reduces the distance between the input and output by learning the features and preserve the structure of the input data set of breath samples. The features were extracted from the unlabeled data of the breath samples. After the completion of unsupervised training, autoencoders with Softmax classifier were cascaded to develop a deep stacked sparse autoencoder neural network. In last, fine-tuning of the developed neural network was carried out with labeled training data to make the model more reliable and repeatable. The proposed deep stacked sparse autoencoder neural network architecture exhibits excellent results, with an overall accuracy of 98.7% for advanced gastric cancer classification and 97.3% for early gastric cancer detection using breath analysis. Moreover, the developed model produces an excellent result for recall, precision, and f score value, making it suitable for clinical application.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Real-time acoustic sensing and artificial intelligence for error prevention in orthopedic surgery",
        "link": "https://www.nature.com/articles/s41598-021-83506-4",
        "publication_date": "17 Feb 2021",
        "abstract": "In this work, we developed and validated a computer method capable of robustly detecting drill breakthrough events and show the potential of deep learning-based acoustic sensing for surgical error prevention. Bone drilling is an essential part of orthopedic surgery and has a high risk of injuring vital structures when over-drilling into adjacent soft tissue. We acquired a dataset consisting of structure-borne audio recordings of drill breakthrough sequences with custom piezo contact microphones in an experimental setup using six human cadaveric hip specimens. In the following step, we developed a deep learning-based method for the automated detection of drill breakthrough events in a fast and accurate fashion. We evaluated the proposed network regarding breakthrough detection sensitivity and latency. The best performing variant yields a sensitivity of \\(93.64 \\pm 2.42\\)% for drill breakthrough detection in a total execution time of 139.29\\({\\hbox { ms}}\\). The validation and performance evaluation of our solution demonstrates promising results for surgical error prevention by automated acoustic-based drill breakthrough detection in a realistic experiment while being multiple times faster than a surgeon’s reaction time. Furthermore, our proposed method represents an important step for the translation of acoustic-based breakthrough detection towards surgical use.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of sarcomatoid differentiation in renal cell carcinoma by machine learning on multiparametric MRI",
        "link": "https://www.nature.com/articles/s41598-021-83271-4",
        "publication_date": "15 Feb 2021",
        "abstract": "Sarcomatoid differentiation in RCC (sRCC) is associated with a poor prognosis, necessitating more aggressive management than RCC without sarcomatoid components (nsRCC). Since suspected renal cell carcinoma (RCC) tumors are not routinely biopsied for histologic evaluation, there is a clinical need for a non-invasive method to detect sarcomatoid differentiation pre-operatively. We utilized unsupervised self-organizing map (SOM) and supervised Learning Vector Quantizer (LVQ) machine learning to classify RCC tumors on T2-weighted, non-contrast T1-weighted fat-saturated, contrast-enhanced arterial-phase T1-weighted fat-saturated, and contrast-enhanced venous-phase T1-weighted fat-saturated MRI images. The SOM was trained on 8 nsRCC and 8 sRCC tumors, and used to compute Activation Maps for each training, validation (3 nsRCC and 3 sRCC), and test (5 nsRCC and 5 sRCC) tumor. The LVQ classifier was trained and optimized on Activation Maps from the 22 training and validation cohort tumors, and tested on Activation Maps of the 10 unseen test tumors. In this preliminary study, the SOM-LVQ model achieved a hold-out testing accuracy of 70% in the task of identifying sarcomatoid differentiation in RCC on standard multiparameter MRI (mpMRI) images. We have demonstrated a combined SOM-LVQ machine learning approach that is suitable for analysis of limited mpMRI datasets for the task of differential diagnosis.",
        "conclusions": "We have demonstrated a Self-Organizing Map based approach for analysis of standard multiparametric MRI images to aid in the task of identifying sarcomatoid differentiation in renal cell carcinoma. Sarcomatoid differentiation is noted in approximately 5–10% of all RCCs, and this relatively uncommon presentation, combined with our requirement for the availability of pre-operative MRIs, restricted the current study to relatively small sample size. The performance of our final model on an independent test dataset, while leaving much room for improvement, points to the promise of this machine learning approach with limited sample sizes. The 2-dimensional “Activation Maps” that are produced as an intermediate output can be visually assessed by the human expert (i.e., Radiologist), which may increase interpretability and acceptability of the machine diagnosis. Our ongoing work is focused on increasing the sample size as well as on increasing the number of mpMRI “channels” to increase the information available to the SOM-LVQ model. Looking ahead, one can envision a hybrid diagnostic approach that combines the objective output of the LVQ classifier on the Activation Map of a given patient’s tumor, with a radiologist’s assessment of T2LIA content 38,39 and peritumoral vascular features 37, to achieve a combined power that is high enough to be clinically useful for diagnosis of sRCC on pre-operative mpMRI images.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting adverse outcomes due to diabetes complications with machine learning using administrative health data",
        "link": "https://www.nature.com/articles/s41746-021-00394-8",
        "publication_date": "12 Feb 2021",
        "abstract": "Across jurisdictions, government and health insurance providers hold a large amount of data from patient interactions with the healthcare system. We aimed to develop a machine learning-based model for predicting adverse outcomes due to diabetes complications using administrative health data from the single-payer health system in Ontario, Canada. A Gradient Boosting Decision Tree model was trained on data from 1,029,366 patients, validated on 272,864 patients, and tested on 265,406 patients. Discrimination was assessed using the AUC statistic and calibration was assessed visually using calibration plots overall and across population subgroups. Our model predicting three-year risk of adverse outcomes due to diabetes complications (hyper/hypoglycemia, tissue infection, retinopathy, cardiovascular events, amputation) included 700 features from multiple diverse data sources and had strong discrimination (average test AUC = 77.7, range 77.7–77.9). Through the design and validation of a high-performance model to predict diabetes complications adverse outcomes at the population level, we demonstrate the potential of machine learning and administrative health data to inform health planning and healthcare resource allocation for diabetes management.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Hypothermic machine perfusion before viability testing of previously discarded human livers",
        "link": "https://www.nature.com/articles/s41467-021-21182-8",
        "publication_date": "12 Feb 2021",
        "abstract": "Arising from H. Mergental et al. Nature Communications https://doi.org/10.1038/s41467-020-16251-3 (2020)",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Inclusion of genetic variants in an ensemble of gradient boosting decision trees does not improve the prediction of citalopram treatment response",
        "link": "https://www.nature.com/articles/s41598-021-83338-2",
        "publication_date": "12 Feb 2021",
        "abstract": "Identifying in advance who is unlikely to respond to a specific antidepressant treatment is crucial to precision medicine efforts. The current work leverages genome-wide genetic variation and machine learning to predict response to the antidepressant citalopram using data from the Sequenced Treatment Alternatives to Relieve Depression (STAR*D) trial (n = 1257 with both valid genomic and outcome data). A confirmatory approach selected 11 SNPs previously reported to predict response to escitalopram in a sample different from the current study. A novel exploratory approach selected SNPs from across the genome using nested cross-validation with elastic net logistic regression with a predominantly lasso penalty (alpha = 0.99). SNPs from each approach were combined with baseline clinical predictors and treatment response outcomes were predicted using a stacked ensemble of gradient boosting decision trees. Using pre-treatment clinical and symptom predictors only, out-of-fold prediction of a novel treatment response definition based on STAR*D treatment guidelines was acceptable, AUC = .659, 95% CI [0.629, 0.689]. The inclusion of SNPs using confirmatory or exploratory selection methods did not improve the out-of-fold prediction of treatment response (AUCs were .662, 95% CI [0.632, 0.692] and .655, 95% CI [0.625, 0.685], respectively). A similar pattern of results were observed for the secondary outcomes of the presence or absence of distressing side effects regardless of treatment response and achieving remission or satisfactory partial response, assuming medication tolerance. In the current study, incorporating SNP variation into prognostic models did not enhance the prediction of citalopram response in the STAR*D sample.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The hidden waves in the ECG uncovered revealing a sound automated interpretation method",
        "link": "https://www.nature.com/articles/s41598-021-82520-w",
        "publication_date": "12 Feb 2021",
        "abstract": "A novel approach for analysing cardiac rhythm data is presented in this paper. Heartbeats are decomposed into the five fundamental P, Q, R, S and T waves plus an error term to account for artifacts in the data which provides a meaningful, physical interpretation of the heart’s electric system. The morphology of each wave is concisely described using four parameters that allow all the different patterns in heartbeats to be characterized and thus differentiated This multi-purpose approach solves such questions as the extraction of interpretable features, the detection of the fiducial marks of the fundamental waves, or the generation of synthetic data and the denoising of signals. Yet the greatest benefit from this new discovery will be the automatic diagnosis of heart anomalies as well as other clinical uses with great advantages compared to the rigid, vulnerable and black box machine learning procedures, widely used in medical devices. The paper shows the enormous potential of the method in practice; specifically, the capability to discriminate subjects, characterize morphologies and detect the fiducial marks (reference points) are validated numerically using simulated and real data, thus proving that it outperforms its competitors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Performance and efficiency of machine learning algorithms for analyzing rectangular biomedical data",
        "link": "https://www.nature.com/articles/s41374-020-00525-x",
        "publication_date": "11 Feb 2021",
        "abstract": "Most biomedical datasets, including those of ‘omics, population studies, and surveys, are rectangular in shape and have few missing data. Recently, their sample sizes have grown significantly. Rigorous analyses on these large datasets demand considerably more efficient and more accurate algorithms. Machine learning (ML) algorithms have been used to classify outcomes in biomedical datasets, including random forests (RF), decision tree (DT), artificial neural networks (ANN), and support vector machine (SVM). However, their performance and efficiency in classifying multi-category outcomes of rectangular data are poorly understood. Therefore, we compared these metrics among the 4 ML algorithms. As an example, we created a large rectangular dataset using the female breast cancers in the surveillance, epidemiology, and end results-18 database, which were diagnosed in 2004 and followed up until December 2016. The outcome was the five-category cause of death, namely alive, non-breast cancer, breast cancer, cardiovascular disease, and other cause. We analyzed the 54 dichotomized features from ~45,000 patients using MatLab (version 2018a) and the tenfold cross-validation approach. The accuracy in classifying five-category cause of death with DT, RF, ANN, and SVM was 69.21%, 70.23%, 70.16%, and 69.06%, respectively, which was higher than the accuracy of 68.12% with multinomial logistic regression. Based on the features' information entropy, we optimized dimension reduction (i.e., reduce the number of features in models). We found 32 or more features were required to maintain similar accuracy, while the running time decreased from 55.57 s for 54 features to 25.99 s for 32 features in RF, from 12.92 s to 10.48 s in ANN, and from 175.50 s to 67.81 s in SVM. In summary, we here show that RF, DT, ANN, and SVM had similar accuracy for classifying multi-category outcomes in this large rectangular dataset. Dimension reduction based on information gain will increase the model’s efficiency while maintaining classification accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting intraocular pressure using systemic variables or fundus photography with deep learning in a health examination cohort",
        "link": "https://www.nature.com/articles/s41598-020-80839-4",
        "publication_date": "11 Feb 2021",
        "abstract": "The purpose of the current study was to predict intraocular pressure (IOP) using color fundus photography with a deep learning (DL) model, or, systemic variables with a multivariate linear regression model (MLM), along with least absolute shrinkage and selection operator regression (LASSO), support vector machine (SVM), and Random Forest: (RF). Training dataset included 3883 examinations from 3883 eyes of 1945 subjects and testing dataset 289 examinations from 289 eyes from 146 subjects. With the training dataset, MLM was constructed to predict IOP using 35 systemic variables and 25 blood measurements. A DL model was developed to predict IOP from color fundus photographs. The prediction accuracy of each model was evaluated through the absolute error and the marginal R-squared (mR2), using the testing dataset. The mean absolute error with MLM was 2.29 mmHg, which was significantly smaller than that with DL (2.70 dB). The mR2 with MLM was 0.15, whereas that with DL was 0.0066. The mean absolute error (between 2.24 and 2.30 mmHg) and mR2 (between 0.11 and 0.15) with LASSO, SVM and RF were similar to or poorer than MLM. A DL model to predict IOP using color fundus photography proved far less accurate than MLM using systemic variables.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Ensemble machine learning prediction and variable importance analysis of 5-year mortality after cardiac valve and CABG operations",
        "link": "https://www.nature.com/articles/s41598-021-82403-0",
        "publication_date": "10 Feb 2021",
        "abstract": "Despite having a similar post-operative complication profile, cardiac valve operations are associated with a higher mortality rate compared to coronary artery bypass grafting (CABG) operations. For long-term mortality, few predictors are known. In this study, we applied an ensemble machine learning (ML) algorithm to 88 routinely collected peri-operative variables to predict 5-year mortality after different types of cardiac operations. The Super Learner algorithm was trained using prospectively collected peri-operative data from 8241 patients who underwent cardiac valve, CABG and combined operations. Model performance and calibration were determined for all models, and variable importance analysis was conducted for all peri-operative parameters. Results showed that the predictive accuracy was the highest for solitary mitral (0.846 [95% CI 0.812–0.880]) and solitary aortic (0.838 [0.813–0.864]) valve operations, confirming that ensemble ML using routine data collected perioperatively can predict 5-year mortality after cardiac operations with high accuracy. Additionally, post-operative urea was identified as a novel and strong predictor of mortality for several types of operation, having a seemingly additive effect to better known risk factors such as age and postoperative creatinine.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive modeling of clinical trial terminations using feature engineering and embedding learning",
        "link": "https://www.nature.com/articles/s41598-021-82840-x",
        "publication_date": "10 Feb 2021",
        "abstract": "In this study, we propose to use machine learning to understand terminated clinical trials. Our goal is to answer two fundamental questions: (1) what are common factors/markers associated to terminated clinical trials? and (2) how to accurately predict whether a clinical trial may be terminated or not? The answer to the first question provides effective ways to understand characteristics of terminated trials for stakeholders to better plan their trials; and the answer to the second question can direct estimate the chance of success of a clinical trial in order to minimize costs. By using 311,260 trials to build a testbed with 68,999 samples, we use feature engineering to create 640 features, reflecting clinical trial administration, eligibility, study information, criteria etc. Using feature ranking, a handful of features, such as trial eligibility, trial inclusion/exclusion criteria, sponsor types etc., are found to be related to the clinical trial termination. By using sampling and ensemble learning, we achieve over 67% Balanced Accuracy and over 0.73 AUC (Area Under the Curve) scores to correctly predict clinical trial termination, indicating that machine learning can help achieve satisfactory prediction results for clinical trial study.",
        "conclusions": "In this paper, we used feature engineering and predictive modeling to study key factors associated to clinical trial termination, and proposed a framework to predict trial termination. By using 311,260 clinical trials to build a dataset with 68,999 samples, we achieved over 0.73 AUC and over 67% Balanced Accuracy scores for trial termination prediction. The predictive modeling offers insight for stakeholders to better plan clinical trials to avoid waste and ensure success.A limitation of our research is that the decision logic of the predictive models is not transparent, making it difficult to interpret the predictions. Future work can focus on models with better interpretability. In addition, research can segregate clinical trials into separate groups to determine if concentrated research area trials have more pronounced features or termination results. For example, this study and a previous study found oncology keywords as important features17. A different study has found surgery words as the highest important keyword factor18. Segregating clinical trials on the basis of research or therapeutic area for a single data set may possibly yield improved results for a predictive termination model. In which case, the same methodology could be applied to a subset of clinical trials.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Assessing robustness of carotid artery CT angiography radiomics in the identification of culprit lesions in cerebrovascular events",
        "link": "https://www.nature.com/articles/s41598-021-82760-w",
        "publication_date": "10 Feb 2021",
        "abstract": "Error fetching abstract: 'NoneType' object has no attribute 'lower'",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "A dynamic lesion model for differentiation of malignant and benign pathologies",
        "link": "https://www.nature.com/articles/s41598-021-83095-2",
        "publication_date": "10 Feb 2021",
        "abstract": "Malignant lesions have a high tendency to invade their surrounding environment compared to benign ones. This paper proposes a dynamic lesion model and explores the 2nd order derivatives at each image voxel, which reflect the rate of change of image intensity, as a quantitative measure of the tendency. The 2nd order derivatives at each image voxel are usually represented by the Hessian matrix, but it is difficult to quantify a matrix field (or image) through the lesion space as a measure of the tendency. We conjecture that the three eigenvalues contain important information of the Hessian matrix and are chosen as the surrogate representation of the Hessian matrix. By treating the three eigenvalues as a vector, called Hessian vector, which is defined in a local coordinate formed by three orthogonal Hessian eigenvectors and further adapting the gray level occurrence computing method to extract the vector texture descriptors (or measures) from the Hessian vector, a quantitative presentation for the dynamic lesion model is completed. The vector texture descriptors were applied to differentiate malignant from benign lesions from two pathologically proven datasets: colon polyps and lung nodules. The classification results not only outperform four state-of-the-art methods but also three radiologist experts.",
        "conclusions": "A dynamic lesion model was proposed to consider the clinical observation that malignant lesions have a high tendency to invade their surrounding environment compared to benign ones. To mathematically describe the lesion model, one conjecture was made that the lesion growing or invading tendency is related to the rate of image intensity changing at each image voxel, and the rate is represented by the 2nd order derivatives at that voxel, leading to a field of Hessian matrix across the image array space. To circumvent the difficulty of extracting quantitative measures from a matrix field for the task of CADx of lesions, another conjecture was made that the three eigenvalues of the Hessian matrix can be a surrogate representation of the Hessian matrix, and further be treated as a vector in the orthogonal system of the eigenvectors, i.e. Hessian vector.Inspired by the well-known co-occurrence texture measures for the CADx task, we extracted the co-occurrence vector texture features, i.e. VTFs, from the Hessian vector field or image. Classifying the VTFs for the CADx task on two pathologically proven lesion datasets of polyps and nodules provided striking results, outperforming both the state-of-the-art CADx methods and radiologist experts.While the VTF was demonstrated as a good feature descriptor of the dynamic lesion model, other vector feature descriptors can be explored for the CADx task. This is one of our future research topics.While the Hessian vector was demonstrated as a good surrogate of the Hessian matrix, use of the Hessian matrix for generation of matrix feature descriptors for the CADx task is desired. This is another topic of our future research endeavors.More importantly, by the insights on why AlphaGo can outperform the human experts, we believe task-driven AI-enabled CADx systems would be a direction of our future research endeavors40,41,42.It can be seen that the evaluation study of the VTF descriptor for the dynamic lesion model is limited by the small sample size of both the polyp and the nodule datasets. We have been devoting significant effort to continually acquire more pathologically proven lesion datasets, although the data acquisition is highly costly.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sequencing of 53,831 diverse genomes from the NHLBI TOPMed Program",
        "link": "https://www.nature.com/articles/s41586-021-03205-y",
        "publication_date": "10 Feb 2021",
        "abstract": "Error fetching abstract: 'NoneType' object has no attribute 'lower'",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Unraveling the deep learning gearbox in optical coherence tomography image segmentation towards explainable artificial intelligence",
        "link": "https://www.nature.com/articles/s42003-021-01697-y",
        "publication_date": "05 Feb 2021",
        "abstract": "Machine learning has greatly facilitated the analysis of medical data, while the internal operations usually remain intransparent. To better comprehend these opaque procedures, a convolutional neural network for optical coherence tomography image segmentation was enhanced with a Traceable Relevance Explainability (T-REX) technique. The proposed application was based on three components: ground truth generation by multiple graders, calculation of Hamming distances among graders and the machine learning algorithm, as well as a smart data visualization (‘neural recording’). An overall average variability of 1.75% between the human graders and the algorithm was found, slightly minor to 2.02% among human graders. The ambiguity in ground truth had noteworthy impact on machine learning results, which could be visualized. The convolutional neural network balanced between graders and allowed for modifiable predictions dependent on the compartment. Using the proposed T-REX setup, machine learning processes could be rendered more transparent and understandable, possibly leading to optimized applications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Meta-omics characteristics of intestinal microbiota associated to HBeAg seroconversion induced by oral antiviral therapy",
        "link": "https://www.nature.com/articles/s41598-021-82939-1",
        "publication_date": "05 Feb 2021",
        "abstract": "Tenofovir and entecavir are currently designated as the preferred oral antiviral drugs for chronic hepatitis B. However, only less than 40% of patients can achieve HBeAg seroconversion. We aim at investigating the role of intestinal microbiome in HBeAg seroconversion induced by oral antiviral therapy and describe multi-omics characteristics of HBeAg seroconversion associated intestinal flora. In this study, we prospectively collected fecal samples at baseline from the patients with HBeAg positive chronic hepatitis B who would have oral antiviral therapy. 16S rDNA sequencing and metabolomics were performed. We identified HBeAg seroconversion-related microbial signature and constructed prediction model for HBeAg seroconversion. Thirty-seven of these subjects achieved HBeAg seroconversion within 156 weeks after the initiation of oral antiviral therapy, while 41 subjects remained HBeAg positive even after over 156 weeks of therapy. A computational statistical and machine learning approach allowed us to identify a microbial signature for HBeAg seroconversion. Using random forest method, we further constructed a classifier based on the microbial signature, with area under curve being 0.749 for the test set. Patients who achieved HBeAg seroconversion tended to have lower abundance of certain fecal metabolites such as essential amino acids, and several dipeptides. By analyzing the fecal microbiota from the patients with and without HBeAg seroconversion, we showed intestinal microbiome play a critical role in HBeAg seroconversion induced by oral antiviral therapy. We also identified intestinal microbial signature that is associated with HBeAg seroconversion after oral antiviral therapy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Electronic healthcare records and external outcome data for hospitalized patients with heart failure",
        "link": "https://www.nature.com/articles/s41597-021-00835-9",
        "publication_date": "05 Feb 2021",
        "abstract": "Heart failure is one of the most important reasons for hospitalization among elderly individuals and is associated with significant mortality and morbidity. Epidemiological studies require the establishment of high-quality databases. Several datasets that primarily involve heart failure populations have been established in Western countries and have generated many high-quality studies. However, no such dataset is available from China. Due to differences in genetic background and healthcare systems between China and Western countries, the establishment of a heart failure database for the Chinese population is urgently needed. We performed a retrospective single-center observational study to collect data regarding the characteristics of heart failure patients in China by integrating electronic healthcare records and follow-up outcome data. The study collected information for a total of 2,008 patients with heart failure, containing 166 attributes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Practical prediction model of the clinical response to programmed death-ligand 1 inhibitors in advanced gastric cancer",
        "link": "https://www.nature.com/articles/s12276-021-00559-1",
        "publication_date": "05 Feb 2021",
        "abstract": "The identification of predictive biomarkers or models is necessary for the selection of patients who might benefit the most from immunotherapy. Seven histological features (signet ring cell [SRC], fibrous stroma, myxoid stroma, tumor-infiltrating lymphocytes [TILs], necrosis, tertiary lymphoid follicles, and ulceration) detected in surgically resected tissues (N = 44) were used to train a model. The presence of SRC became an optimal decision parameter for pathology alone (AUC = 0.78). Analysis of differentially expressed genes (DEGs) for the prediction of genomic markers showed that C-X-C motif chemokine ligand 11 (CXCL11) was high in responders (P < 0.001). Immunohistochemistry (IHC) was performed to verify its potential as a biomarker. IHC revealed that the expression of CXCL11 was associated with responsiveness (P = 0.003). The response prediction model was trained by integrating the results of the analysis of pathological factors and RNA sequencing (RNA-seq). When trained with the C5.0 decision tree model, the categorical level of the expression of CXCL11, a single variable, was shown to be the best model (AUC = 0.812). The AUC of the model trained with the random forest was 0.944. Survival analysis revealed that the C5.0-trained model (log-rank P = 0.01 for progression-free survival [PFS]; log-rank P = 0.012 for overall survival [OS]) and the random forest-trained model (log-rank P < 0.001 for PFS; log-rank P = 0.001 for OS) predicted prognosis more accurately than the PD-L1 test (log-rank P = 0.031 for PFS; log-rank P = 0.107 for OS).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Classification of paediatric brain tumours by diffusion weighted imaging and machine learning",
        "link": "https://www.nature.com/articles/s41598-021-82214-3",
        "publication_date": "04 Feb 2021",
        "abstract": "To determine if apparent diffusion coefficients (ADC) can discriminate between posterior fossa brain tumours on a multicentre basis. A total of 124 paediatric patients with posterior fossa tumours (including 55 Medulloblastomas, 36 Pilocytic Astrocytomas and 26 Ependymomas) were scanned using diffusion weighted imaging across 12 different hospitals using a total of 18 different scanners. Apparent diffusion coefficient maps were produced and histogram data was extracted from tumour regions of interest. Total histograms and histogram metrics (mean, variance, skew, kurtosis and 10th, 20th and 50th quantiles) were used as data input for classifiers with accuracy determined by tenfold cross validation. Mean ADC values from the tumour regions of interest differed between tumour types, (ANOVA P < 0.001). A cut off value for mean ADC between Ependymomas and Medulloblastomas was found to be of 0.984 × 10−3 mm2 s−1 with sensitivity 80.8% and specificity 80.0%. Overall classification for the ADC histogram metrics were 85% using Naïve Bayes and 84% for Random Forest classifiers. The most commonly occurring posterior fossa paediatric brain tumours can be classified using Apparent Diffusion Coefficient histogram values to a high accuracy on a multicentre basis.",
        "conclusions": "We have shown in this study that it is possible to discriminate between the three most common types of paediatric posterior fossa brain tumour types using histogram analysis of Apparent Diffusion Coefficient maps in a large cohort of patients acquired on a multi-centre basis.",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A universal molecular prognostic score for gastrointestinal tumors",
        "link": "https://www.nature.com/articles/s41525-021-00172-1",
        "publication_date": "04 Feb 2021",
        "abstract": "Colorectal and gastric cancers are a leading cause of cancer deaths in developed countries. Precise estimation of prognosis is important with regard to clinical decision making for individuals with such cancers. We here comprehensively compiled a complete atlas of prognostic genes based on an integrated meta-analysis of one of the largest assembled colorectal cancer cohorts. A simple yet robust machine learning approach was then applied to establish a universal molecular prognostic score (mPS_colon) that relies on the expression status of only 16 genes and which was validated with independent data sets. This score was found to be an independent prognostic indicator in multivariate models including cancer stage, to be valid independent of tumor characteristics or patient ethnicity, and to be also applicable to gastric cancer. We conclude that mPS_colon is a universal prognostic classifier for patients with gastrointestinal cancers and that it should prove informative for optimization of personalized therapy for such patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Applying artificial intelligence to longitudinal imaging analysis of vestibular schwannoma following radiosurgery",
        "link": "https://www.nature.com/articles/s41598-021-82665-8",
        "publication_date": "04 Feb 2021",
        "abstract": "Artificial intelligence (AI) has been applied with considerable success in the fields of radiology, pathology, and neurosurgery. It is expected that AI will soon be used to optimize strategies for the clinical management of patients based on intensive imaging follow-up. Our objective in this study was to establish an algorithm by which to automate the volumetric measurement of vestibular schwannoma (VS) using a series of parametric MR images following radiosurgery. Based on a sample of 861 consecutive patients who underwent Gamma Knife radiosurgery (GKRS) between 1993 and 2008, the proposed end-to-end deep-learning scheme with automated pre-processing pipeline was applied to a series of 1290 MR examinations (T1W+C, and T2W parametric MR images). All of which were performed under consistent imaging acquisition protocols. The relative volume difference (RVD) between AI-based volumetric measurements and clinical measurements performed by expert radiologists were + 1.74%, − 0.31%, − 0.44%, − 0.19%, − 0.01%, and + 0.26% at each follow-up time point, regardless of the state of the tumor (progressed, pseudo-progressed, or regressed). This study outlines an approach to the evaluation of treatment responses via novel volumetric measurement algorithm, and can be used longitudinally following GKRS for VS. The proposed deep learning AI scheme is applicable to longitudinal follow-up assessments following a variety of therapeutic interventions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Risk factors analysis of COVID-19 patients with ARDS and prediction based on machine learning",
        "link": "https://www.nature.com/articles/s41598-021-82492-x",
        "publication_date": "03 Feb 2021",
        "abstract": "COVID-19 is a newly emerging infectious disease, which is generally susceptible to human beings and has caused huge losses to people's health. Acute respiratory distress syndrome (ARDS) is one of the common clinical manifestations of severe COVID-19 and it is also responsible for the current shortage of ventilators worldwide. This study aims to analyze the clinical characteristics of COVID-19 ARDS patients and establish a diagnostic system based on artificial intelligence (AI) method to predict the probability of ARDS in COVID-19 patients. We collected clinical data of 659 COVID-19 patients from 11 regions in China. The clinical characteristics of the ARDS group and no-ARDS group of COVID-19 patients were elaborately compared and both traditional machine learning algorithms and deep learning-based method were used to build the prediction models. Results indicated that the median age of ARDS patients was 56.5 years old, which was significantly older than those with non-ARDS by 7.5 years. Male and patients with BMI > 25 were more likely to develop ARDS. The clinical features of ARDS patients included cough (80.3%), polypnea (59.2%), lung consolidation (53.9%), secondary bacterial infection (30.3%), and comorbidities such as hypertension (48.7%). Abnormal biochemical indicators such as lymphocyte count, CK, NLR, AST, LDH, and CRP were all strongly related to the aggravation of ARDS. Furthermore, through various AI methods for modeling and prediction effect evaluation based on the above risk factors, decision tree achieved the best AUC, accuracy, sensitivity and specificity in identifying the mild patients who were easy to develop ARDS, which undoubtedly helped to deliver proper care and optimize use of limited resources.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]