[
    {
        "title": "Unraveling cradle-to-grave disease trajectories from multilayer comorbidity networks",
        "link": "https://www.nature.com/articles/s41746-024-01015-w",
        "publication_date": "07 Mar 2024",
        "abstract": "We aim to comprehensively identify typical life-spanning trajectories and critical events that impact patients’ hospital utilization and mortality. We use a unique dataset containing 44 million records of almost all inpatient stays from 2003 to 2014 in Austria to investigate disease trajectories. We develop a new, multilayer disease network approach to quantitatively analyze how cooccurrences of two or more diagnoses form and evolve over the life course of patients. Nodes represent diagnoses in age groups of ten years; each age group makes up a layer of the comorbidity multilayer network. Inter-layer links encode a significant correlation between diagnoses (p < 0.001, relative risk > 1.5), while intra-layers links encode correlations between diagnoses across different age groups. We use an unsupervised clustering algorithm for detecting typical disease trajectories as overlapping clusters in the multilayer comorbidity network. We identify critical events in a patient’s career as points where initially overlapping trajectories start to diverge towards different states. We identified 1260 distinct disease trajectories (618 for females, 642 for males) that on average contain 9 (IQR 2–6) different diagnoses that cover over up to 70 years (mean 23 years). We found 70 pairs of diverging trajectories that share some diagnoses at younger ages but develop into markedly different groups of diagnoses at older ages. The disease trajectory framework can help us to identify critical events as specific combinations of risk factors that put patients at high risk for different diagnoses decades later. Our findings enable a data-driven integration of personalized life-course perspectives into clinical decision-making.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "poisoning"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Uncertainty-aware deep learning for trustworthy prediction of long-term outcome after endovascular thrombectomy",
        "link": "https://www.nature.com/articles/s41598-024-55761-8",
        "publication_date": "06 Mar 2024",
        "abstract": "Acute ischemic stroke (AIS) is a leading global cause of mortality and morbidity. Improving long-term outcome predictions after thrombectomy can enhance treatment quality by supporting clinical decision-making. With the advent of interpretable deep learning methods in recent years, it is now possible to develop trustworthy, high-performing prediction models. This study introduces an uncertainty-aware, graph deep learning model that predicts endovascular thrombectomy outcomes using clinical features and imaging biomarkers. The model targets long-term functional outcomes, defined by the three-month modified Rankin Score (mRS), and mortality rates. A sample of 220 AIS patients in the anterior circulation who underwent endovascular thrombectomy (EVT) was included, with 81 (37%) demonstrating good outcomes (mRS\\(\\le\\)2). The performance of the different algorithms evaluated was comparable, with the maximum validation under the curve (AUC) reaching 0.87 using graph convolutional networks (GCN) for mRS prediction and 0.86 using fully connected networks (FCN) for mortality prediction. Moderate performance was obtained at admission (AUC of 0.76 using GCN), which improved to 0.84 post-thrombectomy and to 0.89 a day after stroke. Reliable uncertainty prediction of the model could be demonstrated.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Investigating the efficacy and importance of mobile-based assessments for Parkinson's disease: uncovering the potential of novel digital tests",
        "link": "https://www.nature.com/articles/s41598-024-55077-7",
        "publication_date": "04 Mar 2024",
        "abstract": "This study introduces PDMotion, a mobile application comprising 11 digital tests, including those adapted from the MDS-Unified Parkinson's Disease Rating Scale (MDS-UPDRS) Part III and novel assessments, for remote Parkinson's Disease (PD) motor symptoms evaluation. Employing machine learning techniques on data from 50 PD patients and 29 healthy controls, PDMotion achieves accuracies of 0.878 for PD status prediction and 0.715 for severity assessment. A post-hoc explanation model is employed to assess the importance of features and tasks in diagnosis and severity evaluation. Notably, novel tasks that are not adapted from MDS-UPDRS Part III like the circle drawing, coordination test, and alternative tapping test are found to be highly important, suggesting digital assessments for PD can go beyond digitizing existing tests. The alternative tapping test emerges as the most significant task. Using its features alone achieves prediction accuracies comparable to the full task set, underscoring its potential as an independent screening tool. This study addresses a notable research gap by digitalizing a wide array of tests, including novel ones, and conducting a comparative analysis of their feature and task importance. These insights provide guidance for task selection and future development in PD mobile assessments, a field previously lacking such comparative studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Electroencephalography-based classification of Alzheimer’s disease spectrum during computer-based cognitive testing",
        "link": "https://www.nature.com/articles/s41598-024-55656-8",
        "publication_date": "04 Mar 2024",
        "abstract": "Alzheimer’s disease (AD) is a progressive disease leading to cognitive decline, and to prevent it, researchers seek to diagnose mild cognitive impairment (MCI) early. Particularly, non-amnestic MCI (naMCI) is often mistaken for normal aging as the representative symptom of AD, memory decline, is absent. Subjective cognitive decline (SCD), an intermediate step between normal aging and MCI, is crucial for prediction or early detection of MCI, which determines the presence of AD spectrum pathology. We developed a computer-based cognitive task to classify the presence or absence of AD pathology and stage within the AD spectrum, and attempted to perform multi-stage classification through electroencephalography (EEG) during resting and memory encoding state. The resting and memory-encoding states of 58 patients (20 with SCD, 10 with naMCI, 18 with aMCI, and 10 with AD) were measured and classified into four groups. We extracted features that could reflect the phase, spectral, and temporal characteristics of the resting and memory-encoding states. For the classification, we compared nine machine learning models and three deep learning models using Leave-one-subject-out strategy. Significant correlations were found between the existing neurophysiological test scores and performance of our computer-based cognitive task for all cognitive domains. In all models used, the memory-encoding states realized a higher classification performance than resting states. The best model for the 4-class classification was cKNN. The highest accuracy using resting state data was 67.24%, while it was 93.10% using memory encoding state data. This study involving participants with SCD, naMCI, aMCI, and AD focused on early Alzheimer’s diagnosis. The research used EEG data during resting and memory encoding states to classify these groups, demonstrating the significance of cognitive process-related brain waves for diagnosis. The computer-based cognitive task introduced in the study offers a time-efficient alternative to traditional neuropsychological tests, showing a strong correlation with their results and serving as a valuable tool to assess cognitive impairment with reduced bias.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring TTN variants as genetic insights into cardiomyopathy pathogenesis and potential emerging clues to molecular mechanisms in cardiomyopathies",
        "link": "https://www.nature.com/articles/s41598-024-56154-7",
        "publication_date": "04 Mar 2024",
        "abstract": "The giant protein titin (TTN) is a sarcomeric protein that forms the myofibrillar backbone for the components of the contractile machinery which plays a crucial role in muscle disorders and cardiomyopathies. Diagnosing TTN pathogenic variants has important implications for patient management and genetic counseling. Genetic testing for TTN variants can help identify individuals at risk for developing cardiomyopathies, allowing for early intervention and personalized treatment strategies. Furthermore, identifying TTN variants can inform prognosis and guide therapeutic decisions. Deciphering the intricate genotype–phenotype correlations between TTN variants and their pathologic traits in cardiomyopathies is imperative for gene-based diagnosis, risk assessment, and personalized clinical management. With the increasing use of next-generation sequencing (NGS), a high number of variants in the TTN gene have been detected in patients with cardiomyopathies. However, not all TTN variants detected in cardiomyopathy cohorts can be assumed to be disease-causing. The interpretation of TTN variants remains challenging due to high background population variation. This narrative review aimed to comprehensively summarize current evidence on TTN variants identified in published cardiomyopathy studies and determine which specific variants are likely pathogenic contributors to cardiomyopathy development.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Real-world testing of an artificial intelligence algorithm for the analysis of chest X-rays in primary care settings",
        "link": "https://www.nature.com/articles/s41598-024-55792-1",
        "publication_date": "03 Mar 2024",
        "abstract": "Interpreting chest X-rays is a complex task, and artificial intelligence algorithms for this purpose are currently being developed. It is important to perform external validations of these algorithms in order to implement them. This study therefore aims to externally validate an AI algorithm’s diagnoses in real clinical practice, comparing them to a radiologist’s diagnoses. The aim is also to identify diagnoses the algorithm may not have been trained for. A prospective observational study for the external validation of the AI algorithm in a region of Catalonia, comparing the AI algorithm’s diagnosis with that of the reference radiologist, considered the gold standard. The external validation was performed with a sample of 278 images and reports, 51.8% of which showed no radiological abnormalities according to the radiologist's report. Analysing the validity of the AI algorithm, the average accuracy was 0.95 (95% CI 0.92; 0.98), the sensitivity was 0.48 (95% CI 0.30; 0.66) and the specificity was 0.98 (95% CI 0.97; 0.99). The conditions where the algorithm was most sensitive were external, upper abdominal and cardiac and/or valvular implants. On the other hand, the conditions where the algorithm was less sensitive were in the mediastinum, vessels and bone. The algorithm has been validated in the primary care setting and has proven to be useful when identifying images with or without conditions. However, in order to be a valuable tool to help and support experts, it requires additional real-world training to enhance its diagnostic capabilities for some of the conditions analysed. Our study emphasizes the need for continuous improvement to ensure the algorithm’s effectiveness in primary care.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Lumbar spine segmentation in MR images: a dataset and a public benchmark",
        "link": "https://www.nature.com/articles/s41597-024-03090-w",
        "publication_date": "02 Mar 2024",
        "abstract": "This paper presents a large publicly available multi-center lumbar spine magnetic resonance imaging (MRI) dataset with reference segmentations of vertebrae, intervertebral discs (IVDs), and spinal canal. The dataset includes 447 sagittal T1 and T2 MRI series from 218 patients with a history of low back pain and was collected from four different hospitals. An iterative data annotation approach was used by training a segmentation algorithm on a small part of the dataset, enabling semi-automatic segmentation of the remaining images. The algorithm provided an initial segmentation, which was subsequently reviewed, manually corrected, and added to the training data. We provide reference performance values for this baseline algorithm and nnU-Net, which performed comparably. Performance values were computed on a sequestered set of 39 studies with 97 series, which were additionally used to set up a continuous segmentation challenge that allows for a fair comparison of different segmentation algorithms. This study may encourage wider collaboration in the field of spine segmentation and improve the diagnostic value of lumbar spine MRI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning-based prediction of post-pancreaticoduodenectomy pancreatic fistula",
        "link": "https://www.nature.com/articles/s41598-024-51777-2",
        "publication_date": "01 Mar 2024",
        "abstract": "Postoperative pancreatic fistula is a life-threatening complication with an unmet need for accurate prediction. This study was aimed to develop preoperative artificial intelligence-based prediction models. Patients who underwent pancreaticoduodenectomy were enrolled and stratified into model development and validation sets by surgery between 2016 and 2017 or in 2018, respectively. Machine learning models based on clinical and body composition data, and deep learning models based on computed tomographic data, were developed, combined by ensemble voting, and final models were selected comparison with earlier model. Among the 1333 participants (training, n = 881; test, n = 452), postoperative pancreatic fistula occurred in 421 (47.8%) and 134 (31.8%) and clinically relevant postoperative pancreatic fistula occurred in 59 (6.7%) and 27 (6.0%) participants in the training and test datasets, respectively. In the test dataset, the area under the receiver operating curve [AUC (95% confidence interval)] of the selected preoperative model for predicting all and clinically relevant postoperative pancreatic fistula was 0.75 (0.71–0.80) and 0.68 (0.58–0.78). The ensemble model showed better predictive performance than the individual ML and DL models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A gut microbial signature for combination immune checkpoint blockade across cancer types",
        "link": "https://www.nature.com/articles/s41591-024-02823-z",
        "publication_date": "01 Mar 2024",
        "abstract": "Immune checkpoint blockade (ICB) targeting programmed cell death protein 1 (PD-1) and cytotoxic T lymphocyte protein 4 (CTLA-4) can induce remarkable, yet unpredictable, responses across a variety of cancers. Studies suggest that there is a relationship between a cancer patient’s gut microbiota composition and clinical response to ICB; however, defining microbiome-based biomarkers that generalize across cohorts has been challenging. This may relate to previous efforts quantifying microbiota to species (or higher taxonomic rank) abundances, whereas microbial functions are often strain specific. Here, we performed deep shotgun metagenomic sequencing of baseline fecal samples from a unique, richly annotated phase 2 trial cohort of patients with diverse rare cancers treated with combination ICB (n = 106 discovery cohort). We demonstrate that strain-resolved microbial abundances improve machine learning predictions of ICB response and 12-month progression-free survival relative to models built using species-rank quantifications or comprehensive pretreatment clinical factors. Through a meta-analysis of gut metagenomes from a further six comparable studies (n = 364 validation cohort), we found cross-cancer (and cross-country) validity of strain–response signatures, but only when the training and test cohorts used concordant ICB regimens (anti-PD-1 monotherapy or combination anti-PD-1 plus anti-CTLA-4). This suggests that future development of gut microbiome diagnostics or therapeutics should be tailored according to ICB treatment regimen rather than according to cancer type.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A phase I/IIa safety and efficacy trial of intratympanic gamma-secretase inhibitor as a regenerative drug treatment for sensorineural hearing loss",
        "link": "https://www.nature.com/articles/s41467-024-45784-0",
        "publication_date": "01 Mar 2024",
        "abstract": "Inhibition of Notch signalling with a gamma-secretase inhibitor (GSI) induces mammalian hair cell regeneration and partial hearing restoration. In this proof-of-concept Phase I/IIa multiple-ascending dose open-label trial (ISRCTN59733689), adults with mild-moderate sensorineural hearing loss received 3 intratympanic injections of GSI LY3056480, in 1 ear over 2 weeks. Phase I primary outcome was safety and tolerability. Phase lla primary outcome was change from baseline to 12 weeks in average pure-tone air conduction threshold across 2,4,8 kHz. Secondary outcomes included this outcome at 6 weeks and change from baseline to 6 and 12 weeks in pure-tone thresholds at individual frequencies, speech reception thresholds (SRTs), Distortion Product Otoacoustic Emissions (DPOAE) amplitudes, Signal to Noise Ratios (SNRs) and distribution of categories normal, present-abnormal, absent and Hearing Handicap Inventory for Adults/Elderly (HHIA/E). In Phase I (N = 15, 1 site) there were no severe nor serious adverse events. In Phase IIa (N = 44, 3 sites) the average pure-tone threshold across 2,4,8 kHz did not change from baseline to 6 and 12 weeks (estimated change −0.87 dB; 95% CI −2.37 to 0.63; P = 0.252 and −0.46 dB; 95% CI −1.94 to 1.03; P = 0.545, respectively), nor did the means of secondary measures. DPOAE amplitudes, SNRs and distribution of categories did not change from baseline to 6 and 12 weeks, nor did SRTs and HHIA/E scores. Intratympanic delivery of LY3056480 is safe and well-tolerated; the trial’s primary endpoint was not met.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Single-cell transcriptomics reveals cell atlas and identifies cycling tumor cells responsible for recurrence in ameloblastoma",
        "link": "https://www.nature.com/articles/s41368-024-00281-4",
        "publication_date": "29 Feb 2024",
        "abstract": "Ameloblastoma is a benign tumor characterized by locally invasive phenotypes, leading to facial bone destruction and a high recurrence rate. However, the mechanisms governing tumor initiation and recurrence are poorly understood. Here, we uncovered cellular landscapes and mechanisms that underlie tumor recurrence in ameloblastoma at single-cell resolution. Our results revealed that ameloblastoma exhibits five tumor subpopulations varying with respect to immune response (IR), bone remodeling (BR), tooth development (TD), epithelial development (ED), and cell cycle (CC) signatures. Of note, we found that CC ameloblastoma cells were endowed with stemness and contributed to tumor recurrence, which was dominated by the EZH2-mediated program. Targeting EZH2 effectively eliminated CC ameloblastoma cells and inhibited tumor growth in ameloblastoma patient-derived organoids. These data described the tumor subpopulation and clarified the identity, function, and regulatory mechanism of CC ameloblastoma cells, providing a potential therapeutic target for ameloblastoma.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automatic assessment of infant carrying and holding using at-home wearable recordings",
        "link": "https://www.nature.com/articles/s41598-024-54536-5",
        "publication_date": "28 Feb 2024",
        "abstract": "Assessing infant carrying and holding (C/H), or physical infant-caregiver interaction, is important for a wide range of contexts in development research. An automated detection and quantification of infant C/H is particularly needed in long term at-home studies where development of infants’ neurobehavior is measured using wearable devices. Here, we first developed a phenomenological categorization for physical infant-caregiver interactions to support five different definitions of C/H behaviors. Then, we trained and assessed deep learning-based classifiers for their automatic detection from multi-sensor wearable recordings that were originally used for mobile assessment of infants’ motor development. Our results show that an automated C/H detection is feasible at few-second temporal accuracy. With the best C/H definition, the automated detector shows 96% accuracy and 0.56 kappa, which is slightly less than the video-based inter-rater agreement between trained human experts (98% accuracy, 0.77 kappa). The classifier performance varies with C/H definition reflecting the extent to which infants’ movements are present in each C/H variant. A systematic benchmarking experiment shows that the widely used actigraphy-based method ignores the normally occurring C/H behaviors. Finally, we show proof-of-concept for the utility of the novel classifier in studying C/H behavior across infant development. Particularly, we show that matching the C/H detections to individuals’ gross motor ability discloses novel insights to infant-parent interaction.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of a deep learning model that predicts critical events of pediatric patients admitted to general wards",
        "link": "https://www.nature.com/articles/s41598-024-55528-1",
        "publication_date": "27 Feb 2024",
        "abstract": "Early detection of deteriorating patients is important to prevent life-threatening events and improve clinical outcomes. Efforts have been made to detect or prevent major events such as cardiopulmonary resuscitation, but previously developed tools are often complicated and time-consuming, rendering them impractical. To overcome this problem, we designed this study to create a deep learning prediction model that predicts critical events with simplified variables. This retrospective observational study included patients under the age of 18 who were admitted to the general ward of a tertiary children’s hospital between 2020 and 2022. A critical event was defined as cardiopulmonary resuscitation, unplanned transfer to the intensive care unit, or mortality. The vital signs measured during hospitalization, their measurement intervals, sex, and age were used to train a critical event prediction model. Age-specific z-scores were used to normalize the variability of the normal range by age. The entire dataset was classified into a training dataset and a test dataset at an 8:2 ratio, and model learning and testing were performed on each dataset. The predictive performance of the developed model showed excellent results, with an area under the receiver operating characteristics curve of 0.986 and an area under the precision-recall curve of 0.896. We developed a deep learning model with outstanding predictive power using simplified variables to effectively predict critical events while reducing the workload of medical staff. Nevertheless, because this was a single-center trial, no external validation was carried out, prompting further investigation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning infers clinically relevant protein levels and drug response in breast cancer from unannotated pathology images",
        "link": "https://www.nature.com/articles/s41523-024-00620-y",
        "publication_date": "27 Feb 2024",
        "abstract": "The computational pathology has been demonstrated to effectively uncover tumor-related genomic alterations and transcriptomic patterns. Although proteomics has indeed shown great potential in the field of precision medicine, few studies have focused on the computational prediction of protein levels from pathology images. In this paper, we assume that deep learning-based pathological features imply the protein levels of tumor biomarkers that are indicative of prognosis and drug response. For this purpose, we propose wsi2rppa, a weakly supervised contrastive learning framework to infer the protein levels of tumor biomarkers from whole slide images (WSIs) in breast cancer. We first conducted contrastive learning-based pre-training on tessellated tiles to extract pathological features, which are then aggregated by attention pooling and adapted to downstream tasks. We conducted extensive evaluation experiments on the TCGA-BRCA cohort (1978 WSIs of 1093 patients with protein levels of 223 biomarkers) and the CPTAC-BRCA cohort (642 WSIs of 134 patients). The results showed that our method achieved state-of-the-art performance in tumor diagnostic tasks, and also performed well in predicting clinically relevant protein levels and drug response. To show the model interpretability, we spatially visualized the WSIs colored the tiles by their attention scores, and found that the regions with high scores were highly consistent with the tumor and necrotic regions annotated by a 10-year experienced pathologist. Moreover, spatial transcriptomic data further verified that the heatmap generated by attention scores agrees greatly with the spatial expression landscape of two typical tumor biomarker genes. In predicting the response to drug trastuzumab treatment, our method achieved a 0.79 AUC value which is much higher than the previous study reported 0.68. These findings showed the remarkable potential of computational pathology in the prediction of clinically relevant protein levels, drug response, and clinical outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multi-night cortico-basal recordings reveal mechanisms of NREM slow-wave suppression and spontaneous awakenings in Parkinson’s disease",
        "link": "https://www.nature.com/articles/s41467-024-46002-7",
        "publication_date": "27 Feb 2024",
        "abstract": "Sleep disturbance is a prevalent and disabling comorbidity in Parkinson’s disease (PD). We performed multi-night (n = 57) at-home intracranial recordings from electrocorticography and subcortical electrodes using sensing-enabled Deep Brain Stimulation (DBS), paired with portable polysomnography in four PD participants and one with cervical dystonia (clinical trial: NCT03582891). Cortico-basal activity in delta increased and in beta decreased during NREM (N2 + N3) versus wakefulness in PD. DBS caused further elevation in cortical delta and decrease in alpha and low-beta compared to DBS OFF state. Our primary outcome demonstrated an inverse interaction between subcortical beta and cortical slow-wave during NREM. Our secondary outcome revealed subcortical beta increases prior to spontaneous awakenings in PD. We classified NREM vs. wakefulness with high accuracy in both traditional (30 s: 92.6 ± 1.7%) and rapid (5 s: 88.3 ± 2.1%) data epochs of intracranial signals. Our findings elucidate sleep neurophysiology and impacts of DBS on sleep in PD informing adaptive DBS for sleep dysfunction.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Adapted large language models can outperform medical experts in clinical text summarization",
        "link": "https://www.nature.com/articles/s41591-024-02855-5",
        "publication_date": "27 Feb 2024",
        "abstract": "Analyzing vast textual data and summarizing key information from electronic health records imposes a substantial burden on how clinicians allocate their time. Although large language models (LLMs) have shown promise in natural language processing (NLP) tasks, their effectiveness on a diverse range of clinical summarization tasks remains unproven. Here we applied adaptation methods to eight LLMs, spanning four distinct clinical summarization tasks: radiology reports, patient questions, progress notes and doctor–patient dialogue. Quantitative assessments with syntactic, semantic and conceptual NLP metrics reveal trade-offs between models and adaptation methods. A clinical reader study with 10 physicians evaluated summary completeness, correctness and conciseness; in most cases, summaries from our best-adapted LLMs were deemed either equivalent (45%) or superior (36%) compared with summaries from medical experts. The ensuing safety analysis highlights challenges faced by both LLMs and medical experts, as we connect errors to potential medical harm and categorize types of fabricated information. Our research provides evidence of LLMs outperforming medical experts in clinical text summarization across multiple tasks. This suggests that integrating LLMs into clinical workflows could alleviate documentation burden, allowing clinicians to focus more on patient care.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The value of five scoring systems in predicting the prognosis of patients with sepsis-associated acute respiratory failure",
        "link": "https://www.nature.com/articles/s41598-024-55257-5",
        "publication_date": "27 Feb 2024",
        "abstract": "Our study aimed to identify the optimal scoring system for predicting the prognosis of patients with sepsis-associated acute respiratory failure (SA-ARF). All data were taken from the fourth version of the Markets in Intensive Care Medicine (MIMIC-IV) database. Independent risk factors for death in hospitals were confirmed by regression analysis. The predictive value of the five scoring systems was evaluated by receiving operating characteristic (ROC) curves. Kaplan‒Meier curves showed the impact of acute physiology score III (APSIII) on survival and prognosis in patients with SA-ARF. Decision curve analysis (DCA) identified a scoring system with the highest net clinical benefit. ROC curve analysis showed that APS III (AUC: 0.755, 95% Cl 0.714–0.768) and Logical Organ Dysfunction System (LODS) (AUC: 0.731, 95% Cl 0.717–0.7745) were better than Simplified Acute Physiology Score II (SAPS II) (AUC: 0.727, 95% CI 0.713–0.741), Oxford Acute Severity of Illness Score (OASIS) (AUC: 0.706, 95% CI 0.691–0.720) and Sequential Organ Failure Assessment (SOFA) (AUC: 0.606, 95% CI 0.590–0.621) in assessing in-hospital mortality. Kaplan‒Meier survival analysis patients in the high-APS III score group had a considerably poorer median survival time. The DCA curve showed that APS III may provide better clinical benefits for patients. We demonstrated that the APS III score is an excellent predictor of in-hospital mortality.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploiting macro- and micro-structural brain changes for improved Parkinson’s disease classification from MRI data",
        "link": "https://www.nature.com/articles/s41531-024-00647-9",
        "publication_date": "26 Feb 2024",
        "abstract": "Parkinson’s disease (PD) is the second most common neurodegenerative disease. Accurate PD diagnosis is crucial for effective treatment and prognosis but can be challenging, especially at early disease stages. This study aimed to develop and evaluate an explainable deep learning model for PD classification from multimodal neuroimaging data. The model was trained using one of the largest collections of T1-weighted and diffusion-tensor magnetic resonance imaging (MRI) datasets. A total of 1264 datasets from eight different studies were collected, including 611 PD patients and 653 healthy controls (HC). These datasets were pre-processed and non-linearly registered to the MNI PD25 atlas. Six imaging maps describing the macro- and micro-structural integrity of brain tissues complemented with age and sex parameters were used to train a convolutional neural network (CNN) to classify PD/HC subjects. Explainability of the model’s decision-making was achieved using SmoothGrad saliency maps, highlighting important brain regions. The CNN was trained using a 75%/10%/15% train/validation/test split stratified by diagnosis, sex, age, and study, achieving a ROC-AUC of 0.89, accuracy of 80.8%, specificity of 82.4%, and sensitivity of 79.1% on the test set. Saliency maps revealed that diffusion tensor imaging data, especially fractional anisotropy, was more important for the classification than T1-weighted data, highlighting subcortical regions such as the brainstem, thalamus, amygdala, hippocampus, and cortical areas. The proposed model, trained on a large multimodal MRI database, can classify PD patients and HC subjects with high accuracy and clinically reasonable explanations, suggesting that micro-structural brain changes play an essential role in the disease course.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Digital pathology-based artificial intelligence models for differential diagnosis and prognosis of sporadic odontogenic keratocysts",
        "link": "https://www.nature.com/articles/s41368-024-00287-y",
        "publication_date": "26 Feb 2024",
        "abstract": "Odontogenic keratocyst (OKC) is a common jaw cyst with a high recurrence rate. OKC combined with basal cell carcinoma as well as skeletal and other developmental abnormalities is thought to be associated with Gorlin syndrome. Moreover, OKC needs to be differentiated from orthokeratinized odontogenic cyst and other jaw cysts. Because of the different prognosis, differential diagnosis of several cysts can contribute to clinical management. We collected 519 cases, comprising a total of 2 157 hematoxylin and eosin-stained images, to develop digital pathology-based artificial intelligence (AI) models for the diagnosis and prognosis of OKC. The Inception_v3 neural network was utilized to train and test models developed from patch-level images. Finally, whole slide image-level AI models were developed by integrating deep learning-generated pathology features with several machine learning algorithms. The AI models showed great performance in the diagnosis (AUC = 0.935, 95% CI: 0.898–0.973) and prognosis (AUC = 0.840, 95%CI: 0.751–0.930) of OKC. The advantages of multiple slides model for integrating of histopathological information are demonstrated through a comparison with the single slide model. Furthermore, the study investigates the correlation between AI features generated by deep learning and pathological findings, highlighting the interpretative potential of AI models in the pathology. Here, we have developed the robust diagnostic and prognostic models for OKC. The AI model that is based on digital pathology shows promise potential for applications in odontogenic diseases of the jaw.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automated neonatal nnU-Net brain MRI extractor trained on a large multi-institutional dataset",
        "link": "https://www.nature.com/articles/s41598-024-54436-8",
        "publication_date": "26 Feb 2024",
        "abstract": "Brain extraction, or skull-stripping, is an essential data preprocessing step for machine learning approaches to brain MRI analysis. Currently, there are limited extraction algorithms for the neonatal brain. We aim to adapt an established deep learning algorithm for the automatic segmentation of neonatal brains from MRI, trained on a large multi-institutional dataset for improved generalizability across image acquisition parameters. Our model, ANUBEX (automated neonatal nnU-Net brain MRI extractor), was designed using nnU-Net and was trained on a subset of participants (N = 433) enrolled in the High-dose Erythropoietin for Asphyxia and Encephalopathy (HEAL) study. We compared the performance of our model to five publicly available models (BET, BSE, CABINET, iBEATv2, ROBEX) across conventional and machine learning methods, tested on two public datasets (NIH and dHCP). We found that our model had a significantly higher Dice score on the aggregate of both data sets and comparable or significantly higher Dice scores on the NIH (low-resolution) and dHCP (high-resolution) datasets independently. ANUBEX performs similarly when trained on sequence-agnostic or motion-degraded MRI, but slightly worse on preterm brains. In conclusion, we created an automatic deep learning-based neonatal brain extraction algorithm that demonstrates accurate performance with both high- and low-resolution MRIs with fast computation time.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The Dresden in vivo OCT dataset for automatic middle ear segmentation",
        "link": "https://www.nature.com/articles/s41597-024-03000-0",
        "publication_date": "26 Feb 2024",
        "abstract": "Endoscopic optical coherence tomography (OCT) offers a non-invasive approach to perform the morphological and functional assessment of the middle ear in vivo. However, interpreting such OCT images is challenging and time-consuming due to the shadowing of preceding structures. Deep neural networks have emerged as a promising tool to enhance this process in multiple aspects, including segmentation, classification, and registration. Nevertheless, the scarcity of annotated datasets of OCT middle ear images poses a significant hurdle to the performance of neural networks. We introduce the Dresden in vivo OCT Dataset of the Middle Ear (DIOME) featuring 43 OCT volumes from both healthy and pathological middle ears of 29 subjects. DIOME provides semantic segmentations of five crucial anatomical structures (tympanic membrane, malleus, incus, stapes and promontory), and sparse landmarks delineating the salient features of the structures. The availability of these data facilitates the training and evaluation of algorithms regarding various analysis tasks with middle ear OCT images, e.g. diagnostics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Investigation of factors regarding the effects of COVID-19 pandemic on college students’ depression by quantum annealer",
        "link": "https://www.nature.com/articles/s41598-024-54533-8",
        "publication_date": "26 Feb 2024",
        "abstract": "Diverse cases regarding the impact, with its related factors, of the COVID-19 pandemic on mental health have been reported in previous studies. In this study, multivariable datasets were collected from 751 college students who could be easily affected by pandemics based on the complex relationships between various mental health factors. We utilized quantum annealing (QA)-based feature selection algorithms that were executed by commercial D-Wave quantum computers to determine the changes in the relative importance of the associated factors before and after the pandemic. Multivariable linear regression (MLR) and XGBoost models were also applied to validate the QA-based algorithms. Based on the experimental results, we confirm that QA-based algorithms have comparable capabilities in factor analysis research to the MLR models that have been widely used in previous studies. Furthermore, the performance of the QA-based algorithms was validated through the important factor results from the algorithms. Pandemic-related factors (e.g., confidence in the social system) and psychological factors (e.g. decision-making in uncertain situations) were more important in post-pandemic conditions. Although the results should be validated using other mental health variables or national datasets, this study will serve as a reference for researchers regarding the use of the quantum annealing approach in factor analysis with validation through real-world survey dataset analysis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Radiomics for residual tumour detection and prognosis in newly diagnosed glioblastoma based on postoperative [11C] methionine PET and T1c-w MRI",
        "link": "https://www.nature.com/articles/s41598-024-55092-8",
        "publication_date": "25 Feb 2024",
        "abstract": "Personalized treatment strategies based on non-invasive biomarkers have potential to improve patient management in patients with newly diagnosed glioblastoma (GBM). The residual tumour burden after surgery in GBM patients is a prognostic imaging biomarker. However, in clinical patient management, its assessment is a manual and time-consuming process that is at risk of inter-rater variability. Furthermore, the prediction of patient outcome prior to radiotherapy may identify patient subgroups that could benefit from escalated radiotherapy doses. Therefore, in this study, we investigate the capabilities of traditional radiomics and 3D convolutional neural networks for automatic detection of the residual tumour status and to prognosticate time-to-recurrence (TTR) and overall survival (OS) in GBM using postoperative [11C] methionine positron emission tomography (MET-PET) and gadolinium-enhanced T1-w magnetic resonance imaging (MRI). On the independent test data, the 3D-DenseNet model based on MET-PET achieved the best performance for residual tumour detection, while the logistic regression model with conventional radiomics features performed best for T1c-w MRI (AUC: MET-PET 0.95, T1c-w MRI 0.78). For the prognosis of TTR and OS, the 3D-DenseNet model based on MET-PET integrated with age and MGMT status achieved the best performance (Concordance-Index: TTR 0.68, OS 0.65). In conclusion, we showed that both deep-learning and conventional radiomics have potential value for supporting image-based assessment and prognosis in GBM. After prospective validation, these models may be considered for treatment personalization.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prevalence and risk factors analysis of postpartum depression at early stage using hybrid deep learning model",
        "link": "https://www.nature.com/articles/s41598-024-54927-8",
        "publication_date": "24 Feb 2024",
        "abstract": "Postpartum Depression Disorder (PPDD) is a prevalent mental health condition and results in severe depression and suicide attempts in the social community. Prompt actions are crucial in tackling PPDD, which requires a quick recognition and accurate analysis of the probability factors associated with this condition. This concern requires attention. The primary aim of our research is to investigate the feasibility of anticipating an individual's mental state by categorizing individuals with depression from those without depression using a dataset consisting of text along with audio recordings from patients diagnosed with PPDD. This research proposes a hybrid PPDD framework that combines Improved Bi-directional Long Short-Term Memory (IBi-LSTM) with Transfer Learning (TL) based on two Convolutional Neural Network (CNN) architectures, respectively CNN-text and CNN audio. In the proposed model, the CNN section efficiently utilizes TL to obtain crucial knowledge from text and audio characteristics, whereas the improved Bi-LSTM module combines written material and sound data to obtain intricate chronological interpersonal relationships. The proposed model incorporates an attention technique to augment the effectiveness of the Bi-LSTM scheme. An experimental analysis is conducted on the PPDD online textual and speech audio dataset collected from UCI. It includes textual features such as age, women's health tracks, medical histories, demographic information, daily life metrics, psychological evaluations, and ‘speech records’ of PPDD patients. Data pre-processing is applied to maintain the data integrity and achieve reliable model performance. The proposed model demonstrates a great performance in better precision, recall, accuracy, and F1-score over existing deep learning models, including VGG-16, Base-CNN, and CNN-LSTM. These metrics indicate the model's ability to differentiate among women at risk of PPDD vs. non-PPDD. In addition, the feature importance analysis demonstrates that specific risk factors substantially impact the prediction of PPDD. The findings of this research establish a basis for improved precision and promptness in assessing the risk of PPDD, which may ultimately result in earlier implementation of interventions and the establishment of support networks for women who are susceptible to PPDD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Understanding the capacity of children with congenital unilateral below-elbow deficiency to actuate their affected muscles",
        "link": "https://www.nature.com/articles/s41598-024-54952-7",
        "publication_date": "24 Feb 2024",
        "abstract": "In recent years, commercially available dexterous upper limb prostheses for children have begun to emerge. These devices derive control signals from surface electromyography (measure of affected muscle electrical activity, sEMG) to drive a variety of grasping motions. However, the ability for children with congenital upper limb deficiency to actuate their affected muscles to achieve naturalistic prosthetic control is not well understood, as compared to adults or children with acquired hand loss. To address this gap, we collected sEMG data from 9 congenital one-handed participants ages 8–20 years as they envisioned and attempted to perform 10 different movements with their missing hands. Seven sEMG electrodes were adhered circumferentially around the participant’s affected and unaffected limbs and participants mirrored the attempted missing hand motions with their intact side. To analyze the collected sEMG data, we used time and frequency domain analyses. We found that for the majority of participants, attempted hand movements produced detectable and consistent muscle activity, and the capacity to achieve this was not dissimilar across the affected and unaffected sides. These data suggest that children with congenital hand absence retain a degree of control over their affected muscles, which has important implications for translating and refining advanced prosthetic control technologies for children.",
        "conclusions": "We have shown in a limited cohort of children with UCBED that they possess a degree of biological control over their affected muscles with the ability to perform consistent and distinguishable hand movements. However, not all participants were able to achieve this degree of biological control over their affected muscles which may have been attributed to age and limb size, since cognitive demands and robust musculature are important to achieve meaningful muscle activation. A limitation of this study that could have affected the results was that we did not have a cohort of age- and sex-matched able-bodied participants to serve as a ground truth control for typical muscle excitation. Nevertheless, the participants underwent typical development and maturation, aside from their affected limb, allowing their unaffected limb to serve as an internal control for comparison. Our findings also suggest that children with UCBED may have the ability to use advanced prosthesis control systems. However, further work is needed to examine age and limb size with larger cohorts and more statistical power to effectively adapt, translate, and prescribe dexterous prostheses to the pediatric population. The bulk of literature for dexterous upper limb prosthetic devices is saturated in adult-based control systems using sEMG. Very limited success has been found in prior studies with UCBED cohorts11,12. Moreover, these studies either did not investigate populations of children or simply applied commercially available control systems that were built on research and refinement in populations with acquired amputations. Our work shows distinguishable and consistent patterns of muscle excitation in children with UCBED when they attempt to perform hand movements. We suggest that these findings warrant further investigation into techniques to best tune, adapt, and leverage existing advanced control techniques, such that they may be most effective in meeting the unique demand of children, most of whom will have a congenital upper limb absence2.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Performance evaluation of a deep learning model for automatic detection and localization of idiopathic osteosclerosis on dental panoramic radiographs",
        "link": "https://www.nature.com/articles/s41598-024-55109-2",
        "publication_date": "23 Feb 2024",
        "abstract": "Idiopathic osteosclerosis (IO) are focal radiopacities of unknown etiology observed in the jaws. These radiopacities are incidentally detected on dental panoramic radiographs taken for other reasons. In this study, we investigated the performance of a deep learning model in detecting IO using a small dataset of dental panoramic radiographs with varying contrasts and features. Two radiologists collected 175 IO-diagnosed dental panoramic radiographs from the dental school database. The dataset size is limited due to the rarity of IO, with its incidence in the Turkish population reported as 2.7% in studies. To overcome this limitation, data augmentation was performed by horizontally flipping the images, resulting in an augmented dataset of 350 panoramic radiographs. The images were annotated by two radiologists and divided into approximately 70% for training (245 radiographs), 15% for validation (53 radiographs), and 15% for testing (52 radiographs). The study employing the YOLOv5 deep learning model evaluated the results using precision, recall, F1-score, mAP (mean Average Precision), and average inference time score metrics. The training and testing processes were conducted on the Google Colab Pro virtual machine. The test process's performance criteria were obtained with a precision value of 0.981, a recall value of 0.929, an F1-score value of 0.954, and an average inference time of 25.4 ms. Although radiographs diagnosed with IO have a small dataset and exhibit different contrasts and features, it has been observed that the deep learning model provides high detection speed, accuracy, and localization results. The automatic identification of IO lesions using artificial intelligence algorithms, with high success rates, can contribute to the clinical workflow of dentists by preventing unnecessary biopsy procedure.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Concordance of randomised controlled trials for artificial intelligence interventions with the CONSORT-AI reporting guidelines",
        "link": "https://www.nature.com/articles/s41467-024-45355-3",
        "publication_date": "22 Feb 2024",
        "abstract": "The Consolidated Standards of Reporting Trials extension for Artificial Intelligence interventions (CONSORT-AI) was published in September 2020. Since its publication, several randomised controlled trials (RCTs) of AI interventions have been published but their completeness and transparency of reporting is unknown. This systematic review assesses the completeness of reporting of AI RCTs following publication of CONSORT-AI and provides a comprehensive summary of RCTs published in recent years. 65 RCTs were identified, mostly conducted in China (37%) and USA (18%). Median concordance with CONSORT-AI reporting was 90% (IQR 77–94%), although only 10 RCTs explicitly reported its use. Several items were consistently under-reported, including algorithm version, accessibility of the AI intervention or code, and references to a study protocol. Only 3 of 52 included journals explicitly endorsed or mandated CONSORT-AI. Despite a generally high concordance amongst recent AI RCTs, some AI-specific considerations remain systematically poorly reported. Further encouragement of CONSORT-AI adoption by journals and funders may enable more complete adoption of the full CONSORT-AI guidelines.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Fetal face shape analysis from prenatal 3D ultrasound images",
        "link": "https://www.nature.com/articles/s41598-023-50386-9",
        "publication_date": "22 Feb 2024",
        "abstract": "3D ultrasound imaging of fetal faces has been predominantly confined to qualitative assessment. Many genetic conditions evade diagnosis and identification could assist with parental counselling, pregnancy management and neonatal care planning. We describe a methodology to build a shape model of the third trimester fetal face from 3D ultrasound and show how it can objectively describe morphological features and gestational-age related changes of normal fetal faces. 135 fetal face 3D ultrasound volumes (117 appropriately grown, 18 growth-restricted) of 24-34 weeks gestation were included. A 3D surface model of each face was obtained using a semi-automatic segmentation workflow. Size normalisation and rescaling was performed using a growth model giving the average size at every gestation. The model demonstrated a similar growth rate to standard head circumference reference charts. A landmark-free morphometry model was estimated to characterize shape differences using non-linear deformations of an idealized template face. Advancing gestation is associated with widening/fullness of the cheeks, contraction of the chin and deepening of the eyes. Fetal growth restriction is associated with a smaller average facial size but no morphological differences. This model may eventually be used as a reference to assist in the prenatal diagnosis of congenital anomalies with characteristic facial dysmorphisms.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Plaque heterogeneity and the spatial distributions of its components dictate drug-coated balloon therapy",
        "link": "https://www.nature.com/articles/s41598-024-54756-9",
        "publication_date": "22 Feb 2024",
        "abstract": "Drug-coated balloon (DCB) angioplasty is one of the potential approaches to alleviating in-stent restenosis and treating peripheral artery disease. An in-silico model has been developed for sirolimus drug eluted from an inflated balloon in a patient-specific arterial cross-section consisting of fibrous tissue, fibrofatty tissue, dense calcium, necrotic core, and healthy tissue. The convection-diffusion-reaction equation represents the transport of drug, while drug binding, both specific and non-specific, can be modelled as a reaction process. The Brinkman equations describe the interstitial flow in porous tissue. An image processing technique is leveraged for reconstructing the computational domain. The Marker and Cell, and Immersed Boundary Methods are used to solve the set of governing equations. The no-flux interface condition and convection do amplify the tissue content, and the regions of dense calcium and necrotic core limited to or extremely close to the interface pose a clinical threat to DCB therapy. Simulations predict the effects of the positioning and clustering of plaque components in the domain. This study demands extensive intravascular ultrasound-derived virtual histology (VH-IVUS) imaging to understand the plaque morphology and determine the relative positions of different plaque compositions about the lumen-tissue interface, which have a significant impact on arterial pharmacokinetics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Ethnicity data resource in population-wide health records: completeness, coverage and granularity of diversity",
        "link": "https://www.nature.com/articles/s41597-024-02958-1",
        "publication_date": "22 Feb 2024",
        "abstract": "Intersectional social determinants including ethnicity are vital in health research. We curated a population-wide data resource of self-identified ethnicity data from over 60 million individuals in England primary care, linking it to hospital records. We assessed ethnicity data in terms of completeness, consistency, and granularity and found one in ten individuals do not have ethnicity information recorded in primary care. By linking to hospital records, ethnicity data were completed for 94% of individuals. By reconciling SNOMED-CT concepts and census-level categories into a consistent hierarchy, we organised more than 250 ethnicity sub-groups including and beyond “White”, “Black”, “Asian”, “Mixed” and “Other, and found them to be distributed in proportions similar to the general population. This large observational dataset presents an algorithmic hierarchy to represent self-identified ethnicity data collected across heterogeneous healthcare settings. Accurate and easily accessible ethnicity data can lead to a better understanding of population diversity, which is important to address disparities and influence policy recommendations that can translate into better, fairer health for all.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of a 3D tracking system for multiple marmosets under free-moving conditions",
        "link": "https://www.nature.com/articles/s42003-024-05864-9",
        "publication_date": "21 Feb 2024",
        "abstract": "Assessment of social interactions and behavioral changes in nonhuman primates is useful for understanding brain function changes during life events and pathogenesis of neurological diseases. The common marmoset (Callithrix jacchus), which lives in a nuclear family like humans, is a useful model, but longitudinal automated behavioral observation of multiple animals has not been achieved. Here, we developed a Full Monitoring and Animal Identification (FulMAI) system for longitudinal detection of three-dimensional (3D) trajectories of each individual in multiple marmosets under free-moving conditions by combining video tracking, Light Detection and Ranging, and deep learning. Using this system, identification of each animal was more than 97% accurate. Location preferences and inter-individual distance could be calculated, and deep learning could detect grooming behavior. The FulMAI system allows us to analyze the natural behavior of individuals in a family over their lifetime and understand how behavior changes due to life events together with other data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Data encoding for healthcare data democratization and information leakage prevention",
        "link": "https://www.nature.com/articles/s41467-024-45777-z",
        "publication_date": "21 Feb 2024",
        "abstract": "The lack of data democratization and information leakage from trained models hinder the development and acceptance of robust deep learning-based healthcare solutions. This paper argues that irreversible data encoding can provide an effective solution to achieve data democratization without violating the privacy constraints imposed on healthcare data and clinical models. An ideal encoding framework transforms the data into a new space where it is imperceptible to a manual or computational inspection. However, encoded data should preserve the semantics of the original data such that deep learning models can be trained effectively. This paper hypothesizes the characteristics of the desired encoding framework and then exploits random projections and random quantum encoding to realize this framework for dense and longitudinal or time-series data. Experimental evaluation highlights that models trained on encoded time-series data effectively uphold the information bottleneck principle and hence, exhibit lesser information leakage from trained models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Construction and optimization of multi-platform precision pathways for precision medicine",
        "link": "https://www.nature.com/articles/s41598-024-54517-8",
        "publication_date": "21 Feb 2024",
        "abstract": "In the enduring challenge against disease, advancements in medical technology have empowered clinicians with novel diagnostic platforms. Whilst in some cases, a single test may provide a confident diagnosis, often additional tests are required. However, to strike a balance between diagnostic accuracy and cost-effectiveness, one must rigorously construct the clinical pathways. Here, we developed a framework to build multi-platform precision pathways in an automated, unbiased way, recommending the key steps a clinician would take to reach a diagnosis. We achieve this by developing a confidence score, used to simulate a clinical scenario, where at each stage, either a confident diagnosis is made, or another test is performed. Our framework provides a range of tools to interpret, visualize and compare the pathways, improving communication and enabling their evaluation on accuracy and cost, specific to different contexts. This framework will guide the development of novel diagnostic pathways for different diseases, accelerating the implementation of precision medicine into clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Endothelium-related biomarkers enhanced prediction of kidney support therapy in critically ill patients with non-oliguric acute kidney injury",
        "link": "https://www.nature.com/articles/s41598-024-54926-9",
        "publication_date": "21 Feb 2024",
        "abstract": "Acute kidney injury (AKI) is a common condition in hospitalized patients who often requires kidney support therapy (KST). However, predicting the need for KST in critically ill patients remains challenging. This study aimed to analyze endothelium-related biomarkers as predictors of KST need in critically ill patients with stage 2 AKI. A prospective observational study was conducted on 127 adult ICU patients with stage 2 AKI by serum creatinine only. Endothelium-related biomarkers, including vascular cell adhesion protein-1 (VCAM-1), angiopoietin (AGPT) 1 and 2, and syndecan-1, were measured. Clinical parameters and outcomes were recorded. Logistic regression models, receiver operating characteristic (ROC) curves, continuous net reclassification improvement (NRI) and integrated discrimination improvement (IDI) were used for analysis. Among the patients, 22 (17.2%) required KST within 72 h. AGPT2 and syndecan-1 levels were significantly greater in patients who progressed to the KST. Multivariate analysis revealed that AGPT2 and syndecan-1 were independently associated with the need for KST. The area under the ROC curve (AUC-ROC) for AGPT2 and syndecan-1 performed better than did the constructed clinical model in predicting KST. The combination of AGPT2 and syndecan-1 improved the discrimination capacity of predicting KST beyond that of the clinical model alone. Additionally, this combination improved the classification accuracy of the NRI and IDI. AGPT2 and syndecan-1 demonstrated predictive value for the need for KST in critically ill patients with stage 2 AKI. The combination of AGPT2 and syndecan-1 alone enhanced the predictive capacity of predicting KST beyond clinical variables alone. These findings may contribute to the early identification of patients who will benefit from KST and aid in the management of AKI in critically ill patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Leveraging electronic health records and knowledge networks for Alzheimer’s disease prediction and sex-specific biological insights",
        "link": "https://www.nature.com/articles/s43587-024-00573-8",
        "publication_date": "21 Feb 2024",
        "abstract": "Identification of Alzheimer’s disease (AD) onset risk can facilitate interventions before irreversible disease progression. We demonstrate that electronic health records from the University of California, San Francisco, followed by knowledge networks (for example, SPOKE) allow for (1) prediction of AD onset and (2) prioritization of biological hypotheses, and (3) contextualization of sex dimorphism. We trained random forest models and predicted AD onset on a cohort of 749 individuals with AD and 250,545 controls with a mean area under the receiver operating characteristic of 0.72 (7 years prior) to 0.81 (1 day prior). We further harnessed matched cohort models to identify conditions with predictive power before AD onset. Knowledge networks highlight shared genes between multiple top predictors and AD (for example, APOE, ACTB, IL6 and INS). Genetic colocalization analysis supports AD association with hyperlipidemia at the APOE locus, as well as a stronger female AD association with osteoporosis at a locus near MS4A6A. We therefore show how clinical data can be utilized for early AD prediction and identification of personalized biological hypotheses.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring the impact of stage and tumor site on colorectal cancer survival: Bayesian survival modeling",
        "link": "https://www.nature.com/articles/s41598-024-54943-8",
        "publication_date": "21 Feb 2024",
        "abstract": "Colorectal cancer is a prevalent malignancy with global significance. This retrospective study aimed to investigate the influence of stage and tumor site on survival outcomes in 284 colorectal cancer patients diagnosed between 2001 and 2017. Patients were categorized into four groups based on tumor site (colon and rectum) and disease stage (early stage and advanced stage). Demographic characteristics, treatment modalities, and survival outcomes were recorded. Bayesian survival modeling was performed using semi-competing risks illness-death models with an accelerated failure time (AFT) approach, utilizing R 4.1 software. Results demonstrated significantly higher time ratios for disease recurrence (TR = 1.712, 95% CI 1.489–2.197), mortality without recurrence (TR = 1.933, 1.480–2.510), and mortality after recurrence (TR = 1.847, 1.147–2.178) in early-stage colon cancer compared to early-stage rectal cancer. Furthermore, patients with advanced-stage rectal cancer exhibited shorter survival times for disease recurrence than patients with early-stage colon cancer. The interaction effect between the disease site and cancer stage was not significant. These findings, derived from the optimal Bayesian log-normal model for terminal and non-terminal events, highlight the importance of early detection and effective management strategies for colon cancer. Early-stage colon cancer demonstrated improved survival rates for disease recurrence, mortality without recurrence, and mortality after recurrence compared to other stages. Early intervention and comprehensive care are crucial to enhance prognosis and minimize adverse events in colon cancer patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Biomimetic computer-to-brain communication enhancing naturalistic touch sensations via peripheral nerve stimulation",
        "link": "https://www.nature.com/articles/s41467-024-45190-6",
        "publication_date": "20 Feb 2024",
        "abstract": "Artificial communication with the brain through peripheral nerve stimulation shows promising results in individuals with sensorimotor deficits. However, these efforts lack an intuitive and natural sensory experience. In this study, we design and test a biomimetic neurostimulation framework inspired by nature, capable of “writing” physiologically plausible information back into the peripheral nervous system. Starting from an in-silico model of mechanoreceptors, we develop biomimetic stimulation policies. We then experimentally assess them alongside mechanical touch and common linear neuromodulations. Neural responses resulting from biomimetic neuromodulation are consistently transmitted towards dorsal root ganglion and spinal cord of cats, and their spatio-temporal neural dynamics resemble those naturally induced. We implement these paradigms within the bionic device and test it with patients (ClinicalTrials.gov identifier NCT03350061). He we report that biomimetic neurostimulation improves mobility (primary outcome) and reduces mental effort (secondary outcome) compared to traditional approaches. The outcomes of this neuroscience-driven technology, inspired by the human body, may serve as a model for advancing assistive neurotechnologies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring new horizons in neuroscience disease detection through innovative visual signal analysis",
        "link": "https://www.nature.com/articles/s41598-024-54416-y",
        "publication_date": "20 Feb 2024",
        "abstract": "Brain disorders pose a substantial global health challenge, persisting as a leading cause of mortality worldwide. Electroencephalogram (EEG) analysis is crucial for diagnosing brain disorders, but it can be challenging for medical practitioners to interpret complex EEG signals and make accurate diagnoses. To address this, our study focuses on visualizing complex EEG signals in a format easily understandable by medical professionals and deep learning algorithms. We propose a novel time–frequency (TF) transform called the Forward–Backward Fourier transform (FBFT) and utilize convolutional neural networks (CNNs) to extract meaningful features from TF images and classify brain disorders. We introduce the concept of eye-naked classification, which integrates domain-specific knowledge and clinical expertise into the classification process. Our study demonstrates the effectiveness of the FBFT method, achieving impressive accuracies across multiple brain disorders using CNN-based classification. Specifically, we achieve accuracies of 99.82% for epilepsy, 95.91% for Alzheimer’s disease (AD), 85.1% for murmur, and 100% for mental stress using CNN-based classification. Furthermore, in the context of naked-eye classification, we achieve accuracies of 78.6%, 71.9%, 82.7%, and 91.0% for epilepsy, AD, murmur, and mental stress, respectively. Additionally, we incorporate a mean correlation coefficient (mCC) based channel selection method to enhance the accuracy of our classification further. By combining these innovative approaches, our study enhances the visualization of EEG signals, providing medical professionals with a deeper understanding of TF medical images. This research has the potential to bridge the gap between image classification and visual medical interpretation, leading to better disease detection and improved patient care in the field of neuroscience.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The impact of using reinforcement learning to personalize communication on medication adherence: findings from the REINFORCE trial",
        "link": "https://www.nature.com/articles/s41746-024-01028-5",
        "publication_date": "19 Feb 2024",
        "abstract": "Text messaging can promote healthy behaviors, like adherence to medication, yet its effectiveness remains modest, in part because message content is rarely personalized. Reinforcement learning has been used in consumer technology to personalize content but with limited application in healthcare. We tested a reinforcement learning program that identifies individual responsiveness (“adherence”) to text message content and personalizes messaging accordingly. We randomized 60 individuals with diabetes and glycated hemoglobin A1c [HbA1c] ≥ 7.5% to reinforcement learning intervention or control (no messages). Both arms received electronic pill bottles to measure adherence. The intervention improved absolute adjusted adherence by 13.6% (95%CI: 1.7%–27.1%) versus control and was more effective in patients with HbA1c 7.5- < 9.0% (36.6%, 95%CI: 25.1%–48.2%, interaction p < 0.001). We also explored whether individual patient characteristics were associated with differential response to tested behavioral factors and unique clusters of responsiveness. Reinforcement learning may be a promising approach to improve adherence and personalize communication at scale.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring the spatiotemporal relationship between influenza and air pollution in Fuzhou using spatiotemporal weighted regression model",
        "link": "https://www.nature.com/articles/s41598-024-54630-8",
        "publication_date": "19 Feb 2024",
        "abstract": "Air pollution has become a significant concern for human health, and its impact on influenza, has been increasingly recognized. This study aims to explore the spatiotemporal heterogeneity of the impacts of air pollution on influenza and to confirm a better method for infectious disease surveillance. Spearman correlation coefficient was used to evaluate the correlation between air pollution and the influenza case counts. VIF was used to test for collinearity among selected air pollutants. OLS regression, GWR, and STWR models were fitted to explore the potential spatiotemporal relationship between air pollution and influenza. The R2, the RSS and the AICc were used to evaluate and compare the models. In addition, the DTW and K-medoids algorithms were applied to cluster the county-level time-series coefficients. Compared with the OLS regression and GWR models, STWR model exhibits superior fit especially when the influenza outbreak changes rapidly and is able to more accurately capture the changes in different regions and time periods. We discovered that identical air pollutant factors may yield contrasting impacts on influenza within the same period in different areas of Fuzhou. NO2 and PM10 showed opposite impacts on influenza in the eastern and western areas of Fuzhou during all periods. Additionally, our investigation revealed that the relationship between air pollutant factors and influenza may exhibit temporal variations in certain regions. From 2013 to 2019, the influence coefficient of O3 on influenza epidemic intensity changed from negative to positive in the western region and from positive to negative in the eastern region. STWR model could be a useful method to explore the spatiotemporal heterogeneity of the impacts of air pollution on influenza in geospatial processes. The research findings emphasize the importance of considering spatiotemporal heterogeneity when studying the relationship between air pollution and influenza.",
        "conclusions": "This study investigated the epidemiological characteristics of influenza in Fuzhou and analyzed the spatiotemporal heterogeneity of the impacts of air pollution on influenza. The following conclusions can be drawn: (1) In Fuzhou, the epidemic of influenza shows a clear trend of high incidence in winter and spring, and the incidence rate has been increasing over the years. The central districts of Fuzhou have a higher incidence rate of influenza. (2) There is a correlation between air pollution and influenza in different county-level regions of Fuzhou. (3) The STWR model outperforms the OLS regression and GWR models and is the optimal regression model. The STWR model, used to study the spatiotemporal heterogeneity of the impacts of air pollution on influenza, helps to understand and identify key air pollutants during different periods of influenza outbreaks. By understanding its spatiotemporal heterogeneity, targeted and effective prevention and control strategies can be developed, providing a scientific basis for the precise management of influenza outbreaks.In a word, our study provides valuable insights into the spatiotemporal heterogeneity of the impact of air pollution on influenza. STWR model could be a useful method for exploring the spatiotemporal heterogeneity of the impacts of air pollution on influenza in geospatial processes.",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Assessment of area and structural irregularity of retinal layers in diabetic retinopathy using machine learning and image processing techniques",
        "link": "https://www.nature.com/articles/s41598-024-54535-6",
        "publication_date": "18 Feb 2024",
        "abstract": "Diabetes retinopathy prevention necessitates early detection, monitoring, and treatment. Non-invasive optical coherence tomography (OCT) shows structural changes in the retinal layer. OCT image evaluation necessitates retinal layer segmentation. The ability of our automated retinal layer segmentation to distinguish between normal, non-proliferative (NPDR), and proliferative diabetic retinopathy (PDR) was investigated in this study using quantifiable biomarkers such as retina layer smoothness index (SI) and area (S) in horizontal and vertical OCT images for each zone (fovea, superior, inferior, nasal, and temporal). This research includes 84 eyes from 57 individuals. The study shows a significant difference in the Area (S) of inner nuclear layer (INL) and outer nuclear layer (ONL) in the horizontal foveal zone across the three groups (p < 0.001). In the horizontal scan, there is a significant difference in the smoothness index (SI) of the inner plexiform layer (IPL) and the upper border of the outer plexiform layer (OPL) among three groups (p < 0.05). There is also a significant difference in the area (S) of the OPL in the foveal zone among the three groups (p = 0.003). The area (S) of the INL in the foveal region of horizontal slabs performed best for distinguishing diabetic patients (NPDR and PDR) from normal individuals, with an accuracy of 87.6%. The smoothness index (SI) of IPL in the nasal zone of horizontal foveal slabs was the most accurate at 97.2% in distinguishing PDR from NPDR. The smoothness index of the top border of the OPL in the nasal zone of horizontal slabs was 84.1% accurate in distinguishing NPDR from PDR. Smoothness index of IPL in the temporal zone of horizontal slabs was 89.8% accurate in identifying NPDR from PDR patients. In conclusion, optical coherence tomography can assess the smoothness index and irregularity of the inner and outer plexiform layers, particularly in the nasal and temporal regions of horizontal foveal slabs, to distinguish non-proliferative from proliferative diabetic retinopathy. The evolution of diabetic retinopathy throughout severity levels and its effects on retinal layer irregularity need more study.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Vascular compactness of unruptured brain arteriovenous malformation predicts risk of hemorrhage after stereotactic radiosurgery",
        "link": "https://www.nature.com/articles/s41598-024-54369-2",
        "publication_date": "18 Feb 2024",
        "abstract": "The aim of the study was to investigate whether morphology (i.e. compact/diffuse) of brain arteriovenous malformations (bAVMs) correlates with the incidence of hemorrhagic events in patients receiving Stereotactic Radiosurgery (SRS) for unruptured bAVMs. This retrospective study included 262 adult patients with unruptured bAVMs who underwent upfront SRS. Hemorrhagic events were defined as evidence of blood on CT or MRI. The morphology of bAVMs was evaluated using automated segmentation which calculated the proportion of vessel, brain tissue, and cerebrospinal fluid in bAVMs on T2-weighted MRI. Compactness index, defined as the ratio of vessel to brain tissue, categorized bAVMs into compact and diffuse types based on the optimal cutoff. Cox proportional hazard model was used to identify the independent factors for post-SRS hemorrhage. The median clinical follow-ups was 62.1 months. Post-SRS hemorrhage occurred in 13 (5.0%) patients and one of them had two bleeds, resulting in an annual bleeding rate of 0.8%. Multivariable analysis revealed bAVM morphology (compact versus diffuse), bAVM volume, and prescribed margin dose were significant predictors. The post-SRS hemorrhage rate increased with larger bAVM volume only among the diffuse nidi (1.7 versus 14.9 versus 30.6 hemorrhage per 1000 person-years in bAVM volume < 20 cm3 versus 20–40 cm3 versus > 40 cm3; p = 0.022). The significantly higher post-SRS hemorrhage rate of Spetzler-Martin grade IV–V compared with grade I–III bAVMs (20.0 versus 3.3 hemorrhages per 1000 person-years; p = 0.001) mainly originated from the diffuse bAVMs rather than the compact subgroup (30.9 versus 4.8 hemorrhages per 1000 person-years; p = 0.035). Compact and smaller bAVMs, with higher prescribed margin dose harbor lower risks of post-SRS hemorrhage. The post-SRS hemorrhage rate exceeded 2.2% annually within the diffuse and large (> 40 cm3) bAVMs and the diffuse Spetzler-Martin IV–V bAVMs. These findings may help guide patient selection of SRS for the unruptured bAVMs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Transcutaneous cervical vagus nerve stimulation improves sensory performance in humans: a randomized controlled crossover pilot study",
        "link": "https://www.nature.com/articles/s41598-024-54026-8",
        "publication_date": "17 Feb 2024",
        "abstract": "Accurate senses depend on high-fidelity encoding by sensory receptors and error-free processing in the brain. Progress has been made towards restoring damaged sensory receptors. However, methods for on-demand treatment of impaired central sensory processing are scarce. Prior invasive studies demonstrated that continuous vagus nerve stimulation (VNS) in rodents can activate the locus coeruleus-norepinephrine system to rapidly improve central sensory processing. Here, we investigated whether transcutaneous VNS improves sensory performance in humans. We conducted three sham-controlled experiments, each with 12 neurotypical adults, that measured the effects of transcutaneous VNS on metrics of auditory and visual performance, and heart rate variability (HRV). Continuous stimulation was delivered to cervical (tcVNS) or auricular (taVNS) branches of the vagus nerve while participants performed psychophysics tasks or passively viewed a display. Relative to sham stimulation, tcVNS improved auditory performance by 37% (p = 0.00052) and visual performance by 23% (p = 0.038). Participants with lower performance during sham conditions experienced larger tcVNS-evoked improvements (p = 0.0040). Lastly, tcVNS increased HRV during passive viewing, corroborating vagal engagement. No evidence for an effect of taVNS was observed. These findings validate the effectiveness of tcVNS in humans and position it as a method for on-demand interventions of impairments associated with central sensory processing dysfunction.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A comparative study of federated learning methods for COVID-19 detection",
        "link": "https://www.nature.com/articles/s41598-024-54323-2",
        "publication_date": "16 Feb 2024",
        "abstract": "Deep learning has proven to be highly effective in diagnosing COVID-19; however, its efficacy is contingent upon the availability of extensive data for model training. The data sharing among hospitals, which is crucial for training robust models, is often restricted by privacy regulations. Federated learning (FL) emerges as a solution by enabling model training across multiple hospitals while preserving data privacy. However, the deployment of FL can be resource-intensive, necessitating efficient utilization of computational and network resources. In this study, we evaluate the performance and resource efficiency of five FL algorithms in the context of COVID-19 detection using Convolutional Neural Networks (CNNs) in a decentralized setting. The evaluation involves varying the number of participating entities, the number of federated rounds, and the selection algorithms. Our findings indicate that the Cyclic Weight Transfer algorithm exhibits superior performance, particularly when the number of participating hospitals is limited. These insights hold practical implications for the deployment of FL algorithms in COVID-19 detection and broader medical image analysis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting long-term time to cardiovascular incidents using myocardial perfusion imaging and deep convolutional neural networks",
        "link": "https://www.nature.com/articles/s41598-024-54139-0",
        "publication_date": "15 Feb 2024",
        "abstract": "Myocardial perfusion imaging (MPI) is a clinical tool which can assess the heart's perfusion status, thereby revealing impairments in patients' cardiac function. Within the MPI modality, the acquired three-dimensional signals are typically represented as a sequence of two-dimensional grayscale tomographic images. Here, we proposed an end-to-end survival training approach for processing gray-scale MPI tomograms to generate a risk score which reflects subsequent time to cardiovascular incidents, including cardiovascular death, non-fatal myocardial infarction, and non-fatal ischemic stroke (collectively known as Major Adverse Cardiovascular Events; MACE) as well as Congestive Heart Failure (CHF). We recruited a total of 1928 patients who had undergone MPI followed by coronary interventions. Among them, 80% (n = 1540) were randomly reserved for the training and 5- fold cross-validation stage, while 20% (n = 388) were set aside for the testing stage. The end-to-end survival training can converge well in generating effective AI models via the fivefold cross-validation approach with 1540 patients. When a candidate model is evaluated using independent images, the model can stratify patients into below-median-risk (n = 194) and above-median-risk (n = 194) groups, the corresponding survival curves of the two groups have significant difference (P < 0.0001). We further stratify the above-median-risk group to the quartile 3 and 4 group (n = 97 each), and the three patient strata, referred to as the high, intermediate and low risk groups respectively, manifest statistically significant difference. Notably, the 5-year cardiovascular incident rate is less than 5% in the low-risk group (accounting for 50% of all patients), while the rate is nearly 40% in the high-risk group (accounting for 25% of all patients). Evaluation of patient subgroups revealed stronger effect size in patients with three blocked arteries (Hazard ratio [HR]: 18.377, 95% CI 3.719–90.801, p < 0.001), followed by those with two blocked vessels at HR 7.484 (95% CI 1.858–30.150; p = 0.005). Regarding stent placement, patients with a single stent displayed a HR of 4.410 (95% CI 1.399–13.904; p = 0.011). Patients with two stents show a HR of 10.699 (95% CI 2.262–50.601; p = 0.003), escalating notably to a HR of 57.446 (95% CI 1.922–1717.207; p = 0.019) for patients with three or more stents, indicating a substantial relationship between the disease severity and the predictive capability of the AI for subsequent cardiovascular inciidents. The success of the MPI AI model in stratifying patients into subgroups with distinct time-to-cardiovascular incidents demonstrated the feasibility of proposed end-to-end survival training approach.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Validation of portable in-clinic video-based gait analysis for prosthesis users",
        "link": "https://www.nature.com/articles/s41598-024-53217-7",
        "publication_date": "15 Feb 2024",
        "abstract": "Despite the common focus of gait in rehabilitation, there are few tools that allow quantitatively characterizing gait in the clinic. We recently described an algorithm, trained on a large dataset from our clinical gait analysis laboratory, which produces accurate cycle-by-cycle estimates of spatiotemporal gait parameters including step timing and walking velocity. Here, we demonstrate this system generalizes well to clinical care with a validation study on prosthetic users seen in therapy and outpatient clinics. Specifically, estimated walking velocity was similar to annotated 10-m walking velocities, and cadence and foot contact times closely mirrored our wearable sensor measurements. Additionally, we found that a 2D keypoint detector pretrained on largely able-bodied individuals struggles to localize prosthetic joints, particularly for those individuals with more proximal or bilateral amputations, but after training a prosthetic-specific joint detector video-based gait analysis also works on these individuals. Further work is required to validate the other outputs from our algorithm including sagittal plane joint angles and step length. Code for the gait transformer and the trained weights are available at https://github.com/peabody124/GaitTransformer.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cyclosporine A in hospitalized COVID-19 pneumonia patients to prevent the development of interstitial lung disease: a pilot randomized clinical trial",
        "link": "https://www.nature.com/articles/s41598-024-54196-5",
        "publication_date": "15 Feb 2024",
        "abstract": "Post-COVID-19 interstitial lung disease (ILD) is a new entity that frequently causes pulmonary fibrosis and can become chronic. We performed a single-center parallel-group open-label pilot randomized clinical trial to investigate the efficacy and safety of cyclosporine A (CsA) in the development of ILD in the medium term among patients hospitalized with COVID-19 pneumonia. Patients were randomized 1:1 to receive CsA plus standard of care or standard of care alone. The primary composite outcome was the percentage of patients without ILD 3 months after diagnosis of pneumonia and not requiring invasive mechanical ventilation (IMV) (response without requiring IMV). The key secondary composite outcomes were the percentage of patients who achieve a response requiring IMV or irrespective of the need for IMV, and adverse events. A total of 33 patients received at least one dose of CsA plus standard of care (n = 17) or standard of care alone (n = 16). No differences were found between the groups in the percentage of patients who achieved a response without requiring IMV or a response requiring IMV. A higher percentage of patients achieved a response irrespective of the need for IMV in the CsA plus standard of care group although the RR was almost significant 2.833 (95% CI, 0.908–8.840; p = 0.057). No differences were found between the groups for adverse events. In hospitalized patients with COVID-19 pneumonia, we were unable to demonstrate that CsA achieved a significant effect in preventing the development of ILD. (EU Clinical Trials Register; EudraCT Number: 2020-002123-11; registration date: 08/05/2020).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring the therapeutic mechanisms and prognostic targets of Biochanin A in glioblastoma via integrated computational analysis and in vitro experiments",
        "link": "https://www.nature.com/articles/s41598-024-53442-0",
        "publication_date": "15 Feb 2024",
        "abstract": "Glioblastoma (GBM) is the most aggressive brain tumor and is characterized by a poor prognosis and high recurrence and mortality rates. Biochanin A (BCA) exhibits promising clinical anti-tumor effects. In this study, we aimed to explore the pharmacological mechanisms by which BCA acts against GBM. Network pharmacology was employed to identify overlapping target genes between BCA and GBM. Differentially expressed genes from the Gene Expression Profiling Interactive Analysis 2 (GEPIA2) database were visualized using VolcaNose. Interactions among these overlapping genes were analyzed using the Search Tool for the Retrieval of Interacting Genes/Proteins database. Protein–protein interaction networks were constructed using Cytoscape 3.8.1. The Kyoto Encyclopedia of Genes and Genomes pathway and Gene Ontology enrichment analyses were conducted using the Database for Annotation, Visualization, and Integrated Discovery. Survival analyses for these genes were performed using the GEPIA2 database. The Chinese Glioma Genome Atlas database was used to study the correlations between key prognostic genes. Molecular docking was confirmed using the DockThor database and visualized with PyMol software. Cell viability was assessed via the CCK-8 assay, apoptosis and the cell cycle stages were examined using flow cytometry, and protein expression was detected using western blotting. In all, 63 genes were initially identified as potential targets for BCA in treating GBM. Enrichment analysis suggested that the pharmacological mechanisms of BCA primarily involved cell cycle inhibition, induction of cell apoptosis, and immune regulation. Based on these findings, AKT1, EGFR, CASP3, and MMP9 were preliminarily predicted as key prognostic target genes for BCA in GBM treatment. Furthermore, molecular docking analysis suggested stable binding of BCA to the target protein. In vitro experiments revealed the efficacy of BCA in inhibiting GBM, with an IC50 value of 98.37 ± 2.21 μM. BCA inhibited cell proliferation, induced cell apoptosis, and arrested the cell cycle of GBM cells. Furthermore, the anti-tumor effects of BCA on U251 cells were linked to the regulation of the target protein. We utilized integrated bioinformatics analyses to predict targets and confirmed through experiments that BCA possesses remarkable anti-tumor activities. We present a novel approach for multi-target treatment of GBM using BCA.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Natural language processing of multi-hospital electronic health records for public health surveillance of suicidality",
        "link": "https://www.nature.com/articles/s44184-023-00046-7",
        "publication_date": "14 Feb 2024",
        "abstract": "There is an urgent need to monitor the mental health of large populations, especially during crises such as the COVID-19 pandemic, to timely identify the most at-risk subgroups and to design targeted prevention campaigns. We therefore developed and validated surveillance indicators related to suicidality: the monthly number of hospitalisations caused by suicide attempts and the prevalence among them of five known risks factors. They were automatically computed analysing the electronic health records of fifteen university hospitals of the Paris area, France, using natural language processing algorithms based on artificial intelligence. We evaluated the relevance of these indicators conducting a retrospective cohort study. Considering 2,911,920 records contained in a common data warehouse, we tested for changes after the pandemic outbreak in the slope of the monthly number of suicide attempts by conducting an interrupted time-series analysis. We segmented the assessment time in two sub-periods: before (August 1, 2017, to February 29, 2020) and during (March 1, 2020, to June 31, 2022) the COVID-19 pandemic. We detected 14,023 hospitalisations caused by suicide attempts. Their monthly number accelerated after the COVID-19 outbreak with an estimated trend variation reaching 3.7 (95%CI 2.1–5.3), mainly driven by an increase among girls aged 8–17 (trend variation 1.8, 95%CI 1.2–2.5). After the pandemic outbreak, acts of domestic, physical and sexual violence were more often reported (prevalence ratios: 1.3, 95%CI 1.16–1.48; 1.3, 95%CI 1.10–1.64 and 1.7, 95%CI 1.48–1.98), fewer patients died (p = 0.007) and stays were shorter (p < 0.001). Our study demonstrates that textual clinical data collected in multiple hospitals can be jointly analysed to compute timely indicators describing mental health conditions of populations. Our findings also highlight the need to better take into account the violence imposed on women, especially at early ages and in the aftermath of the COVID-19 pandemic.",
        "conclusions": "In conclusion, we demonstrated that naturalistic data collected in the EHR of multiple hospitals, both structured and unstructured, could be leveraged to compute indicators describing mental health conditions of populations. To achieve this, we analysed retrospectively millions of clinical reports using NLP algorithms to identify populations whose suicidality was the most affected during a critical period, the COVID-19 pandemic. We detected some risk factors associated with the variation of the number of severe SA being hospitalised. Our results also highlighted the need to better take into account violence imposed on women, especially at early ages, to prevent the occurrence of severe SA in this at-risk group.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Lung cancer diagnosis based on weighted convolutional neural network using gene data expression",
        "link": "https://www.nature.com/articles/s41598-024-54124-7",
        "publication_date": "13 Feb 2024",
        "abstract": "Lung cancer is thought to be a genetic disease with a variety of unknown origins. Globocan2020 report tells in 2020 new cancer cases identified was 19.3 million and nearly 10.0 million died owed to cancer. GLOBOCAN envisages that the cancer cases will raised to 28.4 million in 2040. This charge is superior to the combined rates of the former generally prevalent malignancies, like breast, colorectal, and prostate cancers. For attribute selection in previous work, the information gain model was applied. Then, for lung cancer prediction, multilayer perceptron, random subspace, and sequential minimal optimization (SMO) are used. However, the total number of parameters in a multilayer perceptron can become extremely large. This is inefficient because of the duplication in such high dimensions, and SMO can become ineffective due to its calculating method and maintaining a single threshold value for prediction. To avoid these difficulties, our research presented a novel technique including Z-score normalization, levy flight cuckoo search optimization, and a weighted convolutional neural network for predicting lung cancer. This result findings show that the proposed technique is effective in precision, recall, and accuracy for the Kent Ridge Bio-Medical Dataset Repository.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]