[
    {
        "title": "Explainable deep learning and virtual evolution identifies antimicrobial peptides with activity against multidrug-resistant human pathogens",
        "link": "https://www.nature.com/articles/s41564-024-01907-3",
        "publication_date": "17 Jan 2025",
        "abstract": "Artificial intelligence (AI) is a promising approach to identify new antimicrobial compounds in diverse microbial species. Here we developed an AI-based, explainable deep learning model, EvoGradient, that predicts the potency of antimicrobial peptides (AMPs) and virtually modifies peptide sequences to produce more potent AMPs, akin to in silico directed evolution. We applied this model to peptides encoded in low-abundance human oral bacteria, resulting in the virtual evolution of 32 peptides into potent AMPs. Of these, the 6 most effective were synthesized and tested against multidrug-resistant pathogens and demonstrated activity against carbapenem-resistant species Escherichia coli, Klebsiella pneumoniae and Acinetobacter baumannii, and vancomycin-resistant Enterococcus faecium. The most potent AMP, pep-19-mod, was validated in vivo, achieving over 95% reduction in bacterial loads in mouse models of thigh infection through both systemic and local administration. Our approach advances the automatic identification and optimization of AMPs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Neutralizing antibody immune correlates in COVAIL trial recipients of an mRNA second COVID-19 vaccine boost",
        "link": "https://www.nature.com/articles/s41467-025-55931-w",
        "publication_date": "17 Jan 2025",
        "abstract": "Neutralizing antibody titer has been a surrogate endpoint for guiding COVID-19 vaccine approval and use, although the pandemic’s evolution and the introduction of variant-adapted vaccine boosters raise questions as to this surrogate’s contemporary performance. For 985 recipients of an mRNA second bivalent or monovalent booster containing various Spike inserts [Prototype (Ancestral), Beta, Delta, and/or Omicron BA.1 or BA.4/5] in the COVAIL trial (NCT05289037), titers against 5 strains were assessed as correlates of risk of symptomatic COVID-19 (“COVID-19”) and as correlates of relative (Pfizer-BioNTech Omicron vs. Prototype) booster protection against COVID-19 over 6 months of follow-up during the BA.2-BA.5 Omicron-dominant period. Consistently across the Moderna and Pfizer-BioNTech vaccine platforms and across all variant Spike inserts assessed, both peak and exposure-proximal (“predicted-at-exposure”) titers correlated with lower Omicron COVID-19 risk in individuals previously infected with SARS-CoV-2, albeit significantly less so in naïve individuals [e.g., exposure-proximal hazard ratio per 10-fold increase in BA.1 titer 0.74 (95% CI 0.59, 0.94) for naïve vs. 0.41 (95% CI 0.23, 0.64) for non-naïve; interaction p = 0.013]. Neutralizing antibody titer was a strong inverse correlate of Omicron COVID-19 in non-naïve individuals and a weaker correlate in naïve individuals, posing questions about how prior infection alters the neutralization correlate.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "A systematic review of machine learning applications in predicting opioid associated adverse events",
        "link": "https://www.nature.com/articles/s41746-024-01312-4",
        "publication_date": "16 Jan 2025",
        "abstract": "Machine learning has increasingly been applied to predict opioid-related harms due to its ability to handle complex interactions and generating actionable predictions. This review evaluated the types and quality of ML methods in opioid safety research, identifying 44 studies using supervised ML through searches of Ovid MEDLINE, PubMed and SCOPUS databases. Commonly predicted outcomes included postoperative opioid use (n = 15, 34%) opioid overdose (n = 8, 18%), opioid use disorder (n = 8, 18%) and persistent opioid use (n = 5, 11%) with varying definitions. Most studies (96%) originated from North America, with only 7% reporting external validation. Model performance was moderate to strong, but calibration was often missing (41%). Transparent reporting of model development was often incomplete, with key aspects such as calibration, imbalance correction, and handling of missing data absent. Infrequent external validation limited the generalizability of current models. Addressing these aspects is critical for transparency, interpretability, and future implementation of the results.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "poisoning"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Harnessing deep learning to detect bronchiolitis obliterans syndrome from chest CT",
        "link": "https://www.nature.com/articles/s43856-025-00732-x",
        "publication_date": "16 Jan 2025",
        "abstract": "Bronchiolitis Obliterans Syndrome (BOS), a fibrotic airway disease that may develop after lung transplantation, conventionally relies on pulmonary function tests (PFTs) for diagnosis due to limitations of CT imaging. Deep neural networks (DNNs) have not previously been used for BOS detection. This study aims to train a DNN to detect BOS in CT scans using an approach tailored for low-data scenarios.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of an interpretable machine learning model based on CT radiomics for the prediction of post acute pancreatitis diabetes mellitus",
        "link": "https://www.nature.com/articles/s41598-025-86290-7",
        "publication_date": "15 Jan 2025",
        "abstract": "This study sought to establish and validate an interpretable CT radiomics-based machine learning model capable of predicting post-acute pancreatitis diabetes mellitus (PPDM-A), providing clinicians with an effective predictive tool to aid patient management in a timely fashion. Clinical and imaging data from 271 patients who had undergone enhanced CT scans after first-episode acute pancreatitis from March 2017–June 2023 were retrospectively analyzed. Patients were classified into PPDM-A (n = 109) and non-PPDM-A groups (n = 162), and split into training (n = 189) and testing (n = 82) cohorts at a 7:3 ratio. 1223 radiomic features were extracted from CT images in the plain, arterial and venous phases, respectively. The radiomics model was developed based on the optimal features retained after dimensionality reduction, utilizing the extreme gradient boosting (XGBoost) algorithm. Five-fold cross-validation of the model was used to assess the performance of the model in the training and testing cohorts. The clinical performance of the model was assessed through a decision curve analysis, while insight into the predictions derived from this model was derived from Shapley additive explanations (SHAP). The final model incorporated five key radiomic features, and achieved area under the curve values in the training and testing cohorts of 0.947 (95% CI 0.915–0.979) and 0.901 (95% CI 0.838–0.964), respectively. SHAP analyses indicated that textural features were key features relevant to the prediction of PPDM-A incidence. The interpretable CT radiomics-based model developed in this study demonstrated good performance, enabling timely and effective interventions with the potential to improve patient outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning analysis of cervical balance in early-onset scoliosis post-growing rod surgery: a case-control study",
        "link": "https://www.nature.com/articles/s41598-025-86330-2",
        "publication_date": "15 Jan 2025",
        "abstract": "We aimed to analyze the cervical sagittal alignment change following the growing rod treatment in early-onset scoliosis (EOS) and identify the risk factors of sagittal cervical imbalance after growing-rod surgery of machine learning. EOS patients from our centre between 2007 and 2019 were retrospectively reviewed. Radiographic parameters include the cervical lordosis (CL), T1 slope, C2-C7 sagittal vertical axis (C2-7 SVA), primary curve Cobb angle, thoracic kyphosis (TK), C7-S1 sagittal vertical axis (C7-S1 SVA) and proximal junctional angle (PJA) were evaluated preoperatively, postoperatively and at the final follow-up. The parameters were analyzed using a t-test and χ2 test. The machine learning methodology of a sparse additive machine (SAM) was applied to identify the risk factors that caused the cervical imbalance. 138 patients were enrolled in this study (96 male and 42 female). The mean thoracic curve Cobb angle was 67.00 ± 22.74°. The mean age at the first operation was 8.5 ± 2.6yrs. The mean follow-up was 38.48 ± 10.87 months. CL, T1 slope, and C2-7 SVA increased significantly in the final follow-up compared with the pre-operative data. (P < 0.05). The CL and T1 slope increased more significantly in the group of patients who had proximal junctional kyphosis (PJK) compared with the patients without PJK (P < 0.05). The location of the upper instrumented vertebrae (UIV) and single/dual growing rod had no significant influence on the sagittal cervical parameters (P > 0.05). According to the SAM analysis of machine learning algorithms, Postoperative PJK, more improvement of kyphosis, and T1 slope angle were identified as the risk factors of cervical sagittal imbalance during the treatment of growing rod surgery. The growing rod surgery in EOS significantly affected the cervical sagittal alignment. Postoperative PJK and more improvement of kyphosis and T1 slope angle would lead to a higher incidence of cervical sagittal imbalance.",
        "conclusions": "Cervical sagittal alignment was significantly affected by the growing rod surgery in EOS. Postoperative PJK and the early insertion of the growing rod would lead to a higher incidence of cervical sagittal imbalance.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Screening of Aβ and phosphorylated tau status in the cerebrospinal fluid through machine learning analysis of portable electroencephalography data",
        "link": "https://www.nature.com/articles/s41598-025-86449-2",
        "publication_date": "15 Jan 2025",
        "abstract": "Diagnosing Alzheimer’s disease (AD) through pathological markers is typically costly and invasive. This study aims to find a noninvasive, cost-effective method using portable electroencephalography (EEG) to detect changes in AD-related biomarkers in cerebrospinal fluid (CSF). A total of 102 patients, both with and without AD-related biomarker changes (amyloid beta and phosphorylated tau), were recorded using a 2-minute resting-state portable EEG. A machine-learning algorithm then analyzed the EEG data to identify these biomarker changes. The results showed that the machine learning model could distinguish patients with AD-related biomarker changes, achieving 68.1% accuracy (AUROC 0.75) for amyloid beta and 71.2% accuracy (AUROC 0.77) for phosphorylated tau, with gamma activities being key features. When excluding cases with idiopathic normal pressure hydrocephalus, accuracy improved to 74.1% (AUROC 0.80) for amyloid beta and 73.1% (AUROC 0.80) for phosphorylated tau. This study suggests that portable EEG combined with machine learning is a promising noninvasive and cost-effective tool for early AD-related pathological marker screening, which could enhance neurophysiological understanding and diagnostic accessibility.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Abnormality detection in nailfold capillary images using deep learning with EfficientNet and cascade transfer learning",
        "link": "https://www.nature.com/articles/s41598-025-85277-8",
        "publication_date": "15 Jan 2025",
        "abstract": "Nailfold Capillaroscopy (NFC) is a simple, non-invasive diagnostic tool used to detect microvascular changes in nailfold. Chronic pathological changes associated with a wide range of systemic diseases, such as diabetes, cardiovascular disorders, and rheumatological conditions like systemic sclerosis, can manifest as observable microvascular changes in the terminal capillaries of nailfolds. The current gold standard relies on experts performing manual evaluations, which is an exhaustive time-intensive, and subjective process. In this study, we demonstrate the viability of a deep learning approach as an automated clinical screening tool. Our dataset consists of NFC images from a total of 225 participants, with normal images accounting for 6% of the dataset. This study introduces a robust framework utilizing cascade transfer learning based on EfficientNet-B0 to differentiate between normal and abnormal cases within NFC images. The results demonstrate that pre-trained EfficientNet-B0 on the ImageNet dataset, followed by transfer learning from domain-specific classes, significantly enhances the classifier’s performance in distinguishing between Normal and Abnormal classes. Our proposed model achieved superior performance, with accuracy, precision, recall, F1 score, and ROC_AUC of 1.00, significantly outperforming both models of single transfer learning on the pre-trained EfficientNet-B0 and cascade transfer learning on a convolutional neural network, which each attained an accuracy, precision, recall, and F1 score of 0.67 and a ROC_AUC of 0.83. The framework demonstrates the potential to facilitate early preventive measures and timely interventions that aim to improve healthcare delivery and patients’ quality of life.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Precision fetal cardiology detects cyanotic congenital heart disease using maternal saliva metabolome and artificial intelligence",
        "link": "https://www.nature.com/articles/s41598-025-85216-7",
        "publication_date": "15 Jan 2025",
        "abstract": "Prenatal sonographic diagnosis of congenital heart disease (CHD) can lead to improved morbidity and mortality. However, the diagnostic accuracy of ultrasound, the sole prenatal screening tool, remains limited. Failed prenatal or early newborn detection of cyanotic CHD (CCHD) can have disastrous consequences. We therefore sought to use a Precision Fetal Cardiology based approach combining metabolomic profiling of maternal saliva and machine learning, a major branch of artificial intelligence (AI), for the prenatal detection of isolated, non-syndromic cyanotic CHD. Metabolomic analyses using Ultra-High Performance Liquid Chromatography/Mass Spectrometry identified 468 metabolites in the saliva. Six different AI platforms were utilized for the detection of CCHD and CHD overall. AI achieved excellent accuracy for the CCHD detection: Area Under the ROC curve: AUC (95% CI) = 0.819 (0.635-1.00) with a sensitivity and specificity of 92.5% and 87.0%, and for CHD overall: AUC (95% CI) = 0.828 (0.635-1.00) with a sensitivity of 90.5% and specificity of 88.0%. Similarly high accuracies were achieved for the detection of CHD overall: AUC (95% CI) = 0.8488 (0.635-1.00) with a sensitivity of 92.5% and specificity of 91.0%. Pathway analysis showed significant alterations in Arachidonic Acid, Alpha-linoleic acid, and Tryptophan metabolism indicating significant lipid dysfunction in cyanotic CHD. In summary, we report for the first time, the accurate detection of non-syndromic cyanotic CHD using maternal salivary metabolomics. Further, analysis revealed significant alteration of lipid metabolism.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A novel breath pattern model and analysis to minimize patient discomfort in medical ventilators",
        "link": "https://www.nature.com/articles/s41598-025-86187-5",
        "publication_date": "15 Jan 2025",
        "abstract": "Typical waveforms used for the simulation of pressure and volume-controlled ventilation in medical ventilators have been extensively studied in the literature. The majority of simulation studies reported employ the step pattern or ramp pattern to model the pressure and flow variations in pressure/volume-controlled ventilation. It was observed that the above waveforms tend to add to the discomfort level of patients due to the presence of jerks in derivatives of pressure/flow variations; the pressure/flow variation of air and oxygen mixture should be smooth so that the patient discomfort is kept at a minimal level. To overcome the above-mentioned drawback, a careful study of the flow/pressure simulation using a cycloidal pattern during the inhalation and exhalation phases of the breath cycle was proposed and investigated in this work. Based on transient analysis of the pressure variation simulation, it was observed that the air and oxygen mixture delivered to the patient was relatively jerk-free due to the finite values of first and second-order derivatives of pressure/flow curves. Mathematical models of the proposed simulation study of the cycloidal pattern of flow variation in both pressure/volume-controlled ventilation, are formulated and presented for use by ventilator designers. A comparative study of the simulation of step, ramp and cycloidal profiles applied to the breath cycle in a typical pressure-controlled ventilation is carried out and a marginal decrease in tidal volumes was observed in the case of cycloidal profiles for a given set of ventilator settings and the results are discussed. A typical natural breath pattern of a healthy adult was experimentally measured using a CITRIX breath analyser and the above mathematical model for the volume-controlled ventilation was found to closely describe the natural breathing process, using statistical parameters. Thus, the proposed cycloidal profile of pressure/flow variations in medical ventilators will be a better alternative, when compared to the step/ramp profiles investigated in this work; further, the proposed cycloidal profile matches closely with the natural breath pattern, based on typical experimental studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Differentiation between multiple sclerosis and neuromyelitis optic spectrum disorders with multilevel fMRI features: A machine learning analysis",
        "link": "https://www.nature.com/articles/s41598-024-84508-8",
        "publication_date": "14 Jan 2025",
        "abstract": "The conventional statistical approach for analyzing resting state functional MRI (rs-fMRI) data struggles to accurately distinguish between patients with multiple sclerosis (MS) and those with neuromyelitis optic spectrum disorders (NMOSD), highlighting the need for improved diagnostic efficacy. In this study, multilevel functional metrics including resting state functional connectivity, amplitude of low frequency fluctuation (ALFF), and regional homogeneity (ReHo) were calculated and extracted from 116 regions of interest in the anatomical automatic labeling atlas. Subsequently, classifiers were developed using different combinations of these selected features to distinguish between MS and NMOSD. Compared to models based on individual MRI features, support vector machine (SVM) and logistic regression (LR) models that integrated multilevel functional features such as RSFC, ALFF, and ReHo demonstrated the highest levels of performance on the testing cohorts (SVM, AUC = 0.857; LR, AUC = 0.929). Adding structural features of gray matter volume (GMV) data did not notably improve the classification performance of the machine learning models using multilevel rs-fMRI features. Notably, similar trends were observed across different brain templates, with models based on RSFC, ALFF, and ReHo yielding optimal performance. These findings suggest that utilizing multilevel fMRI features can effectively differentiate between MS and NMOSD patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Systematic review of machine learning applications using nonoptical motion tracking in surgery",
        "link": "https://www.nature.com/articles/s41746-024-01412-1",
        "publication_date": "14 Jan 2025",
        "abstract": "This systematic review explores machine learning (ML) applications in surgical motion analysis using non-optical motion tracking systems (NOMTS), alone or with optical methods. It investigates objectives, experimental designs, model effectiveness, and future research directions. From 3632 records, 84 studies were included, with Artificial Neural Networks (38%) and Support Vector Machines (11%) being the most common ML models. Skill assessment was the primary objective (38%). NOMTS used included internal device kinematics (56%), electromagnetic (17%), inertial (15%), mechanical (11%), and electromyography (1%) sensors. Surgical settings were robotic (60%), laparoscopic (18%), open (16%), and others (6%). Procedures focused on bench-top tasks (67%), clinical models (17%), clinical simulations (9%), and non-clinical simulations (7%). Over 90% accuracy was achieved in 36% of studies. Literature shows NOMTS and ML can enhance surgical precision, assessment, and training. Future research should advance ML in surgical environments, ensure model interpretability and reproducibility, and use larger datasets for accurate evaluation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Targeted dual biologic therapy for erythroderma of unknown etiology guided by high-parameter peripheral blood immunophenotyping",
        "link": "https://www.nature.com/articles/s41598-024-81060-3",
        "publication_date": "14 Jan 2025",
        "abstract": "Erythroderma is a severe and heterogeneous inflammatory skin condition with little guidance on the approach to management in cases of unknown etiology. To guide therapeutic selection, we sought to create an immunophenotyping platform able to identify aberrant cell populations and cytokines in subtypes of erythroderma. We performed high-parameter flow cytometry on peripheral blood mononuclear cells (PBMCs) and whole blood of a patient with refractory idiopathic erythroderma, erythrodermic patients with Sézary syndrome and pityriasis rubra pilaris, and healthy controls. We found that the index patient had a novel form of erythroderma characterized by increased interleukin (IL)-13- and IL-17-producing γVδ2 T cells, basophils, and activated platelets. Whole-genome sequencing of PBMCs and immunofluorescence staining of skin biopsies revealed increased expression of Th2- (IL-13, IL-4Rα) and Th17-associated markers (IL-17, IL-17Rα) and non-functional mutations associated with Th2 and Th17 signaling, demonstrating that PBMCs can reflect cutaneous disease pathology. Targeted intervention via dual dupilumab and secukinumab therapy resulted in complete disease control and reduction of immunopathogenic cell populations and cytokines. This study highlights a novel form of erythroderma with concomitant Th2 and Th17 dysregulation and introduces a minimally invasive peripheral blood-based immunophenotyping platform that offers a personalized medicine approach to the management of systemic inflammatory diseases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Large Language Models lack essential metacognition for reliable medical reasoning",
        "link": "https://www.nature.com/articles/s41467-024-55628-6",
        "publication_date": "14 Jan 2025",
        "abstract": "Large Language Models have demonstrated expert-level accuracy on medical board examinations, suggesting potential for clinical decision support systems. However, their metacognitive abilities, crucial for medical decision-making, remain largely unexplored. To address this gap, we developed MetaMedQA, a benchmark incorporating confidence scores and metacognitive tasks into multiple-choice medical questions. We evaluated twelve models on dimensions including confidence-based accuracy, missing answer recall, and unknown recall. Despite high accuracy on multiple-choice questions, our study revealed significant metacognitive deficiencies across all tested models. Models consistently failed to recognize their knowledge limitations and provided confident answers even when correct options were absent. In this work, we show that current models exhibit a critical disconnect between perceived and actual capabilities in medical reasoning, posing significant risks in clinical settings. Our findings emphasize the need for more robust evaluation frameworks that incorporate metacognitive abilities, essential for developing reliable Large Language Model enhanced clinical decision support systems.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of immune-derived molecular markers for preeclampsia based on multiple machine learning algorithms",
        "link": "https://www.nature.com/articles/s41598-025-86442-9",
        "publication_date": "13 Jan 2025",
        "abstract": "Preeclampsia (PE) is a major pregnancy-specific cardiovascular complication posing latent life-threatening risks to mothers and neonates. The contribution of immune dysregulation to PE is not fully understood, highlighting the need to explore molecular markers and their relationship with immune infiltration to potentially inform therapeutic strategies. We used bioinformatics tools to analyze gene expression data from the Gene Expression Omnibus (GEO) database using the GEOquery package in R. Differential expression analysis was performed using the DESeq2 and limma packages, followed by analysis of variance to identify immune-related differentially expressed genes (DEGs). Several machine learning algorithms, including least absolute shrinkage and selection operator (LASSO), bagged trees, and random forest (RF), were used to select immune-related signaling genes closely associated with the occurrence of PE. Our analysis identified 34 immune source–related DEGs. Using the identified PE- and immune source–related genes, we constructed a diagnostic forecasting model employing several ML algorithms. We identified six types of statistically significant immune cells in patients with PE and discovered a strong relationship between biomarkers and immune cells. Moreover, the immune-derived hub genes for PE exhibited strong binding capabilities with drugs, such as alitretinoin, tretinoin, and acitretin. This study presents a robust prediction model for PE that integrates multiple machine learning–derived immune-related biomarkers. Our results indicate that these biomarkers may outperform previously reported molecular signatures in predicting PE and provide insights into the mechanisms underlying immune dysregulation in PE. Further validation in larger cohorts could lead to their clinical application in PE prediction and treatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Blood cancer prediction model based on deep learning technique",
        "link": "https://www.nature.com/articles/s41598-024-84475-0",
        "publication_date": "13 Jan 2025",
        "abstract": "Blood cancer is among the critical health concerns among people around the world and normally emanates from genetic and environmental issues. Early detection becomes essential, as the rate of death associated with it is high, to ensure that the rate of treatment success is up, and mortality reduced. This paper focuses on improving blood cancer diagnosis using advanced deep learning techniques like ResNetRS50, RegNetX016, AlexNet, Convnext, EfficientNet, Inception_V3, Xception, and VGG19. Among the models assessed, ResNetRS50 had better accuracy and speed with minimal error rates compared with other state-of-the-arts. This work will exploit the power of ResNetRS50 in contributing to early detection and reducing bad outcomes for blood cancer patients. Blood cancer is currently one of the deadliest diseases worldwide, resulting from a combination of genetic and non-genetic factors. It stands as a leading cause of cancer-related deaths in both developed and developing nations. Early detection of cancer is pivotal in reducing mortality rates, as it increases the likelihood of successful treatment and potential cure. The objective is to decrease mortality rates through early diagnosis of blood cancer, thus offering individuals a better chance of survival from this disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring scalable medical image encoders beyond text supervision",
        "link": "https://www.nature.com/articles/s42256-024-00965-w",
        "publication_date": "13 Jan 2025",
        "abstract": "Language-supervised pretraining has proven to be a valuable method for extracting semantically meaningful features from images, serving as a foundational element in multimodal systems within the computer vision and medical imaging domains. However, the computed features are limited by the information contained in the text, which is particularly problematic in medical imaging, in which the findings described by radiologists focus on specific observations. This challenge is compounded by the scarcity of paired imaging–text data due to concerns over the leakage of personal health information. In this work, we fundamentally challenge the prevailing reliance on language supervision for learning general-purpose biomedical imaging encoders. We introduce RAD-DINO, a biomedical image encoder pretrained solely on unimodal biomedical imaging data that obtains similar or greater performance than state-of-the-art biomedical-language-supervised models on a diverse range of benchmarks. Specifically, the quality of learned representations is evaluated on standard imaging tasks (classification and semantic segmentation), and a vision–language alignment task (text report generation from images). To further demonstrate the drawback of language supervision, we show that features from RAD-DINO correlate with other medical records (for example, sex or age) better than language-supervised models, which are generally not mentioned in radiology reports. Finally, we conduct a series of ablations determining the factors in RAD-DINO’s performance. In particular, we observe that RAD-DINO’s downstream performance scales well with the quantity and diversity of training data, demonstrating that image-only supervision is a scalable approach for training a foundational biomedical image encoder.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive equation derived from 6,497 doubly labelled water measurements enables the detection of erroneous self-reported energy intake",
        "link": "https://www.nature.com/articles/s43016-024-01089-5",
        "publication_date": "13 Jan 2025",
        "abstract": "Nutritional epidemiology aims to link dietary exposures to chronic disease, but the instruments for evaluating dietary intake are inaccurate. One way to identify unreliable data and the sources of errors is to compare estimated intakes with the total energy expenditure (TEE). In this study, we used the International Atomic Energy Agency Doubly Labeled Water Database to derive a predictive equation for TEE using 6,497 measures of TEE in individuals aged 4 to 96 years. The resultant regression equation predicts expected TEE from easily acquired variables, such as body weight, age and sex, with 95% predictive limits that can be used to screen for misreporting by participants in dietary studies. We applied the equation to two large datasets (National Diet and Nutrition Survey and National Health and Nutrition Examination Survey) and found that the level of misreporting was >50%. The macronutrient composition from dietary reports in these studies was systematically biased as the level of misreporting increased, leading to potentially spurious associations between diet components and body mass index.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Robustly detecting mpox and non-mpox using a deep learning framework based on image inpainting",
        "link": "https://www.nature.com/articles/s41598-025-85771-z",
        "publication_date": "10 Jan 2025",
        "abstract": "Due to the lack of efficient mpox diagnostic technology, mpox cases continue to increase. Recently, the great potential of deep learning models in detecting mpox and non-mpox has been proven. However, existing methods are susceptible to interference from various noises in real-world settings, require diverse non-mpox images, and fail to detect abnormal input, which makes them unsuitable for practical deployment and application. To address these challenges, we proposed a novel strategy based on image inpainting called “Mask, Inpainting, and Measure” (MIM). In MIM’s pipeline, a generative adversarial network learns feature representations of mpox images by inpainting the masked mpox images. On this basis, MIM measure the similarity between the inpainted image and the original image to detect mpox and non-mpox. Compared with multi-class classification models, MIM can handle unknown categories and abnormal inputs more effectively. We used the recognized mpox dataset (MSLD) and a dataset containing 18 categories of non-mpox skin diseases to verify the effectiveness and robustness of MIM. Experimental results show that the average AUROC of MIM achieves 0.8237. In addition, external clinical testing further demonstrates the robustness of MIM. Importantly, we developed a free smartphone app to help the public and healthcare professionals detect mpox more conveniently.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Laboratory validation of patient-specific templating for total knee arthroplasty",
        "link": "https://www.nature.com/articles/s41598-024-77794-9",
        "publication_date": "10 Jan 2025",
        "abstract": "Patient-specific templating (PST), which is a sister procedure to patient-specific instrumentation (PSI) but hospital-based, is relatively less complex and less expensive than robotics and navigation. However, there are some concerns about the PST including the process of preoperative planning, 3D printing and material, positioning of PST intraoperatively, availability, and clinical value. The purpose of this study was to validate the technical accuracy and reliability of the PST technique in the lab and to report the outcomes of clinical application. To test the reliability of the PST technique, five observers positioned the PST templates five times over the distal femur and proximal tibial whilst a navigation system was used to measure the level of bone cutting, coronal and sagittal alignment, and rotation in both femur and tibia. The mean alignment error in all planes was 0.67° (maximum 2.5°). Concerning the bone (femoral and tibial) cutting, the mean error was 0.32 mm (maximum 1 mm). The qualitative and quantitative analysis showed an overall agreement between observers (p < 0.05). The laboratory part of this study showed that the positioning of the PST over the proximal tibia and distal femur during TKA is reliable. There were statistically insignificant intraobserver and interobserver variations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Small-molecule-induced ERBB4 activation to treat heart failure",
        "link": "https://www.nature.com/articles/s41467-024-54908-5",
        "publication_date": "10 Jan 2025",
        "abstract": "Heart failure is a common and deadly disease requiring new treatments. The neuregulin-1/ERBB4 pathway offers cardioprotective benefits, but using recombinant neuregulin-1 as therapy has limitations due to the need for intravenous delivery and lack of receptor specificity. We hypothesize that small-molecule activation of ERBB4 could protect against heart damage and fibrosis. To test this, we conduct a screening of 10,240 compounds and identify eight structurally similar ones (EF-1 to EF-8) that induce ERBB4 dimerization, with EF-1 being the most effective. EF-1 reduces cell death and hypertrophy in cardiomyocytes and decreases collagen production in cardiac fibroblasts in an ERBB4-dependent manner. In wild-type mice, EF-1 inhibits angiotensin-II-induced fibrosis in males and females and reduces heart damage caused by doxorubicin and myocardial infarction in females, but not in Erbb4-null mice. This study shows that small-molecule ERBB4 activation is feasible and may lead to a novel class of drugs for treating heart failure.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Network-based transfer of pan-cancer immunotherapy responses to guide breast cancer prognosis",
        "link": "https://www.nature.com/articles/s41540-024-00486-7",
        "publication_date": "10 Jan 2025",
        "abstract": "Breast cancer prognosis is complicated by tumor heterogeneity. Traditional methods focus on cancer-specific gene signatures, but cross-cancer strategies that provide deeper insights into tumor homogeneity are rarely used. Immunotherapy, particularly immune checkpoint inhibitors, results from variable responses across cancers, offering valuable prognostic insights. We introduced a network-based transfer (NBT) of pan-cancer immunotherapy responses to enhance breast cancer prognosis using node embedding and heat diffusion algorithms, identifying gene signatures netNE and netHD. Our results showed that netHD and netNE outperformed seven established breast cancer signatures in prognostic metrics, with netHD excelling. All nine gene signatures were grouped into three clusters, with netHD and netNE enriching the immune-related interferon-gamma pathway. Stratifying TCGA patients into two groups based on netHD revealed significant immunological differences and variations in 20 of 50 cancer hallmarks, emphasizing immune-related markers. This approach leverages pan-cancer insights to enhance breast cancer prognosis, facilitating insight transfer and improving tumor homogeneity understanding.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Estimating hip impact velocity and acceleration from video-captured falls using a pose estimation algorithm",
        "link": "https://www.nature.com/articles/s41598-025-85934-y",
        "publication_date": "10 Jan 2025",
        "abstract": "Analyzing video footage of falls in older adults has emerged as an alternative to traditional lab studies. However, this approach is limited by the labor-intensive process of manually labeling body parts. To address this limitation, we aimed to validate the use of the AI-based pose estimation algorithm (OpenPose) in assessing the hip impact velocity and acceleration of video-captured falls. We analyzed 110 videos of 13 older adults (64.0 ± 5.9 years old) falling sideways in an experimental setting. By applying OpenPose to each video, we generated a time series of hip positions in the video, which were then analyzed using custom MATLAB code to calculate hip impact velocity and acceleration. These calculations were compared against ground truth measurements obtained from motion capture systems (VICON for hip impact velocity) and inertial measurement units (MC10 for hip impact acceleration). We examined the agreement between the ground truth and OpenPose measurements in terms of mean of absolute error (MAE), mean of absolute percentage error (MAPE), and bias (mean of error). Results showed that OpenPose had a good accuracy in estimating hip impact velocity with minimal bias (MAE: 0.17 ± 0.13 m/s, MAPE: 7.28 ± 5.21%; percent bias: − 1.27%). However, its estimation of hip impact acceleration (i.e., peak vertical hip acceleration at impact) showed poor accuracy (MAPE: 26.3 ± 19.4%), showing substantial underestimation in instances of high acceleration impacts (> 3.0 g). Further ANOVA analysis revealed OpenPose’s ability to discern significant differences in hip impact velocity and acceleration based on the movement response utilized during the fall (e.g., stick-like fall, tuck-and-roll, knee block). This is the first study to validate the use of a pose estimation algorithm for identifying the hip impact kinematics in video-captured falls among older adults. Future validation studies involving diverse camera settings, fall contexts, and biomechanical parameters are warranted to extend this support for using pose estimation algorithms in this field.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Shaping current European mitochondrial haplogroup frequency in response to infection: the case of SARS-CoV-2 severity",
        "link": "https://www.nature.com/articles/s42003-024-07314-y",
        "publication_date": "09 Jan 2025",
        "abstract": "The frequency of mitochondrial DNA haplogroups (mtDNA-HG) in humans is known to be shaped by migration and repopulation. Mounting evidence indicates that mtDNA-HG are not phenotypically neutral, and selection may contribute to its distribution. Haplogroup H, the most abundant in Europe, improved survival in sepsis. Here we developed a random forest trained model for mitochondrial haplogroup calling using data procured from GWAS arrays. Our results reveal that in the context of the SARS-CoV-2 pandemic, HV branch were found to represent protective factors against the development of critical SARS-CoV-2 in an analysis of 14,349 patients. These results highlight the role of mtDNA in the response to infectious diseases and support the proposal that its expansion and population proportion has been influenced by selection through successive pandemics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A super-resolution algorithm to fuse orthogonal CT volumes using OrthoFusion",
        "link": "https://www.nature.com/articles/s41598-025-85516-y",
        "publication_date": "09 Jan 2025",
        "abstract": "OrthoFusion, an intuitive super-resolution algorithm, is presented in this study to enhance the spatial resolution of clinical CT volumes. The efficacy of OrthoFusion is evaluated, relative to high-resolution CT volumes (ground truth), by assessing image volume and derived bone morphological similarity, as well as its performance in specific applications in 2D-3D registration tasks. Results demonstrate that OrthoFusion significantly reduced segmentation time, while improving structural similarity of bone images and relative accuracy of derived bone model geometries. Moreover, it proved beneficial in the context of biplane videoradiography, enhancing the similarity of digitally reconstructed radiographs to radiographic images and improving the accuracy of relative bony kinematics. OrthoFusion’s simplicity, ease of implementation, and generalizability make it a valuable tool for researchers and clinicians seeking high spatial resolution from existing clinical CT data. This study opens new avenues for retrospectively utilizing clinical images for research and advanced clinical purposes, while reducing the need for additional scans, mitigating associated costs and radiation exposure.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Using the appropriate modulus of elasticity of periodontal ligament matters in stress analysis of human first premolar tooth and periodontium structures",
        "link": "https://www.nature.com/articles/s41598-025-85578-y",
        "publication_date": "09 Jan 2025",
        "abstract": "Although the modulus of elasticity of the human periodontal ligament (EPDL) values used in dentistry widely ranged from 0.01 to 175 MPa, the exact EPDL value has not been determined. This study aimed to verify whether and how EPDL values affect the stress distribution over the tooth and periodontium structures, and to determine the appropriate EPDL range. A 3D multi-component human first premolar model was created based on a cone-beam computed tomography dataset. Finite element analysis was performed to analyze stress distribution and deformation of the structures under an average Asian occlusal force with different EPDL values (0.0689–68.9 MPa). The low EPDL caused excessive PDL deformation, contributing to a non-uniform stress distribution and localized stress concentration, especially in the cementum, enamel, and dentin. With the low EPDL value, the stress magnitude was overestimated by 1,195%, potentially leading to erroneous conclusions regarding material failure and tooth movement. The EPDL value significantly affects the stress magnitude and distribution over the tooth and periodontium. The appropriate EPDL range of 0.964 ± 0.276 MPa is suggested for human first premolars to ensure accurate and reliable FEA simulations and help avoid misinterpretation of the stress results, which could compromise orthodontic planning and restoration design.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Unveiling the molecular mechanisms of recurrent miscarriage through endoplasmic reticulum stress related gene expression",
        "link": "https://www.nature.com/articles/s41598-024-77642-w",
        "publication_date": "09 Jan 2025",
        "abstract": "Recurrent miscarriage (RM) is a reproductive disorder affecting couples worldwide. The underlying molecular mechanisms remain elusive, even though emerging evidence has implicated endoplasmic reticulum stress (ERS). We investigated RM- and ERS-related genes to develop a diagnostic model that can enhance predictive ability. We utilized the R package GEO query to extract and process Gene Expression Omnibus data, applying batch correction, normalization, and differential gene expression analysis with limma. ERS-related differentially expressed genes (ERSRGs) were identified through Gene Ontology and Kyoto Encyclopedia of genes and genomes analyses, and their diagnostic potential was assessed. Diagnostic models were developed using logistic regression, support vector machines, and least absolute shrinkage and selection operators, complemented by immune infiltration analysis and regulatory network construction. Integrated analysis revealed 1395 differentially expressed genes (DEGs), including 626 upregulated and 769 downregulated genes. Seventeen ERSRGs were identified. KEAP1 and YIPF5 displayed high diagnostic accuracy (area under the curve [AUC] > 0.9). Gene Ontology and Kyoto Encyclopedia of genes and genomes analyses highlighted the role of ESRDEGs in cellular responses to ERS, protein processing, and apoptosis. Diagnostic models demonstrated robust predictive performance (AUC > 0.9). A molecular interaction was found between RM and the ERS response, and the identified ESRDEGs could serve as potential biomarkers for diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Dynamic effects of psychiatric vulnerability, loneliness and isolation on distress during the first year of the COVID-19 pandemic",
        "link": "https://www.nature.com/articles/s44220-024-00371-6",
        "publication_date": "09 Jan 2025",
        "abstract": "The COVID-19 pandemic’s impact on mental health is challenging to quantify because pre-existing risk, disease burden and public policy varied across individuals, time and regions. Longitudinal, within-person analyses can determine whether pandemic-related changes in social isolation impacted mental health. We analyzed time-varying associations between psychiatric vulnerability, loneliness, psychological distress and social distancing in a US-based study during the first year of the pandemic. We surveyed 3,655 participants about psychological health and COVID-19-related circumstances every 2 weeks for 6 months. We combined self-reports with regional social distancing estimates and a classifier that predicted probability of psychiatric diagnosis at enrollment. Loneliness and psychiatric vulnerability both impacted psychological distress. Loneliness and distress were also linked to social isolation and stress associated with distancing, and psychiatric vulnerability shaped how regional distancing affected loneliness across time. Public health policies should address loneliness when encouraging social distancing, particularly in those at risk for psychiatric conditions.",
        "conclusions": "Our large longitudinal study of mental health measured dynamic relationships between loneliness, social distancing and mental health throughout the first year of the COVID-19 pandemic. Our results indicate that likelihood of previous psychiatric diagnosis and week-to-week fluctuations in loneliness were the strongest predictors of psychological distress across time. Individuals’ responses to social distancing also predicted distress and loneliness, and the association between distancing-related stress and psychological distress was mediated by changes in loneliness. The impact of loneliness was both related to, and distinct from, the impact of objective social isolation. This highlights loneliness as a key target for interventions to improve mental health, particularly in future public health crises that require social distancing.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A hybrid machine learning approach for the personalized prognostication of aggressive skin cancers",
        "link": "https://www.nature.com/articles/s41746-024-01329-9",
        "publication_date": "08 Jan 2025",
        "abstract": "Accurate prognostication guides optimal clinical management in skin cancer. Merkel cell carcinoma (MCC) is the most aggressive form of skin cancer that often presents in advanced stages and is associated with poor survival rates. There are no personalized prognostic tools in use in MCC. We employed explainability analysis to reveal new insights into mortality risk factors for this highly aggressive cancer. We then combined deep learning feature selection with a modified XGBoost framework, to develop a web-based prognostic tool for MCC termed ‘DeepMerkel’. DeepMerkel can make accurate personalised, time-dependent survival predictions for MCC from readily available clinical information. It demonstrated generalizability through high predictive performance in an international clinical cohort, out-performing current population-based prognostic staging systems. MCC and DeepMerkel provide the exemplar model of personalised machine learning prognostic tools in aggressive skin cancers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Uncertainty-aware diabetic retinopathy detection using deep learning enhanced by Bayesian approaches",
        "link": "https://www.nature.com/articles/s41598-024-84478-x",
        "publication_date": "08 Jan 2025",
        "abstract": "Deep learning-based medical image analysis has shown strong potential in disease categorization, segmentation, detection, and even prediction. However, in high-stakes and complex domains like healthcare, the opaque nature of these models makes it challenging to trust predictions, particularly in uncertain cases. This sort of uncertainty can be crucial in medical image analysis; diabetic retinopathy is an example where even slight errors without an indication of confidence can have adverse impacts. Traditional deep learning models rely on single-point predictions, limiting their ability to provide uncertainty measures essential for robust clinical decision-making. To solve this issue, Bayesian approximation approaches have evolved and are gaining market traction. In this work, we implemented a transfer learning approach, building upon the DenseNet-121 convolutional neural network to detect diabetic retinopathy, followed by Bayesian extensions to the trained model. Bayesian approximation techniques, including Monte Carlo Dropout, Mean Field Variational Inference, and Deterministic Inference, were applied to represent the posterior predictive distribution, allowing us to evaluate uncertainty in model predictions. Our experiments on a combined dataset (APTOS 2019 + DDR) with pre-processed images showed that the Bayesian-augmented DenseNet-121 outperforms state-of-the-art models in test accuracy, achieving 97.68% for the Monte Carlo Dropout model, 94.23% for Mean Field Variational Inference, and 91.44% for the Deterministic model. We also measure how certain the predictions are, using an entropy and a standard deviation metric for each approach. We also evaluated the model using both AUC and accuracy scores at multiple data retention levels. In addition to overall performance boosts, these results highlight that Bayesian deep learning does not only improve classification accuracy in the detection of diabetic retinopathy but also reveals beneficial insights about how uncertainty estimation can help build more trustworthy clinical decision-making solutions.",
        "conclusions": "In this work, we aimed to fine-tune current state-of-the-art pre-trained DL models for DR classification using our pre-processed dataset. We also sought to quantify uncertainty in model predictions through Bayesian modeling approximation techniques. We enhanced the DenseNet-121 pre-trained model with Bayesian approximation techniques, including MC-Dropout, MFVI, and deterministic approaches, to develop a Bayesian DenseNet-121 CNN model capable of quantifying uncertainty by analyzing the posterior predictive distribution. Our focus was on effectively modeling uncertainty to detect and classify DR in retinal images.We experimentally verified our method using a pre-processed dataset. The experimental results provide evidence for the accuracy of our proposed methods, demonstrating the ability to quantify uncertainty, particularly with Bayesian models. Our Bayesian DenseNet-121-based CNN models achieved high accuracy in DR classification while enabling the quantification of uncertainty in classification results, which is crucial in clinical practice.In our experiments, the BCNN-MC Dropout model achieved a testing accuracy of 97.68%, with the BCNN-MFVI model showing the second-best performance at 94.23% testing accuracy and the BCNN-Deterministic model achieving a testing accuracy of 91.44%. Furthermore, our findings show that our method works just as well as the best current methods at finding DR. This shows that our BCNN models could be useful for medical image analysis tasks.Future work may involve testing on alternate DR-related datasets and also investigating alternative Bayesian approaches, including ensemble models and more advanced inference techniques for uncertainty quantification and model performance. In the future, more work will be done in these areas to enhance the clinical utility of the model and facilitate better decision-making for medical diagnostics due to proper uncertainty estimates with good calibration.In conclusion, we have developed a state-of-the-art method in Bayesian models for image analysis and transfer learning using pre-trained models. This study demonstrates the importance of uncertainty quantification in improving disease diagnosis and treatment outcomes and offers guidelines for addressing these issues. By overcoming the challenges and identifying barriers, this work provides insight into modeling uncertainty, which will aid in creating more effective and precise diagnostic tools for DR and other diseases.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of a novel disulfidptosis-related gene signature in osteoarthritis using bioinformatics analysis and experimental validation",
        "link": "https://www.nature.com/articles/s41598-025-85569-z",
        "publication_date": "08 Jan 2025",
        "abstract": "Osteoarthritis (OA) is a degenerative bone disease characterized by the destruction of joint cartilage and synovial inflammation, involving intricate immune regulation processes. Disulfidptosis, a novel form of programmed cell death, has recently been identified; however, the effects and roles of disulfidptosis-related genes (DR-DEGs) in OA remain unclear. We obtained six OA datasets from the GEO database, using four as training sets and two as validation sets. Differential expression analysis was employed to identify DR-DEGs, and unique molecular subtypes of OA were constructed based on these DR-DEGs. Subsequently, the immune microenvironment of OA patients was comprehensively analyzed using the “CIBERSORT” algorithm for immune infiltration. Various machine learning algorithms were utilized to screen characteristic DR-DEGs, and nomogram models and ROC curves were built based on these genes. The scRNA dataset (GSE169454) was used to classify chondrocytes in OA samples into distinct cell types, further exploring the gene distribution and correlation of characteristic DR-DEGs with specific cell subpopulations. Moreover, the expression levels of four characteristic DR-DEGs were validated through OA cell models and rat models. In our study, we identified 10 DR-DEGs with significant differences in expression within OA samples. Based on these DR-DEGs, two distinct molecular subtypes were recognized (cluster 1 and 2). ZNF484 and NDUFS1 were found to be significantly overexpressed in subtype 1, while the infiltration abundance of activated mast cells was markedly elevated in subtype 2. Moreover, significant differences were observed in the infiltration proportions of 11 immune cell types between OA and control samples, with 9 DR-DEGs demonstrating substantial correlations with immune cell infiltration levels. Further analysis of the scRNA dataset revealed that SLC3A2 and NDUFC1 were predominantly expressed in the preHTC subpopulation. All 10 DR-DEGs exhibited notably higher expression in the EC subpopulation across various cell types. The proportion of EC subgroups with high SLC3A2 expression increased, mainly enriching pathways related to inflammation, such as the IL-17 signaling pathway and TGF-beta signaling pathway. Using machine learning, we identified four characteristic DR-DEGs, which, in combination with the nomogram and ROC models, demonstrated promising performance in the diagnosis of OA. Additionally, in vivo validation confirmed a significant elevation of PPM1F expression in OA models. This study identified DR-DEGs as potential biomarkers for the diagnosis and classification of OA and provided a preliminary understanding of their role in the immune microenvironment. However, further experimental and clinical studies are required to validate their diagnostic value and therapeutic potential.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clustering-based binary Grey Wolf Optimisation model with 6LDCNNet for prediction of heart disease using patient data",
        "link": "https://www.nature.com/articles/s41598-025-85561-7",
        "publication_date": "08 Jan 2025",
        "abstract": "In recent years, the healthcare data system has expanded rapidly, allowing for the identification of important health trends and facilitating targeted preventative care. Heart disease remains a leading cause of death in developed countries, often leading to consequential outcomes such as dementia, which can be mitigated through early detection and treatment of cardiovascular issues. Continued research into preventing strokes and heart attacks is crucial. Utilizing the wealth of healthcare data related to cardiac ailments, a two-stage medical data classification and prediction model is proposed in this study. Initially, Binary Grey Wolf Optimization (BGWO) is used to cluster features, with the grouped information then utilized as input for the prediction model. An innovative 6-layered deep convolutional neural network (6LDCNNet) is designed for the classification of cardiac conditions. Hyper-parameter tuning for 6LDCNNet is achieved through an improved optimization method. The resulting model demonstrates promising performance on both the Cleveland dataset, achieving a convergence of 96% for assessing severity, and the echocardiography imaging dataset, with an impressive 98% convergence. This approach has the potential to aid physicians in diagnosing the severity of cardiac diseases, facilitating early interventions that can significantly reduce mortality associated with cardiovascular conditions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "OBF-Psychiatric, a motor activity dataset of patients diagnosed with major depression, schizophrenia, and ADHD",
        "link": "https://www.nature.com/articles/s41597-025-04384-3",
        "publication_date": "08 Jan 2025",
        "abstract": "Mental health is vital to human well-being, and prevention strategies to address mental illness have a significant impact on the burden of disease and quality of life. With the recent developments in body-worn sensors, it is now possible to continuously collect data that can be used to gain insights into mental health states. This has the potential to optimize psychiatric assessment, thereby improving patient experiences and quality of life. However, access to high-quality medical data for research purposes is limited, especially regarding diagnosed psychiatric patients. To this extent, we present the OBF-Psychiatric dataset which comprises motor activity recordings of patients with bipolar and unipolar major depression, schizophrenia, and ADHD (attention deficit hyperactivity disorder). The dataset also contains data from a clinical sample diagnosed with various mood and anxiety disorders, as well as a healthy control group, making it suitable for building machine learning models and other analytical tools. It contains recordings from 162 individuals totalling 1565 days worth of motor activity data with a mean of 9.6 days per individual.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Toward expert-level medical question answering with large language models",
        "link": "https://www.nature.com/articles/s41591-024-03423-7",
        "publication_date": "08 Jan 2025",
        "abstract": "Large language models (LLMs) have shown promise in medical question answering, with Med-PaLM being the first to exceed a ‘passing’ score in United States Medical Licensing Examination style questions. However, challenges remain in long-form medical question answering and handling real-world workflows. Here, we present Med-PaLM 2, which bridges these gaps with a combination of base LLM improvements, medical domain fine-tuning and new strategies for improving reasoning and grounding through ensemble refinement and chain of retrieval. Med-PaLM 2 scores up to 86.5% on the MedQA dataset, improving upon Med-PaLM by over 19%, and demonstrates dramatic performance increases across MedMCQA, PubMedQA and MMLU clinical topics datasets. Our detailed human evaluations framework shows that physicians prefer Med-PaLM 2 answers to those from other physicians on eight of nine clinical axes. Med-PaLM 2 also demonstrates significant improvements over its predecessor across all evaluation metrics, particularly on new adversarial datasets designed to probe LLM limitations (P < 0.001). In a pilot study using real-world medical questions, specialists preferred Med-PaLM 2 answers to generalist physician answers 65% of the time. While specialist answers were still preferred overall, both specialists and generalists rated Med-PaLM 2 to be as safe as physician answers, demonstrating its growing potential in real-world medical applications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multimodal fuzzy logic-based gait evaluation system for assessing children with cerebral palsy",
        "link": "https://www.nature.com/articles/s41598-025-85172-2",
        "publication_date": "08 Jan 2025",
        "abstract": "Gait analysis is crucial for identifying functional deviations from the normal gait cycle and is essential for the individualized treatment of motor disorders such as cerebral palsy (CP). The primary contribution of this study is the introduction of a multimodal fuzzy logic system-based gait index (FLS-GIS), designed to provide numerical scores for gait patterns in both healthy children and those with CP, before and after surgery. This study examines and evaluates the surgical outcomes in children with CP who have undergone Achilles tendon lengthening. The FLS-GIS utilizes hierarchical feature fusion and fuzzy logic models to systematically evaluate and score gait patterns, focusing on spatial and temporal features across the hip, knee, and ankle joints. The two FLS types-1 (FLS-GIS-T1) and type-2 (FLS-GIS-T2) indices, respectively, were implemented to comprehensively study gait profiles. Starting with the gait parameters of all subjects, the changes in gait parameters in post-surgery children reflect significant improvements in gait dynamics, bringing walking patterns in CP children closer to those of their typically healthy peers. Both FLS-GIS-T1 and FLS-GIS-T2 demonstrated significant improvements in post-surgery evaluations compared to pre-surgery assessments, with p values < 0.05 and < 0.001, respectively, when compared to traditional indices. The proposed FLS-based index offers clinicians a robust and standardized gait evaluation tool, characterized by a fixed range of values, enabling consistent assessment across various gait conditions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "EBP1 potentiates amyloid β pathology by regulating γ-secretase",
        "link": "https://www.nature.com/articles/s43587-024-00790-1",
        "publication_date": "08 Jan 2025",
        "abstract": "The abnormal deposition of amyloid β (Aβ), produced by proteolytic cleavage events of amyloid precursor protein involving the protease γ-secretase and subsequent polymerization into amyloid plaques, plays a key role in the neuropathology of Alzheimer’s disease (AD). Here we show that ErbB3 binding protein 1 (EBP1)/proliferation-associated 2G4 (PA2G4) interacts with presenilin, a catalytic subunit of γ-secretase, inhibiting Aβ production. Mice lacking forebrain Ebp1/Pa2g4 recapitulate the representative phenotypes of late-onset sporadic AD, displaying an age-dependent increase in Aβ deposition, amyloid plaques and cognitive dysfunction. In postmortem brains of patients with AD and 5x-FAD mice, we found that EBP1 is proteolytically cleaved by asparagine endopeptidase at N84 and N204 residues, compromising its inhibitory effect on γ-secretase, increasing Aβ aggregation and neurodegeneration. Accordingly, injection of AAV2-Ebp1 wild-type or an asparagine endopeptidase-uncleavable mutant into the brains of 5x-FAD mice decreased Aβ generation and alleviated the behavioral impairments. Thus, our study suggests that EBP1 acts as an inhibitor of γ-secretase on amyloid precursor protein cleavage and preservation of functional EBP1 could be a therapeutic strategy for AD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction analysis of human brucellosis cases in Ili Kazakh Autonomous Prefecture Xinjiang China based on time series",
        "link": "https://www.nature.com/articles/s41598-024-80513-z",
        "publication_date": "07 Jan 2025",
        "abstract": "Human brucellosis remains a significant public health issue in the Ili Kazak Autonomous Prefecture, Xinjiang, China. To assist local Centers for Disease Control and Prevention (CDC) in promptly formulate effective prevention and control measures, this study leveraged time-series data on brucellosis cases from February 2010 to September 2023 in Ili Kazak Autonomous Prefecture. Three distinct predictive modeling techniques—Seasonal Autoregressive Integrated Moving Average (SARIMA), eXtreme Gradient Boosting (XGBoost), and Long Short-Term Memory (LSTM) networks—were employed for long-term forecasting. Further, the optimal model will be used to explore the impact of COVID-19 on the transmission of Human brucellosis in the region. We constructed a SARIMA(4,1,1)(3,1,2)12 model, an XGBoost model with a time lag of 22, and an LSTM model featuring 3 LSTM layers and 100 neurons in the fully connected layer to predict monthly reported cases from January 2021 to September 2023. The results indicated that the occurrence of brucellosis exhibits pronounced seasonal patterns, with higher incidence during summer and autumn, peaking in June annually. Performance evaluations revealed low Mean Absolute Error (MAE), Root Mean Square Error (RMSE), and Symmetric Mean Absolute Percentage Error (SMAPE) for all three models. Specifically, the coefficient of determination (R2) was 0.6177 for the SARIMA model, 0.8033 for the XGBoost model, and 0.6523 for the LSTM model. The study found that the XGBoost model outperformed the other two in long-term forecasting of brucellosis, demonstrating higher predictive accuracy. This discovery can aid public health departments in advancing the deployment of prevention and control resources, particularly during peak seasons of brucellosis. It was also found that the impact of the COVID-19 pandemic on the transmission of human brucellosis in the region was minimal. This research not only provides a reliable predictive tool but also offers a scientific basis for formulating early prevention and control strategies, potentially reducing the spread of this disease.",
        "conclusions": "In this study, we constructed SARIMA, XGBoost, and LSTM models and used them to predict brucellosis in the Ili Kazakh Autonomous Prefecture of Xinjiang. The results showed that the SARIMA model and LSTM model performed poorly in predicting the monthly number of human brucellosis cases in Xinjiang, while the XGBoost model showed excellent performance. The impact of the COVID-19 period on the transmission of human brucellosis in the region is minimal. Using XGBoost to predict brucellosis in the Ili Kazakh Autonomous Prefecture is of great significance for early warning, prevention, and control.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluation of an acne lesion detection and severity grading model for Chinese population in online and offline healthcare scenarios",
        "link": "https://www.nature.com/articles/s41598-024-84670-z",
        "publication_date": "07 Jan 2025",
        "abstract": "Accurate acne severity grading is crucial for effective clinical treatment and timely follow-up management. Although some artificial intelligence methods have been developed to automate the process of acne severity grading, the diversity of acne image capture sources and the various application scenarios can affect their performance. Therefore, it’s necessary to design special methods and evaluate them systematically before introducing them into clinical practice. To develop and evaluate a deep learning-based algorithm that could accurately accomplish acne lesion detection and severity grading simultaneously in different healthcare scenarios. We collected 2,157 facial images from two public and three self-built datasets for model development and evaluation. An algorithm called AcneDGNet was constructed with a feature extraction module, a lesion detection module and a severity grading module. Its performance was evaluated in both online and offline healthcare scenarios. Experimental results on the largest and most diverse evaluation datasets revealed that the overall performance for acne severity grading achieved accuracies of 89.5% in online scenarios and 89.8% in offline scenarios. For follow-up visits in online scenarios, the accuracy for detecting the changing trends reached 87.8%, with a total counting error of 1.91 ± 3.28 for all acne lesions. Additionally, the prospective evaluation demonstrated that AcneDGNet was not only much more accurate for acne grading than junior dermatologists but also comparable to the accuracy of senior dermatologists. These findings indicated that AcneDGNet can effectively assist dermatologists and patients in the diagnosis and management of acne, both in online and offline healthcare scenarios.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence for hemodynamic monitoring with a wearable electrocardiogram monitor",
        "link": "https://www.nature.com/articles/s43856-024-00730-5",
        "publication_date": "07 Jan 2025",
        "abstract": "The ability to non-invasively measure left atrial pressure would facilitate the identification of patients at risk of pulmonary congestion and guide proactive heart failure care. Wearable cardiac monitors, which record single-lead electrocardiogram data, provide information that can be leveraged to infer left atrial pressures.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "External validation of an artificial intelligence model using clinical variables, including ICD-10 codes, for predicting in-hospital mortality among trauma patients: a multicenter retrospective cohort study",
        "link": "https://www.nature.com/articles/s41598-025-85420-5",
        "publication_date": "07 Jan 2025",
        "abstract": "Artificial intelligence (AI) is being increasingly applied in healthcare to improve patient care and clinical outcomes. We previously developed an AI model using ICD-10 (International Classification of Diseases, Tenth Revision) codes with other clinical variables to predict in-hospital mortality among trauma patients from a nationwide database. This study aimed to externally validate the performance of the AI model. Validation was conducted using a multicenter retrospective cohort study design, analyzing patient data from January 2020 to December 2021. The study included trauma patients based on specific ICD-10 codes, with other clinical variables. The performance of the AI model was evaluated against conventional metrics, including the ISS, and the ICISS (ICD-based ISS), using sensitivity, specificity, accuracy, balanced accuracy, precision, F1-score, and area under the receiver operating characteristic curve (AUROC) analyses. Data from 4,439 patients were analyzed. The AI model demonstrated high overall performance, achieving an AUROC of 0.9448 and a balanced accuracy of 85.08%, thereby outperforming traditional scoring systems such as ISS, or ICISS. Furthermore, the model accurately predicted mortality across datasets from each hospital (AUROCs of 0.9234 and 0.9653, respectively) despite significant differences in hospital characteristics. In the subset of patients with ISS < 9, the model showed a robust AUROC of 0.9043, indicating its effectiveness in predicting mortality, even in cases with lower-severity injuries. For patients with ISSs ≥ 9, the model maintained high sensitivity (93.60%) and balanced accuracy (77.08%), proving its reliability in more severe injury cases. External validation demonstrated the AI model’s high predictive accuracy and reliability in assessing in-hospital mortality risk among trauma patients across different injury severities and heterogeneous cohorts. These findings support the model’s potential integration into emergency departments and offer a significant tool for enhancing patient triage and treatment protocols.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Healthcare professionals and the public sentiment analysis of ChatGPT in clinical practice",
        "link": "https://www.nature.com/articles/s41598-024-84512-y",
        "publication_date": "07 Jan 2025",
        "abstract": "To explore the attitudes of healthcare professionals and the public on applying ChatGPT in clinical practice. The successful application of ChatGPT in clinical practice depends on technical performance and critically on the attitudes and perceptions of non-healthcare and healthcare. This study has a qualitative design based on artificial intelligence. This study was divided into five steps: data collection, data cleaning, validation of relevance, sentiment analysis, and content analysis using the K-means algorithm. This study comprised 3130 comments amounting to 1,593,650 words. The dictionary method showed positive and negative emotions such as anger, disgust, fear, sadness, surprise, good, and happy emotions. Healthcare professionals prioritized ChatGPT’s efficiency but raised ethical and accountability concerns, while the public valued its accessibility and emotional support but expressed worries about privacy and misinformation. Bridging these perspectives by improving reliability, safeguarding privacy, and clearly defining ChatGPT’s role is essential for its practical and ethical integration into clinical practice.",
        "conclusions": "This study revealed distinct yet overlapping sentiments among healthcare professionals and the public toward ChatGPT’s use in clinical practice. Healthcare professionals valued efficiency but voiced concerns about ethical risks and professional accountability. Non-healthcare individuals emphasized emotional support and accessibility while worrying about privacy and misinformation. Addressing these issues—such as enhancing reliability, safeguarding privacy, and defining ChatGPT’s role as a support tool—will be key to its integration. Future research should focus on aligning ChatGPT with clinical standards, and user needs to ensure it enhances healthcare delivery while maintaining the trust and ethical integrity.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning Nomogram for Predicting endometrial lesions after tamoxifen therapy in breast Cancer patients",
        "link": "https://www.nature.com/articles/s41598-024-82373-z",
        "publication_date": "06 Jan 2025",
        "abstract": "Objective Endometrial lesions are a frequent complication following breast cancer, and current diagnostic tools have limitations. This study aims to develop a machine learning-based nomogram model for predicting the early detection of endometrial lesions in patients. The model is designed to assess risk and facilitate individualized treatment strategies for premenopausal breast cancer patients. Method A retrospective study was conducted on 224 patients who underwent diagnostic curettage post-tamoxifen (TAM) therapy between November 2012 and November 2023. These patients exhibited signs of endometrial abnormalities or symptoms such as colporrhagia. Clinical data were collected and analyzed using R software (version 4.3.2) to identify factors influencing the occurrence of endometrial lesions and evaluate their predictive values. Three machine learning methods were employed to develop a risk prediction model, and their performances were compared. The best-performing model was selected to construct a nomogram of endometrial lesions. Internal validation was conducted using the bootstrap method, and the model’s accuracy and fit were assessed using the concordance index (C-index) and calibration curves. Results Independent risk factors for endometrial lesions included ultrasound characteristics, duration of TAM therapy, presence of colporrhagia, and endometrial thickness (P < 0.05). Among the machine learning methods compared, the LASSO regression integrated with a multifactorial logistic regression model demonstrated strong performance, with a concordance index (C-index) of 0.874 and effective calibration (mean absolute error of conformity: 0.014). This model achieved an accuracy of 0.853 and a precision of 0.917, with a training set AUC of 0.874 (95% CI: 0.794–0.831) and a test set AUC of 0.891 (95% CI: 0.777-1.000), closely aligning the predicted risk with the actual observed risk. Conclusion The developed prediction model is effective in evaluating endometrial lesions in premenopausal breast cancer patients. This model offers a theoretical foundation for improving clinical predictions and devising tailored treatment strategies for this patient group.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Interpretable machine learning for predicting sepsis risk in emergency triage patients",
        "link": "https://www.nature.com/articles/s41598-025-85121-z",
        "publication_date": "06 Jan 2025",
        "abstract": "The study aimed to develop and validate a sepsis prediction model using structured electronic medical records (sEMR) and machine learning (ML) methods in emergency triage. The goal was to enhance early sepsis screening by integrating comprehensive triage information beyond vital signs. This retrospective cohort study utilized data from the MIMIC-IV database. Two models were developed: Model 1 based on vital signs alone, and Model 2 incorporating vital signs, demographic characteristics, medical history, and chief complaints. Eight ML algorithms were employed, and model performance was evaluated using metrics such as AUC, F1 Score, and calibration curves. SHapley Additive exPlanations (SHAP) and Local Interpretable Model-agnostic Explanations (LIME) methods were used to enhance model interpretability. The study included 189,617 patients, with 5.95% diagnosed with sepsis. Model 2 consistently outperformed Model 1 across most algorithms. In Model 2, Gradient Boosting achieved the highest AUC of 0.83, followed by Extra Tree, Random Forest, and Support Vector Machine (all 0.82). The SHAP method provided more comprehensible explanations for the Gradient Boosting algorithm. Modeling with comprehensive triage information using sEMR and ML methods was more effective in predicting sepsis at triage compared to using vital signs alone. Interpretable ML enhanced model transparency and provided sepsis prediction probabilities, offering a feasible approach for early sepsis screening and aiding healthcare professionals in making informed decisions during the triage process.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A novel RFE-GRU model for diabetes classification using PIMA Indian dataset",
        "link": "https://www.nature.com/articles/s41598-024-82420-9",
        "publication_date": "06 Jan 2025",
        "abstract": "Diabetes is a long-term condition characterized by elevated blood sugar levels. It can lead to a variety of complex disorders such as stroke, renal failure, and heart attack. Diabetes requires the most machine learning help to diagnose diabetes illness at an early stage, as it cannot be treated and adds significant complications to our health-care system. The diabetes PIMA Indian dataset (PIDD) was used for classification in several studies, it includes 768 instances and 9 features; eight of the features are the predictors, and one feature is the target. Firstly, we performed the preprocessing stage that includes mean imputation and data normalization. Afterwards, we trained the extracted features using various types of Machine Learning (ML); Random Forest (RF), Logistic Regression (LR), K-Nearest neighbor (KNN), Naïve Bayes (NB), Histogram Gradient Boost (HGB), and Gated Recurrent Unit (GRU) models. To achieve the classification for the PIDD, a new model called Recursive Feature Elimination-GRU (RFE-GRU) is proposed in this paper. RFE is vital for selecting features in the training dataset that are most important in predicting the target variable. While the GRU handles the challenge of vanishing and inflating gradient of the features results from RFE. Several predictive evaluation metrics, including precision, recall, F1-score, accuracy, and Area Under the Curve (AUC) achieved 90.50%, 90.70%, 90.50%, 90.70%, 0.9278, respectively, to verify and validate the execution of the RFE-GRU model. The comparative results showed that the RFE-GRU model is better than other classification models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive modeling of consecutive intravenous immunoglobulin treatment resistance in Kawasaki disease: A nationwide study",
        "link": "https://www.nature.com/articles/s41598-025-85394-4",
        "publication_date": "06 Jan 2025",
        "abstract": "Kawasaki disease (KD) is a leading cause of acquired heart disease in children, often resulting in coronary artery complications such as dilation, aneurysms, and stenosis. While intravenous immunoglobulin (IVIG) is effective in reducing immunologic inflammation, 10–15% of patients do not respond to initial therapy, and some show resistance even after two consecutive treatments. Predicting which patients will not respond to these two IVIG treatments is crucial for guiding treatment strategies and improving outcomes. This study aimed to forecast resistance to two consecutive IVIG treatments using advanced machine learning models based on clinical and laboratory data. Data from the 9th National Kawasaki Disease Patient Survey by the Korean Kawasaki Disease Society encompassing 15,378 patients (mean age 33.0 ± 24.8 months; sex ratio 1.4:1) were used. Clinical and laboratory findings included white blood cell count, absolute neutrophil count (ANC), platelet count, erythrocyte sedimentation rate, serum protein, aspartate aminotransferase, alanine aminotransferase, total bilirubin, N-terminal pro-brain natriuretic peptide, and presence of pyuria. Machine learning models, including Logistic Regression (LR), Multi-Layer Perceptron (MLP), Random Forest (RF), CATBoost, Explainable Boosting Machine (EBM), and Gradient Boosting Machine (GBM), were applied to predict treatment resistance. The machine learning models achieved Area Under the Receiver Operating Characteristic Curve (AUROC) values between 0.664 and 0.791, with the GBM model exhibiting the highest AUROC of 0.791. Analysis of feature importance revealed that ANC, serum protein, platelet count, and C-reactive protein (CRP) levels were the most significant predictors of treatment resistance. The cutoff values for these predictors were 7,860/mm³ for ANC, 7.0 g/dL for serum protein, 519,000/mm³ for platelet count, and 10.4 mg/dL for CRP. Among the patients, 12.2% were refractory to the first IVIG infusion, and 2.8% did not respond to the second IVIG treatment. Additionally, 13.1% of these patients had confirmed coronary artery dilatation (CAD) in the acute phase, and 4.7% developed CAD after the acute phase. Machine learning models effectively predict resistance to consecutive IVIG treatments, allowing for early identification of high-risk patients. Key predictors include ANC, serum protein, platelet count, and CRP levels. These findings can guide personalized treatment strategies and improve outcomes for Kawasaki Disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of checkpoint inhibitor immunotherapy efficacy for cancer using routine blood tests and clinical data",
        "link": "https://www.nature.com/articles/s41591-024-03398-5",
        "publication_date": "06 Jan 2025",
        "abstract": "Predicting whether a patient with cancer will benefit from immune checkpoint inhibitors (ICIs) without resorting to advanced genomic or immunologic assays is an important clinical need. To address this, we developed and evaluated SCORPIO, a machine learning system that utilizes routine blood tests (complete blood count and comprehensive metabolic profile) alongside clinical characteristics from 9,745 ICI-treated patients across 21 cancer types. SCORPIO was trained on data from 1,628 patients across 17 cancer types from Memorial Sloan Kettering Cancer Center. In two internal test sets comprising 2,511 patients across 19 cancer types, SCORPIO achieved median time-dependent area under the receiver operating characteristic curve (AUC(t)) values of 0.763 and 0.759 for predicting overall survival at 6, 12, 18, 24 and 30 months, outperforming tumor mutational burden (TMB), which showed median AUC(t) values of 0.503 and 0.543. Additionally, SCORPIO demonstrated superior predictive performance for predicting clinical benefit (tumor response or prolonged stability), with AUC values of 0.714 and 0.641, compared to TMB (AUC = 0.546 and 0.573). External validation was performed using 10 global phase 3 trials (4,447 patients across 6 cancer types) and a real-world cohort from the Mount Sinai Health System (1,159 patients across 18 cancer types). In these external cohorts, SCORPIO maintained robust performance in predicting ICI outcomes, surpassing programmed death-ligand 1 immunostaining. These findings underscore SCORPIO’s reliability and adaptability, highlighting its potential to predict patient outcomes with ICI therapy across diverse cancer types and healthcare settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Validation and accuracy of the Hyfe cough monitoring system: a multicenter clinical study",
        "link": "https://www.nature.com/articles/s41598-025-85341-3",
        "publication_date": "06 Jan 2025",
        "abstract": "Background: The ability to passively and continuously monitor coughing for prolonged periods of time would significantly improve cough management and research. To date there is no automated clinically validated cough monitor that can be routinely used in clinical care and research. Here we describe the validation of such an automated cough monitor. Methods: This multicenter observational study compared the results of the Hyfe CoughMonitor wrist-worn device with manually counted coughs in subjects with a variety of etiologies as they went about their usual daily activities. We collected 24 h of continuous sounds from subjects while they simultaneously wore a CoughMonitor and an audio recorder. Coughs were labelled by multiple trained annotators who listened to the continuous audio recordings using validated methodology. The time stamps of these human-detected coughs were compared to those of the CoughMonitor to determine the system’s overall performance using event-to-event and hourly rate correlation analyses. Results: Over the 546 h monitored, 4,454 cough events were recorded; The overall sensitivity was 90.4% (95% CI of 88.3–92.2%). The overall false positive rate was 1.03 false positives per hour (95% CI of 0.84 to 1.24). The overall correlation between manual and CoughMonitor measured hourly coughing was high (Pearson correlation coefficient of 0.99). Two case studies of long-term monitoring of patients with chronic cough are presented. Conclusion: The present analysis of cough events demonstrated that the Hyfe CoughMonitor accurately reflects them with a high sensitivity and a low false positive rate. Future studies should focus on its potential role in the management of patients with cough in clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Gut microbiome signatures of vegan, vegetarian and omnivore diets and associated health outcomes across 21,561 individuals",
        "link": "https://www.nature.com/articles/s41564-024-01870-z",
        "publication_date": "06 Jan 2025",
        "abstract": "As plant-based diets gain traction, interest in their impacts on the gut microbiome is growing. However, little is known about diet-pattern-specific metagenomic profiles across populations. Here we considered 21,561 individuals spanning 5 independent, multinational, human cohorts to map how differences in diet pattern (omnivore, vegetarian and vegan) are reflected in gut microbiomes. Microbial profiles distinguished these common diet patterns well (mean AUC = 0.85). Red meat was a strong driver of omnivore microbiomes, with corresponding signature microbes (for example, Ruminococcus torques, Bilophila wadsworthia and Alistipes putredinis) negatively correlated with host cardiometabolic health. Conversely, vegan signature microbes were correlated with favourable cardiometabolic markers and were enriched in omnivores consuming more plant-based foods. Diet-specific gut microbes partially overlapped with food microbiomes, especially with dairy microbes, for example, Streptococcus thermophilus, and typical soil microbes in vegans. The signatures of common western diet patterns can support future nutritional interventions and epidemiology.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a nomogram to predict survival in septic patients with heart failure in the intensive care unit",
        "link": "https://www.nature.com/articles/s41598-025-85596-w",
        "publication_date": "06 Jan 2025",
        "abstract": "Heart failure is a common complication in patients with sepsis, and individuals who experience both sepsis and heart failure are at a heightened risk for adverse outcomes. This study aims to develop an effective nomogram model to predict the 7-day, 15-day, and 30-day survival probabilities of septic patients with heart failure in the intensive care unit (ICU). This study extracted the pertinent clinical data of septic patients with heart failure from the Critical Medical Information Mart for Intensive Care (MIMIC-IV) database. Patients were then randomly allocated into a training set and a test set at a ratio of 7:3. Cox proportional hazards regression analysis was used to determine independent risk factors influencing patient prognosis and to develop a nomogram model. The model’s efficacy and clinical significance were assessed through metrics such as the concordance index (C-index), time-dependent receiver operating characteristic (ROC), calibration curve, and decision curve analysis (DCA). A total of 5,490 septic patients with heart failure were included in the study. A nomogram model was developed to predict short-term survival probabilities, using 13 variables: age, pneumonia, endotracheal intubation, mechanical ventilation, potassium (K), anion gap (AG), lactate (Lac), activated partial thromboplastin time (APTT), white blood cell count (WBC), red cell distribution width (RDW), hemoglobin-to-red cell distribution width ratio (HRR), Sequential Organ Failure Assessment (SOFA) score, and Charlson Comorbidity Index (CCI). The C-index was 0.730 (95% CI 0.719–0.742) for the training set and 0.761 (95% CI 0.745–0.776) for the test set, indicating strong model accuracy, indicating good model accuracy. Evaluations via the ROC curve, calibration curve, and decision curve analyses further confirmed the model’s reliability and utility. This study effectively developed a straightforward and efficient nomogram model to predict the 7-day, 15-day, and 30-day survival probabilities of septic patients with heart failure in the ICU. The implementation of treatment strategies that address the risk factors identified in the model can enhance patient outcomes and increase survival rates.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a new nomogram for self-reported OA based on machine learning: a cross-sectional study",
        "link": "https://www.nature.com/articles/s41598-024-83524-y",
        "publication_date": "04 Jan 2025",
        "abstract": "Developing a new diagnostic prediction model for osteoarthritis (OA) to assess the likelihood of individuals developing OA is crucial for the timely identification of potential populations of OA. This allows for further diagnosis and intervention, which is significant for improving patient prognosis. Based on the NHANES for the periods of 2011–2012, 2013–2014, and 2015–2016, the study involved 11,366 participants, of whom 1,434 reported a diagnosis of OA. LASSO regression, XGBoost algorithm, and RF algorithm were used to identify significant indicators, and a OA prediction nomogram was developed. The nomogram was evaluated by measuring the AUC, calibration curve, and DCA curve of training and validation sets. In this study, we identified 5 predictors from 19 variables, including age, gender, hypertension, BMI and caffeine intake, and developed an OA nomogram. In both the training and validation cohorts, the OA nomogram exhibited good diagnostic predictive performance (with AUCs of 0.804 and 0.814, respectively), good consistency and stability in calibration curve and high net benefit in DCA. The nomogram based on 5 variables demonstrates a high accuracy in predicting the diagnosis of OA, indicating that it is a convenient tool for clinicians to identify potential populations of OA.",
        "conclusions": "Compared to other existing models, this study has developed an effective clinical nomogram for identifying OA in a large population. Based on this assessment, clinicians can develop individualized diagnostic and treatment plans for the subjects. For the potential populations of OA, it is recommended to conduct further examinations for diagnosis and to implement lifestyle or medical interventions to prevent disease progression. Thus, the probability prediction nomogram of OA developed in this study has significant clinical value.",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]