[
    {
        "title": "Predicting type 2 diabetes via machine learning integration of multiple omics from human pancreatic islets",
        "link": "https://www.nature.com/articles/s41598-024-64846-3",
        "publication_date": "25 Jun 2024",
        "abstract": "Type 2 diabetes (T2D) is the fastest growing non-infectious disease worldwide. Impaired insulin secretion from pancreatic beta-cells is a hallmark of T2D, but the mechanisms behind this defect are insufficiently characterized. Integrating multiple layers of biomedical information, such as different Omics, may allow more accurate understanding of complex diseases such as T2D. Our aim was to explore and use Machine Learning to integrate multiple sources of biological/molecular information (multiOmics), in our case RNA-sequening, DNA methylation, SNP and phenotypic data from islet donors with T2D and non-diabetic controls. We exploited Machine Learning to perform multiOmics integration of DNA methylation, expression, SNPs, and phenotypes from pancreatic islets of 110 individuals, with ~ 30% being T2D cases. DNA methylation was analyzed using Infinium MethylationEPIC array, expression was analyzed using RNA-sequencing, and SNPs were analyzed using HumanOmniExpress arrays. Supervised linear multiOmics integration via DIABLO based on Partial Least Squares (PLS) achieved an accuracy of 91 ± 15% of T2D prediction with an area under the curve of 0.96 ± 0.08 on the test dataset after cross-validation. Biomarkers identified by this multiOmics integration, including SACS and TXNIP DNA methylation, OPRD1 and RHOT1 expression and a SNP annotated to ANO1, provide novel insights into the interplay between different biological mechanisms contributing to T2D. This Machine Learning approach of multiOmics cross-sectional data from human pancreatic islets achieved a promising accuracy of T2D prediction, which may potentially find broad applications in clinical diagnostics. In addition, it delivered novel candidate biomarkers for T2D and links between them across the different Omics.",
        "conclusions": "Here, we have demonstrated the proof-of-concept Machine Learning integration applied to three molecular Omics and one clinical phenotypic dataset from human pancreatic islets. We implemented a supervised linear PLS DIABLO integrative method and achieved remarkable accuracy as well as a high area under the ROC curve of T2D status prediction on 110 individuals with almost 30% of diabetics. Our model not only demonstrates a state-of-the-art T2D predictive capacity that can potentially be implemented for clinical diagnostics but also provides novel biomarkers such as SACS DNA methylation that we recently linked to diabetes pathogenesis11. In addition, cross-links between different biomarkers across the different Omics were delivered as a result of the integrative model. This integrative multiOmics analysis increases our knowledge about the disease and may further advance diagnosis of T2D.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sex differences in the association of long-term exposure to heat stress on kidney function in a large Taiwanese population study",
        "link": "https://www.nature.com/articles/s41598-024-65741-7",
        "publication_date": "25 Jun 2024",
        "abstract": "The incidence and prevalence of dialysis in Taiwan are high compared to other regions. Consequently, mitigating chronic kidney disease (CKD) and the worsening of kidney function have emerged as critical healthcare priorities in Taiwan. Heat stress is known to be a significant risk factor for CKD and kidney function impairment. However, differences in the impact of heat stress between males and females remains unexplored. We conducted this retrospective cross-sectional analysis using data from the Taiwan Biobank (TWB), incorporating records of the wet bulb globe temperature (WBGT) during midday (11 AM–2 PM) and working hours (8 AM–5 PM) periods based on the participants’ residential address. Average 1-, 3-, and 5-year WBGT values prior to the survey year were calculated and analyzed using a geospatial artificial intelligence-based ensemble mixed spatial model, covering the period from 2010 to 2020. A total of 114,483 participants from the TWB were included in this study, of whom 35.9% were male and 1053 had impaired kidney function (defined as estimated glomerular filtration rate < 60 ml/min/1.73 m2). Multivariable analysis revealed that in the male participants, during the midday period, the 1-, 3-, and 5-year average WBGT values per 1 ℃ increase were significantly positively associated with eGFR < 60 ml/min/1.73 m2 (odds ratio [OR], 1.096, 95% confidence interval [CI] = 1.002–1.199, p = 0.044 for 1 year; OR, 1.093, 95% CI = 1.000–1.196, p = 0.005 for 3 years; OR, 1.094, 95% CI = 1.002–1.195, p = 0.045 for 5 years). However, significant associations were not found for the working hours period. In the female participants, during the midday period, the 1-, 3-, and 5-year average WBGT values per 1 ℃ increase were significantly negatively associated with eGFR < 60 ml/min/1.73 m2 (OR, 0.872, 95% CI = 0.778–0.976, p = 0.018 for 1 year; OR, 0.874, 95% CI = 0.780–0.978, p = 0.019 for 3 years; OR, 0.875, 95% CI = 0.784–0.977, p = 0.018 for 5 years). In addition, during the working hours period, the 1-, 3-, and 5-year average WBGT values per 1 ℃ increase were also significantly negatively associated with eGFR < 60 ml/min/1.73 m2 (OR, 0.856, 95% CI = 0.774–0.946, p = 0.002 for 1 year; OR, 0.856, 95% CI = 0.774–0.948, p = 0.003 for 3 years; OR, 0.853, 95% CI = 0.772–0.943, p = 0.002 for 5 years). In conclusion, our results revealed that increased WBGT was associated with impaired kidney function in males, whereas increased WBGT was associated with a protective effect against impaired kidney function in females. Further studies are needed to elucidate the exact mechanisms underlying these sex-specific differences.",
        "conclusions": "Our study identified sex differences in the association of long-term heat exposure on kidney function within a substantial Taiwanese cohort. Increased WBGT was associated with impaired kidney function in males, while it was associated with a protective effect against impaired kidney function in females. This analysis linked WBGT data, obtained using a machine learning-based model, to the Taiwan Weather Bureau database by residential area. Further investigations using more broadly representative data or studies designed with a higher level of evidence, such as prospective or randomized controlled trials are warranted to thoroughly explore and validate the impact of heat stress on kidney function in both males and females.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning-based prediction of one-year mortality in Finland is an accurate but unfair aging marker",
        "link": "https://www.nature.com/articles/s43587-024-00657-5",
        "publication_date": "24 Jun 2024",
        "abstract": "Short-term mortality risk, which is indicative of individual frailty, serves as a marker for aging. Previous age clocks focused on predicting either chronological age or longer-term mortality. Aging clocks predicting short-term mortality are lacking and their algorithmic fairness remains unexamined. We developed a deep learning model to predict 1-year mortality using nationwide longitudinal data from the Finnish population (FinRegistry; n = 5.4 million), incorporating more than 8,000 features spanning up to 50 years. We achieved an area under the curve (AUC) of 0.944, outperforming a baseline model that included only age and sex (AUC = 0.897). The model generalized well to different causes of death (AUC > 0.800 for 45 of 50 causes), including coronavirus disease 2019, which was absent in the training data. Performance varied among demographics, with young females exhibiting the best and older males the worst results. Extensive prediction fairness analyses highlighted disparities among disadvantaged groups, posing challenges to equitable integration into public health interventions. Our model accurately identified short-term mortality risk, potentially serving as a population-wide aging marker.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Creation of a biological sensorimotor interface for bionic reconstruction",
        "link": "https://www.nature.com/articles/s41467-024-49580-8",
        "publication_date": "24 Jun 2024",
        "abstract": "Neuromuscular control of bionic arms has constantly improved over the past years, however, restoration of sensation remains elusive. Previous approaches to reestablish sensory feedback include tactile, electrical, and peripheral nerve stimulation, however, they cannot recreate natural, intuitive sensations. Here, we establish an experimental biological sensorimotor interface and demonstrate its potential use in neuroprosthetics. We transfer a mixed nerve to a skeletal muscle combined with glabrous dermal skin transplantation, thus forming a bi-directional communication unit in a rat model. Morphological analyses indicate reinnervation of the skin, mechanoreceptors, NMJs, and muscle spindles. Furthermore, sequential retrograde labeling reveals specific sensory reinnervation at the level of the dorsal root ganglia. Electrophysiological recordings show reproducible afferent signals upon tactile stimulation and tendon manipulation. The results demonstrate the possibility of surgically creating an interface for both decoding efferent motor control, as well as encoding afferent tactile and proprioceptive feedback, and may indicate the way forward regarding clinical translation of biological communication pathways for neuroprosthetic applications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Microbial community-scale metabolic modelling predicts personalized short-chain fatty acid production profiles in the human gut",
        "link": "https://www.nature.com/articles/s41564-024-01728-4",
        "publication_date": "24 Jun 2024",
        "abstract": "Microbially derived short-chain fatty acids (SCFAs) in the human gut are tightly coupled to host metabolism, immune regulation and integrity of the intestinal epithelium. However, the production of SCFAs can vary widely between individuals consuming the same diet, with lower levels often associated with disease. A systems-scale mechanistic understanding of this heterogeneity is lacking. Here we use a microbial community-scale metabolic modelling (MCMM) approach to predict individual-specific SCFA production profiles to assess the impact of different dietary, prebiotic and probiotic inputs. We evaluate the quantitative accuracy of our MCMMs using in vitro and ex vivo data, plus published human cohort data. We find that MCMM SCFA predictions are significantly associated with blood-derived clinical chemistries, including cardiometabolic and immunological health markers, across a large human cohort. Finally, we demonstrate how MCMMs can be leveraged to design personalized dietary, prebiotic and probiotic interventions aimed at optimizing SCFA production in the gut. Our model represents an approach to direct gut microbiome engineering for precision health and nutrition.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Possible adverse events of imidazole antifungal drugs during treatment of vulvovaginal candidiasis: analysis of the FDA Adverse Event Reporting System",
        "link": "https://www.nature.com/articles/s41598-024-63315-1",
        "publication_date": "24 Jun 2024",
        "abstract": "Azole antifungal drugs are commonly used to treat vulvovaginal candidiasis (VVC). The nephrotoxicity and developmental toxicity of azole drugs have not been systematically analyzed in the real world. We used the FDA Adverse Event Reporting System (FAERS) to investigate the adverse events (AEs) associated with imidazole therapy for VVC. FAERS data (from quarter 1 2004 to quarter 3 2022) were retrieved using OpenVigil 2.1, and AEs were retrieved and standardized according to the Medical Dictionary for Regulatory Activities (MedDRA). In the top 10 System Organ Class (SOC), all four drugs have been found to have kidney and urinary system diseases and pregnancy. We found significant signals, including clotrimazole [bladder transitional cell carcinoma, (report odds ratio, ROR = 291.66)], [fetal death, (ROR = 10.28)], ketoconazole[nephrogenic anemia (ROR = 22.1)], [premature rupture of membranes (ROR = 22.91 46.45, 11, 3)], Miconazole[hematuria (ROR = 19.03)], [neonatal sepsis (ROR = 123.71)], [spontaneous abortion (ROR = 5.98)], Econazole [acute kidney injury (ROR = 4.41)], [spontaneous abortion (ROR = 19.62)]. We also discovered new adverse reactions that were not reported. Therefore, when using imidazole drugs for treatment, it is necessary to closely monitor the patient's renal function, pay attention to the developmental toxicity of the fetus during pregnancy, and be aware of potential adverse reactions that may occur.",
        "conclusions": "This study utilized the FAERS database to analyze potential AEs of representative drugs used for the treatment of VVC, and collected renal and developmental toxicity of imidazole drugs in clinical practice. These findings emphasize the importance of monitoring rare but severe AEs associated with imidazole drug use. At the same time, by comparing the instructions, it was found that AEs were not recorded in the instructions. Although the overall incidence of these events may be low, their clinical significance deserves careful consideration, especially in pregnant women or vulnerable populations with existing renal dysfunction. Healthcare providers must always be aware of the latest safety information about these drugs and adjust treatment decisions accordingly to minimize potential risks to patients. Long-term observation of these AEs is required to ensure the health and safety of patients treated with these drugs32.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "poisoning"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical experience with shear wave elastography (SWE) for assessing healthy uterus in a transabdominal approach",
        "link": "https://www.nature.com/articles/s41598-024-65238-3",
        "publication_date": "24 Jun 2024",
        "abstract": "Aim of the study was to evaluate the diagnostic performance and feasibility of transabdominal ultrasound shear wave elastography (SWE) in assessing sonoelastographic features of the uterus. Twenty-seven premenopausal women were enrolled between 2021 and 2022. Transabdominal SWE measured myometrial stiffness in various uterine segments. Additionally, tissue stiffness of the quadriceps femoris muscle and autochthonous back muscle was measured. Statistical analysis employed non-parametric tests, t test, and a robust mixed linear model. Stiffness values of the uterus and the two investigated muscle types exhibited a similar spectrum: 6.38 ± 2.59 kPa (median 5.61 kPa; range 2.76–11.31 kPa) for the uterine myometrium, 7.22 ± 1.24 kPa (6.82 kPa; 5.11–9.39 kPa) for the quadriceps femoris musle, and 7.43 ± 2.73 kPa (7.41 kPa; 3.10–13.73 kPa) for the autochthonous back muscle. A tendency for significant differences in myometrial stiffness was observed concerning the type of labor mode (mean stiffness of 9.17 ± 1.35 kPa after vaginal birth vs. 3.83 ± 1.35 kPa after Caesarian section, p = 0.01). No significant differences in myometrial stiffness were observed concerning age, BMI, previous pregnancies, uterine flexion and menstrual cycle phase. Transabdominal SWE of uterine stiffness seems to be a fast and practicable method in a clinical setting. Uterine stiffness appears to be largely independent of various factors, except for the mode of delivery. However, further studies are needed to validate these results.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning workflow for edge computed arrhythmia detection in exploration class missions",
        "link": "https://www.nature.com/articles/s41526-024-00409-0",
        "publication_date": "22 Jun 2024",
        "abstract": "Deep-space missions require preventative care methods based on predictive models for identifying in-space pathologies. Deploying such models requires flexible edge computing, which Open Neural Network Exchange (ONNX) formats enable by optimizing inference directly on wearable edge devices. This work demonstrates an innovative approach to point-of-care machine learning model pipelines by combining this capacity with an advanced self-optimizing training scheme to classify periods of Normal Sinus Rhythm (NSR), Atrial Fibrillation (AFIB), and Atrial Flutter (AFL). 742 h of electrocardiogram (ECG) recordings were pre-processed into 30-second normalized samples where variable mode decomposition purged muscle artifacts and instrumentation noise. Seventeen heart rate variability and morphological ECG features were extracted by convoluting peak detection with Gaussian distributions and delineating QRS complexes using discrete wavelet transforms. The decision tree classifier’s features, parameters, and hyperparameters were self-optimized through stratified triple nested cross-validation ranked on F1-scoring against cardiologist labeling. The selected model achieved a macro F1-score of 0.899 with 0.993 for NSR, 0.938 for AFIB, and 0.767 for AFL. The most important features included median P-wave amplitudes, PRR20, and mean heart rates. The ONNX-translated pipeline took 9.2 s/sample. This combination of our self-optimizing scheme and deployment use case of ONNX demonstrated overall accurate operational tachycardia detection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An elastic net regression model for predicting the risk of ICU admission and death for hospitalized patients with COVID-19",
        "link": "https://www.nature.com/articles/s41598-024-64776-0",
        "publication_date": "22 Jun 2024",
        "abstract": "This study aimed to develop and validate prediction models to estimate the risk of death and intensive care unit admission in COVID-19 inpatients. All RT-PCR-confirmed adult COVID-19 inpatients admitted to Fujian Provincial Hospital from October 2022 to April 2023 were considered. Elastic Net Regression was used to derive the risk prediction models. Potential risk factors were considered, which included demographic characteristics, clinical symptoms, comorbidities, laboratory results, treatment process, prognosis. A total of 1906 inpatients were included finally by inclusion/exclusion criteria and were divided into derivation and test cohorts in a ratio of 8:2, where 1526 (80%) samples were used to develop prediction models under a repeated cross-validation framework and the remaining 380 (20%) samples were used for performance evaluation. Overall performance, discrimination and calibration were evaluated in the validation set and test cohort and quantified by accuracy, scaled Brier score (SbrS), the area under the ROC curve (AUROC), and Spiegelhalter-Z statistics. The models performed well, with high levels of discrimination (AUROCICU [95%CI]: 0.858 [0.803,0.899]; AUROCdeath [95%CI]: 0.906 [0.850,0.948]); and good calibrations (Spiegelhalter-ZICU: − 0.821 (p-value: 0.412); Spiegelhalter-Zdeath: 0.173) in the test set. We developed and validated prediction models to help clinicians identify high risk patients for death and ICU admission after COVID-19 infection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Reconciling privacy and accuracy in AI for medical imaging",
        "link": "https://www.nature.com/articles/s42256-024-00858-y",
        "publication_date": "21 Jun 2024",
        "abstract": "Artificial intelligence (AI) models are vulnerable to information leakage of their training data, which can be highly sensitive, for example, in medical imaging. Privacy-enhancing technologies, such as differential privacy (DP), aim to circumvent these susceptibilities. DP is the strongest possible protection for training models while bounding the risks of inferring the inclusion of training samples or reconstructing the original data. DP achieves this by setting a quantifiable privacy budget. Although a lower budget decreases the risk of information leakage, it typically also reduces the performance of such models. This imposes a trade-off between robust performance and stringent privacy. Additionally, the interpretation of a privacy budget remains abstract and challenging to contextualize. Here we contrast the performance of artificial intelligence models at various privacy budgets against both theoretical risk bounds and empirical success of reconstruction attacks. We show that using very large privacy budgets can render reconstruction attacks impossible, while drops in performance are negligible. We thus conclude that not using DP at all is negligent when applying artificial intelligence models to sensitive data. We deem our results to lay a foundation for further debates on striking a balance between privacy risks and model performance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "backdoor",
                "membership inference",
                "model inversion",
                "data reconstruction"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "INSPIRE, a publicly available research dataset for perioperative medicine",
        "link": "https://www.nature.com/articles/s41597-024-03517-4",
        "publication_date": "21 Jun 2024",
        "abstract": "We present the INSPIRE dataset, a publicly available research dataset in perioperative medicine, which includes approximately 130,000 surgical operations at an academic institution in South Korea over a ten-year period between 2011 and 2020. This comprehensive dataset includes patient characteristics such as age, sex, American Society of Anesthesiologists physical status classification, diagnosis, surgical procedure code, department, and type of anaesthesia. The dataset also includes vital signs in the operating theatre, general wards, and intensive care units (ICUs), laboratory results from six months before admission to six months after discharge, and medication during hospitalisation. Complications include total hospital and ICU length of stay and in-hospital death. We hope this dataset will inspire collaborative research and development in perioperative medicine and serve as a reproducible external validation dataset to improve surgical outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Improving difficult direct laryngoscopy prediction using deep learning and minimal image analysis: a single-center prospective study",
        "link": "https://www.nature.com/articles/s41598-024-65060-x",
        "publication_date": "20 Jun 2024",
        "abstract": "Accurate prediction of difficult direct laryngoscopy (DDL) is essential to ensure optimal airway management and patient safety. The present study proposed an AI model that would accurately predict DDL using a small number of bedside pictures of the patient’s face and neck taken simply with a smartphone. In this prospective single-center study, adult patients scheduled for endotracheal intubation under general anesthesia were included. Patient pictures were obtained in frontal, lateral, frontal-neck extension, and open mouth views. DDL prediction was performed using a deep learning model based on the EfficientNet-B5 architecture, incorporating picture view information through multitask learning. We collected 18,163 pictures from 3053 patients. After under-sampling to achieve a 1:1 image ratio of DDL to non-DDL, the model was trained and validated with a dataset of 6616 pictures from 1283 patients. The deep learning model achieved a receiver operating characteristic area under the curve of 0.81–0.88 and an F1-score of 0.72–0.81 for DDL prediction. Including picture view information improved the model’s performance. Gradient-weighted class activation mapping revealed that neck and chin characteristics in frontal and lateral views are important factors in DDL prediction. The deep learning model we developed effectively predicts DDL and requires only a small set of patient pictures taken with a smartphone. The method is practical and easy to implement.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automated hearing loss type classification based on pure tone audiometry data",
        "link": "https://www.nature.com/articles/s41598-024-64310-2",
        "publication_date": "20 Jun 2024",
        "abstract": "Hearing problems are commonly diagnosed with the use of tonal audiometry, which measures a patient’s hearing threshold in both air and bone conduction at various frequencies. Results of audiometry tests, usually represented graphically in the form of an audiogram, need to be interpreted by a professional audiologist in order to determine the exact type of hearing loss and administer proper treatment. However, the small number of professionals in the field can severely delay proper diagnosis. The presented work proposes a neural network solution for classification of tonal audiometry data. The solution, based on the Bidirectional Long Short-Term Memory architecture, has been devised and evaluated for classifying audiometry results into four classes, representing normal hearing, conductive hearing loss, mixed hearing loss, and sensorineural hearing loss. The network was trained using 15,046 test results analysed and categorised by professional audiologists. The proposed model achieves 99.33% classification accuracy on datasets outside of training. In clinical application, the model allows general practitioners to independently classify tonal audiometry results for patient referral. In addition, the proposed solution provides audiologists and otolaryngologists with access to an AI decision support system that has the potential to reduce their burden, improve diagnostic accuracy, and minimise human error.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Construction of a digital twin of chronic graft vs. host disease patients with standard of care",
        "link": "https://www.nature.com/articles/s41409-024-02324-0",
        "publication_date": "20 Jun 2024",
        "abstract": "There is an unmet medical need for new clinical trials to evaluate novel therapies in chronic graft-versus-host disease (cGvHD). Disease rarity, ethical issues regarding placebo arms, time, and cost impede clinical trial conduct. Digital twin (DT) technology enables virtual clinical trial arm construction using historical data, circumventing these obstacles. We evaluated the feasibility of constructing a DT trial arm using a large database of real-world clinical trial data and performed an efficacy assessment of a standard-of-care (SOC) drug to examine agreement with literature data. We constructed a flGvHD DT cohort (cGvHD patients at first-line treatment) (2042 patients; 32 cohorts) using the Trial Accelerator™ Digital Twin platform and derived an SOC arm from this cohort (flGvHD DT SOC cohort) (438 patients; eight cohorts); we analyzed the efficacy of SOC (prednisone) (overall response rate (ORR)) at six months. Our analysis results are in agreement with literature: flGvHD DT: disease onset time: 7.58 months post-allogeneic hematopoietic cell transplantation; most used graft source: peripheral blood stem cells; flGvHD DT SOC: ORR at six months for prednisone: 52.7%. It is feasible to construct a DT cohort using existing clinical trial data; a DT SOC arm can potentially replace a control arm in clinical trials.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning analysis with population data for prepregnancy and perinatal risk factors for the neurodevelopmental delay of offspring",
        "link": "https://www.nature.com/articles/s41598-024-64590-8",
        "publication_date": "18 Jun 2024",
        "abstract": "Neurodevelopmental disorders (NDD) in offspring are associated with a complex combination of pre-and postnatal factors. This study uses machine learning and population data to evaluate the association between prepregnancy or perinatal risk factors and the NDD of offspring. Population-based retrospective cohort data were obtained from Korea National Health Insurance Service claims data for 209,424 singleton offspring and their mothers who gave birth for the first time in 2007. The dependent variables were motor development disorder (MDD), cognitive development disorder (CDD) and combined overall neurodevelopmental disorder (NDD) from offspring. Seventeen independent variables from 2002 to 2007 were included. Random forest variable importance and Shapley Additive Explanation (SHAP) values were calculated to analyze the directions of its associations with the predictors. The random forest with oversampling registered much higher areas under the receiver-operating-characteristic curves than the logistic regression of interaction and non-linearity terms, 79% versus 50% (MDD), 82% versus 52% (CDD) and 74% versus 50% (NDD). Based on random forest variable importance, low socioeconomic status and age at birth were highly ranked. In SHAP values, there was a positive association between NDD and pre- or perinatal outcomes, especially, fetal male sex with growth restriction associated the development of NDD in offspring.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive modeling of ambulatory outcomes after spinal cord injury using machine learning",
        "link": "https://www.nature.com/articles/s41393-024-01008-2",
        "publication_date": "18 Jun 2024",
        "abstract": "Retrospective multi-site cohort study.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Digital telomere measurement by long-read sequencing distinguishes healthy aging from disease",
        "link": "https://www.nature.com/articles/s41467-024-49007-4",
        "publication_date": "18 Jun 2024",
        "abstract": "Telomere length is an important biomarker of organismal aging and cellular replicative potential, but existing measurement methods are limited in resolution and accuracy. Here, we deploy digital telomere measurement (DTM) by nanopore sequencing to understand how distributions of human telomere length change with age and disease. We measure telomere attrition and de novo elongation with up to 30 bp resolution in genetically defined populations of human cells, in blood cells from healthy donors and in blood cells from patients with genetic defects in telomere maintenance. We find that human aging is accompanied by a progressive loss of long telomeres and an accumulation of shorter telomeres. In patients with defects in telomere maintenance, the accumulation of short telomeres is more pronounced and correlates with phenotypic severity. We apply machine learning to train a binary classification model that distinguishes healthy individuals from those with telomere biology disorders. This sequencing and bioinformatic pipeline will advance our understanding of telomere maintenance mechanisms and the use of telomere length as a clinical biomarker of aging and disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Pre-emptive detection and evolution of relapse in acute myeloid leukemia by flow cytometric measurable residual disease surveillance",
        "link": "https://www.nature.com/articles/s41375-024-02300-z",
        "publication_date": "18 Jun 2024",
        "abstract": "Measurable residual disease (MRD) surveillance in acute myeloid leukemia (AML) may identify patients destined for relapse and thus provide the option of pre-emptive therapy to improve their outcome. Whilst flow cytometric MRD (Flow-MRD) can be applied to high-risk AML/ myelodysplasia patients, its diagnostic performance for detecting impending relapse is unknown. We evaluated this in a cohort comprising 136 true positives (bone marrows preceding relapse by a median of 2.45 months) and 155 true negatives (bone marrows during sustained remission). At an optimal Flow-MRD threshold of 0.040%, clinical sensitivity and specificity for relapse was 74% and 87% respectively (51% and 98% for Flow-MRD ≥ 0.1%) by ‘different-from-normal’ analysis. Median relapse kinetics were 0.78 log10/month but significantly higher at 0.92 log10/month for FLT3-mutated AML. Computational (unsupervised) Flow-MRD (C-Flow-MRD) generated optimal MRD thresholds of 0.036% and 0.082% with equivalent clinical sensitivity to standard analysis. C-Flow-MRD-identified aberrancies in HLADRlow or CD34+CD38low (LSC-type) subpopulations contributed the greatest clinical accuracy (56% sensitivity, 90% specificity) and notably, by longitudinal profiling expanded rapidly within blasts in > 40% of 86 paired MRD and relapse samples. In conclusion, flow MRD surveillance can detect MRD relapse in high risk AML and its evaluation may be enhanced by computational analysis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of post-delivery hemoglobin levels with machine learning algorithms",
        "link": "https://www.nature.com/articles/s41598-024-64278-z",
        "publication_date": "17 Jun 2024",
        "abstract": "Predicting postpartum hemorrhage (PPH) before delivery is crucial for enhancing patient outcomes, enabling timely transfer and implementation of prophylactic therapies. We attempted to utilize machine learning (ML) using basic pre-labor clinical data and laboratory measurements to predict postpartum Hemoglobin (Hb) in non-complicated singleton pregnancies. The local databases of two academic care centers on patient delivery were incorporated into the current study. Patients with preexisting coagulopathy, traumatic cases, and allogenic blood transfusion were excluded from all analyses. The association of pre-delivery variables with 24-h post-delivery hemoglobin level was evaluated using feature selection with Elastic Net regression and Random Forest algorithms. A suite of ML algorithms was employed to predict post-delivery Hb levels. Out of 2051 pregnant women, 1974 were included in the final analysis. After data pre-processing and redundant variable removal, the top predictors selected via feature selection for predicting post-delivery Hb were parity (B: 0.09 [0.05–0.12]), gestational age, pre-delivery hemoglobin (B:0.83 [0.80–0.85]) and fibrinogen levels (B:0.01 [0.01–0.01]), and pre-labor platelet count (B*1000: 0.77 [0.30–1.23]). Among the trained algorithms, artificial neural network provided the most accurate model (Root mean squared error: 0.62), which was subsequently deployed as a web-based calculator: https://predictivecalculators.shinyapps.io/ANN-HB. The current study shows that ML models could be utilized as accurate predictors of indirect measures of PPH and can be readily incorporated into healthcare systems. Further studies with heterogenous population-based samples may further improve the generalizability of these models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Targeted therapy for capillary-venous malformations",
        "link": "https://www.nature.com/articles/s41392-024-01862-9",
        "publication_date": "17 Jun 2024",
        "abstract": "Sporadic venous malformations are genetic conditions primarily caused by somatic gain-of-function mutation of PIK3CA or TEK, an endothelial transmembrane receptor signaling through PIK3CA. Venous malformations are associated with pain, bleedings, thrombosis, pulmonary embolism, esthetic deformities and, in severe cases, life-threatening situations. No authorized medical treatment exists for patients with venous malformations. Here, we created a genetic mouse model of PIK3CA-related capillary venous malformations that replicates patient phenotypes. We showed that these malformations only partially signal through AKT proteins. We compared the efficacy of different drugs, including rapamycin, a mTORC1 inhibitor, miransertib, an AKT inhibitor and alpelisib, a PI3Kα inhibitor at improving the lesions seen in the mouse model. We demonstrated the effectiveness of alpelisib in preventing vascular malformations’ occurrence, improving the already established ones, and prolonging survival. Considering these findings, we were authorized to treat 25 patients with alpelisib, including 7 children displaying PIK3CA (n = 16) or TEK (n = 9)-related capillary venous malformations resistant to usual therapies including sirolimus, debulking surgical procedures or percutaneous sclerotherapies. We assessed the volume of vascular malformations using magnetic resonance imaging (MRI) for each patient. Alpelisib demonstrated improvement in all 25 patients. Vascular malformations previously considered intractable were reduced and clinical symptoms were attenuated. MRI showed a decrease of 33.4% and 27.8% in the median volume of PIK3CA and TEK malformations respectively, over 6 months on alpelisib. In conclusion, this study supports PI3Kα inhibition as a promising therapeutic strategy in patients with PIK3CA or TEK-related capillary venous malformations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The associations of leukocyte telomere length and intermediary cardiovascular phenotype with adverse cardiovascular outcomes in the white population",
        "link": "https://www.nature.com/articles/s41598-024-64997-3",
        "publication_date": "17 Jun 2024",
        "abstract": "The evidence about the associations of leukocyte telomere length (LTL) and intermediary cardiovascular phenotypes with adverse cardiovascular outcomes is inconclusive. This study assessed these relationships with cardiovascular imaging, electrocardiography, and the risks of sudden cardiac death (SCD), coronary events, and heart failure (HF) admission. We conducted a cross-sectional analysis of UK Biobank participants enrolled between 2006 and 2010. LTL was measured using quantitative polymerase chain reactions. Electronic health records were used to determine the incidence of SCD, coronary events, and HF admission. Cardiovascular measurements were made using cardiovascular magnetic resonance imaging and machine learning. The associations of LTL with SCD, coronary events, and HF admission and cardiac magnetic resonance imaging, electrocardiogram parameters of 33,043 and 19,554 participants were evaluated by multivariate regression. The median (interquartile range) follow-up period was 11.9 (11.2–12.6) years. Data was analyzed from January to May 2023. Among the 403,382 white participants without coronary artery disease or HF, 181,637 (45.0%) were male with a mean age of 57.1 years old. LTL was independently negatively associated with a risk of SCD (LTL third quartile vs first quartile: hazard ratio [HR]: 0.81, 95% confidence interval [CI]: 0.72–0.92), coronary events (LTL third quartile vs first quartile: HR: 0.88, 95% CI: 0.84–0.92), and HF admission (LTL fourth quartile vs first quartile: HR: 0.84, 95% CI: 0.74–0.95). LTL was also independently positively associated with cardiac remodeling, specifically left ventricular mass index, left-ventricular-end systolic and diastolic volumes, mean left ventricular myocardial wall thickness, left ventricular stroke volume, and with electrocardiogram changes along the negative degree of T-axis. Cross-sectional study results showed that LTL was positively associated with heart size and cardiac function in middle age, but electrocardiography results did not show these associations, which could explain the negative association between LTL and risk of SCD, coronary events, and HF admission in UK Biobank participants.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Healthy aging meta-analyses and scoping review of risk factors across Latin America reveal large heterogeneity and weak predictive models",
        "link": "https://www.nature.com/articles/s43587-024-00648-6",
        "publication_date": "17 Jun 2024",
        "abstract": "Models of healthy aging are typically based on the United States and Europe and may not apply to diverse and heterogeneous populations. In this study, our objectives were to conduct a meta-analysis to assess risk factors of cognition and functional ability across aging populations in Latin America and a scoping review focusing on methodological procedures. Our study design included randomized controlled trials and cohort, case–control and cross-sectional studies using multiple databases, including MEDLINE, the Virtual Health Library and Web of Science. From an initial pool of 455 studies, our meta-analysis included 38 final studies (28 assessing cognition and 10 assessing functional ability, n = 146,000 participants). Our results revealed significant but heterogeneous effects for cognition (odds ratio (OR) = 1.20, P = 0.03, confidence interval (CI) = (1.0127, 1.42); heterogeneity: I2 = 92.1%, CI = (89.8%, 94%)) and functional ability (OR = 1.20, P = 0.01, CI = (1.04, 1.39); I2 = 93.1%, CI = (89.3%, 95.5%)). Specific risk factors had limited effects, especially on functional ability, with moderate impacts for demographics and mental health and marginal effects for health status and social determinants of health. Methodological issues, such as outliers, inter-country differences and publication bias, influenced the results. Overall, we highlight the specific profile of risk factors associated with healthy aging in Latin America. The heterogeneity in results and methodological approaches in studying healthy aging call for greater harmonization and further regional research to understand healthy aging in Latin America.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Measuring gait parameters from a single chest-worn accelerometer in healthy individuals: a validation study",
        "link": "https://www.nature.com/articles/s41598-024-62330-6",
        "publication_date": "17 Jun 2024",
        "abstract": "Digital health technologies (DHTs) are increasingly being adopted in clinical trials, as they enable objective evaluations of health parameters in free-living environments. Although lumbar accelerometers notably provide reliable gait parameters, embedding accelerometers in chest devices, already used for vital signs monitoring, could capture a more comprehensive picture of participants’ wellbeing, while reducing the burden of multiple devices. Here we assess the validity of gait parameters measured from a chest accelerometer. Twenty healthy adults (13 females, mean ± sd age: 33.9 ± 9.1 years) instrumented with lumbar and chest accelerometers underwent in-lab and outside-lab walking tasks, while monitored with reference devices (an instrumented mat, and a 6-accelerometers set). Gait parameters were extracted from chest and lumbar accelerometers using our open-source Scikit Digital Health gait (SKDH-gait) algorithm, and compared against reference values via Bland–Altman plots, Pearson’s correlation, and intraclass correlation coefficient. Mixed effects regression models were performed to investigate the effect of device, task, and their interaction. Gait parameters derived from chest and lumbar accelerometers showed no significant difference and excellent agreement across all tasks, as well as good-to-excellent agreement and strong correlation against reference values, thus supporting the deployment of a single multimodal chest device in clinical trials, to simultaneously measure gait and vital signs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Detection of Parkinson disease using multiclass machine learning approach",
        "link": "https://www.nature.com/articles/s41598-024-64004-9",
        "publication_date": "15 Jun 2024",
        "abstract": "Parkinson’s Disease (PD) is a prevalent neurological condition characterized by motor and cognitive impairments, typically manifesting around the age of 50 and presenting symptoms such as gait difficulties and speech impairments. Although a cure remains elusive, symptom management through medication is possible. Timely detection is pivotal for effective disease management. In this study, we leverage Machine Learning (ML) and Deep Learning (DL) techniques, specifically K-Nearest Neighbor (KNN) and Feed-forward Neural Network (FNN) models, to differentiate between individuals with PD and healthy individuals based on voice signal characteristics. Our dataset, sourced from the University of California at Irvine (UCI), comprises 195 voice recordings collected from 31 patients. To optimize model performance, we employ various strategies including Synthetic Minority Over-sampling Technique (SMOTE) for addressing class imbalance, Feature Selection to identify the most relevant features, and hyperparameter tuning using RandomizedSearchCV. Our experimentation reveals that the FNN and KSVM models, trained on an 80–20 split of the dataset for training and testing respectively, yield the most promising results. The FNN model achieves an impressive overall accuracy of 99.11%, with 98.78% recall, 99.96% precision, and a 99.23% f1-score. Similarly, the KSVM model demonstrates strong performance with an overall accuracy of 95.89%, recall of 96.88%, precision of 98.71%, and an f1-score of 97.62%. Overall, our study showcases the efficacy of ML and DL techniques in accurately identifying PD from voice signals, underscoring the potential for these approaches to contribute significantly to early diagnosis and intervention strategies for Parkinson’s Disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a clinical breast cancer tool for accurate prediction of recurrence",
        "link": "https://www.nature.com/articles/s41523-024-00651-5",
        "publication_date": "15 Jun 2024",
        "abstract": "Given high costs of Oncotype DX (ODX) testing, widely used in recurrence risk assessment for early-stage breast cancer, studies have predicted ODX using quantitative clinicopathologic variables. However, such models have incorporated only small cohorts. Using a cohort of patients from the National Cancer Database (NCDB, n = 53,346), we trained machine learning models to predict low-risk (0-25) or high-risk (26-100) ODX using quantitative estrogen receptor (ER)/progesterone receptor (PR)/Ki-67 status, quantitative ER/PR status alone, and no quantitative features. Models were externally validated on a diverse cohort of 970 patients (median follow-up 55 months) for accuracy in ODX prediction and recurrence. Comparing the area under the receiver operating characteristic curve (AUROC) in a held-out set from NCDB, models incorporating quantitative ER/PR (AUROC 0.78, 95% CI 0.77–0.80) and ER/PR/Ki-67 (AUROC 0.81, 95% CI 0.80–0.83) outperformed the non-quantitative model (AUROC 0.70, 95% CI 0.68–0.72). These results were preserved in the validation cohort, where the ER/PR/Ki-67 model (AUROC 0.87, 95% CI 0.81–0.93, p = 0.009) and the ER/PR model (AUROC 0.86, 95% CI 0.80–0.92, p = 0.031) significantly outperformed the non-quantitative model (AUROC 0.80, 95% CI 0.73–0.87). Using a high-sensitivity rule-out threshold, the non-quantitative, quantitative ER/PR and ER/PR/Ki-67 models identified 35%, 30% and 43% of patients as low-risk in the validation cohort. Of these low-risk patients, fewer than 3% had a recurrence at 5 years. These models may help identify patients who can forgo genomic testing and initiate endocrine therapy alone. An online calculator is provided for further study.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Enteric viral pathogens and child growth among under-five children: findings from South Asia and sub-Saharan Africa",
        "link": "https://www.nature.com/articles/s41598-024-64374-0",
        "publication_date": "15 Jun 2024",
        "abstract": "Enteric viral pathogens are associated with a significant burden of childhood morbidity and mortality. We investigated the relationship between viral pathogens and child growth among under-5 children. We analyzed data from 5572/22,567 children enrolled in the Global Enteric Multicenter Study across seven study sites (2007–2011). Multiple linear regression was used to examine the association between the viral pathogens and changes of length/height-for-age (HAZ), weight-for-age (WAZ), and weight-for-length/height (WHZ) z-scores, stratified by diarrheal symptoms and adjusted for potential covariates. Rotavirus (18.51%) and norovirus (7.33%) were the most prevalent enteric viral pathogens among symptomatic and asymptomatic under-5 children, respectively. Infection with individual enteric viral pathogens hurts child growth in asymptomatic children. However, the relationship with HAZ was less clear and statistically non-significant. On the other hand, the combined viral pathogens demonstrated a strong negative influence on child growth [WAZ: β coef.: − 0.10 (95%, CI − 0.15, − 0.05); P < 0.001 and WHZ: β: − 0.12 (95% CI − 0.17, − 0.07); P < 0.001] among asymptomatic children. Infection with any viral pathogen was associated with growth shortfalls [HAZ: β: − 0.05 (95% CI − 0.09, 0.00); P = 0.03 and WAZ: β: − 0.11 (95% CI − 0.16, − 0.07); P < 0.001 and WHZ: β: − 0.13 (95% CI − 0.18, − 0.09); P < 0.001], though the relationship with HAZ was less evident and became statistically non-significant in older children. Notably, among symptomatic children with moderate-to-severe diarrhea, individual enteric viral pathogens, as well as the combined effects of these pathogens [WHZ: β: 0.07; (95% CI 0.01, 0.14); P = 0.03] and the presence of any virus [HAZ: β: 0.09 (95% CI 0.05, 0.13) & WAZ: β: 0.08 (95% CI 0.03, 0.12); P < 0.001], exhibited positive effects on child growth. While previous studies hypothesized that several viral pathogens had a conflicting controversial role in child growth, we find clear indications that enteric viral pathogens are associated with growth shortfalls, specifically among asymptomatic children. These findings highlight the need for preventive strategies targeting children with enteric viral pathogens, which could address the consequences of growth faltering.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sex classification of 3D skull images using deep neural networks",
        "link": "https://www.nature.com/articles/s41598-024-61879-6",
        "publication_date": "14 Jun 2024",
        "abstract": "Determining the fundamental characteristics that define a face as \"feminine\" or \"masculine\" has long fascinated anatomists and plastic surgeons, particularly those involved in aesthetic and gender-affirming surgery. Previous studies in this area have relied on manual measurements, comparative anatomy, and heuristic landmark-based feature extraction. In this study, we collected retrospectively at Cedars Sinai Medical Center (CSMC) a dataset of 98 skull samples, which is the first dataset of this kind of 3D medical imaging. We then evaluated the accuracy of multiple deep learning neural network architectures on sex classification with this dataset. Specifically, we evaluated methods representing three different 3D data modeling approaches: Resnet3D, PointNet++, and MeshNet. Despite the limited number of imaging samples, our testing results show that all three approaches achieve AUC scores above 0.9 after convergence. PointNet++ exhibits the highest accuracy, while MeshNet has the lowest. Our findings suggest that accuracy is not solely dependent on the sparsity of data representation but also on the architecture design, with MeshNet's lower accuracy likely due to the lack of a hierarchical structure for progressive data abstraction. Furthermore, we studied a problem related to sex determination, which is the analysis of the various morphological features that affect sex classification. We proposed and developed a new method based on morphological gradients to visualize features that influence model decision making. The method based on morphological gradients is an alternative to the standard saliency map, and the new method provides better visualization of feature importance. Our study is the first to develop and evaluate deep learning models for analyzing 3D facial skull images to identify imaging feature differences between individuals assigned male or female at birth. These findings may be useful for planning and evaluating craniofacial surgery, particularly gender-affirming procedures, such as facial feminization surgery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A real-world pharmacovigilance study on cardiovascular adverse events of tisagenlecleucel using machine learning approach",
        "link": "https://www.nature.com/articles/s41598-024-64466-x",
        "publication_date": "13 Jun 2024",
        "abstract": "Chimeric antigen receptor T-cell (CAR-T) therapies are a paradigm-shifting therapeutic in patients with hematological malignancies. However, some concerns remain that they may cause serious cardiovascular adverse events (AEs), for which data are scarce. In this study, gradient boosting machine algorithm-based model was fitted to identify safety signals of serious cardiovascular AEs reported for tisagenlecleucel in the World Health Organization Vigibase up until February 2024. Input dataset, comprised of positive and negative controls of tisagenlecleucel based on its labeling information and literature search, was used to train the model. Then, we implemented the model to calculate the predicted probability of serious cardiovascular AEs defined by preferred terms included in the important medical event list from European Medicine Agency. There were 467 distinct AEs from 3,280 safety cases reports for tisagenlecleucel, of which 363 (77.7%) were classified as positive controls, 66 (14.2%) as negative controls, and 37 (7.9%) as unknown AEs. The prediction model had area under the receiver operating characteristic curve of 0.76 in the test dataset application. Of the unknown AEs, six cardiovascular AEs were predicted as the safety signals: bradycardia (predicted probability 0.99), pleural effusion (0.98), pulseless electrical activity (0.89), cardiotoxicity (0.83), cardio-respiratory arrest (0.69), and acute myocardial infarction (0.58). Our findings underscore vigilant monitoring of acute cardiotoxicities with tisagenlecleucel therapy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of an interpretable model for predicting sepsis mortality across care settings",
        "link": "https://www.nature.com/articles/s41598-024-64463-0",
        "publication_date": "13 Jun 2024",
        "abstract": "There are numerous prognostic predictive models for evaluating mortality risk, but current scoring models might not fully cater to sepsis patients’ needs. This study developed and validated a new model for sepsis patients that is suitable for any care setting and accurately forecasts 28-day mortality. The derivation dataset, gathered from 20 hospitals between September 2019 and December 2021, contrasted with the validation dataset, collected from 15 hospitals from January 2022 to December 2022. In this study, 7436 patients were classified as members of the derivation dataset, and 2284 patients were classified as members of the validation dataset. The point system model emerged as the optimal model among the tested predictive models for foreseeing sepsis mortality. For community-acquired sepsis, the model’s performance was satisfactory (derivation dataset AUC: 0.779, 95% CI 0.765–0.792; validation dataset AUC: 0.787, 95% CI 0.765–0.810). Similarly, for hospital-acquired sepsis, it performed well (derivation dataset AUC: 0.768, 95% CI 0.748–0.788; validation dataset AUC: 0.729, 95% CI 0.687–0.770). The calculator, accessible at https://avonlea76.shinyapps.io/shiny_app_up/, is user-friendly and compatible. The new predictive model of sepsis mortality is user-friendly and satisfactorily forecasts 28-day mortality. Its versatility lies in its applicability to all patients, encompassing both community-acquired and hospital-acquired sepsis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Can ChatGPT provide high-quality patient information on male lower urinary tract symptoms suggestive of benign prostate enlargement?",
        "link": "https://www.nature.com/articles/s41391-024-00847-7",
        "publication_date": "13 Jun 2024",
        "abstract": "ChatGPT has recently emerged as a novel resource for patients’ disease-specific inquiries. There is, however, limited evidence assessing the quality of the information. We evaluated the accuracy and quality of the ChatGPT’s responses on male lower urinary tract symptoms (LUTS) suggestive of benign prostate enlargement (BPE) when compared to two reference resources.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Enhancing the diagnosis of functionally relevant coronary artery disease with machine learning",
        "link": "https://www.nature.com/articles/s41467-024-49390-y",
        "publication_date": "12 Jun 2024",
        "abstract": "Functionally relevant coronary artery disease (fCAD) can result in premature death or nonfatal acute myocardial infarction. Its early detection is a fundamentally important task in medicine. Classical detection approaches suffer from limited diagnostic accuracy or expose patients to possibly harmful radiation. Here we show how machine learning (ML) can outperform cardiologists in predicting the presence of stress-induced fCAD in terms of area under the receiver operating characteristic (AUROC: 0.71 vs. 0.64, p = 4.0E-13). We present two ML approaches, the first using eight static clinical variables, whereas the second leverages electrocardiogram signals from exercise stress testing. At a target post-test probability for fCAD of <15%, ML facilitates a potential reduction of imaging procedures by 15–17% compared to the cardiologist’s judgement. Predictive performance is validated on an internal temporal data split as well as externally. We also show that combining clinical judgement with conventional ML and deep learning using logistic regression results in a mean AUROC of 0.74.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Alteration of circulating ACE2-network related microRNAs in patients with COVID-19",
        "link": "https://www.nature.com/articles/s41598-024-58037-3",
        "publication_date": "12 Jun 2024",
        "abstract": "Angiotensin converting enzyme 2 (ACE2) serves as the primary receptor for the SARS-CoV-2 virus and has implications for the functioning of the cardiovascular system. Based on our previously published bioinformatic analysis, in this study we aimed to analyze the diagnostic and predictive utility of miRNAs (miR-10b-5p, miR-124-3p, miR-200b-3p, miR-26b-5p, miR-302c-5p) identified as top regulators of ACE2 network with potential to affect cardiomyocytes and cardiovascular system in patients with COVID-19. The expression of miRNAs was determined through qRT-PCR in a cohort of 79 hospitalized COVID-19 patients as well as 32 healthy volunteers. Blood samples and clinical data of COVID-19 patients were collected at admission, 7-days and 21-days after admission. We also performed SHAP analysis of clinical data and miRNAs target predictions and advanced enrichment analyses. Low expression of miR-200b-3p at the seventh day of admission is indicative of predictive value in determining the length of hospital stay and/or the likelihood of mortality, as shown in ROC curve analysis with an AUC of 0.730 and a p-value of 0.002. MiR-26b-5p expression levels in COVID-19 patients were lower at the baseline, 7 and 21-days of admission compared to the healthy controls (P < 0.0001). Similarly, miR-10b-5p expression levels were lower at the baseline and 21-days post admission (P = 0.001). The opposite situation was observed in miR-124-3p and miR-302c-5p. Enrichment analysis showed influence of analyzed miRNAs on IL-2 signaling pathway and multiple cardiovascular diseases through COVID-19-related targets. Moreover, the COVID-19-related genes regulated by miR-200b-3p were linked to T cell protein tyrosine phosphatase and the HIF-1 transcriptional activity in hypoxia. Analysis focused on COVID-19 associated genes showed that all analyzed miRNAs are strongly affecting disease pathways related to CVDs which could be explained by their strong interaction with the ACE2 network.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A systematic review and bayesian meta-analysis of medical devices used in chronic pain management",
        "link": "https://www.nature.com/articles/s41598-024-63499-6",
        "publication_date": "12 Jun 2024",
        "abstract": "Whilst. pharmacological therapies remain the cornerstone of pain management in chronic pain, factors including the current opioid epidemic have led to non-pharmacological techniques becoming a more attractive proposition. We explored the prevalence of medical device use and their treatment efficacy in non-cancer pain management. A systematic methodology was developed, peer reviewed and published in PROSPERO (CRD42021235384). Key words of medical device, pain management devices, chronic pain, lower back pain, back pain, leg pain and chronic pelvic pain using Science direct, PubMed, Web of Science, PROSPERO, MEDLINE, EMBASE, PorQuest and ClinicalTrials.gov. All clinical trials, epidemiology and mixed methods studies that reported the use of medical devices for non-cancer chronic pain management published between the 1st of January 1990 and the 30th of April 2022 were included. 13 studies were included in systematic review, of these 6 were used in the meta-analysis. Our meta-analysis for pain reduction showed that transcutaneous electrical nerve stimulation combined with instrument-assisted soft tissue mobilization treatment and pulsed electromagnetic therapy produced significant treatment on chronic lower back pain patients. Pooled evidence revealed the use of medical device related interventions resulted in 0.7 degree of pain reduction under a 0–10 scale. Significant improvement in disability scores, with a 7.44 degree reduction in disability level compared to a placebo using a 50 score range was also seen. Our analysis has shown that the optimal use of medical devices in a sustainable manner requires further research, needing larger cohort studies, greater gender parity, in a more diverse range of geographical locations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Digital twin mathematical models suggest individualized hemorrhagic shock resuscitation strategies",
        "link": "https://www.nature.com/articles/s43856-024-00535-6",
        "publication_date": "12 Jun 2024",
        "abstract": "Optimizing resuscitation to reduce inflammation and organ dysfunction following human trauma-associated hemorrhagic shock is a major clinical hurdle. This is limited by the short duration of pre-clinical studies and the sparsity of early data in the clinical setting.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exome sequence analysis identifies rare coding variants associated with a machine learning-based marker for coronary artery disease",
        "link": "https://www.nature.com/articles/s41588-024-01791-x",
        "publication_date": "11 Jun 2024",
        "abstract": "Coronary artery disease (CAD) exists on a spectrum of disease represented by a combination of risk factors and pathogenic processes. An in silico score for CAD built using machine learning and clinical data in electronic health records captures disease progression, severity and underdiagnosis on this spectrum and could enhance genetic discovery efforts for CAD. Here we tested associations of rare and ultrarare coding variants with the in silico score for CAD in the UK Biobank, All of Us Research Program and BioMe Biobank. We identified associations in 17 genes; of these, 14 show at least moderate levels of prior genetic, biological and/or clinical support for CAD. We also observed an excess of ultrarare coding variants in 321 aggregated CAD genes, suggesting more ultrarare variant associations await discovery. These results expand our understanding of the genetic etiology of CAD and illustrate how digital markers can enhance genetic association investigations for complex diseases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Towards knowledge-infused automated disease diagnosis assistant",
        "link": "https://www.nature.com/articles/s41598-024-53042-y",
        "publication_date": "11 Jun 2024",
        "abstract": "With the advancement of internet communication and telemedicine, people are increasingly turning to the web for various healthcare activities. With an ever-increasing number of diseases and symptoms, diagnosing patients becomes challenging. In this work, we build a diagnosis assistant to assist doctors, which identifies diseases based on patient–doctor interaction. During diagnosis, doctors utilize both symptomatology knowledge and diagnostic experience to identify diseases accurately and efficiently. Inspired by this, we investigate the role of medical knowledge in disease diagnosis through doctor–patient interaction. We propose a two-channel, knowledge-infused, discourse-aware disease diagnosis model (KI-DDI), where the first channel encodes patient–doctor communication using a transformer-based encoder, while the other creates an embedding of symptom-disease using a graph attention network (GAT). In the next stage, the conversation and knowledge graph embeddings are infused together and fed to a deep neural network for disease identification. Furthermore, we first develop an empathetic conversational medical corpus comprising conversations between patients and doctors, annotated with intent and symptoms information. The proposed model demonstrates a significant improvement over the existing state-of-the-art models, establishing the crucial roles of (a) a doctor’s effort for additional symptom extraction (in addition to patient self-report) and (b) infusing medical knowledge in identifying diseases effectively. Many times, patients also show their medical conditions, which acts as crucial evidence in diagnosis. Therefore, integrating visual sensory information would represent an effective avenue for enhancing the capabilities of diagnostic assistants.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluating the Shock Index, Revised Assessment of Bleeding and Transfusion (RABT), Assessment of Blood Consumption (ABC) and novel PTTrauma score to predict critical transfusion threshold (CAT) in penetrating thoracic trauma",
        "link": "https://www.nature.com/articles/s41598-024-62579-x",
        "publication_date": "11 Jun 2024",
        "abstract": "The shock index (SI) has been associated with predicting transfusion needs in trauma patients. However, its utility in penetrating thoracic trauma (PTTrauma) for predicting the Critical Administration Threshold (CAT) has not been well-studied. This study aimed to evaluate the prognostic value of SI in predicting CAT in PTTrauma patients and compare its performance with the Assessment of Blood Consumption (ABC) and Revised Assessment of Bleeding and Transfusion (RABT) scores. We conducted a prognostic type 2, single-center retrospective observational cohort study on patients with PTTrauma and an Injury Severity Score (ISS) > 9. The primary exposure was SI at admission, and the primary outcome was CAT. Logistic regression and decision curve analysis were used to assess the predictive performance of SI and the PTTrauma score, a novel model incorporating clinical variables. Of the 620 participants, 53 (8.5%) had more than one CAT. An SI > 0.9 was associated with CAT (adjusted OR 4.89, 95% CI 1.64–14.60). The PTTrauma score outperformed SI, ABC, and RABT scores in predicting CAT (AUC 0.867, 95% CI 0.826–0.908). SI is a valuable predictor of CAT in PTTrauma patients. The novel PTTrauma score demonstrates superior performance compared to existing scores, highlighting the importance of developing targeted predictive models for specific injury patterns. These findings can guide clinical decision-making and resource allocation in the management of PTTrauma.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Capturing relationships between suturing sub-skills to improve automatic suturing assessment",
        "link": "https://www.nature.com/articles/s41746-024-01143-3",
        "publication_date": "11 Jun 2024",
        "abstract": "Suturing skill scores have demonstrated strong predictive capabilities for patient functional recovery. The suturing can be broken down into several substep components, including needle repositioning, needle entry angle, etc. Artificial intelligence (AI) systems have been explored to automate suturing skill scoring. Traditional approaches to skill assessment typically focus on evaluating individual sub-skills required for particular substeps in isolation. However, surgical procedures require the integration and coordination of multiple sub-skills to achieve successful outcomes. Significant associations among the technical sub-skill have been established by existing studies. In this paper, we propose a framework for joint skill assessment that takes into account the interconnected nature of sub-skills required in surgery. The prior known relationships among sub-skills are firstly identified. Our proposed AI system is then empowered by the prior known relationships to perform the suturing skill scoring for each sub-skill domain simultaneously. Our approach can effectively improve skill assessment performance through the prior known relationships among sub-skills. Through the proposed approach to joint skill assessment, we aspire to enhance the evaluation of surgical proficiency and ultimately improve patient outcomes in surgery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Computationally derived transition points across phases of clinical care",
        "link": "https://www.nature.com/articles/s41746-024-01145-1",
        "publication_date": "11 Jun 2024",
        "abstract": "The objective of this study is to use statistical techniques for the identification of transition points along the life course, aiming to identify fundamental changes in patient multimorbidity burden across phases of clinical care. This retrospective cohort analysis utilized 5.2 million patient encounters from 2013 to 2022, collected from a large academic institution and its affiliated hospitals. Structured information was systematically gathered for each encounter and three methodologies - clustering analysis, False Nearest Neighbor, and transitivity analysis - were employed to pinpoint transitions in patients’ clinical phase. Clustering analysis identified transition points at age 2, 17, 41, and 66, FNN at 4.27, 5.83, 5.85, 14.12, 20.62, 24.30, 25.10, 29.08, 33.12, 35.7, 38.69, 55.66, 70.03, and transitivity analysis at 7.27, 23.58, 29.04, 35.00, 61.29, 67.03, 77.11. Clustering analysis identified transition points that align with the current clinical gestalt of pediatric, adult, and geriatric phases of care. Notably, over half of the transition points identified by FNN and transitivity analysis were between ages 20 and 40, a population that is traditionally considered to be clinically homogeneous. Few transition points were identified between ages 3 and 17. Despite large social and developmental transition at those ages, the burden of multimorbidities may be consistent across the age range. Transition points derived through unsupervised machine learning approaches identify changes in the clinical phase that align with true differences in underlying multimorbidity burden. These transitions may be different from conventional pediatric and geriatric phases, which are often influenced by policy rather than clinical changes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting ineffective thrombolysis in acute ischemic stroke with clinical and biochemical markers",
        "link": "https://www.nature.com/articles/s41598-024-64413-w",
        "publication_date": "11 Jun 2024",
        "abstract": "**Ischemic stroke remains a leading cause of morbidity and mortality globally. Despite the advances in thrombolytic therapy, notably recombinant tissue plasminogen activator (rtPA), patient outcomes are highly variable. This study aims to introduce a novel predictive model, the Acute Stroke Thrombolysis Non-Responder Prediction Model (ASTN-RPM), to identify patients unlikely to benefit from rtPA within the critical early recovery window. We conducted a retrospective cohort study at Baoding No.1 Central Hospital including 709 adult patients diagnosed with acute ischemic stroke and treated with intravenous alteplase within the therapeutic time window. The ASTN-RPM was developed using Least Absolute Shrinkage and Selection Operator (LASSO) regression technique, incorporating a wide range of biomarkers and clinical parameters. Model performance was evaluated using Receiver Operating Characteristic (ROC) curves, calibration plots, and Decision Curve Analysis (DCA). ASTN-RPM effectively identified patients at high risk of poor response to thrombolysis, with an AUC of 0.909 in the training set and 0.872 in the validation set, indicating high sensitivity and specificity. Key predictors included posterior circulation stroke, high admission NIHSS scores, extended door to needle time, and certain laboratory parameters like homocysteine levels. The ASTN-RPM stands as a potential tool for refining clinical decision-making in ischemic stroke management. By anticipating thrombolytic non-response, clinicians can personalize treatment strategies, possibly improving patient outcomes and reducing the burden of ineffective interventions. Future studies are needed for external validation and to explore the incorporation of emerging biomarkers and imaging data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "In situ brain tumor detection using a Raman spectroscopy system—results of a multicenter study",
        "link": "https://www.nature.com/articles/s41598-024-62543-9",
        "publication_date": "10 Jun 2024",
        "abstract": "Safe and effective brain tumor surgery aims to remove tumor tissue, not non-tumoral brain. This is a challenge since tumor cells are often not visually distinguishable from peritumoral brain during surgery. To address this, we conducted a multicenter study testing whether the Sentry System could distinguish the three most common types of brain tumors from brain tissue in a label-free manner. The Sentry System is a new real time, in situ brain tumor detection device that merges Raman spectroscopy with machine learning tissue classifiers. Nine hundred and seventy-six in situ spectroscopy measurements and colocalized tissue specimens were acquired from 67 patients undergoing surgery for glioblastoma, brain metastases, or meningioma to assess tumor classification. The device achieved diagnostic accuracies of 91% for glioblastoma, 97% for brain metastases, and 96% for meningiomas. These data show that the Sentry System discriminated tumor containing tissue from non-tumoral brain in real time and prior to resection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Heterogeneous associations of multiplexed environmental factors and multidimensional aging metrics",
        "link": "https://www.nature.com/articles/s41467-024-49283-0",
        "publication_date": "10 Jun 2024",
        "abstract": "Complicated associations between multiplexed environmental factors and aging are poorly understood. We manipulated aging using multidimensional metrics such as phenotypic age, brain age, and brain volumes in the UK Biobank. Weighted quantile sum regression was used to examine the relative individual contributions of multiplexed environmental factors to aging, and self-organizing maps (SOMs) were used to examine joint effects. Air pollution presented a relatively large contribution in most cases. We also found fair heterogeneities in which the same environmental factor contributed inconsistently to different aging metrics. Particulate matter contributed the most to variance in aging, while noise and green space showed considerable contribution to brain volumes. SOM identified five subpopulations with distinct environmental exposure patterns and the air pollution subpopulation had the worst aging status. This study reveals the heterogeneous associations of multiplexed environmental factors with multidimensional aging metrics and serves as a proof of concept when analyzing multifactors and multiple outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive approach for liberation from acute dialysis in ICU patients using interpretable machine learning",
        "link": "https://www.nature.com/articles/s41598-024-63992-y",
        "publication_date": "07 Jun 2024",
        "abstract": "Renal recovery following dialysis-requiring acute kidney injury (AKI-D) is a vital clinical outcome in critical care, yet it remains an understudied area. This retrospective cohort study, conducted in a medical center in Taiwan from 2015 to 2020, enrolled patients with AKI-D during intensive care unit stays. We aimed to develop and temporally test models for predicting dialysis liberation before hospital discharge using machine learning algorithms and explore early predictors. The dataset comprised 90 routinely collected variables within the first three days of dialysis initiation. Out of 1,381 patients who received acute dialysis, 27.3% experienced renal recovery. The cohort was divided into the training group (N = 1135) and temporal testing group (N = 251). The models demonstrated good performance, with an area under the receiver operating characteristic curve of 0.85 (95% CI, 0.81–0.88) and an area under the precision-recall curve of 0.69 (95% CI, 0.62–0.76) for the XGBoost model. Key predictors included urine volume, Charlson comorbidity index, vital sign derivatives (trend of respiratory rate and SpO2), and lactate levels. We successfully developed early prediction models for renal recovery by integrating early changes in vital signs and inputs/outputs, which have the potential to aid clinical decision-making in the ICU.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of subclusters and prognostic genes based on GLS-associated molecular signature in ulcerative colitis",
        "link": "https://www.nature.com/articles/s41598-024-63891-2",
        "publication_date": "07 Jun 2024",
        "abstract": "Ulcerative colitis (UC) is a chronic and recurrent inflammatory disease that affects the colon and rectum. The response to treatment varies among individuals with UC. Therefore, the aim of this study was to identify and explore potential biomarkers for different subtypes of UC and examine their association with immune cell infiltration. We obtained UC RNA sequencing data from the GEO database, which included the training set GSE92415 and the validation set GSE87473 and GSE72514. UC patients were classified based on GLS and its associated genes using consensus clustering analysis. We identified differentially expressed genes (DEGs) in different UC subtypes through a differential expression analysis of the training cohort. Machine learning algorithms, including Weighted Gene Co-Expression Network Analysis (WGCNA), Least Absolute Shrinkage and Selection Operator (LASSO), and Support Vector Machine Recursive Feature Elimination (SVM-RFE), were utilized to identify marker genes for UC. The CIBERSORT algorithm was used to determine the abundance of various immune cells in UC and their correlation with UC signature genes. Finally, we validated the expression of GLS through in vivo and ex vivo experiments. The expression of GLS was found to be elevated in patients with UC compared to normal patients. GLS and its related genes were able to classify UC patients into two subtypes, C1 and C2. The C1 subtype, as compared to the C2 subtype, showed a higher Mayo score and poorer treatment response. A total of 18 DEGs were identified in both subtypes, including 7 up-regulated and 11 down-regulated genes. Four UC signature genes (CWH43, HEPACAM2, IL24, and PCK1) were identified and their diagnostic value was validated in a separate cohort (AUC > 0.85). Furthermore, we found that UC signature biomarkers were linked to the immune cell infiltration. CWH43, HEPACAM2, IL24, and PCK1 may serve as potential biomarkers for diagnosing different subtypes of UC, which could contribute to the development of targeted molecular therapy and immunotherapy for UC.",
        "conclusions": "By integrating multiple bioinformatics tools and using GLS-related genes to characterize different subtypes, related pathways, and immune cell infiltration in UC tissues, we screened CWH43, HEPACAM2, IL24, and PCK1 as possible candidate diagnostic biomarkers for UC typing. These results will help to understand the pathogenesis of UC and provide new therapeutic tools.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring the relationship between heavy metals and diabetic retinopathy: a machine learning modeling approach",
        "link": "https://www.nature.com/articles/s41598-024-63916-w",
        "publication_date": "06 Jun 2024",
        "abstract": "Diabetic retinopathy (DR) is one of the leading causes of adult blindness in the United States. Although studies applying traditional statistical methods have revealed that heavy metals may be essential environmental risk factors for diabetic retinopathy, there is a lack of analyses based on machine learning (ML) methods to adequately explain the complex relationship between heavy metals and DR and the interactions between variables. Based on characteristic variables of participants with and without DR and heavy metal exposure data obtained from the NHANES database (2003–2010), a ML model was developed for effective prediction of DR. The best predictive model for DR was selected from 11 models by receiver operating characteristic curve (ROC) analysis. Further permutation feature importance (PFI) analysis, partial dependence plots (PDP) analysis, and SHapley Additive exPlanations (SHAP) analysis were used to assess the model capability and key influencing factors. A total of 1042 eligible individuals were randomly assigned to two groups for training and testing set of the prediction model. ROC analysis showed that the k-nearest neighbour (KNN) model had the highest prediction performance, achieving close to 100% accuracy in the testing set. Urinary Sb level was identified as the critical heavy metal affecting the predicted risk of DR, with a contribution weight of 1.730632 ± 1.791722, which was much higher than that of other heavy metals and baseline variables. The results of the PDP analysis and the SHAP analysis also indicated that antimony (Sb) had a more significant effect on DR. The interaction between age and Sb was more significant compared to other variables and metal pairs. We found that Sb could serve as a potential predictor of DR and that Sb may influence the development of DR by mediating cellular and systemic senescence. The study revealed that monitoring urinary Sb levels can be useful for early non-invasive screening and intervention in DR development, and also highlighted the important role of constructed ML models in explaining the effects of heavy metal exposure on DR.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Assessing calibration and bias of a deployed machine learning malnutrition prediction model within a large healthcare system",
        "link": "https://www.nature.com/articles/s41746-024-01141-5",
        "publication_date": "06 Jun 2024",
        "abstract": "Malnutrition is a frequently underdiagnosed condition leading to increased morbidity, mortality, and healthcare costs. The Mount Sinai Health System (MSHS) deployed a machine learning model (MUST-Plus) to detect malnutrition upon hospital admission. However, in diverse patient groups, a poorly calibrated model may lead to misdiagnosis, exacerbating health care disparities. We explored the model’s calibration across different variables and methods to improve calibration. Data from adult patients admitted to five MSHS hospitals from January 1, 2021 - December 31, 2022, were analyzed. We compared MUST-Plus prediction to the registered dietitian’s formal assessment. Hierarchical calibration was assessed and compared between the recalibration sample (N = 49,562) of patients admitted between January 1, 2021 - December 31, 2022, and the hold-out sample (N = 17,278) of patients admitted between January 1, 2023 - September 30, 2023. Statistical differences in calibration metrics were tested using bootstrapping with replacement. Before recalibration, the overall model calibration intercept was −1.17 (95% CI: −1.20, −1.14), slope was 1.37 (95% CI: 1.34, 1.40), and Brier score was 0.26 (95% CI: 0.25, 0.26). Both weak and moderate measures of calibration were significantly different between White and Black patients and between male and female patients. Logistic recalibration significantly improved calibration of the model across race and gender in the hold-out sample. The original MUST-Plus model showed significant differences in calibration between White vs. Black patients. It also overestimated malnutrition in females compared to males. Logistic recalibration effectively reduced miscalibration across all patient subgroups. Continual monitoring and timely recalibration can improve model accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Generic protein–ligand interaction scoring by integrating physical prior knowledge and data augmentation modelling",
        "link": "https://www.nature.com/articles/s42256-024-00849-z",
        "publication_date": "06 Jun 2024",
        "abstract": "Developing robust methods for evaluating protein–ligand interactions has been a long-standing problem. Data-driven methods may memorize ligand and protein training data rather than learning protein–ligand interactions. Here we show a scoring approach called EquiScore, which utilizes a heterogeneous graph neural network to integrate physical prior knowledge and characterize protein–ligand interactions in equivariant geometric space. EquiScore is trained based on a new dataset constructed with multiple data augmentation strategies and a stringent redundancy-removal scheme. On two large external test sets, EquiScore consistently achieved top-ranking performance compared to 21 other methods. When EquiScore is used alongside different docking methods, it can effectively enhance the screening ability of these docking methods. EquiScore also showed good performance on the activity-ranking task of a series of structural analogues, indicating its potential to guide lead compound optimization. Finally, we investigated different levels of interpretability of EquiScore, which may provide more insights into structure-based drug design.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "The Depression Anxiety Stress Scale 8: investigating its cutoff scores in relevance to loneliness and burnout among dementia family caregivers",
        "link": "https://www.nature.com/articles/s41598-024-60127-1",
        "publication_date": "06 Jun 2024",
        "abstract": "The global trend of advanced aging comes at the cost of amplified onset of age-related diseases. Dementia is a common multifactorial age-related neurodegenerative disorder, which manifests with progressive declines in cognitive functioning and ability to perform activities of daily living. As polices discourage institutionalized care, family members act as primary caregivers and endure increased vulnerability to physical and mental health problems secondary to care-related changes in life routine and relationships. Targeting clinically significant distress at earlier stages through valid brief measures may promote caregivers’ wellbeing and dementia care continuity/quality. This study aimed to determine the optimal cutoff score of the Depression Anxiety Stress Scale 8-items (DASS-8) in a convenience sample of 571 European caregivers (Mean age = 53 ± 12 years, Italian = 74.4%, Swiss = 25.6%) through three methods. K-means clustering classified the sample into high- and low-distress clusters based on DASS-8 score of 19. Receiver operator curve (ROC) analysis using 48 and 7 cutoffs of the Zarit Burden Interview (ZBI) and the Three-Item University of California, Los Angeles, Loneliness Scale-version 3 (UCLALS3), revealed two DASS-8 cutoffs (12.5 and 14.5, area under the curve (AUC) = 0.85 and 0.92, p values < .001, 95% CI 0.82–0.88 and 0.89 to 0.94, sensitivity = 0.81 and 0.78, specificity = 0.76 and 0.89, Youden index = 0.57 and 0.67, respectively). Decision modeling produced two DASS-8 cutoffs (9.5 and 14.5) for predicting low and high caregiving burden and loneliness, respectively. According to the median of all DASS-8 cutoffs (14.5) the prevalence of mental distress was 50.8%. Distress correlated with key mental problems such as burnout and loneliness—in path analysis, DASS-8 scores were predicted by the ZBI, UCLALS3, care dependency, and receiving help with care, especially among older, female, and spouse caregivers. Further diagnostic workup should follow to confirm psycho-pathogenicity among caregivers with DASS-8 scores above 14.5. Investigations of the DASS-8 in other countries/populations may confirm the validity of this cutoff score.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A multi-institutional machine learning algorithm for prognosticating facial nerve injury following microsurgical resection of vestibular schwannoma",
        "link": "https://www.nature.com/articles/s41598-024-63161-1",
        "publication_date": "05 Jun 2024",
        "abstract": "Vestibular schwannomas (VS) are the most common tumor of the skull base with available treatment options that carry a risk of iatrogenic injury to the facial nerve, which can significantly impact patients’ quality of life. As facial nerve outcomes remain challenging to prognosticate, we endeavored to utilize machine learning to decipher predictive factors relevant to facial nerve outcomes following microsurgical resection of VS. A database of patient-, tumor- and surgery-specific features was constructed via retrospective chart review of 242 consecutive patients who underwent microsurgical resection of VS over a 7-year study period. This database was then used to train non-linear supervised machine learning classifiers to predict facial nerve preservation, defined as House-Brackmann (HB) I vs. facial nerve injury, defined as HB II–VI, as determined at 6-month outpatient follow-up. A random forest algorithm demonstrated 90.5% accuracy, 90% sensitivity and 90% specificity in facial nerve injury prognostication. A random variable (rv) was generated by randomly sampling a Gaussian distribution and used as a benchmark to compare the predictiveness of other features. This analysis revealed age, body mass index (BMI), case length and the tumor dimension representing tumor growth towards the brainstem as prognosticators of facial nerve injury. When validated via prospective assessment of facial nerve injury risk, this model demonstrated 84% accuracy. Here, we describe the development of a machine learning algorithm to predict the likelihood of facial nerve injury following microsurgical resection of VS. In addition to serving as a clinically applicable tool, this highlights the potential of machine learning to reveal non-linear relationships between variables which may have clinical value in prognostication of outcomes for high-risk surgical procedures.",
        "conclusions": "Here, we have described the development of a multi-institutionally derived machine learning algorithm to predict the likelihood of facial nerve injury following microsurgical resection of VS. Our model demonstrated a high degree of accuracy, and was able to identify novel predictors of facial nerve dysfunction following microsurgical resection of VS. The model will be further developed as a clinical tool for predictions of facial nerve outcome. With the inclusion of additional national and international institutions to improve generalizability, our ultimate goal is to utilize this tool for counseling patients about surgical risk, and aid in surgical decision-making. More broadly, while further evaluation is necessary to fully understand the mechanistic implications of the features identified, this analysis has demonstrated the utility of machine learning in identifying clinically relevant factors which may otherwise evade elucidation via linear statistical methods, such as comparisons of measures of centrality.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Vortex-like vs. turbulent mixing of a Viscum album preparation affects crystalline structures formed in dried droplets",
        "link": "https://www.nature.com/articles/s41598-024-63797-z",
        "publication_date": "05 Jun 2024",
        "abstract": "Various types of motion introduced into a solution can affect, among other factors, the alignment and positioning of molecules, the agglomeration of large molecules, oxidation processes, and the production of microparticles and microbubbles. We employed turbulent mixing vs. laminar flow induced by a vortex vs. diffusion-based mixing during the production of Viscum album Quercus L. 10−3 following the guidelines for manufacturing homeopathic preparations. The differently mixed preparation variants were analyzed using the droplet evaporation method. The crystalline structures formed in dried droplets were photographed and analyzed using computer-supported image analysis and deep learning. Computer-supported evaluation and deep learning revealed that the patterns of the variant succussed under turbulence are characterized by lower complexity, whereas those obtained from the vortex-mixed variant are characterized by greater complexity compared to the diffusion-based mixed control variant. The droplet evaporation method could provide a relatively inexpensive means of testing the effects of liquid flow and serve as an alternative to currently used methods.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]