[
    {
        "title": "Enhancing pectus excavatum diagnosis with an automated batch evaluation tool for chest computed tomography images",
        "link": "https://www.nature.com/articles/s41598-024-73880-0",
        "publication_date": "08 Oct 2024",
        "abstract": "We aimed to implement a fully automatic computed tomography (CT) image-detection programming algorithm as a pectus excavatum (PE) diagnostic tool, facilitating comprehensive chest wall deformity evaluation. We developed our algorithm using MATLAB, leveraging the Hounsfield unit threshold and region growing methods. The MATLAB graphical user interface enables the direct use of our program. We validated the model using CT images of anthropomorphic phantoms and one normal individual. The measurement values obtained by our algorithm demonstrated very small differences compared to the known anthropomorphic phantom model data and manual measurement. For algorithm testing, 17,214 chest CT scans obtained from 57 PE patients were processed by the algorithm and independently reviewed by a radiologist and a thoracic surgeon. The measurements of transverse, anteroposterior, and sternum-to-vertebral distance of the thoracic cavity, along with the calculated data of four indices, exhibited high positive correlations (0.94–0.99). The asymmetry index and maximum anteroposterior hemithorax distance exhibited moderate correlation (0.40–0.83). Our automatic PE diagnostic tool demonstrated high accuracy; four chest wall deformity indices were obtained simultaneously without any initial manual marking, correlating well with manual measurements.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of brain metastasis development with DNA methylation signatures",
        "link": "https://www.nature.com/articles/s41591-024-03286-y",
        "publication_date": "08 Oct 2024",
        "abstract": "Brain metastases (BMs) are the most common and among the deadliest brain tumors. Currently, there are no reliable predictors of BM development from primary cancer, which limits early intervention. Lung adenocarcinoma (LUAD) is the most common BM source and here we obtained 402 tumor and plasma samples from a large cohort of patients with LUAD with or without BM (n = 346). LUAD DNA methylation signatures were evaluated to build and validate an accurate model predicting BM development from LUAD, which was integrated with clinical factors to provide comprehensive patient-specific BM risk probabilities in a nomogram. Additionally, immune and cell interaction gene sets were differentially methylated at promoters in BM versus paired primary LUAD and had aligning dysregulation in the proteome. Immune cells were differentially abundant in BM versus LUAD. Finally, liquid biomarkers identified from methylated cell-free DNA sequenced in plasma were used to generate and validate accurate classifiers for early BM detection. Overall, LUAD methylomes can be leveraged to predict and noninvasively identify BM, moving toward improved patient outcomes with personalized treatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Disease coverage of human genome-wide association studies and pharmaceutical research and development",
        "link": "https://www.nature.com/articles/s43856-024-00625-5",
        "publication_date": "08 Oct 2024",
        "abstract": "Despite the growing interest in the use of human genomic data for drug target identification and validation, the extent to which the spectrum of human disease has been addressed by genome-wide association studies (GWAS), or by drug development, and the degree to which these efforts overlap remain unclear.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [
                "poisoning"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying patient subgroups in MASLD and MASH-associated fibrosis: molecular profiles and implications for drug development",
        "link": "https://www.nature.com/articles/s41598-024-74098-w",
        "publication_date": "07 Oct 2024",
        "abstract": "The incidence of MASLD and MASH-associated fibrosis is rapidly increasing worldwide. Drug therapy is hampered by large patient variability and partial representation of human MASH fibrosis in preclinical models. Here, we investigated the mechanisms underlying patient heterogeneity using a discovery dataset and validated in distinct human transcriptomic datasets, to improve patient stratification and translation into subgroup specific patterns. Patient stratification was performed using weighted gene co-expression network analysis (WGCNA) in a large public transcriptomic discovery dataset (n = 216). Differential expression analysis was performed using DESeq2 to obtain differentially expressed genes (DEGs). Ingenuity Pathway analysis was used for functional annotation. The discovery dataset showed relevant fibrosis-related mechanisms representative of disease heterogeneity. Biological complexity embedded in genes signature was used to stratify discovery dataset into six subgroups of various sizes. Of note, subgroup-specific DEGs show differences in directionality in canonical pathways (e.g. Collagen biosynthesis, cytokine signaling) across subgroups. Finally, a multiclass classification model was trained and validated in two datasets. In summary, our work shows a potential alternative for patient population stratification based on heterogeneity in MASLD-MASH mechanisms. Future research is warranted to further characterize patient subgroups and identify protein targets for virtual screening and/or in vitro validation in preclinical models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Bioinformatics analysis of effective biomarkers and immune infiltration in type 2 diabetes with cognitive impairment and aging",
        "link": "https://www.nature.com/articles/s41598-024-74480-8",
        "publication_date": "07 Oct 2024",
        "abstract": "With the increasing prevalence of diabetes mellitus worldwide, type 2 diabetes mellitus (T2D) combined with cognitive impairment and aging has become one of the common and important complications of diabetes mellitus, which seriously affects the quality of life of the patients, and imposes a heavy burden on the patients’ families and the society. Currently, there are no special measures for the treatment of cognitive impairment and aging in type 2 diabetes mellitus. Therefore, the search for potential biological markers of type 2 diabetes mellitus combined with cognitive impairment and aging is of great significance for future precisive treatment. We downloaded three gene expression datasets from the GEO database: GSE161355 (related to T2D with cognitive impairment and aging), GSE122063, and GSE5281 (related to Alzheimer’s disease). Differentially expressed genes (DEGs) were identified, followed by gene set enrichment analysis (GSEA). A protein-protein interaction (PPI) network was constructed using the STRING database, and the top 15 hub genes were identified using the CytoHubba plugin in Cytoscape. Core genes were ultimately determined using three machine learning methods: LASSO regression, Support Vector Machine Recursive Feature Elimination (SVM-RFE), and Linear Discriminant Analysis (LDA). The diagnostic performance of these genes was assessed using ROC curve analysis and validated in an independent dataset (GSE5281). Regulatory genes related to ferroptosis were screened from the FerrDb database, and their biological functions were further explored through GO and KEGG enrichment analyses. Finally, the CIBERSORT algorithm was used to analyze immune cell infiltration, and the correlation between core genes and immune cell infiltration levels was calculated, leading to the construction of an mRNA-miRNA regulatory network. In the GSE161355 and GSE122063 datasets, 217 common DEGs were identified. GSEA analysis revealed their enrichment in the PI3K-PLC-TRK signaling pathway, TP53 regulation of metabolic genes pathway, Notch signaling pathway, among others. PPI network analysis identified 15 candidate core genes, and further selection using LASSO, LDA, and SVM-RFE machine learning algorithms resulted in 6 core genes: BCL6, TP53, HSP90AA1, CRYAB, IL1B, and DNAJB1. ROC curve analysis indicated that these genes had good diagnostic performance in the GSE161355 dataset, with TP53 and IL1B achieving an AUC of 0.9, indicating the highest predictive accuracy. BCL6, HSP90AA1, CRYAB, and DNAJB1 also had AUCs greater than 0.8, demonstrating moderate predictive accuracy. Validation in the independent dataset GSE5281 showed that these core genes also had good diagnostic performance in Alzheimer’s disease samples (AUC > 0.6). Ferroptosis-related analysis revealed that IL1B and TP53 play significant roles in apoptosis and immune response. Immune cell infiltration analysis showed that IL1B is significantly positively correlated with infiltration levels of monocytes and NK cells, while TP53 is significantly negatively correlated with infiltration levels of follicular helper T cells. The construction of the miRNA-mRNA regulatory network suggested that miR-150a-5p might play a key role in the regulation of T2D-associated cognitive impairment and aging by TP53. This study, by integrating bioinformatics and machine learning methods, identified BCL6, TP53, HSP90AA1, CRYAB, IL1B, and DNAJB1 as potential diagnostic biomarkers for T2D with cognitive impairment and aging, with a particular emphasis on the significance of TP53 and IL1B in immune cell infiltration. These findings not only enhance our understanding of the molecular mechanisms linking type 2 diabetes to cognitive impairment and aging, providing new targets for early diagnosis and treatment, but also offer new directions and targets for basic research.",
        "conclusions": "In summary, candidate genes TP53 and IL1B screened based on bioinformatics analysis have the potential to influence the course of type 2 diabetes combined with cognitive impairment and aging through the Lipid and atherosclerosis, MAPK signalling pathway, fluid shear stress and atherosclerosis signalling pathways. They may play important roles in the course and disease outcome of type 2 diabetes mellitus combined with cognitive impairment and aging, and the results of this study provide meaningful clues and directions for clinical prognosis and treatment.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "COVID-19 detection from exhaled breath",
        "link": "https://www.nature.com/articles/s41598-024-74104-1",
        "publication_date": "06 Oct 2024",
        "abstract": "The SARS-CoV-2 coronavirus emerged in 2019 causing a COVID-19 pandemic that resulted in 7 million deaths out of 770 million reported cases over the next 4 years. The global health emergency called for unprecedented efforts to monitor and reduce the rate of infection, pushing the study of new diagnostic methods. In this paper, we introduce a cheap, fast, and non-invasive COVID-19 detection system, which exploits only exhaled breath. Specifically, provided an air sample, the mass spectra in the 10–351 mass-to-charge range are measured using an original micro and nano-sampling device coupled with a high-precision spectrometer; then, the raw spectra are processed by custom software algorithms; the clean and augmented data are eventually classified using state-of-the-art machine-learning algorithms. An uncontrolled clinical trial was conducted between 2021 and 2022 on 302 subjects who were concerned about being infected, either due to exhibiting symptoms or having recently recovered from illness. Despite the simplicity of use, our system showed a performance comparable to the traditional polymerase-chain-reaction and antigen testing in identifying cases of COVID-19 (that is, 95% accuracy, 94% recall, 96% specificity, and 92% \\(F_1\\)-score). In light of these outcomes, we think that the proposed system holds the potential for substantial contributions to routine screenings and expedited responses during future epidemics, as it yields results comparable to state-of-the-art methods, providing them in a more rapid and less invasive manner.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A fair individualized polysocial risk score for identifying increased social risk in type 2 diabetes",
        "link": "https://www.nature.com/articles/s41467-024-52960-9",
        "publication_date": "05 Oct 2024",
        "abstract": "Racial and ethnic minorities bear a disproportionate burden of type 2 diabetes (T2D) and its complications, with social determinants of health (SDoH) recognized as key drivers of these disparities. Implementing efficient and effective social needs management strategies is crucial. We propose a machine learning analytic pipeline to calculate the individualized polysocial risk score (iPsRS), which can identify T2D patients at high social risk for hospitalization, incorporating explainable AI techniques and algorithmic fairness optimization. We use electronic health records (EHR) data from T2D patients in the University of Florida Health Integrated Data Repository, incorporating both contextual SDoH (e.g., neighborhood deprivation) and person-level SDoH (e.g., housing instability). After fairness optimization across racial and ethnic groups, the iPsRS achieved a C statistic of 0.71 in predicting 1-year hospitalization. Our iPsRS can fairly and accurately screen patients with T2D who are at increased social risk for hospitalization.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Single-cell landscape of bronchoalveolar immune cells in patients with immune checkpoint inhibitor-related pneumonitis",
        "link": "https://www.nature.com/articles/s41698-024-00715-6",
        "publication_date": "05 Oct 2024",
        "abstract": "The pathophysiology of immune checkpoint inhibitor-related pneumonitis remains incompletely understood. We conducted single-cell and T-cell receptor transcriptomic sequencing on the bronchoalveolar lavage fluid from five patients with grade ≥2 immune checkpoint inhibitor-related pneumonitis. Our analyses revealed a prominent enrichment of T cells in the bronchoalveolar lavage fluid of patients with immune checkpoint inhibitor-related pneumonitis. Within the CD4 + T cell subset, Tfh-like T cells were highly enriched and exhibited signatures associated with inflammation and clonal expansion. Regulatory T cells were also enriched and displayed enhanced inhibitory functions. Within the CD8 + T-cell subset, effector memory/tissue-resident memory T cells with an elevated cytotoxic phenotype were highly infiltrated. Among myeloid cells, alveolar macrophages were depleted, while pro-inflammatory intermediate monocytes were elevated. Dendritic cells demonstrated enhanced antigen presentation capabilities. Cytokines CXCR4, CXCL13, TNF-α, IFN-α, IFN-γ, and TWEAK were elevated. Through a comprehensive single-cell analysis, we depicted the landscape of immune checkpoint inhibitor-related pneumonitis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multiomic profiling identifies predictors of survival in African American patients with acute myeloid leukemia",
        "link": "https://www.nature.com/articles/s41588-024-01929-x",
        "publication_date": "04 Oct 2024",
        "abstract": "Genomic profiles and prognostic biomarkers in patients with acute myeloid leukemia (AML) from ancestry-diverse populations are underexplored. We analyzed the exomes and transcriptomes of 100 patients with AML with genomically confirmed African ancestry (Black; Alliance) and compared their somatic mutation frequencies with those of 323 self-reported white patients with AML, 55% of whom had genomically confirmed European ancestry (white; BeatAML). Here we find that 73% of 162 gene mutations recurrent in Black patients, including a hitherto unreported PHIP alteration detected in 7% of patients, were found in one white patient or not detected. Black patients with myelodysplasia-related AML were younger than white patients suggesting intrinsic and/or extrinsic dysplasia-causing stressors. On multivariable analyses of Black patients, NPM1 and NRAS mutations were associated with inferior disease-free and IDH1 and IDH2 mutations with reduced overall survival. Inflammatory profiles, cell type distributions and transcriptional profiles differed between Black and white patients with NPM1 mutations. Incorporation of ancestry-specific risk markers into the 2022 European LeukemiaNet genetic risk stratification changed risk group assignment for one-third of Black patients and improved their outcome prediction.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multiresolution cascaded attention U-Net for localization and segmentation of optic disc and fovea in fundus images",
        "link": "https://www.nature.com/articles/s41598-024-73493-7",
        "publication_date": "04 Oct 2024",
        "abstract": "Identification of retinal diseases in automated screening methods, such as those used in clinical settings or computer-aided diagnosis, usually depends on the localization and segmentation of the Optic Disc (OD) and fovea. However, this task is difficult since these anatomical features have irregular spatial, texture, and shape characteristics, limited sample sizes, and domain shifts due to different data distributions across datasets. This study proposes a novel Multiresolution Cascaded Attention U-Net (MCAU-Net) model that addresses these problems by optimally balancing receptive field size and computational efficiency. The MCAU-Net utilizes two skip connections to accurately localize and segment the OD and fovea in fundus images. We incorporated a Multiresolution Wavelet Pooling Module (MWPM) into the CNN at each stage of U-Net input to compensate for spatial information loss. Additionally, we integrated a cascaded connection of the spatial and channel attentions as a skip connection in MCAU-Net to concentrate precisely on the target object and improve model convergence for segmenting and localizing OD and fovea centers. The proposed model has a low parameter count of 0.8 million, improving computational efficiency and reducing the risk of overfitting. For OD segmentation, the MCAU-Net achieves high IoU values of 0.9771, 0.945, and 0.946 for the DRISHTI-GS, DRIONS-DB, and IDRiD datasets, respectively, outperforming previous results for all three datasets. For the IDRiD dataset, the MCAU-Net locates the OD center with an Euclidean Distance (ED) of 16.90 pixels and the fovea center with an ED of 33.45 pixels, demonstrating its effectiveness in overcoming the common limitations of state-of-the-art methods.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Our experience with a modified prying-up technique for closed reduction of irreducible supracondylar humeral fractures",
        "link": "https://www.nature.com/articles/s41598-024-74467-5",
        "publication_date": "04 Oct 2024",
        "abstract": "Satisfactory reduction of some displaced pediatric supracondylar humerus fractures is not achievable via closed reduction, thus necessitating open procedure, which increases the incidence of complications. Using percutaneous prying-up technique to assist closed reduction may reduce the requirement for transform to an open operation. We retrospectively reviewed displaced pediatric supracondylar humerus fractures treated by the same surgeon from September 2021 to January 2024,with 134 subjects meeting criteria for inclusion. These children were divided into two groups. In Group A(n = 61),the prying-up technique was used to assist with closed reduction of fractures. Group B(n = 73) included fractures treated with conventional manual traction. To balance group size,12 fractures from group A were randomly removed, leaving a final 61 patients in each group. Demographics, operative time, the rate of failed closed reduction, complications and radiographic results were analyzed. The operative time was significantly less in Group A as compared with Group B(mean difference, − 7.22; [95% confidence interval (CI), − 8.49 to − 5.94]; p < 0.001). The rate of failed closed reduction were significantly lower in Group A as compared to Group B(2 of 61 vs. 10 of 61, p = 0.015).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "ChemAP: predicting drug approval with chemical structures before clinical trial phase by leveraging multi-modal embedding space and knowledge distillation",
        "link": "https://www.nature.com/articles/s41598-024-72868-0",
        "publication_date": "03 Oct 2024",
        "abstract": "Recent studies showed that the likelihood of drug approval can be predicted with clinical data and structure information of drug using computational approaches. Predicting the likelihood of drug approval can be innovative and of high impact. However, models that leverage clinical data are applicable only in clinical stages, which is not very practical. Prioritizing drug candidates and early-stage decision-making in the de novo drug development process is crucial in pharmaceutical research to optimize resource allocation. For early-stage decision-making, we need a computational model that uses only chemical structures. This seemingly impossible task may utilize the predictive power with multi-modal features including clinical data. In this work, we introduce ChemAP (Chemical structure-based drug Approval Predictor), a novel deep learning scheme for drug approval prediction in the early-stage drug discovery phase. ChemAP aims to enhance the possibility of early-stage decision-making by enriching semantic knowledge to fill in the gap between multi-modal and single-modal chemical spaces through knowledge distillation techniques. This approach facilitates the effective construction of chemical space solely from chemical structure data, guided by multi-modal knowledge related to efficacy, such as clinical trials and patents of drugs. In this study, ChemAP achieved state-of-the-art performance, outperforming both traditional machine learning and deep learning models in drug approval prediction, with AUROC and AUPRC scores of 0.782 and 0.842 respectively on the drug approval benchmark dataset. Additionally, we demonstrated its generalizability by outperforming baseline models on a recent external dataset, which included drugs from the 2023 FDA-approved list and the 2024 clinical trial failure drug list, achieving AUROC and AUPRC scores of 0.694 and 0.851. These results demonstrate that ChemAP is an effective method in predicting drug approval only with chemical structure information of drug so that decision-making can be done at the early stages of drug development process. To the best of our knowledge, our work is the first of its kind to show that prediction of drug approval is possible only with structure information of drug by defining the chemical space of approved and unapproved drugs using deep learning technology.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Improving prognostic accuracy in lung transplantation using unique features of isolated human lung radiographs",
        "link": "https://www.nature.com/articles/s41746-024-01260-z",
        "publication_date": "03 Oct 2024",
        "abstract": "Ex vivo lung perfusion (EVLP) enables advanced assessment of human lungs for transplant suitability. We developed a convolutional neural network (CNN)-based approach to analyze the largest cohort of isolated lung radiographs to date. CNNs were trained to process 1300 longitudinal radiographs from n = 650 clinical EVLP cases. Latent features were transformed into principal components (PC) and correlated with known radiographic findings. PCs were combined with physiological data to classify clinical outcomes: (1) recipient time to extubation of <72 h, (2) ≥ 72 h, and (3) lungs unsuitable for transplantation. The top PC was significantly correlated with infiltration (Spearman R: 0·72, p < 0·0001), and adding radiographic PCs significantly improved the discrimination for clinical outcomes (Accuracy: 73 vs 78%, p = 0·014). CNN-derived radiographic lung features therefore add substantial value to the current assessments. This approach can be adopted by EVLP centers worldwide to harness radiographic information without requiring real-time radiological expertise.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting the severity of mycoplasma pneumoniae pneumonia in pediatric and adult patients: a multicenter study",
        "link": "https://www.nature.com/articles/s41598-024-74251-5",
        "publication_date": "03 Oct 2024",
        "abstract": "The purpose of this study is to develop a nomogram model for early prediction of the severe mycoplasma pneumoniae pneumonia (SMPP) in Pediatric and Adult Patients. A retrospective analysis was conducted on patients with MPP, classifying them into SMPP and non-severe MPP (NSMPP) groups. A total of 550 patients (NSMPP 374 and SMPP 176) were enrolled in the study and allocated to training, validation cohorts. 278 patients (NSMPP 224 and SMPP 54) were retrospectively collected from two institutions and allocated to testing cohort. The risk factors for SMPP were identified using univariate analysis. For radiomic feature selection, Spearman’s correlation and the least absolute shrinkage and selection operator (LASSO) were utilized. Logistic regression was used to build different models, including clinical, imaging, radiomics, and integrated models (combining clinical, imaging, and radiomics features selected). The model’s discrimination was evaluated using a receiver operating characteristic curve, its calibration with a calibration curve, and the results were visualized using the Hosmer–Lemeshow goodness-of-fit test. Thirteen clinical features and fourteen imaging features were selected for constructing the clinical and imaging models. Simultaneously, a set of twenty-five radiomics features were utilized to build the radiomics model. The integrated model demonstrated good calibration and discrimination in the training cohorts (AUC, 0.922; 95% CI: 0.900, 0.942), validation cohorts (AUC, 0.879; 95% CI: 0.806, 0.920), and testing cohorts (AUC, 0.877; 95% CI: 0.836, 0.916). The discriminatory and predictive efficacy of the clinical model in testing cohorts increased further after clinical and radiological features were incorporated (AUC, 0.849 vs. 0.922, P = 0.002). The model demonstrated exemplary predictive efficacy for SMPP by leveraging a comprehensive set of inputs, encompassing clinical data, quantitative and qualitative radiological features, along with radiomics features. The integration of these three aspects in the predictive model further enhanced the performance of the clinical model, indicating the potential for extensive clinical applications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Mechanisms of Berberine in anti-pancreatic ductal adenocarcinoma revealed by integrated multi-omics profiling",
        "link": "https://www.nature.com/articles/s41598-024-74943-y",
        "publication_date": "02 Oct 2024",
        "abstract": "This study integrates pharmacology databases with bulk RNA-seq and scRNA-seq to reveal the latent anti-PDAC capacities of BBR. Target genes of BBR were sifted through TargetNet, CTD, SwissTargetPrediction, and Binding Database. Based on the GSE183795 dataset, DEG analysis, GSEA, and WGCNA were sequentially run to build a disease network. Through sub-network filtration acquired PDAC-related hub genes. A PPI network was established using the shared genes. Degree algorithm from cytoHubba screened the key cluster in the network. Analysis of differential mRNA expression and ROC curves gauged the diagnostic performance of clustered genes. CYBERSORT uncovered the potential role of the key cluster on PDAC immunomodulation. ScRNA-seq analysis evaluated the distribution and expression profile of the key cluster at the single-cell level, assessing enrichment within annotated cell subpopulations to delineate the target distribution of BBR in PDAC. We identified 425 drug target genes and 771 disease target genes, using 57 intersecting genes to construct the PPI network. CytoHubba anchored the top 10 highest contributing genes to be the key cluster. mRNA expression levels and ROC curves confirmed that these genes showed good robustness for PDAC. CYBERSORT revealed that the key cluster influenced immune pathways predominantly associated with Macrophages M0, CD8 T cells, and naïve B cells. ScRNA-seq analysis clarified that BBR mainly acted on epithelial cells and macrophages in PDAC tissues. BBR potentially targets CDK1, CCNB1, CTNNB1, CDK2, TOP2A, MCM2, RUNX2, MYC, PLK1, and AURKA to exert therapeutic effects on PDAC. The mechanisms of action appear to significantly involve macrophage polarization-related immunological responses.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Brain tumor detection and classification in MRI using hybrid ViT and GRU model with explainable AI in Southern Bangladesh",
        "link": "https://www.nature.com/articles/s41598-024-71893-3",
        "publication_date": "01 Oct 2024",
        "abstract": "Brain tumor, a leading cause of uncontrolled cell growth in the central nervous system, presents substantial challenges in medical diagnosis and treatment. Early and accurate detection is essential for effective intervention. This study aims to enhance the detection and classification of brain tumors in Magnetic Resonance Imaging (MRI) scans using an innovative framework combining Vision Transformer (ViT) and Gated Recurrent Unit (GRU) models. We utilized primary MRI data from Bangabandhu Sheikh Mujib Medical College Hospital (BSMMCH) in Faridpur, Bangladesh. Our hybrid ViT-GRU model extracts essential features via ViT and identifies relationships between these features using GRU, addressing class imbalance and outperforming existing diagnostic methods. We extensively processed the dataset, and then trained the model using various optimizers (SGD, Adam, AdamW) and evaluated through rigorous 10-fold cross-validation. Additionally, we incorporated Explainable Artificial Intelligence (XAI) techniques-Attention Map, SHAP, and LIME-to enhance the interpretability of the model’s predictions. For the primary dataset BrTMHD-2023, the ViT-GRU model achieved precision, recall, and F1-score metrics of 97%. The highest accuracies obtained with SGD, Adam, and AdamW optimizers were 81.66%, 96.56%, and 98.97%, respectively. Our model outperformed existing Transfer Learning models by 1.26%, as validated through comparative analysis and cross-validation. The proposed model also shows excellent performances with another Brain Tumor Kaggle Dataset outperforming the existing research done on the same dataset with 96.08% accuracy. The proposed ViT-GRU framework significantly improves the detection and classification of brain tumors in MRI scans. The integration of XAI techniques enhances the model’s transparency and reliability, fostering trust among clinicians and facilitating clinical application. Future work will expand the dataset and apply findings to real-time diagnostic devices, advancing the field.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying who are unlikely to benefit from total knee arthroplasty using machine learning models",
        "link": "https://www.nature.com/articles/s41746-024-01265-8",
        "publication_date": "30 Sept 2024",
        "abstract": "Identifying and preventing patients who are not likely to benefit long-term from total knee arthroplasty (TKA) would decrease healthcare expenditure significantly. We trained machine learning (ML) models (image-only, clinical-data only, and multimodal) among 5720 knee OA patients to predict postoperative dissatisfaction at 2 years. Dissatisfaction was defined as not achieving a minimal clinically important difference in postoperative Knee Society knee and function scores (KSS), Short Form-36 Health Survey [SF-36, divided into a physical component score (PCS) and mental component score (MCS)], and Oxford Knee Score (OKS). Compared to image-only models, both clinical-data only and multimodal models achieved superior performance at predicting dissatisfaction measured by AUC, clinical-data only model: KSS 0.888 (0.866–0.909), SF-PCS 0.836 (0.812–0.860), SF-MCS 0.833 (0.812–0.854), and OKS 0.806 (0.753–0.859); multimodal model: KSS 0.891 (0.870–0.911), SF-PCS 0.832 (0.808–0.857), SF-MCS 0.835 (0.811–0.856), and OKS 0.816 (0.768–0.863). Our findings highlighted that ML models using clinical or multimodal data were capable to predict post-TKA dissatisfaction.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sex estimation using skull silhouette images from postmortem computed tomography by deep learning",
        "link": "https://www.nature.com/articles/s41598-024-74703-y",
        "publication_date": "30 Sept 2024",
        "abstract": "Prompt personal identification is required during disasters that can result in many casualties. To rapidly estimate sex based on skull structure, this study applied deep learning using two-dimensional silhouette images, obtained from head postmortem computed tomography (PMCT), to enhance the outline shape of the skull. We investigated the process of sex estimation using silhouette images viewed from different angles and majority votes. A total of 264 PMCT cases (132 cases for each sex) were used for transfer learning with two deep-learning models (AlexNet and VGG16). VGG16 exhibited the highest accuracy (89.8%) for lateral projections. The accuracy improved to 91.7% when implementing a majority vote based on the results of multiple projection angles. Moreover, silhouette images can be obtained from simple and popular X-ray imaging in addition to PMCT. Thus, this study demonstrated the feasibility of sex estimation by combining silhouette images with deep learning. The results implied that X-ray images can be used for personal identification.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Uncovering individualised treatment effects for educational trials",
        "link": "https://www.nature.com/articles/s41598-024-73714-z",
        "publication_date": "30 Sept 2024",
        "abstract": "Large-scale Randomised Controlled Trials (RCTs) are widely regarded as “the gold standard” for testing the causal effects of school-based interventions. RCTs typically present the statistical significance of the average treatment effect (ATE), which captures the effect an intervention has had on average for a given population. However, key decisions in child health and education are often about individuals who may be very different from those averages. One way to identify heterogeneous treatment effects across different individuals, not captured by the ATE, is to conduct subgroup analyses. For example, free school meal (FSM) pupils as required for projects funded by the Education Endowment Foundation (EEF) in England. These subgroup analyses, as we demonstrate in 48 EEF-funded RCTs involving over 200,000 students, are usually not standardised across studies and offer flexible degrees of freedom to researchers, potentially leading to mixed, if not misleading, results. Here, we develop and deploy an alternative to ATE and subgroup analysis, a machine-learning and regression-based framework to predict individualised treatment effects (ITEs). ITEs could show where an intervention worked, for which individuals, and to what extent. Our findings have implications for decision-makers in fields like education, healthcare, law, and clinical practices concerning children and adolescents.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Neoantigen immunogenicity landscapes and evolution of tumor ecosystems during immunotherapy with nivolumab",
        "link": "https://www.nature.com/articles/s41591-024-03240-y",
        "publication_date": "30 Sept 2024",
        "abstract": "Neoantigen immunoediting drives immune checkpoint blockade efficacy, yet the molecular features of neoantigens and how neoantigen immunogenicity shapes treatment response remain poorly understood. To address these questions, 80 patients with non-small cell lung cancer were enrolled in the biomarker cohort of CheckMate 153 (CA209-153), which collected radiographic guided biopsy samples before treatment and during treatment with nivolumab. Early loss of mutations and neoantigens during therapy are both associated with clinical benefit. We examined 1,453 candidate neoantigens, including many of which that had reduced cancer cell fraction after treatment with nivolumab, and identified 196 neopeptides that were recognized by T cells. Mapping these neoantigens to clonal dynamics, evolutionary trajectories and clinical response revealed a strong selection against immunogenic neoantigen-harboring clones. We identified position-specific amino acid and physiochemical features related to immunogenicity and developed an immunogenicity score. Nivolumab-induced microenvironmental evolution in non-small cell lung cancer shared some similarities with melanoma, yet critical differences were apparent. This study provides unprecedented molecular portraits of neoantigen landscapes underlying nivolumab’s mechanism of action.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Power and area efficient FIR filter using Radix- 2r multiplier for de-noise the electrooculography (EOG) signal",
        "link": "https://www.nature.com/articles/s41598-024-73514-5",
        "publication_date": "30 Sept 2024",
        "abstract": "This article introduces a novel FIR filter using a Radix-2r multiplier combined with 4:2 and 3:2 compressors for denoising Electrooculography (EOG) signals. This approach replaces traditional ripple-carry adders with compressors to add the partial products generated by the Radix-2r multiplier, resulting in reduced delay and energy consumption. The FIR filter is implemented in gate-level Verilog HDL, verified using ModelSim and Altera DSP Builder, and synthesized with the Cadence RTL compiler. Compared to conventional designs, the proposed filter achieves a 71.48% reduction in area, 73.28% reduction in power, 51.84% reduction in delay, 86.22% reduction in the area-delay product (ADP), and 92.38% reduction in energy-per-operation (EPS), significantly outperforming the SOPOT filter.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Variability of thermal subthreshold retinal laser treatment plans",
        "link": "https://www.nature.com/articles/s41598-024-73763-4",
        "publication_date": "30 Sept 2024",
        "abstract": "To investigate the variability in subthreshold laser treatment plans for patients with diabetic macular edema or central serous chorioretinopathy. Diagnostic images from 20 patients were utilized, and 25 retina specialists generated subthreshold treatment plans along with a self-rated experience level. Evaluation comprised of i) Area Variability (AV): quantifies the consensus regarding the covered area and is the difference between the areas planned by 75% and 25% of the participants ii) mean Centroid Distance (CD): level of agreement on the localization of a treatment. Subgroup analysis investigated the impact of participants’ experience levels, utilizing the Mann-Whitney-Wilcoxon test. The predominant plan style is a targeted treatment approach (92%) and avoidance of subfoveal region (89%). Mean CD is 71.0 ± 37.5 pixels (≈half disc diameter) and mean AV is 9.8%±8.9%. A slight difference is observed between the 50-75% areas, but a notable distinction exists between the 25-50% areas. Subgroup analysis revealed CD and AV value of 75.9 pixels and 24% in the lower experience level group as opposed to 55.9 pixels and 8.6% in the higher experience level group. There is significant variability in treatment planning which reduces with increased experience of retina specialists. While consensus is observed around focal points, differences in the surrounding extents persist.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Air pollution below US regulatory standards and cardiovascular diseases using a double negative control approach",
        "link": "https://www.nature.com/articles/s41467-024-52117-8",
        "publication_date": "30 Sept 2024",
        "abstract": "Growing evidence suggests that long-term air pollution exposure is a risk factor for cardiovascular mortality and morbidity. However, few studies have investigated air pollution below current regulatory limits, and causal evidence is limited. We use a double negative control approach to examine the association between long-term exposure to air pollution at low concentration and cardiovascular hospitalizations among US Medicare beneficiaries aged ≥65 years between 2000 and 2016. The expected values of the negative outcome control (preceding-year hospitalizations) regressed on exposure and negative exposure control (subsequent-year exposure) are treated as a surrogate for omitted confounders. With analyses separately restricted to low-pollution areas (PM2.5 < 9 μg/m³, NO2 < 75.2 µg/m3 [40 ppb], warm-season O3 < 88.2 μg/m3 [45 ppb]), we observed positive associations of the three pollutants with hospitalization rates of stroke, heart failure, and atrial fibrillation and flutter. The associations generally persisted in demographic subgroups. Stricter national air quality standards should be considered.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparison of NLP machine learning models with human physicians for ASA Physical Status classification",
        "link": "https://www.nature.com/articles/s41746-024-01259-6",
        "publication_date": "28 Sept 2024",
        "abstract": "The American Society of Anesthesiologist’s Physical Status (ASA-PS) classification system assesses comorbidities before sedation and analgesia, but inconsistencies among raters have hindered its objective use. This study aimed to develop natural language processing (NLP) models to classify ASA-PS using pre-anesthesia evaluation summaries, comparing their performance to human physicians. Data from 717,389 surgical cases in a tertiary hospital (October 2004–May 2023) was split into training, tuning, and test datasets. Board-certified anesthesiologists created reference labels for tuning and test datasets. The NLP models, including ClinicalBigBird, BioClinicalBERT, and Generative Pretrained Transformer 4, were validated against anesthesiologists. The ClinicalBigBird model achieved an area under the receiver operating characteristic curve of 0.915. It outperformed board-certified anesthesiologists with a specificity of 0.901 vs. 0.897, precision of 0.732 vs. 0.715, and F1-score of 0.716 vs. 0.713 (all p <0.01). This approach will facilitate automatic and objective ASA-PS classification, thereby streamlining the clinical workflow.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Combining 2.5D deep learning and conventional features in a joint model for the early detection of sICH expansion",
        "link": "https://www.nature.com/articles/s41598-024-73415-7",
        "publication_date": "28 Sept 2024",
        "abstract": "The study aims to investigate the potential of training efficient deep learning models by using 2.5D (2.5-Dimension) masks of sICH. Furthermore, it intends to evaluate and compare the predictive performance of a joint model incorporating four types of features with standalone 2.5D deep learning, radiomics, radiology, and clinical models for early expansion in sICH. A total of 254 sICH patients were enrolled retrospectively and divided into two groups according to whether the hematoma was enlarged or not. The 2.5D mask of sICH is constructed with the maximum axial, coronal and sagittal planes of the hematoma, which is used to train the deep learning model and extract deep learning features. Predictive models were built on clinic, radiology, radiomics and deep learning features separately and four type features jointly. The diagnostic performance of each model was measured using the receiver operating characteristic curve (AUC), Accuracy, Recall, F1 and decision curve analysis (DCA). The AUCs of the clinic model, radiology model, radiomics model, deep learning model, joint model, and nomogram model on the train set (training and Cross-validation) were 0.639, 0.682, 0.859, 0.807, 0.939, and 0.942, respectively, while the AUCs on the test set (external validation) were 0.680, 0.758, 0.802, 0.857, 0.929, and 0.926. Decision curve analysis showed that the joint model was superior to the other models and demonstrated good consistency between the predicted probability of early hematoma expansion and the actual occurrence probability. Our study demonstrates that the joint model is a more efficient and robust prediction model, as verified by multicenter data. This finding highlights the potential clinical utility of a multifactorial prediction model that integrates various data sources for prognostication in patients with intracerebral hemorrhage. The Critical Relevance Statement: Combining 2.5D deep learning features with clinic features, radiology markers, and radiomics signatures to establish a joint model enabling physicians to conduct better-individualized assessments the risk of early expansion of sICH.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A framework for human evaluation of large language models in healthcare derived from literature review",
        "link": "https://www.nature.com/articles/s41746-024-01258-7",
        "publication_date": "28 Sept 2024",
        "abstract": "With generative artificial intelligence (GenAI), particularly large language models (LLMs), continuing to make inroads in healthcare, assessing LLMs with human evaluations is essential to assuring safety and effectiveness. This study reviews existing literature on human evaluation methodologies for LLMs in healthcare across various medical specialties and addresses factors such as evaluation dimensions, sample types and sizes, selection, and recruitment of evaluators, frameworks and metrics, evaluation process, and statistical analysis type. Our literature review of 142 studies shows gaps in reliability, generalizability, and applicability of current human evaluation practices. To overcome such significant obstacles to healthcare LLM developments and deployments, we propose QUEST, a comprehensive and practical framework for human evaluation of LLMs covering three phases of workflow: Planning, Implementation and Adjudication, and Scoring and Review. QUEST is designed with five proposed evaluation principles: Quality of Information, Understanding and Reasoning, Expression Style and Persona, Safety and Harm, and Trust and Confidence.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparative study of machine learning and statistical survival models for enhancing cervical cancer prognosis and risk factor assessment using SEER data",
        "link": "https://www.nature.com/articles/s41598-024-72790-5",
        "publication_date": "27 Sept 2024",
        "abstract": "Cervical cancer is a common malignant tumor of the female reproductive system and the leading cause of death among women worldwide. The survival prediction method can be used to effectively analyze the time to event, which is essential in any clinical study. This study aims to bridge the gap between traditional statistical methods and machine learning in survival analysis by revealing which techniques are most effective in predicting survival, with a particular emphasis on improving prediction accuracy and identifying key risk factors for cervical cancer. Women with cervical cancer diagnosed between 2013 and 2015 were included in our study using data from the Surveillance, Epidemiology, and End Results (SEER) database. Using this dataset, the study assesses the performance of Weibull, Cox proportional hazards models, and Random Survival Forests in terms of predictive accuracy and risk factor identification. The findings reveal that machine learning models, particularly Random Survival Forests (RSF), outperform traditional statistical methods in both predictive accuracy and the discernment of crucial prognostic factors, underscoring the advantages of machine learning in handling complex survival data. However, for a survival dataset with a small number of predictors, statistical models should be used first. The study finds that RSF models enhance survival analysis with more accurate predictions and insights into survival risk factors but highlights the need for larger datasets and further research on model interpretability and clinical applicability.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of immune patterns in idiopathic pulmonary fibrosis patients driven by PLA2G7-positive macrophages using an integrated machine learning survival framework",
        "link": "https://www.nature.com/articles/s41598-024-73625-z",
        "publication_date": "27 Sept 2024",
        "abstract": "Patients with advanced idiopathic pulmonary fibrosis (IPF), a complex and incurable lung disease with an elusive pathology, are nearly exclusive candidates for lung transplantation. Improved identification of patient subtypes can enhance early diagnosis and intervention, ultimately leading to better prognostic outcomes for patients. The goal of this study is to identify new immune patterns and biomarkers in patients. Immune subtypes in IPF patients were identified using single-sample gene set enrichment analysis, and immune subtype-related genes were explored using the weighted correlation network analysis algorithm. A machine learning integration framework was used to establish the optimal prognostic model, known as the immune-related risk score (IRS). Single-cell sequencing was conducted to investigate the major role of macrophage-derived PLA2G7 in the immune microenvironment. We assessed the stability of celecoxib in targeting PLA2G7 through molecular docking and surface plasmon resonance. IPF patients present two distinct immune subtypes, one characterized by immune activation and inflammation, and the other by immune suppression. IRS can predict the immune status and prognosis of IPF patients. Furthermore, multi-cohort analysis and single-cell sequencing analysis demonstrated the diagnostic and prognostic value of PLA2G7 derived from macrophages and its role in shaping the inflammatory immune microenvironment in IPF patients. Celecoxib could effectively and stably bind with PLA2G7. PLA2G7, as identified through IRS, demonstrates marked stability in diagnosing and predicting the prognosis of IPF patients as well as predicting their immune status. It can serve as a novel biomarker for IPF patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Detection of cardiovascular disease cases using advanced tree-based machine learning algorithms",
        "link": "https://www.nature.com/articles/s41598-024-72819-9",
        "publication_date": "27 Sept 2024",
        "abstract": "Cardiovascular disease (CVD) can often lead to serious consequences such as death or disability. This study aims to identify a tree-based machine learning method with the best performance criteria for the detection of CVD. This study analyzed data collected from 9,499 participants, with a focus on 38 different variables. The target variable was the presence of cardiovascular disease (CVD) and the villages were considered as the cluster variable. The standard tree, random forest, Generalized Linear Mixed Model tree (GLMM tree), and Generalized Mixed Effect random forest (GMERF) were fitted to the data and the estimated prediction power indices were compared to identify the best approach. According to the analysis of important variables in all models, five variables (age, LDL, history of cardiac disease in first-degree relatives, physical activity level, and presence of hypertension) were identified as the most influential in predicting CVD. Fitting the decision tree, random forest, GLMM tree, and GMERF, respectively, resulted in an area under the ROC curve of 0.56, 0.73, 0.78, and 0.80. The GMERF model demonstrated the best predictive performance among the fitted models based on evaluation criteria. Regarding the clustered structure of the data, using relevant machine-learning approaches that account for this clustering may result in more accurate predicting indices and targeted prevention frameworks.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive modeling of arginine vasopressin deficiency after transsphenoidal pituitary adenoma resection by using multiple machine learning algorithms",
        "link": "https://www.nature.com/articles/s41598-024-72486-w",
        "publication_date": "27 Sept 2024",
        "abstract": "This study aimed to predict arginine vasopressin deficiency (AVP-D) following transsphenoidal pituitary adenoma surgery using machine learning algorithms. We reviewed 452 cases from December 2013 to December 2023, analyzing clinical and imaging data. Key predictors of AVP-D included sex, tumor height, preoperative and postoperative changes in sellar diaphragm height and pituitary stalk length, preoperative ACTH levels, changes in ACTH levels, and preoperative cortisol levels. Six machine learning algorithms were tested: logistic regression (LR), support vector classification (SVC), random forest (RF), decision tree (DT), k-nearest neighbors (KNN), and extreme gradient boosting (XGBoost). After cross-validation and parameter optimization, the random forest model demonstrated the highest performance, with an accuracy (ACC) of 0.882 and an AUC of 0.96. The decision tree model followed, achieving an accuracy of 0.843 and an AUC of 0.95. Other models showed lower performance: LR had an ACC of 0.522 and an AUC of 0.54; SVC had an ACC of 0.647 and an AUC of 0.67; KNN achieved an ACC of 0.64 and an AUC of 0.70; and XGBoost had an ACC of 0.794 and an AUC of 0.91. The study found that a shorter preoperative pituitary stalk length, significant intraoperative stretching, and lower preoperative ACTH and cortisol levels were associated with a higher likelihood of developing AVP-D post-surgery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A novel hybrid deep learning IChOA-CNN-LSTM model for modality-enriched and multilingual emotion recognition in social media",
        "link": "https://www.nature.com/articles/s41598-024-73452-2",
        "publication_date": "27 Sept 2024",
        "abstract": "In the rapidly evolving field of artificial intelligence, the importance of multimodal sentiment analysis has never been more evident, especially amid the ongoing COVID-19 pandemic. Our research addresses the critical need to understand public sentiment across various dimensions of this crisis by integrating data from multiple modalities, such as text, images, audio, and videos sourced from platforms like Twitter. Conventional methods, which primarily focus on text analysis, often fall short in capturing the nuanced intricacies of emotional states, necessitating a more comprehensive approach. To tackle this challenge, our proposed framework introduces a novel hybrid model, IChOA-CNN-LSTM, which leverages Convolutional Neural Networks (CNNs) for precise image feature extraction, Long Short-Term Memory (LSTM) networks for sequential data analysis, and an Improved Chimp Optimization Algorithm for effective feature fusion. Remarkably, our model achieves an impressive accuracy rate of 97.8%, outperforming existing approaches in the field. Additionally, by integrating the GeoCoV19 dataset, we facilitate a comprehensive analysis that spans linguistic and geographical boundaries, enriching our understanding of global pandemic discourse and providing critical insights for informed decision-making in public health crises. Through this holistic approach and innovative techniques, our research significantly advances multimodal sentiment analysis, offering a robust framework for deciphering the complex interplay of emotions during unprecedented global challenges like the COVID-19 pandemic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Generalizability assessment of AI models across hospitals in a low-middle and high income country",
        "link": "https://www.nature.com/articles/s41467-024-52618-6",
        "publication_date": "27 Sept 2024",
        "abstract": "The integration of artificial intelligence (AI) into healthcare systems within low-middle income countries (LMICs) has emerged as a central focus for various initiatives aiming to improve healthcare access and delivery quality. In contrast to high-income countries (HICs), which often possess the resources and infrastructure to adopt innovative healthcare technologies, LMICs confront resource limitations such as insufficient funding, outdated infrastructure, limited digital data, and a shortage of technical expertise. Consequently, many algorithms initially trained on data from non-LMIC settings are now being employed in LMIC contexts. However, the effectiveness of these systems in LMICs can be compromised when the unique local contexts and requirements are not adequately considered. In this study, we evaluate the feasibility of utilizing models developed in the United Kingdom (a HIC) within hospitals in Vietnam (a LMIC). Consequently, we present and discuss practical methodologies aimed at improving model performance, emphasizing the critical importance of tailoring solutions to the distinct healthcare systems found in LMICs. Our findings emphasize the necessity for collaborative initiatives and solutions that are sensitive to the local context in order to effectively tackle the healthcare challenges that are unique to these regions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Explainability of CNN-based Alzheimer’s disease detection from online handwriting",
        "link": "https://www.nature.com/articles/s41598-024-72650-2",
        "publication_date": "27 Sept 2024",
        "abstract": "With over 55 million people globally affected by dementia and nearly 10 million new cases reported annually, Alzheimer’s disease is a prevalent and challenging neurodegenerative disorder. Despite significant advancements in machine learning techniques for Alzheimer’s disease detection, the widespread adoption of deep learning models raises concerns about their explainability. The lack of explainability in deep learning models for online handwriting analysis is a critical gap in the literature in the context of Alzheimer’s disease detection. This paper addresses this challenge by interpreting predictions from a Convolutional Neural Network applied to multivariate time series data, generated by online handwriting data associated with continuous loop series handwritten on a graphical tablet. Our explainability methods reveal distinct motor behavior characteristics for healthy individuals and those diagnosed with Alzheimer’s. Healthy subjects exhibited consistent, smooth movements, while Alzheimer’s patients demonstrated erratic patterns marked by abrupt stops and direction changes. This emphasizes the critical role of explainability in translating complex models into clinically relevant insights. Our research contributes to the enhancement of early diagnosis, providing significant and reliable insights to stakeholders involved in patient care and intervention strategies. Our work bridges the gap between machine learning predictions and clinical insights, fostering a more effective and understandable application of advanced models for Alzheimer’s disease assessment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "High-resolution AI image dataset for diagnosing oral submucous fibrosis and squamous cell carcinoma",
        "link": "https://www.nature.com/articles/s41597-024-03836-6",
        "publication_date": "27 Sept 2024",
        "abstract": "Oral cancer is a global health challenge with a difficult histopathological diagnosis. The accurate histopathological interpretation of oral cancer tissue samples remains difficult. However, early diagnosis is very challenging due to a lack of experienced pathologists and inter- observer variability in diagnosis. The application of artificial intelligence (deep learning algorithms) for oral cancer histology images is very promising for rapid diagnosis. However, it requires a quality annotated dataset to build AI models. We present ORCHID (ORal Cancer Histology Image Database), a specialized database generated to advance research in AI-based histology image analytics of oral cancer and precancer. The ORCHID database is an extensive multicenter collection of high-resolution images captured at 1000X effective magnification (100X objective lens), encapsulating various oral cancer and precancer categories, such as oral submucous fibrosis (OSMF) and oral squamous cell carcinoma (OSCC). Additionally, it also contains grade-level sub-classifications for OSCC, such as well- differentiated (WD), moderately-differentiated (MD), and poorly-differentiated (PD). The database seeks to aid in developing innovative artificial intelligence-based rapid diagnostics for OSMF and OSCC, along with subtypes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Proteomic signatures of healthy dietary patterns are associated with lower risks of major chronic diseases and mortality",
        "link": "https://www.nature.com/articles/s43016-024-01059-x",
        "publication_date": "27 Sept 2024",
        "abstract": "Healthy dietary patterns have been linked to a decreased risk of chronic diseases. However, it remains uncertain whether proteomic signatures can reflect proteome response to healthy diet patterns, and whether these proteomic signatures are associated with health outcomes. Using data from the UK Biobank including Olink plasma proteins, we identified substantial proteomic variation in relation to adherence to eight healthy dietary patterns. The proteomic signatures, reflecting adherence and proteome response to healthy dietary patterns, were prospectively associated with lower risks of diabetes, cardiovascular diseases, chronic respiratory diseases, chronic kidney diseases and cancers, along with longer life expectancy, even after adjusting for corresponding dietary patterns. These findings suggest proteomic signatures have the potential to complement traditional dietary assessments and deepen our understanding of the relationships between dietary patterns and chronic diseases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Mapping biological influences on the human plasma proteome beyond the genome",
        "link": "https://www.nature.com/articles/s42255-024-01133-5",
        "publication_date": "26 Sept 2024",
        "abstract": "Broad-capture proteomic platforms now enable simultaneous assessment of thousands of plasma proteins, but most of these are not actively secreted and their origins are largely unknown. Here we integrate genomic with deep phenomic information to identify modifiable and non-modifiable factors associated with 4,775 plasma proteins in ~8,000 mostly healthy individuals. We create a data-driven map of biological influences on the human plasma proteome and demonstrate segregation of proteins into clusters based on major explanatory factors. For over a third (N = 1,575) of protein targets, joint genetic and non-genetic factors explain 10–77% of the variation in plasma (median 19.88%, interquartile range 14.01–31.09%), independent of technical factors (median 2.48%, interquartile range 0.78–6.41%). Together with genetically anchored causal inference methods, our map highlights potential causal associations between modifiable risk factors and plasma proteins for hundreds of protein–disease associations, for example, COL6A3, which possibly mediates the association between reduced kidney function and cardiovascular disease. We provide a map of biological and technical influences on the human plasma proteome to help contextualize findings from proteomic studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A foundation model for clinician-centered drug repurposing",
        "link": "https://www.nature.com/articles/s41591-024-03233-x",
        "publication_date": "25 Sept 2024",
        "abstract": "Drug repurposing—identifying new therapeutic uses for approved drugs—is often a serendipitous and opportunistic endeavour to expand the use of drugs for new diseases. The clinical utility of drug-repurposing artificial intelligence (AI) models remains limited because these models focus narrowly on diseases for which some drugs already exist. Here we introduce TxGNN, a graph foundation model for zero-shot drug repurposing, identifying therapeutic candidates even for diseases with limited treatment options or no existing drugs. Trained on a medical knowledge graph, TxGNN uses a graph neural network and metric learning module to rank drugs as potential indications and contraindications for 17,080 diseases. When benchmarked against 8 methods, TxGNN improves prediction accuracy for indications by 49.2% and contraindications by 35.1% under stringent zero-shot evaluation. To facilitate model interpretation, TxGNN’s Explainer module offers transparent insights into multi-hop medical knowledge paths that form TxGNN’s predictive rationales. Human evaluation of TxGNN’s Explainer showed that TxGNN’s predictions and explanations perform encouragingly on multiple axes of performance beyond accuracy. Many of TxGNN’s new predictions align well with off-label prescriptions that clinicians previously made in a large healthcare system. TxGNN’s drug-repurposing predictions are accurate, consistent with off-label drug use, and can be investigated by human experts through multi-hop interpretable rationales.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Accuracy assessment of artificial intelligence IOL calculation formulae: utilizing the heteroscedastic statistics and the Eyetemis Analysis Tool",
        "link": "https://www.nature.com/articles/s41433-024-03365-x",
        "publication_date": "25 Sept 2024",
        "abstract": "To analyse the accuracy of artificial intelligence (AI)-driven intraocular (IOL) calculation formulae, together with established formulae using the heteroscedastic methodology and the Eyetemis Analysis Tool.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Addressing challenges in speaker anonymization to maintain utility while ensuring privacy of pathological speech",
        "link": "https://www.nature.com/articles/s43856-024-00609-5",
        "publication_date": "25 Sept 2024",
        "abstract": "Integration of speech into healthcare has intensified privacy concerns due to its potential as a non-invasive biomarker containing individual biometric information. In response, speaker anonymization aims to conceal personally identifiable information while retaining crucial linguistic content. However, the application of anonymization techniques to pathological speech, a critical area where privacy is especially vital, has not been extensively examined.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "membership inference",
                "data reconstruction"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Probabilistic inference of epigenetic age acceleration from cellular dynamics",
        "link": "https://www.nature.com/articles/s43587-024-00700-5",
        "publication_date": "23 Sept 2024",
        "abstract": "The emergence of epigenetic predictors was a pivotal moment in geroscience, propelling the measurement and concept of biological aging into a quantitative era; however, while current epigenetic clocks show strong predictive power, they are data-driven in nature and are not based on the underlying biological mechanisms driving methylation dynamics. We show that predictions of these clocks are susceptible to several confounding non-age-related phenomena that make interpretation of these estimates and associations difficult. To address these limitations, we developed a probabilistic model describing methylation transitions at the cellular level. Our approach reveals two measurable components, acceleration and bias, which directly reflect perturbations of the underlying cellular dynamics. Acceleration is the proportional increase in the speed of methylation transitions across CpG sites, whereas bias corresponds to global changes in methylation levels. Using data from 15,900 participants from the Generation Scotland study, we develop a robust inference framework and show that these are two distinct processes confounding current epigenetic predictors. Our results show improved associations of acceleration and bias with physiological traits known to impact healthy aging, such as smoking and alcohol consumption, respectively. Furthermore, a genome-wide association study of epigenetic age acceleration identified seven genomic loci.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of preterm birth in multiparous women using logistic regression and machine learning approaches",
        "link": "https://www.nature.com/articles/s41598-024-60097-4",
        "publication_date": "20 Sept 2024",
        "abstract": "To predict preterm birth (PTB) in multiparous women, comparing machine learning approaches with traditional logistic regression. A population-based cohort study was conducted using data from the Ontario Better Outcomes Registry and Network (BORN). The cohort included all multiparous women who delivered a singleton birth at 20–42 weeks’ gestation in an Ontario hospital between April 1, 2012 and March 31, 2014. The primary outcome was PTB < 37 weeks, with spontaneous PTB analyzed as a secondary outcome. Stepwise logistic regression and the Boruta machine learning were used to select the important variables during the first and second trimester. For building prediction models, the whole data set were divided for the two independent parts: two-third for training the classifiers (Logistic regression, random forests, decision trees, and artificial neural networks) and one-third for model validation. Then, the training data set were balanced by random over sampling technique. The best hyper parameters were obtained by the tenfold cross validation. The performance of all models was evaluated by sensitivity, specificity, positive predictive value, negative predictive value, and the area under the receiver operating characteristics (AUC). The cohort included 145,846 births, of which 8125 (5.57%) were preterm. In first-trimester models, the strongest predictors of PTB were previous PTB, preexisting diabetes, and abnormal pregnancy‐associated plasma protein-A. In the testing data set, the highest predictive ability was seen for artificial neural networks, with an area under the receiver operating characteristic curve (AUC) of 68.8% (95% CI 67.6–70.1%). In second-trimester models, addition of infant sex, attendance at first-trimester appointment, medication exposure, and abnormal alpha-fetoprotein concentrations increased the AUC to 72.1% (95% CI 71.1–73.1%) with logistic regression. With the inclusion of the variable complications during pregnancy, the AUC increased to 80.5% (95% CI 79.6–81.5%) using logistic regression. For both overall and spontaneous PTB, during both the first and second trimesters, models yielded negative predictive values of 97%. Overall, machine learning and logistic regression produced similar performance for prediction of PTB. For overall and spontaneous PTB, both first- and second-trimester models provided negative predictive values of ~ 97%, higher than that of fetal fibronectin.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "High-throughput identification of repurposable neuroactive drugs with potent anti-glioblastoma activity",
        "link": "https://www.nature.com/articles/s41591-024-03224-y",
        "publication_date": "20 Sept 2024",
        "abstract": "Glioblastoma, the most aggressive primary brain cancer, has a dismal prognosis, yet systemic treatment is limited to DNA-alkylating chemotherapies. New therapeutic strategies may emerge from exploring neurodevelopmental and neurophysiological vulnerabilities of glioblastoma. To this end, we systematically screened repurposable neuroactive drugs in glioblastoma patient surgery material using a clinically concordant and single-cell resolved platform. Profiling more than 2,500 ex vivo drug responses across 27 patients and 132 drugs identified class-diverse neuroactive drugs with potent anti-glioblastoma efficacy that were validated across model systems. Interpretable molecular machine learning of drug–target networks revealed neuroactive convergence on AP-1/BTG-driven glioblastoma suppression, enabling expanded in silico screening of more than 1 million compounds with high patient validation accuracy. Deep multimodal profiling confirmed Ca2+-driven AP-1/BTG-pathway induction as a neuro-oncological glioblastoma vulnerability, epitomized by the anti-depressant vortioxetine synergizing with current standard-of-care chemotherapies in vivo. These findings establish an actionable framework for glioblastoma treatment rooted in its neural etiology.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multi-output prediction of dose–response curves enables drug repositioning and biomarker discovery",
        "link": "https://www.nature.com/articles/s41698-024-00691-x",
        "publication_date": "20 Sept 2024",
        "abstract": "Drug response prediction is hampered by uncertainty in the measures of response and selection of doses. In this study, we propose a probabilistic multi-output model to simultaneously predict all dose–responses and uncover their biomarkers. By describing the relationship between genomic features and chemical properties to every response at every dose, our multi-output Gaussian Process (MOGP) models enable assessment of drug efficacy using any dose–response metric. This approach was tested across two drug screening studies and ten cancer types. Kullback-leibler divergence measured the importance of each feature and identified EZH2 gene as a novel biomarker of BRAF inhibitor response. We demonstrate the effectiveness of our MOGP models in accurately predicting dose–responses in different cancer types and when there is a limited number of drug screening experiments for training. Our findings highlight the potential of MOGP models in enhancing drug development pipelines by reducing data requirements and improving precision in dose–response predictions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Intelligent cardiovascular disease diagnosis using deep learning enhanced neural network with ant colony optimization",
        "link": "https://www.nature.com/articles/s41598-024-71932-z",
        "publication_date": "18 Sept 2024",
        "abstract": "To identify patterns in big medical datasets and use Deep Learning and Machine Learning (ML) to reliably diagnose Cardio Vascular Disease (CVD), researchers are currently delving deeply into these fields. Training on large datasets and producing highly accurate validation results is exceedingly difficult. Furthermore, early and precise diagnosis is necessary due to the increased global prevalence of cardiovascular disease (CVD). However, the increasing complexity of healthcare datasets makes it challenging to detect feature connections and produce precise predictions. To address these issues, the Intelligent Cardiovascular Disease Diagnosis based on Ant Colony Optimisation with Enhanced Deep Learning (ICVD-ACOEDL) model was developed. This model employs feature selection (FS) and hyperparameter optimization to diagnose CVD. Applying a min–max scaler, medical data is first consistently prepared. The key feature that sets ICVD-ACOEDL apart is the use of Ant Colony Optimisation (ACO) to select an optimal feature subset, which in turn helps to upgrade the performance of the ensuring deep learning enhanced neural network (DLENN) classifier. The model reforms the hyperparameters of DLENN for CVD classification using Bayesian optimization. Comprehensive evaluations on benchmark medical datasets show that ICVD-ACOEDL exceeds existing techniques, indicating that it could have a significant impact on CVD diagnosis. The model furnishes a workable way to increase CVD classification efficiency and accuracy in real-world medical situations by incorporating ACO for feature selection, min–max scaling for data pre-processing, and Bayesian optimization for hyperparameter tweaking.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of early clinical response to neoadjuvant chemotherapy in Triple-negative breast cancer: Incorporating Radiomics through breast MRI",
        "link": "https://www.nature.com/articles/s41598-024-72581-y",
        "publication_date": "17 Sept 2024",
        "abstract": "This study assessed pretreatment breast MRI coupled with machine learning for predicting early clinical responses to neoadjuvant chemotherapy (NAC) in triple-negative breast cancer (TNBC), focusing on identifying non-responders. A retrospective analysis of 135 TNBC patients (107 responders, 28 non-responders) treated with NAC from January 2015 to October 2022 was conducted. Non-responders were defined according to RECIST guidelines. Data included clinicopathologic factors and clinical MRI findings, with radiomics features from contrast-enhanced T1-weighted images, to train a stacking ensemble of 13 machine learning models. For subgroup analysis, propensity score matching was conducted to adjust for clinical disparities in NAC response. The efficacy of the models was evaluated using the area under the receiver-operating-characteristic curve (AUROC) before and after matching. The model combining clinicopathologic factors and clinical MRI findings achieved an AUROC of 0.752 (95% CI 0.644–0.860) for predicting non-responders, while radiomics-based models showed 0.749 (95% CI 0.614–0.884). An integrated model of radiomics, clinicopathologic factors, and clinical MRI findings reached an AUROC of 0.802 (95% CI 0.699–0.905). After propensity score matching, the hierarchical order of key radiomics features remained consistent. Our study demonstrated the potential of using machine learning models based on pretreatment MRI to non-invasively predict TNBC non-responders to NAC.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Longitudinal deep neural networks for assessing metastatic brain cancer on a large open benchmark",
        "link": "https://www.nature.com/articles/s41467-024-52414-2",
        "publication_date": "17 Sept 2024",
        "abstract": "The detection and tracking of metastatic cancer over the lifetime of a patient remains a major challenge in clinical trials and real-world care. Advances in deep learning combined with massive datasets may enable the development of tools that can address this challenge. We present NYUMets-Brain, the world’s largest, longitudinal, real-world dataset of cancer consisting of the imaging, clinical follow-up, and medical management of 1,429 patients. Using this dataset we developed Segmentation-Through-Time, a deep neural network which explicitly utilizes the longitudinal structure of the data and obtained state-of-the-art results at small (<10 mm3) metastases detection and segmentation. We also demonstrate that the monthly rate of change of brain metastases over time are strongly predictive of overall survival (HR 1.27, 95%CI 1.18-1.38). We are releasing the dataset, codebase, and model weights for other cancer researchers to build upon these results and to serve as a public benchmark.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Variational Bayes machine learning for risk adjustment of general outcome indicators with examples in urology",
        "link": "https://www.nature.com/articles/s41746-024-01244-z",
        "publication_date": "14 Sept 2024",
        "abstract": "Risk adjustment is often necessary for outcome quality indicators (QIs) to provide fair and accurate feedback to healthcare professionals. However, traditional risk adjustment models are generally oversimplified and not equipped to disentangle complex factors influencing outcomes that are out of a healthcare professional’s control. We present VIRGO, a novel variational Bayes model trained on routinely collected, large administrative datasets to risk-adjust outcome QIs. VIRGO uses detailed demographics, diagnosis, and procedure codes to provide individualized risk adjustment and explanations on patient factors affecting outcomes. VIRGO achieves state-of-the-art on external datasets and features capabilities of uncertainty expression, explainable features, and counterfactual analysis capabilities. VIRGO facilitates risk adjustment by explaining how patient factors led to adverse outcomes and expresses the uncertainty of each prediction, allowing healthcare professionals to not only explore patient factors with unexplained variance that are associated with worse outcomes but also reflect on the quality of their clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Body mass index changes and their association with SARS-CoV-2 infection: a real-world analysis",
        "link": "https://www.nature.com/articles/s41366-024-01628-x",
        "publication_date": "14 Sept 2024",
        "abstract": "To study body mass index (BMI) changes among individuals aged 18–99 years with and without SARS-CoV-2 infection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Engagement analysis of a persuasive-design-optimized eHealth intervention through machine learning",
        "link": "https://www.nature.com/articles/s41598-024-72162-z",
        "publication_date": "13 Sept 2024",
        "abstract": "The challenge of sustaining user engagement in eHealth interventions is a pressing issue with significant implications for the effectiveness of these digital health tools. This study investigates user engagement in a cognitive-behavioral therapy-based eHealth intervention for procrastination, using a dataset from a randomized controlled trial of 233 university students. Various machine learning models, including Decision Tree, Gradient Boosting, Logistic Regression, Random Forest, and Support Vector Machines, were employed to predict patterns of user engagement. The study adopted a two-phase analytical approach. In the first phase, all features of the dataset were included, revealing ‘total_minutes’—the total time participants spent on the intervention and the eHealth platform—as the most significant predictor of engagement. This finding emphasizes the intuitive notion that early time spent on the platform and the intervention is a strong indicator of later user engagement. However, to gain a deeper understanding of engagement beyond this predominant metric, the second phase of the analysis excluded ‘total_minutes’. This approach allowed for the exploration of the roles and interdependencies of other engagement indicators, such as ‘number_intervention_answersheets’—the number of completed lessons, ‘logins_first_4_weeks’—login frequency, and ‘number_diary_answersheets’—the number of completed diaries. The results from this phase highlighted the multifaceted nature of engagement, showing that while ‘total_minutes’ is strongly correlated with engagement, indicating that more engaged participants tend to spend more time on the intervention, the comprehensive engagement profile also depends on additional aspects like lesson completions and frequency of platform interactions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Text mining method to unravel long COVID’s clinical condition in hospitalized patients",
        "link": "https://www.nature.com/articles/s41419-024-07043-4",
        "publication_date": "13 Sept 2024",
        "abstract": "Long COVID is characterized by persistent that extends symptoms beyond established timeframes. Its varied presentation across different populations and healthcare systems poses significant challenges in understanding its clinical manifestations and implications. In this study, we present a novel application of text mining technique to automatically extract unstructured data from a long COVID survey conducted at a prominent university hospital in São Paulo, Brazil. Our phonetic text clustering (PTC) method enables the exploration of unstructured Electronic Healthcare Records (EHR) data to unify different written forms of similar terms into a single phonemic representation. We used n-gram text analysis to detect compound words and negated terms in Portuguese-BR, focusing on medical conditions and symptoms related to long COVID. By leveraging text mining, we aim to contribute to a deeper understanding of this chronic condition and its implications for healthcare systems globally. The model developed in this study has the potential for scalability and applicability in other healthcare settings, thereby supporting broader research efforts and informing clinical decision-making for long COVID patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]