[
    {
        "title": "Viability criteria assessment during liver machine perfusion",
        "link": "https://www.nature.com/articles/s41587-020-0720-z",
        "publication_date": "26 Oct 2020",
        "abstract": "arising from Eshmuminov, D. et al. Nature Biotechnology https://doi.org/10.1038/s41587-019-0374-x (2020)",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Shortwave-infrared meso-patterned imaging enables label-free mapping of tissue water and lipid content",
        "link": "https://www.nature.com/articles/s41467-020-19128-7",
        "publication_date": "23 Oct 2020",
        "abstract": "Water and lipids are key participants in many biological processes, but there are few non-invasive methods that provide quantification of these components in vivo, and none that can isolate and quantify lipids in the blood. Here we develop a new imaging modality termed shortwave infrared meso-patterned imaging (SWIR-MPI) to provide label-free, non-contact, spatial mapping of water and lipid concentrations in tissue. The method utilizes patterned hyperspectral illumination to target chromophore absorption bands in the 900–1,300 nm wavelength range. We use SWIR-MPI to monitor clinically important physiological processes including edema, inflammation, and tumor lipid heterogeneity in preclinical models. We also show that SWIR-MPI can spatially map blood-lipids in humans, representing an example of non-invasive and contact-free measurements of in vivo blood lipids. Together, these results highlight the potential of SWIR-MPI to enable new capabilities in fundamental studies and clinical monitoring of major conditions including obesity, cancer, and cardiovascular disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning for identifying corneal diseases from ocular surface slit-lamp photographs",
        "link": "https://www.nature.com/articles/s41598-020-75027-3",
        "publication_date": "20 Oct 2020",
        "abstract": "To demonstrate the identification of corneal diseases using a novel deep learning algorithm. A novel hierarchical deep learning network, which is composed of a family of multi-task multi-label learning classifiers representing different levels of eye diseases derived from a predefined hierarchical eye disease taxonomy was designed. Next, we proposed a multi-level eye disease-guided loss function to learn the fine-grained variability of eye diseases features. The proposed algorithm was trained end-to-end directly using 5,325 ocular surface images from a retrospective dataset. Finally, the algorithm’s performance was tested against 10 ophthalmologists in a prospective clinic-based dataset with 510 outpatients newly enrolled with diseases of infectious keratitis, non-infectious keratitis, corneal dystrophy or degeneration, and corneal neoplasm. The area under the ROC curve of the algorithm for each corneal disease type was over 0.910 and in general it had sensitivity and specificity similar to or better than the average values of all ophthalmologists. Confusion matrices revealed similarities in misclassification between human experts and the algorithm. In addition, our algorithm outperformed over all four previous reported methods in identified corneal diseases. The proposed algorithm may be useful for computer-assisted corneal disease diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Large-scale biometry with interpretable neural network regression on UK Biobank body MRI",
        "link": "https://www.nature.com/articles/s41598-020-74633-5",
        "publication_date": "20 Oct 2020",
        "abstract": "In a large-scale medical examination, the UK Biobank study has successfully imaged more than 32,000 volunteer participants with magnetic resonance imaging (MRI). Each scan is linked to extensive metadata, providing a comprehensive medical survey of imaged anatomy and related health states. Despite its potential for research, this vast amount of data presents a challenge to established methods of evaluation, which often rely on manual input. To date, the range of reference values for cardiovascular and metabolic risk factors is therefore incomplete. In this work, neural networks were trained for image-based regression to infer various biological metrics from the neck-to-knee body MRI automatically. The approach requires no manual intervention or direct access to reference segmentations for training. The examined fields span 64 variables derived from anthropometric measurements, dual-energy X-ray absorptiometry (DXA), atlas-based segmentations, and dedicated liver scans. With the ResNet50, the standardized framework achieves a close fit to the target values (median R\\(^2 > 0.97\\)) in cross-validation. Interpretation of aggregated saliency maps suggests that the network correctly targets specific body regions and limbs, and learned to emulate different modalities. On several body composition metrics, the quality of the predictions is within the range of variability observed between established gold standard techniques.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Interferons and viruses induce a novel truncated ACE2 isoform and not the full-length SARS-CoV-2 receptor",
        "link": "https://www.nature.com/articles/s41588-020-00731-9",
        "publication_date": "19 Oct 2020",
        "abstract": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), which causes COVID-19, utilizes angiotensin-converting enzyme 2 (ACE2) for entry into target cells. ACE2 has been proposed as an interferon-stimulated gene (ISG). Thus, interferon-induced variability in ACE2 expression levels could be important for susceptibility to COVID-19 or its outcomes. Here, we report the discovery of a novel, transcriptionally independent truncated isoform of ACE2, which we designate as deltaACE2 (dACE2). We demonstrate that dACE2, but not ACE2, is an ISG. In The Cancer Genome Atlas, the expression of dACE2 was enriched in squamous tumors of the respiratory, gastrointestinal and urogenital tracts. In vitro, dACE2, which lacks 356 amino-terminal amino acids, was non-functional in binding the SARS-CoV-2 spike protein and as a carboxypeptidase. Our results suggest that the ISG-type induction of dACE2 in IFN-high conditions created by treatments, an inflammatory tumor microenvironment or viral co-infections is unlikely to increase the cellular entry of SARS-CoV-2 and promote infection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning algorithms for detecting and visualising intussusception on plain abdominal radiography in children: a retrospective multicenter study",
        "link": "https://www.nature.com/articles/s41598-020-74653-1",
        "publication_date": "16 Oct 2020",
        "abstract": "This study aimed to verify a deep convolutional neural network (CNN) algorithm to detect intussusception in children using a human-annotated data set of plain abdominal X-rays from affected children. From January 2005 to August 2019, 1449 images were collected from plain abdominal X-rays of patients ≤ 6 years old who were diagnosed with intussusception while 9935 images were collected from patients without intussusception from three tertiary academic hospitals (A, B, and C data sets). Single Shot MultiBox Detector and ResNet were used for abdominal detection and intussusception classification, respectively. The diagnostic performance of the algorithm was analysed using internal and external validation tests. The internal test values after training with two hospital data sets were 0.946 to 0.971 for the area under the receiver operating characteristic curve (AUC), 0.927 to 0.952 for the highest accuracy, and 0.764 to 0.848 for the highest Youden index. The values from external test using the remaining data set were all lower (P-value < 0.001). The mean values of the internal test with all data sets were 0.935 and 0.743 for the AUC and Youden Index, respectively. Detection of intussusception by deep CNN and plain abdominal X-rays could aid in screening for intussusception in children.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Integration of geoscience frameworks into digital pathology analysis permits quantification of microarchitectural relationships in histological landscapes",
        "link": "https://www.nature.com/articles/s41598-020-74691-9",
        "publication_date": "16 Oct 2020",
        "abstract": "Although gold-standard histological assessment is subjective it remains central to diagnosis and clinical trial protocols and is crucial for the evaluation of any preclinical disease model. Objectivity and reproducibility are enhanced by quantitative analysis of histological images but current methods require application-specific algorithm training and fail to extract understanding from the histological context of observable features. We reinterpret histopathological images as disease landscapes to describe a generalisable framework defining topographic relationships in tissue using geoscience approaches. The framework requires no user-dependent training to operate on all image datasets in a classifier-agnostic manner but is adaptable and scalable, able to quantify occult abnormalities, derive mechanistic insights, and define a new feature class for machine-learning diagnostic classification. We demonstrate application to inflammatory, fibrotic and neoplastic disease in multiple organs, including the detection and quantification of occult lobular enlargement in the liver secondary to hilar obstruction. We anticipate this approach will provide a robust class of histological data for trial stratification or endpoints, provide quantitative endorsement of experimental models of disease, and could be incorporated within advanced approaches to clinical diagnostic pathology.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automatic classification between COVID-19 pneumonia, non-COVID-19 pneumonia, and the healthy on chest X-ray image: combination of data augmentation methods",
        "link": "https://www.nature.com/articles/s41598-020-74539-2",
        "publication_date": "16 Oct 2020",
        "abstract": "This study aimed to develop and validate computer-aided diagnosis (CXDx) system for classification between COVID-19 pneumonia, non-COVID-19 pneumonia, and the healthy on chest X-ray (CXR) images. From two public datasets, 1248 CXR images were obtained, which included 215, 533, and 500 CXR images of COVID-19 pneumonia patients, non-COVID-19 pneumonia patients, and the healthy samples, respectively. The proposed CADx system utilized VGG16 as a pre-trained model and combination of conventional method and mixup as data augmentation methods. Other types of pre-trained models were compared with the VGG16-based model. Single type or no data augmentation methods were also evaluated. Splitting of training/validation/test sets was used when building and evaluating the CADx system. Three-category accuracy was evaluated for test set with 125 CXR images. The three-category accuracy of the CAD system was 83.6% between COVID-19 pneumonia, non-COVID-19 pneumonia, and the healthy. Sensitivity for COVID-19 pneumonia was more than 90%. The combination of conventional method and mixup was more useful than single type or no data augmentation method. In conclusion, this study was able to create an accurate CADx system for the 3-category classification. Source code of our CADx system is available as open source for COVID-19 research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Transparency and reproducibility in artificial intelligence",
        "link": "https://www.nature.com/articles/s41586-020-2766-y",
        "publication_date": "14 Oct 2020",
        "abstract": "arising from S. M. McKinney et al. Nature https://doi.org/10.1038/s41586-019-1799-6 (2020)",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Hyperactive sensorimotor cortex during voice perception in spasmodic dysphonia",
        "link": "https://www.nature.com/articles/s41598-020-73450-0",
        "publication_date": "14 Oct 2020",
        "abstract": "Spasmodic dysphonia (SD) is characterized by an involuntary laryngeal muscle spasm during vocalization. Previous studies measured brain activation during voice production and suggested that SD arises from abnormal sensorimotor integration involving the sensorimotor cortex. However, it remains unclear whether this abnormal sensorimotor activation merely reflects neural activation produced by abnormal vocalization. To identify the specific neural correlates of SD, we used a sound discrimination task without overt vocalization to compare neural activation between 11 patients with SD and healthy participants. Participants underwent functional MRI during a two-alternative judgment task for auditory stimuli, which could be modal or falsetto voice. Since vocalization in falsetto is intact in SD, we predicted that neural activation during speech perception would differ between the two groups only for modal voice and not for falsetto voice. Group-by-stimulus interaction was observed in the left sensorimotor cortex and thalamus, suggesting that voice perception activates different neural systems between the two groups. Moreover, the sensorimotor signals positively correlated with disease severity of SD, and classified the two groups with 73% accuracy in linear discriminant analysis. Thus, the sensorimotor cortex and thalamus play a central role in SD pathophysiology and sensorimotor signals can be a new biomarker for SD diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A critical evaluation of visual proportion of Gleason 4 and maximum cancer core length quantified by histopathologists",
        "link": "https://www.nature.com/articles/s41598-020-73524-z",
        "publication_date": "14 Oct 2020",
        "abstract": "Gleason score 7 prostate cancer with a higher proportion of pattern 4 (G4) has been linked to genomic heterogeneity and poorer patient outcome. The current assessment of G4 proportion uses estimation by a pathologist, with a higher proportion of G4 more likely to trigger additional imaging and treatment over active surveillance. This estimation method has been shown to have inter-observer variability. Fifteen patients with Prostate Grade Group (GG) 2 (Gleason 3 + 4) and fifteen patients with GG3 (Gleason 4 + 3) disease were selected from the PROMIS study with 192 haematoxylin and eosin-stained slides scanned. Two experienced uropathologists assessed the maximum cancer core length (MCCL) and G4 proportion using the current standard method (visual estimation) followed by detailed digital manual annotation of each G4 area and measurement of MCCL (planimetric estimation) using freely available software by the same two experts. We aimed to compare visual estimation of G4 and MCCL to a pathologist-driven digital measurement. We show that the visual and digital MCCL measurement differs up to 2 mm in 76.6% (23/30) with a high degree of agreement between the two measurements; Visual gave a median MCCL of 10 ± 2.70 mm (IQR 4, range 5–15 mm) compared to digital of 9.88 ± 3.09 mm (IQR 3.82, range 5.01–15.7 mm) (p = 0.64) The visual method for assessing G4 proportion over-estimates in all patients, compared to digital measurements [median 11.2% (IQR 38.75, range 4.7–17.9%) vs 30.4% (IQR 18.37, range 12.9–50.76%)]. The discordance was higher as the amount of G4 increased (Bias 18.71, CI 33.87–48.75, r 0.7, p < 0.0001). Further work on assessing actual G4 burden calibrated to clinical outcomes might lead to the use of differing G4 thresholds of significance if the visual estimation is used or by incorporating semi-automated methods for G4 burden measurement.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Survival prediction of patients with sepsis from age, sex, and septic episode number alone",
        "link": "https://www.nature.com/articles/s41598-020-73558-3",
        "publication_date": "13 Oct 2020",
        "abstract": "Sepsis is a life-threatening condition caused by an exaggerated reaction of the body to an infection, that leads to organ failure or even death. Since sepsis can kill a patient even in just one hour, survival prediction is an urgent priority among the medical community: even if laboratory tests and hospital analyses can provide insightful information about the patient, in fact, they might not come in time to allow medical doctors to recognize an immediate death risk and treat it properly. In this context, machine learning can be useful to predict survival of patients within minutes, especially when applied to few medical features easily retrievable. In this study, we show that it is possible to achieve this goal by applying computational intelligence algorithms to three features of patients with sepsis, recorded at hospital admission: sex, age, and septic episode number. We applied several data mining methods to a cohort of 110,204 admissions of patients, and obtained high prediction scores both on this complete dataset (top precision-recall area under the curve PR AUC = 0.966) and on its subset related to the recent Sepsis-3 definition (top PR AUC = 0.860). Additionally, we tested our models on an external validation cohort of 137 patients, and achieved good results in this case too (top PR AUC = 0.863), confirming the generalizability of our approach. Our results can have a huge impact on clinical settings, allowing physicians to forecast the survival of patients by sex, age, and septic episode number alone.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Bundle analytics, a computational framework for investigating the shapes and profiles of brain pathways across populations",
        "link": "https://www.nature.com/articles/s41598-020-74054-4",
        "publication_date": "13 Oct 2020",
        "abstract": "Tractography has created new horizons for researchers to study brain connectivity in vivo. However, tractography is an advanced and challenging method that has not been used so far for medical data analysis at a large scale in comparison to other traditional brain imaging methods. This work allows tractography to be used for large scale and high-quality medical analytics. BUndle ANalytics (BUAN) is a fast, robust, and flexible computational framework for real-world tractometric studies. BUAN combines tractography and anatomical information to analyze the challenging datasets and identifies significant group differences in specific locations of the white matter bundles. Additionally, BUAN takes the shape of the bundles into consideration for the analysis. BUAN compares the shapes of the bundles using a metric called bundle adjacency which calculates shape similarity between two given bundles. BUAN builds networks of bundle shape similarities that can be paramount for automating quality control. BUAN is freely available in DIPY. Results are presented using publicly available Parkinson’s Progression Markers Initiative data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep transfer learning for reducing health care disparities arising from biomedical data inequality",
        "link": "https://www.nature.com/articles/s41467-020-18918-3",
        "publication_date": "12 Oct 2020",
        "abstract": "As artificial intelligence (AI) is increasingly applied to biomedical research and clinical decisions, developing unbiased AI models that work equally well for all ethnic groups is of crucial importance to health disparity prevention and reduction. However, the biomedical data inequality between different ethnic groups is set to generate new health care disparities through data-driven, algorithm-based biomedical research and clinical decisions. Using an extensive set of machine learning experiments on cancer omics data, we find that current prevalent schemes of multiethnic machine learning are prone to generating significant model performance disparities between ethnic groups. We show that these performance disparities are caused by data inequality and data distribution discrepancies between ethnic groups. We also find that transfer learning can improve machine learning model performance for data-disadvantaged ethnic groups, and thus provides an effective approach to reduce health care disparities arising from data inequality among ethnic groups.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Five-year trajectories of multimorbidity patterns in an elderly Mediterranean population using Hidden Markov Models",
        "link": "https://www.nature.com/articles/s41598-020-73231-9",
        "publication_date": "09 Oct 2020",
        "abstract": "This study aimed to analyse the trajectories and mortality of multimorbidity patterns in patients aged 65 to 99 years in Catalonia (Spain). Five year (2012–2016) data of 916,619 participants from a primary care, population-based electronic health record database (Information System for Research in Primary Care, SIDIAP) were included in this retrospective cohort study. Individual longitudinal trajectories were modelled with a Hidden Markov Model across multimorbidity patterns. We computed the mortality hazard using Cox regression models to estimate survival in multimorbidity patterns. Ten multimorbidity patterns were originally identified and two more states (death and drop-outs) were subsequently added. At baseline, the most frequent cluster was the Non-Specific Pattern (42%), and the least frequent the Multisystem Pattern (1.6%). Most participants stayed in the same cluster over the 5 year follow-up period, from 92.1% in the Nervous, Musculoskeletal pattern to 59.2% in the Cardio-Circulatory and Renal pattern. The highest mortality rates were observed for patterns that included cardio-circulatory diseases: Cardio-Circulatory and Renal (37.1%); Nervous, Digestive and Circulatory (31.8%); and Cardio-Circulatory, Mental, Respiratory and Genitourinary (28.8%). This study demonstrates the feasibility of characterizing multimorbidity patterns along time. Multimorbidity trajectories were generally stable, although changes in specific multimorbidity patterns were observed. The Hidden Markov Model is useful for modelling transitions across multimorbidity patterns and mortality risk. Our findings suggest that health interventions targeting specific multimorbidity patterns may reduce mortality in patients with multimorbidity.",
        "conclusions": "Four main aspects differentiate and characterise the ten multimorbidity patterns observed: (1) the proportion of women was higher in C2-Eye Impairment and Mental; C4-Cardio-circulatory and Renal; C7-Respiratory and Ear; and C9-Nervous, Musculoskeletal, and Minor, whereas men predominated in C5-Cardio-circulatory, Mental, Respiratory and Genitourinary; (2) the highest mortality rates were observed for C4-Cardio-Circulatory and Renal; C6-Nervous, Digestive and Circulatory and C5-Cardio-Circulatory, Mental, Respiratory and Genitourinary; (3) trajectories were generally stable, although changes were common in certain patterns of multimorbidity; (4) most trajectories consisted of a single transition during 5 years of follow up.This study sheds light on the changing prevalence of multimorbidity patterns over time and on mortality associated with specific patterns. These data are essential for the provision of adequate healthcare for patients with multiple chronic conditions. Future studies on the trajectory of multimorbidity patterns should follow up a younger population for a longer period of time.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical predictive modelling of post-surgical recovery in individuals with cervical radiculopathy: a machine learning approach",
        "link": "https://www.nature.com/articles/s41598-020-73740-7",
        "publication_date": "08 Oct 2020",
        "abstract": "Prognostic models play an important role in the clinical management of cervical radiculopathy (CR). No study has compared the performance of modern machine learning techniques, against more traditional stepwise regression techniques, when developing prognostic models in individuals with CR. We analysed a prospective cohort dataset of 201 individuals with CR. Four modelling techniques (stepwise regression, least absolute shrinkage and selection operator [LASSO], boosting, and multivariate adaptive regression splines [MuARS]) were each used to form a prognostic model for each of four outcomes obtained at a 12 month follow-up (disability—neck disability index [NDI]), quality of life (EQ5D), present neck pain intensity, and present arm pain intensity). For all four outcomes, the differences in mean performance between all four models were small (difference of NDI < 1 point; EQ5D < 0.1 point; neck and arm pain < 2 points). Given that the predictive accuracy of all four modelling methods were clinically similar, the optimal modelling method may be selected based on the parsimony of predictors. Some of the most parsimonious models were achieved using MuARS, a non-linear technique. Modern machine learning methods may be used to probe relationships along different regions of the predictor space.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Data mining and model-predicting a global disease reservoir for low-pathogenic Avian Influenza (AI) in the wider pacific rim using big data sets",
        "link": "https://www.nature.com/articles/s41598-020-73664-2",
        "publication_date": "08 Oct 2020",
        "abstract": "Avian Influenza (AI) is a complex but still poorly understood disease; specifically when it comes to reservoirs, co-infections, connectedness and wider landscape perspectives. Low pathogenic (Low-path LP) AI in chickens caused by less virulent strains of AI viruses (AIVs)—when compared with highly pathogenic AIVs (HPAIVs)—are not even well-described yet or known how they contribute to wider AI and immune system issues. Co-circulation of LPAIVs with HPAIVs suggests their interactions in their ecological aspects. Here we show for the Pacific Rim an international approach how to data mine and model-predict LP AI and its ecological niche with machine learning and open access data sets and geographic information systems (GIS) on a 5 km pixel size for best-possible inference. This is based on the best-available data on the issue (~ 40,827 records of lab-analyzed field data from Japan, Russia, Vietnam, Mongolia, Alaska and Influenza Research Database (IRD) and U.S. Department of Agriculture (USDA) database sets, as well as 19 GIS data layers). We sampled 157 hosts and 110 low-path AIVs with 32 species as drivers. The prevalence across low-path AIV subtypes is dominated by Muscovy ducks, Mallards, Whistling Swans and gulls also emphasizing industrial impacts for the human-dominated wildlife contact zone. This investigation sets a good precedent for the study of reservoirs, big data mining, predictions and subsequent outbreaks of HPAI and other pandemics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Longitudinal assessment of U-shaped and inverted U-shaped developmental changes in the spontaneous movements of infants via markerless video analysis",
        "link": "https://www.nature.com/articles/s41598-020-74006-y",
        "publication_date": "08 Oct 2020",
        "abstract": "Various attempts have been made to elucidate the development patterns in the spontaneous movements of infants through longitudinal evaluations. Movement complexity has been found to demonstrate u-shaped changes in the measurements focusing on limb movements. However, researchers have not yet clarified how other characteristics, besides movement complexity, change over time. This paper presents a longitudinal evaluation of spontaneous movements in infants using evaluation indices calculated through markerless video analysis. Nine infants with corrected ages from \\(-1\\) to 15 weeks participated in the experiments. We confirmed the change in indices over time using statistical methods. Index changes can be classified as positively correlated, u-shaped, inverted u-shaped, and uncorrelated. We also confirmed that the u-shaped and inverted u-shaped indices are negatively correlated. Furthermore, the principal component analysis revealed that the first principal component had the inverted u-shaped changes with the corrected age. These results suggest that it is important to synchronize the inverted u-shaped variations in the movement and velocity with the u-shaped changes in the movement complexity for infant development.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "A multivariate neuromonitoring approach to neuroplasticity-based computerized cognitive training in recent onset psychosis",
        "link": "https://www.nature.com/articles/s41386-020-00877-4",
        "publication_date": "07 Oct 2020",
        "abstract": "Two decades of studies suggest that computerized cognitive training (CCT) has an effect on cognitive improvement and the restoration of brain activity. Nevertheless, individual response to CCT remains heterogenous, and the predictive potential of neuroimaging in gauging response to CCT remains unknown. We employed multivariate pattern analysis (MVPA) on whole-brain resting-state functional connectivity (rsFC) to (neuro)monitor clinical outcome defined as psychosis-likeness change after 10-hours of CCT in recent onset psychosis (ROP) patients. Additionally, we investigated if sensory processing (SP) change during CCT is associated with individual psychosis-likeness change and cognitive gains after CCT. 26 ROP patients were divided into maintainers and improvers based on their SP change during CCT. A support vector machine (SVM) classifier separating 56 healthy controls (HC) from 35 ROP patients using rsFC (balanced accuracy of 65.5%, P < 0.01) was built in an independent sample to create a naturalistic model representing the HC-ROP hyperplane. This model was out-of-sample cross-validated in the ROP patients from the CCT trial to assess associations between rsFC pattern change, cognitive gains and SP during CCT. Patients with intact SP threshold at baseline showed improved attention despite psychosis status on the SVM hyperplane at follow-up (p < 0.05). Contrarily, the attentional gains occurred in the ROP patients who showed impaired SP at baseline only if rsfMRI diagnosis status shifted to the healthy-like side of the SVM continuum. Our results reveal the utility of MVPA for elucidating treatment response neuromarkers based on rsFC-SP change and pave the road to more personalized interventions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Outcomes of photorefractive keratectomy in patients with posterior corneal steepening",
        "link": "https://www.nature.com/articles/s41433-020-01213-2",
        "publication_date": "06 Oct 2020",
        "abstract": "To assess post-operative outcomes following photorefractive keratectomy (PRK) in patients with posterior corneal steepening compared to an age, gender and refraction matched control group.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Using epidemic simulators for monitoring an ongoing epidemic",
        "link": "https://www.nature.com/articles/s41598-020-73308-5",
        "publication_date": "06 Oct 2020",
        "abstract": "Prediction of infection trends, estimating the efficacy of contact tracing, testing or impact of influx of infected are of vital importance for administration during an ongoing epidemic. Most effective methods currently are empirical in nature and their relation to parameters of interest to administrators are not evident. We thus propose a modified SEIRD model that is capable of modeling effect of interventions and inward migrations on the progress of an epidemic. The tunable parameters of this model bear relevance to monitoring of an epidemic. This model was used to show that some of the commonly seen features of cumulative infections in real data can be explained by piecewise constant changes in interventions and population influx. We also show that the data of cumulative infections from twelve Indian states between mid March and mid April 2020 can be generated from the model by applying interventions according to a set of heuristic rules. Prediction for the next ten days based on this model, reproduced real data very well. In addition, our model also reproduced the time series of recoveries and deaths. Our work constitutes an important first step towards an effective dashboard for the monitoring of epidemic by the administration, especially in an Indian context.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Three-dimensional optoacoustic imaging of nailfold capillaries in systemic sclerosis and its potential for disease differentiation using deep learning",
        "link": "https://www.nature.com/articles/s41598-020-73319-2",
        "publication_date": "05 Oct 2020",
        "abstract": "The autoimmune disease systemic sclerosis (SSc) causes microvascular changes that can be easily observed cutaneously at the finger nailfold. Optoacoustic imaging (OAI), a combination of optical and ultrasound imaging, specifically raster-scanning optoacoustic mesoscopy (RSOM), offers a non-invasive high-resolution 3D visualization of capillaries allowing for a better view of microvascular changes and an extraction of volumetric measures. In this study, nailfold capillaries of patients with SSc and healthy controls are imaged and compared with each other for the first time using OAI. The nailfolds of 23 patients with SSc and 19 controls were imaged using RSOM. The acquired images were qualitatively compared to images from state-of-the-art imaging tools for SSc, dermoscopy and high magnification capillaroscopy. The vascular volume in the nailfold capillaries were computed from the RSOM images. The vascular volumes differ significantly between both cohorts (0.216 ± 0.085 mm3 and 0.337 ± 0.110 mm3; p < 0.0005). In addition, an artificial neural network was trained to automatically differentiate nailfold images from both cohorts to further assess whether OAI is sensitive enough to visualize anatomical differences in the capillaries between the two cohorts. Using transfer learning, the model classifies images with an area under the ROC curve of 0.897, and a sensitivity of 0.783 and specificity of 0.895. In conclusion, this study demonstrates the capabilities of RSOM as an imaging tool for SSc and establishes it as a modality that facilitates more in-depth studies into the disease mechanisms and progression.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning algorithms out-perform veterinary pathologists in detecting the mitotically most active tumor region",
        "link": "https://www.nature.com/articles/s41598-020-73246-2",
        "publication_date": "05 Oct 2020",
        "abstract": "Manual count of mitotic figures, which is determined in the tumor region with the highest mitotic activity, is a key parameter of most tumor grading schemes. It can be, however, strongly dependent on the area selection due to uneven mitotic figure distribution in the tumor section. We aimed to assess the question, how significantly the area selection could impact the mitotic count, which has a known high inter-rater disagreement. On a data set of 32 whole slide images of H&E-stained canine cutaneous mast cell tumor, fully annotated for mitotic figures, we asked eight veterinary pathologists (five board-certified, three in training) to select a field of interest for the mitotic count. To assess the potential difference on the mitotic count, we compared the mitotic count of the selected regions to the overall distribution on the slide. Additionally, we evaluated three deep learning-based methods for the assessment of highest mitotic density: In one approach, the model would directly try to predict the mitotic count for the presented image patches as a regression task. The second method aims at deriving a segmentation mask for mitotic figures, which is then used to obtain a mitotic density. Finally, we evaluated a two-stage object-detection pipeline based on state-of-the-art architectures to identify individual mitotic figures. We found that the predictions by all models were, on average, better than those of the experts. The two-stage object detector performed best and outperformed most of the human pathologists on the majority of tumor cases. The correlation between the predicted and the ground truth mitotic count was also best for this approach (0.963–0.979). Further, we found considerable differences in position selection between pathologists, which could partially explain the high variance that has been reported for the manual mitotic count. To achieve better inter-rater agreement, we propose to use a computer-based area selection for support of the pathologist in the manual mitotic count.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Design and clinical implementation of an open-source bionic leg",
        "link": "https://www.nature.com/articles/s41551-020-00619-3",
        "publication_date": "05 Oct 2020",
        "abstract": "In individuals with lower-limb amputations, robotic prostheses can increase walking speed, and reduce energy use, the incidence of falls and the development of secondary complications. However, safe and reliable prosthetic-limb control strategies for robust ambulation in real-world settings remain out of reach, partly because control strategies have been tested with different robotic hardware in constrained laboratory settings. Here, we report the design and clinical implementation of an integrated robotic knee–ankle prosthesis that facilitates the real-world testing of its biomechanics and control strategies. The bionic leg is open source, it includes software for low-level control and for communication with control systems, and its hardware design is customizable, enabling reduction in its mass and cost, improvement in its ease of use and independent operation of the knee and ankle joints. We characterized the electromechanical and thermal performance of the bionic leg in benchtop testing, as well as its kinematics and kinetics in three individuals during walking on level ground, ramps and stairs. The open-source integrated-hardware solution and benchmark data that we provide should help with research and clinical testing of knee–ankle prostheses in real-world environments.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": [
                "model control"
            ]
        }
    },
    {
        "title": "Neurocognitive and functional heterogeneity in depressed youth",
        "link": "https://www.nature.com/articles/s41386-020-00871-w",
        "publication_date": "02 Oct 2020",
        "abstract": "Depression is a common psychiatric illness that often begins in youth, and is sometimes associated with cognitive deficits. However, there is significant variability in cognitive dysfunction, likely reflecting biological heterogeneity. We sought to identify neurocognitive subtypes and their neurofunctional signatures in a large cross-sectional sample of depressed youth. Participants were drawn from the Philadelphia Neurodevelopmental Cohort, including 712 youth with a lifetime history of a major depressive episode and 712 typically developing (TD) youth matched on age and sex. A subset (MDD n = 368, TD n = 200) also completed neuroimaging. Cognition was assessed with the Penn Computerized Neurocognitive Battery. A recently developed semi-supervised machine learning algorithm was used to delineate neurocognitive subtypes. Subtypes were evaluated for differences in both clinical psychopathology and brain activation during an n-back working memory fMRI task. We identified three neurocognitive subtypes in the depressed group. Subtype 1 was high-performing (high accuracy, moderate speed), Subtype 2 was cognitively impaired (low accuracy, slow speed), and Subtype 3 was impulsive (low accuracy, fast speed). While subtypes did not differ in clinical psychopathology, they diverged in their activation profiles in regions critical for executive function, which mirrored differences in cognition. Taken together, these data suggest disparate mechanisms of cognitive vulnerability and resilience in depressed youth, which may inform the identification of biomarkers for prognosis and treatment response.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Osr1 regulates hepatic inflammation and cell survival in the progression of non-alcoholic fatty liver disease",
        "link": "https://www.nature.com/articles/s41374-020-00493-2",
        "publication_date": "01 Oct 2020",
        "abstract": "Odd-skipped related 1 (Osr1) is a novel tumor suppressor gene in several cancer cell lines. Non-alcoholic steatohepatitis (NASH) is considered as a high-risk factor for hepatocellular carcinoma (HCC). This study is aimed to investigate the novel role of Osr1 in promoting the progression of hepatic steatosis to NASH. Following 12 weeks of diethylnitrosamine (DEN) and high-fat diet (HFD), wildtype (WT) and Osr1 heterozygous (Osr1+/−) male mice were examined for liver injuries. Osr1+/− mice displayed worsen liver injury with higher serum alanine aminotransferase levels than the WT mice. The Osr1+/− mice also revealed early signs of collagen deposition with increased hepatic Tgfb and Fn1 expression. There was overactivation of both JNK and NF-κB signaling in the Osr1+/− liver, along with accumulation of F4/80+ cells and enhanced hepatic expression of Il-1b and Il-6. Moreover, the Osr1+/− liver displayed hyperphosphorylation of AKT/mTOR signaling, associated with overexpression of Bcl-2. In addition, Osr1+/− and WT mice displayed differences in the DNA methylome of the liver cells. Specifically, Osr1-responsible CpG islands of Ccl3 and Pcgf2, genes for inflammation and macrophage infiltration, were further identified. Taken together, Osr1 plays an important role in regulating cell inflammation and survival through multiple signaling pathways and DNA methylation modification for NAFLD progression.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multimodal combination of GC × GC-HRTOFMS and SIFT-MS for asthma phenotyping using exhaled breath",
        "link": "https://www.nature.com/articles/s41598-020-73408-2",
        "publication_date": "30 Sept 2020",
        "abstract": "Chronic inflammatory lung diseases impact more than 300 million of people worldwide. Because they are not curable, these diseases have a high impact on both the quality of life of patients and the healthcare budget. The stability of patient condition relies mostly on constant treatment adaptation and lung function monitoring. However, due to the variety of inflammation phenotypes, almost one third of the patients receive an ineffective treatment. To improve phenotyping, we evaluated the complementarity of two techniques for exhaled breath analysis: full resolving comprehensive two-dimensional gas chromatography coupled to high-resolution time-of-flight mass spectrometry (GC × GC-HRTOFMS) and rapid screening selected ion flow tube MS (SIFT-MS). GC × GC-HRTOFMS has a high resolving power and offers a full overview of sample composition, providing deep insights on the ongoing biology. SIFT-MS is usually used for targeted analyses, allowing rapid classification of samples in defined groups. In this study, we used SIFT-MS in a possible untargeted full-scan mode, where it provides pattern-based classification capacity. We analyzed the exhaled breath of 50 asthmatic patients. Both techniques provided good classification accuracy (around 75%), similar to the efficiency of other clinical tools routinely used for asthma phenotyping. Moreover, our study provides useful information regarding the complementarity of the two techniques.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Contact lenses, the reverse Pulfrich effect, and anti-Pulfrich monovision corrections",
        "link": "https://www.nature.com/articles/s41598-020-71395-y",
        "publication_date": "30 Sept 2020",
        "abstract": "Interocular differences in image blur can cause processing speed differences that lead to dramatic misperceptions of the distance and three-dimensional direction of moving objects. This recently discovered illusion—the reverse Pulfrich effect—is caused by optical conditions induced by monovision, a common correction for presbyopia. Fortunately, anti-Pulfrich monovision corrections, which darken the blurring lens, can eliminate the illusion for many viewing conditions. However, the reverse Pulfrich effect and the efficacy of anti-Pulfrich corrections have been demonstrated only with trial lenses. This situation should be addressed, for clinical and scientific reasons. First, it is important to replicate these effects with contact lenses, the most common method for delivering monovision. Second, trial lenses of different powers, unlike contacts, can cause large magnification differences between the eyes. To confidently attribute the reverse Pulfrich effect to interocular optical blur differences, and to ensure that previously reported effect sizes are reliable, one must control for magnification. Here, in a within-observer study with five separate experiments, we demonstrate that (1) contact lenses and trial lenses induce indistinguishable reverse Pulfrich effects, (2) anti-Pulfrich corrections are equally effective when induced by contact and trial lenses, and (3) magnification differences do not cause or impact the Pulfrich effect.",
        "conclusions": "This manuscript shows that interocular magnification differences up to ±3.6% do not cause or impact the reverse Pulfrich effect, that the reverse Pulfrich effect can be caused by contact lenses delivering monovision corrections, and that the reverse Pulfrich effect can be eliminated with contact lenses delivering anti-Pulfrich monovision corrections. Although many questions must still be resolved before the suitability of anti-Pulfrich corrections can be determined for clinical practice, optometrists and ophthalmologists should consider making their patients aware of the reverse Pulfrich effect when prescribing monovision. Because the reverse Pulfrich effect is mediated by processing speed differences between the eyes, scientific and clinical progress will be facilitated by a computational theory that links properties of individual images to neural processing speed.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Birth and birth-related obstetrical characteristics in southwestern China associated with the current adjustment of family planning policy: a 7-year retrospective study",
        "link": "https://www.nature.com/articles/s41598-020-73039-7",
        "publication_date": "29 Sept 2020",
        "abstract": "In China, the adjustment of the family planning policy was expected to increase the number of births and trigger a change in the demographic and obstetrical background of pregnant women. The policy itself, and corresponding background variations of the pregnant mothers, might have various influences on certain birth-related characteristics. Moreover, the adaption of the medical system to the policy needs to be demonstrated. To address these issues, over 50,000 individual records from January 2012 to December 2018 were collected from a large tertiary care centre of southwest China as a representative. The monthly numbers of deliveries and births showed stabilized patterns after remarkable upward trends. Policy-sensitive women, among whom older age and multiparity were typical features, contributed considerably to the remarkable additional births. Indeed, multivariable logistic regression analysis identified the child policy and these two background characteristics as factors influencing CS (caesarean section) rate and certain pregnancy complications or adverse outcomes. After the implementation of the two-child policy, a care provider was faced with fewer but more difficult cases. Briefly speaking, more individual-based studies on family planning policy and more efforts to improve obstetrical service are needed to better guide clinical practice in the new era.",
        "conclusions": "Our study, conducted in a representative hospital in southwest China, demonstrated that (1) an increase in births occurred after implementation of the two-child policy and has already stabilized; (2) a newly balanced demographic makeup of pregnant women has developed; (3) the policy target is more sensitive to additional births; (4) the policy put hospitals and care providers in a situation of lower quantity but greater difficulty work; and (5) the covariates should not be ignored when analysing the factors influencing the birth-related obstetrical characteristics.We sincerely recommend that (1) more individual-based studies be performed both to describe changes and to answer the questions mentioned above; (2) more efforts should be put into providing high-quality health care service to prevent adverse outcomes from improper operations; and (3) childbearing should be concentrated within the optimum maternal age range.",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A machine learning-based diagnostic model associated with knee osteoarthritis severity",
        "link": "https://www.nature.com/articles/s41598-020-72941-4",
        "publication_date": "25 Sept 2020",
        "abstract": "Knee osteoarthritis (KOA) is characterized by pain and decreased gait function. We aimed to find KOA-related gait features based on patient reported outcome measures (PROMs) and develop regression models using machine learning algorithms to estimate KOA severity. The study included 375 volunteers with variable KOA grades. The severity of KOA was determined using the Western Ontario and McMaster Universities Osteoarthritis Index (WOMAC). WOMAC scores were used to classify disease severity into three groups. A total of 1087 features were extracted from the gait data. An ANOVA and student’s t-test were performed and only features that were significant were selected for inclusion in the machine learning algorithm. Three WOMAC subscales (physical function, pain and stiffness) were further divided into three classes. An ANOVA was performed to determine which selected features were significantly related to the subscales. Both linear regression models and a random forest regression was used to estimate patient the WOMAC scores. Forty-three features were selected based on ANOVA and student’s t-test results. The following number of features were selected from each joint: 12 from hip, 1 feature from pelvic, 17 features from knee, 9 features from ankle, 1 feature from foot, and 3 features from spatiotemporal parameters. A significance level of < 0.0001 and < 0.00003 was set for the ANOVA and t-test, respectively. The physical function, pain, and stiffness subscales were related to 41, 10, and 16 features, respectively. Linear regression models showed a correlation of 0.723 and the machine learning algorithm showed a correlation of 0.741. The severity of KOA was predicted by gait analysis features, which were incorporated to develop an objective estimation model for KOA severity. The identified features may serve as a tool to guide rehabilitation and progress assessments. In addition, the estimation model presented here suggests an approach for clinical application of gait analysis data for KOA evaluation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "MicroRNA signatures associated with lymph node metastasis in intramucosal gastric cancer",
        "link": "https://www.nature.com/articles/s41379-020-00681-x",
        "publication_date": "24 Sept 2020",
        "abstract": "Although a certain proportion of intramucosal carcinomas (IMCs) of the stomach does metastasize, the majority of patients are currently treated with endoscopic resection without lymph node dissection, and this potentially veils any existing metastasis and may put some patients in danger. In this regard, biological markers from the resected IMC that can predict metastasis are warranted. Here, we discovered unique miRNA expression profiles that consist of 21 distinct miRNAs that are specifically upregulated (miR-628-5p, miR-1587, miR-3175, miR-3620-5p, miR-4459, miR-4505, miR-4507, miR-4720-5p, miR-4742-5p, and miR-6779-5p) or downregulated (miR-106b-3p, miR-125a-5p, miR-151b, miR-181d-5p, miR-486-5p, miR-500a-3p, miR-502-3p, miR-1231, miR-3609, and miR-6831-5p) in metastatic (M)-IMC compared to nonmetastatic (N)-IMC, or nonneoplastic gastric mucosa. Intriguingly, most of these selected miRNAs showed stepwise increased or decreased expression from nonneoplastic tissue to N-IMC to M-IMC. This suggests that common oncogenic mechanisms are gradually intensified during the metastatic process. Using a machine-learning algorithm, we demonstrated that such miRNA signatures could distinguish M-IMC from N-IMC. Gene ontology and pathway analysis revealed that TGF-β signaling was enriched from upregulated miRNAs, whereas E2F targets, apoptosis-related, hypoxia-related, and PI3K/AKT/mTOR signaling pathways, were enriched from downregulated miRNAs. Immunohistochemical staining of samples from multiple institutions indicated that PI3K/AKT/mTOR pathway components, MAPK1, phospho-p44/42 MAPK, and pS6 were highly expressed and the expression of SMAD7, a TGF-β pathway component, was decreased in M-IMC, which could aid in distinguishing M-IMC from N-IMC. The miRNA signature discovered in this study is a valuable biological marker for identifying metastatic potential of IMCs, and provides novel insights regarding the metastatic progression of IMC.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Serum proteins may facilitate the identification of Kawasaki disease and promote in vitro neutrophil infiltration",
        "link": "https://www.nature.com/articles/s41598-020-72695-z",
        "publication_date": "24 Sept 2020",
        "abstract": "Kawasaki disease (KD) usually affects the children younger than 5 years of age and subsequently causes coronary artery lesions (CALs) without timely identification and treatment. Developing a robust and fast prediction method may facilitate the timely diagnosis of KD, significantly reducing the risk of CALs in KD patients. The levels of inflammatory serum proteins dramatically vary during the onsets of many immune diseases, including in KD. However, our understanding of their pathogenic roles in KD is behind satisfaction. The purpose of this study was to evaluate candidate diagnostic serum proteins and the potential mechanism in KD using iTRAQ gel-free proteomics. We enrolled subjects and conducted iTRAQ gel-free proteomics to globally screen serum proteins followed by specific validation with ELISA. Further in vitro leukocyte trans-endothelial model was also applied to investigate the pathogenesis roles of inflammatory serum proteins. We identified six KD protein biomarkers, including Protein S100-A8 (S100A8), Protein S100-A9 (S100A9), Protein S100-A12 (S100A12), Peroxiredoxin-2 (PRDX2), Neutrophil defensin 1 (DEFA1) and Alpha-1-acid glycoprotein 1 (ORM1). They enabled us to develop a high-performance KD prediction model with an auROC value of 0.94, facilitating the timely identification of KD. Further assays concluded that recombinant S100A12 protein treatment activated neutrophil surface adhesion molecules responsible for adhesion to endothelial cells. Therefore, S100A12 promoted both freshly clinically isolated neutrophils and neutrophil-like cells to infiltrate through the endothelial layer in vitro. Finally, the antibody against S100A12 may attenuate the infiltration promoted by S100A12. Our result demonstrated that evaluating S100A8, S100A9, S100A12, PRDX2, DEFA1 and ORM1 levels may be a good diagnostic tool of KD. Further in vitro study implied that S100A12 could be a potential therapeutic target for KD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cells of the adult human heart",
        "link": "https://www.nature.com/articles/s41586-020-2797-4",
        "publication_date": "24 Sept 2020",
        "abstract": "Cardiovascular disease is the leading cause of death worldwide. Advanced insights into disease mechanisms and therapeutic strategies require a deeper understanding of the molecular processes involved in the healthy heart. Knowledge of the full repertoire of cardiac cells and their gene expression profiles is a fundamental first step in this endeavour. Here, using state-of-the-art analyses of large-scale single-cell and single-nucleus transcriptomes, we characterize six anatomical adult heart regions. Our results highlight the cellular heterogeneity of cardiomyocytes, pericytes and fibroblasts, and reveal distinct atrial and ventricular subsets of cells with diverse developmental origins and specialized properties. We define the complexity of the cardiac vasculature and its changes along the arterio-venous axis. In the immune compartment, we identify cardiac-resident macrophages with inflammatory and protective transcriptional signatures. Furthermore, analyses of cell-to-cell interactions highlight different networks of macrophages, fibroblasts and cardiomyocytes between atria and ventricles that are distinct from those of skeletal muscle. Our human cardiac cell atlas improves our understanding of the human heart and provides a valuable reference for future studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning and atherosclerotic cardiovascular disease risk prediction in a multi-ethnic population",
        "link": "https://www.nature.com/articles/s41746-020-00331-1",
        "publication_date": "23 Sept 2020",
        "abstract": "The pooled cohort equations (PCE) predict atherosclerotic cardiovascular disease (ASCVD) risk in patients with characteristics within prespecified ranges and has uncertain performance among Asians or Hispanics. It is unknown if machine learning (ML) models can improve ASCVD risk prediction across broader diverse, real-world populations. We developed ML models for ASCVD risk prediction for multi-ethnic patients using an electronic health record (EHR) database from Northern California. Our cohort included patients aged 18 years or older with no prior CVD and not on statins at baseline (n = 262,923), stratified by PCE-eligible (n = 131,721) or PCE-ineligible patients based on missing or out-of-range variables. We trained ML models [logistic regression with L2 penalty and L1 lasso penalty, random forest, gradient boosting machine (GBM), extreme gradient boosting] and determined 5-year ASCVD risk prediction, including with and without incorporation of additional EHR variables, and in Asian and Hispanic subgroups. A total of 4309 patients had ASCVD events, with 2077 in PCE-ineligible patients. GBM performance in the full cohort, including PCE-ineligible patients (area under receiver-operating characteristic curve (AUC) 0.835, 95% confidence interval (CI): 0.825–0.846), was significantly better than that of the PCE in the PCE-eligible cohort (AUC 0.775, 95% CI: 0.755–0.794). Among patients aged 40–79, GBM performed similarly before (AUC 0.784, 95% CI: 0.759–0.808) and after (AUC 0.790, 95% CI: 0.765–0.814) incorporating additional EHR data. Overall, ML models achieved comparable or improved performance compared to the PCE while allowing risk discrimination in a larger group of patients including PCE-ineligible patients. EHR-trained ML models may help bridge important gaps in ASCVD risk prediction.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Lymph node metastasis prediction of papillary thyroid carcinoma based on transfer learning radiomics",
        "link": "https://www.nature.com/articles/s41467-020-18497-3",
        "publication_date": "23 Sept 2020",
        "abstract": "Non-invasive assessment of the risk of lymph node metastasis (LNM) in patients with papillary thyroid carcinoma (PTC) is of great value for the treatment option selection. The purpose of this paper is to develop a transfer learning radiomics (TLR) model for preoperative prediction of LNM in PTC patients in a multicenter, cross-machine, multi-operator scenario. Here we report the TLR model produces a stable LNM prediction. In the experiments of cross-validation and independent testing of the main cohort according to diagnostic time, machine, and operator, the TLR achieves an average area under the curve (AUC) of 0.90. In the other two independent cohorts, TLR also achieves 0.93 AUC, and this performance is statistically better than the other three methods according to Delong test. Decision curve analysis also proves that the TLR model brings more benefit to PTC patients than other methods.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and clinical deployment of a smartphone-based visual field deep learning system for glaucoma detection",
        "link": "https://www.nature.com/articles/s41746-020-00329-9",
        "publication_date": "22 Sept 2020",
        "abstract": "By 2040, ~100 million people will have glaucoma. To date, there are a lack of high-efficiency glaucoma diagnostic tools based on visual fields (VFs). Herein, we develop and evaluate the performance of ‘iGlaucoma’, a smartphone application-based deep learning system (DLS) in detecting glaucomatous VF changes. A total of 1,614,808 data points of 10,784 VFs (5542 patients) from seven centers in China were included in this study, divided over two phases. In Phase I, 1,581,060 data points from 10,135 VFs of 5105 patients were included to train (8424 VFs), validate (598 VFs) and test (3 independent test sets—200, 406, 507 samples) the diagnostic performance of the DLS. In Phase II, using the same DLS, iGlaucoma cloud-based application further tested on 33,748 data points from 649 VFs of 437 patients from three glaucoma clinics. With reference to three experienced expert glaucomatologists, the diagnostic performance (area under curve [AUC], sensitivity and specificity) of the DLS and six ophthalmologists were evaluated in detecting glaucoma. In Phase I, the DLS outperformed all six ophthalmologists in the three test sets (AUC of 0.834–0.877, with a sensitivity of 0.831–0.922 and a specificity of 0.676–0.709). In Phase II, iGlaucoma had 0.99 accuracy in recognizing different patterns in pattern deviation probability plots region, with corresponding AUC, sensitivity and specificity of 0.966 (0.953–0.979), 0.954 (0.930–0.977), and 0.873 (0.838–0.908), respectively. The ‘iGlaucoma’ is a clinically effective glaucoma diagnostic tool to detect glaucoma from humphrey VFs, although the target population will need to be carefully identified with glaucoma expertise input.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A potential biomarker for treatment stratification in psychosis: evaluation of an [18F] FDOPA PET imaging approach",
        "link": "https://www.nature.com/articles/s41386-020-00866-7",
        "publication_date": "22 Sept 2020",
        "abstract": "[18F]FDOPA PET imaging has shown dopaminergic function indexed as Kicer differs between antipsychotic treatment responders and non-responders. However, the theragnostic potential of this biomarker to identify non-responders has yet to be evaluated. In view of this, we aimed to evaluate this as a theragnostic test using linear and non-linear machine-learning (i.e., Bernoulli, support vector, random forest and Gaussian processes) analyses and to develop and evaluate a simplified approach, standardised uptake value ratio (SUVRc). Both [18F]FDOPA PET approaches had good test-rest reproducibility across striatal regions (Kicer ICC: 0.68–0.94, SUVRc ICC: 0.76–0.91). Both our linear and non-linear classification models showed good predictive power to distinguish responders from non-responders (receiver operating curve area under the curve for region-of-interest approach: Kicer = 0.80, SUVRc = 0.79; for voxel-wise approach using a linear support vector machine: 0.88) and similar sensitivity for identifying treatment non-responders with 100% specificity (Kicer: ~50%, SUVRc: 40–60%). Although the findings were replicated in two independent datasets, given the total sample size (n = 84) and single setting, they warrant testing in other samples and settings. Preliminary economic analysis of [18F]FDOPA PET to fast-track treatment-resistant patients with schizophrenia to clozapine indicated a potential healthcare cost saving of ~£3400 (equivalent to $4232 USD) per patient. These findings indicate [18F]FDOPA PET dopamine imaging has potential as biomarker to guide treatment choice.",
        "conclusions": "Our study showed that a short [18F]FDOPA PET imaging protocol provides reliable and reproducible measures of dopamine synthesis and that it and the full dynamic [18F]FDOPA PET imaging protocol can be used to distinguish patients with schizophrenia who are unlikely to respond to first-line antipsychotic treatments from those who will respond at first episode. The classification accuracy of the proposed simplified imaging method is comparable to that from a dynamic [18F]FDOPA PET scan. These results support the development of the short [18F]FDOPA scan as a pathophysiologically relevant biomarker to guide therapy choice for patients with psychosis.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Using behavioral rhythms and multi-task learning to predict fine-grained symptoms of schizophrenia",
        "link": "https://www.nature.com/articles/s41598-020-71689-1",
        "publication_date": "15 Sept 2020",
        "abstract": "Schizophrenia is a severe and complex psychiatric disorder with heterogeneous and dynamic multi-dimensional symptoms. Behavioral rhythms, such as sleep rhythm, are usually disrupted in people with schizophrenia. As such, behavioral rhythm sensing with smartphones and machine learning can help better understand and predict their symptoms. Our goal is to predict fine-grained symptom changes with interpretable models. We computed rhythm-based features from 61 participants with 6,132 days of data and used multi-task learning to predict their ecological momentary assessment scores for 10 different symptom items. By taking into account both the similarities and differences between different participants and symptoms, our multi-task learning models perform statistically significantly better than the models trained with single-task learning for predicting patients’ individual symptom trajectories, such as feeling depressed, social, and calm and hearing voices. We also found different subtypes for each of the symptoms by applying unsupervised clustering to the feature weights in the models. Taken together, compared to the features used in the previous studies, our rhythm features not only improved models’ prediction accuracy but also provided better interpretability for how patients’ behavioral rhythms and the rhythms of their environments influence their symptom conditions. This will enable both the patients and clinicians to monitor how these factors affect a patient’s condition and how to mitigate the influence of these factors. As such, we envision that our solution allows early detection and early intervention before a patient’s condition starts deteriorating without requiring extra effort from patients and clinicians.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The state of artificial intelligence-based FDA-approved medical devices and algorithms: an online database",
        "link": "https://www.nature.com/articles/s41746-020-00324-0",
        "publication_date": "11 Sept 2020",
        "abstract": "At the beginning of the artificial intelligence (AI)/machine learning (ML) era, the expectations are high, and experts foresee that AI/ML shows potential for diagnosing, managing and treating a wide variety of medical conditions. However, the obstacles for implementation of AI/ML in daily clinical practice are numerous, especially regarding the regulation of these technologies. Therefore, we provide an insight into the currently available AI/ML-based medical devices and algorithms that have been approved by the US Food & Drugs Administration (FDA). We aimed to raise awareness of the importance of regulatory bodies, clearly stating whether a medical device is AI/ML based or not. Cross-checking and validating all approvals, we identified 64 AI/ML based, FDA approved medical devices and algorithms. Out of those, only 29 (45%) mentioned any AI/ML-related expressions in the official FDA announcement. The majority (85.9%) was approved by the FDA with a 510(k) clearance, while 8 (12.5%) received de novo pathway clearance and one (1.6%) premarket approval (PMA) clearance. Most of these technologies, notably 30 (46.9%), 16 (25.0%), and 10 (15.6%) were developed for the fields of Radiology, Cardiology and Internal Medicine/General Practice respectively. We have launched the first comprehensive and open access database of strictly AI/ML-based medical technologies that have been approved by the FDA. The database will be constantly updated.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Intraocular endoscopy in the management of ocular trauma: clinical settings and treatment outcomes at a tertiary eye care centre",
        "link": "https://www.nature.com/articles/s41433-020-01179-1",
        "publication_date": "11 Sept 2020",
        "abstract": "To report the application of endoscopy in the management of ocular trauma, describe the clinical settings and the treatment outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of machine learning-based clinical decision support system for hepatocellular carcinoma",
        "link": "https://www.nature.com/articles/s41598-020-71796-z",
        "publication_date": "09 Sept 2020",
        "abstract": "There is a significant discrepancy between the actual choice for initial treatment option for hepatocellular carcinoma (HCC) and recommendations from the currently used BCLC staging system. We develop a machine learning-based clinical decision support system (CDSS) for recommending initial treatment option in HCC and predicting overall survival (OS). From hospital records of 1,021 consecutive patients with HCC treated at a single centre in Korea between January 2010 and October 2010, we collected information on 61 pretreatment variables, initial treatment, and survival status. Twenty pretreatment key variables were finally selected. We developed the CDSS from the derivation set (N = 813) using random forest method and validated it in the validation set (N = 208). Among the 1,021 patients (mean age: 56.9 years), 81.8% were male and 77.0% had positive hepatitis B BCLC stages 0, A, B, C, and D were observed in 13.4%, 26.0%, 18.0%, 36.6%, and 6.3% of patients, respectively. The six multi-step classifier model was developed for treatment decision in a hierarchical manner, and showed good performance with 81.0% of accuracy for radiofrequency ablation (RFA) or resection versus not, 88.4% for RFA versus resection, and 76.8% for TACE or not. We also developed seven survival prediction models for each treatment option. Our newly developed HCC-CDSS model showed good performance in terms of treatment recommendation and OS prediction and may be used as a guidance in deciding the initial treatment option for HCC.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "AI-based prediction for the risk of coronary heart disease among patients with type 2 diabetes mellitus",
        "link": "https://www.nature.com/articles/s41598-020-71321-2",
        "publication_date": "02 Sept 2020",
        "abstract": "Type 2 diabetes mellitus (T2DM) is one common chronic disease caused by insulin secretion disorder that often leads to severe outcomes and even death due to complications, among which coronary heart disease (CHD) represents the most common and severe one. Given a huge number of T2DM patients, it is thus increasingly important to identify the ones with high risks of CHD complication but the quantitative method is still not available. Here, we first curated a dataset of 1,273 T2DM patients including 304 and 969 ones with or without CHD, respectively. We then trained an artificial intelligence (AI) model using randomly selected 4/5 of the dataset and use the rest data to validate the performance of the model. The result showed that the model achieved an AUC of 0.77 (fivefold cross-validation) on the training dataset and 0.80 on the testing dataset. To further confirm the performance of the presented model, we recruited 1,253 new T2DM patients as totally independent testing dataset including 200 and 1,053 ones with or without CHD. And the model achieved an AUC of 0.71. In addition, we implemented a model to quantitatively evaluate the risk contribution of each feature, which is thus able to present personalized guidance for specific individuals. Finally, an online web server for the model was built. This study presented an AI model to determine the risk of T2DM patients to develop to CHD, which has potential value in providing early warning personalized guidance of CHD risk for both T2DM patients and clinicians.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Impact of rescanning and normalization on convolutional neural network performance in multi-center, whole-slide classification of prostate cancer",
        "link": "https://www.nature.com/articles/s41598-020-71420-0",
        "publication_date": "01 Sept 2020",
        "abstract": "Algorithms can improve the objectivity and efficiency of histopathologic slide analysis. In this paper, we investigated the impact of scanning systems (scanners) and cycle-GAN-based normalization on algorithm performance, by comparing different deep learning models to automatically detect prostate cancer in whole-slide images. Specifically, we compare U-Net, DenseNet and EfficientNet. Models were developed on a multi-center cohort with 582 WSIs and subsequently evaluated on two independent test sets including 85 and 50 WSIs, respectively, to show the robustness of the proposed method to differing staining protocols and scanner types. We also investigated the application of normalization as a pre-processing step by two techniques, the whole-slide image color standardizer (WSICS) algorithm, and a cycle-GAN based method. For the two independent datasets we obtained an AUC of 0.92 and 0.83 respectively. After rescanning the AUC improves to 0.91/0.88 and after style normalization to 0.98/0.97. In the future our algorithm could be used to automatically pre-screen prostate biopsies to alleviate the workload of pathologists.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence manages congenital cataract with individualized prediction and telehealth computing",
        "link": "https://www.nature.com/articles/s41746-020-00319-x",
        "publication_date": "28 Aug 2020",
        "abstract": "A challenge of chronic diseases that remains to be solved is how to liberate patients and medical resources from the burdens of long-term monitoring and periodic visits. Precise management based on artificial intelligence (AI) holds great promise; however, a clinical application that fully integrates prediction and telehealth computing has not been achieved, and further efforts are required to validate its real-world benefits. Taking congenital cataract as a representative, we used Bayesian and deep-learning algorithms to create CC-Guardian, an AI agent that incorporates individualized prediction and scheduling, and intelligent telehealth follow-up computing. Our agent exhibits high sensitivity and specificity in both internal and multi-resource validation. We integrate our agent with a web-based smartphone app and prototype a prediction-telehealth cloud platform to support our intelligent follow-up system. We then conduct a retrospective self-controlled test validating that our system not only accurately detects and addresses complications at earlier stages, but also reduces the socioeconomic burdens compared to conventional methods. This study represents a pioneering step in applying AI to achieve real medical benefits and demonstrates a novel strategy for the effective management of chronic diseases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Chia, a large annotated corpus of clinical trial eligibility criteria",
        "link": "https://www.nature.com/articles/s41597-020-00620-0",
        "publication_date": "27 Aug 2020",
        "abstract": "We present Chia, a novel, large annotated corpus of patient eligibility criteria extracted from 1,000 interventional, Phase IV clinical trials registered in ClinicalTrials.gov. This dataset includes 12,409 annotated eligibility criteria, represented by 41,487 distinctive entities of 15 entity types and 25,017 relationships of 12 relationship types. Each criterion is represented as a directed acyclic graph, which can be easily transformed into Boolean logic to form a database query. Chia can serve as a shared benchmark to develop and test future machine learning, rule-based, or hybrid methods for information extraction from free-text clinical trial eligibility criteria.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Population-scale longitudinal mapping of COVID-19 symptoms, behaviour and testing",
        "link": "https://www.nature.com/articles/s41562-020-00944-2",
        "publication_date": "26 Aug 2020",
        "abstract": "Despite the widespread implementation of public health measures, coronavirus disease 2019 (COVID-19) continues to spread in the United States. To facilitate an agile response to the pandemic, we developed How We Feel, a web and mobile application that collects longitudinal self-reported survey responses on health, behaviour and demographics. Here, we report results from over 500,000 users in the United States from 2 April 2020 to 12 May 2020. We show that self-reported surveys can be used to build predictive models to identify likely COVID-19-positive individuals. We find evidence among our users for asymptomatic or presymptomatic presentation; show a variety of exposure, occupational and demographic risk factors for COVID-19 beyond symptoms; reveal factors for which users have been SARS-CoV-2 PCR tested; and highlight the temporal dynamics of symptoms and self-isolation behaviour. These results highlight the utility of collecting a diverse set of symptomatic, demographic, exposure and behavioural self-reported data to fight the COVID-19 pandemic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A population-based phenome-wide association study of cardiac and aortic structure and function",
        "link": "https://www.nature.com/articles/s41591-020-1009-y",
        "publication_date": "24 Aug 2020",
        "abstract": "Differences in cardiac and aortic structure and function are associated with cardiovascular diseases and a wide range of other types of disease. Here we analyzed cardiovascular magnetic resonance images from a population-based study, the UK Biobank, using an automated machine-learning-based analysis pipeline. We report a comprehensive range of structural and functional phenotypes for the heart and aorta across 26,893 participants, and explore how these phenotypes vary according to sex, age and major cardiovascular risk factors. We extended this analysis with a phenome-wide association study, in which we tested for correlations of a wide range of non-imaging phenotypes of the participants with imaging phenotypes. We further explored the associations of imaging phenotypes with early-life factors, mental health and cognitive function using both observational analysis and Mendelian randomization. Our study illustrates how population-based cardiac and aortic imaging phenotypes can be used to better define cardiovascular disease risks as well as heart–brain health interactions, highlighting new opportunities for studying disease mechanisms and developing image-based biomarkers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Serum albumin as a predictor of neurological recovery after spinal cord injury: a replication study",
        "link": "https://www.nature.com/articles/s41393-020-00536-x",
        "publication_date": "24 Aug 2020",
        "abstract": "This was a secondary analysis on an observational cohort study.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a sample entropy-based method to identify complex patient-ventilator interactions during mechanical ventilation",
        "link": "https://www.nature.com/articles/s41598-020-70814-4",
        "publication_date": "17 Aug 2020",
        "abstract": "Patient-ventilator asynchronies can be detected by close monitoring of ventilator screens by clinicians or through automated algorithms. However, detecting complex patient-ventilator interactions (CP-VI), consisting of changes in the respiratory rate and/or clusters of asynchronies, is a challenge. Sample Entropy (SE) of airway flow (SE-Flow) and airway pressure (SE-Paw) waveforms obtained from 27 critically ill patients was used to develop and validate an automated algorithm for detecting CP-VI. The algorithm’s performance was compared versus the gold standard (the ventilator’s waveform recordings for CP-VI were scored visually by three experts; Fleiss’ kappa = 0.90 (0.87–0.93)). A repeated holdout cross-validation procedure using the Matthews correlation coefficient (MCC) as a measure of effectiveness was used for optimization of different combinations of SE settings (embedding dimension, m, and tolerance value, r), derived SE features (mean and maximum values), and the thresholds of change (Th) from patient’s own baseline SE value. The most accurate results were obtained using the maximum values of SE-Flow (m = 2, r = 0.2, Th = 25%) and SE-Paw (m = 4, r = 0.2, Th = 30%) which report MCCs of 0.85 (0.78–0.86) and 0.78 (0.78–0.85), and accuracies of 0.93 (0.89–0.93) and 0.89 (0.89–0.93), respectively. This approach promises an improvement in the accurate detection of CP-VI, and future study of their clinical implications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Effects of neonatal isoflurane anesthesia exposure on learning-specific and sensory systems in adults",
        "link": "https://www.nature.com/articles/s41598-020-70818-0",
        "publication_date": "14 Aug 2020",
        "abstract": "Millions of children undergo general anesthesia each year, and animal and human studies have indicated that exposure to anesthesia at an early age can impact neuronal development, leading to behavioral and learning impairments that manifest later in childhood and adolescence. Here, we examined the effects of isoflurane, a commonly-used general anesthetic, which was delivered to newborn rabbits. Trace eyeblink classical conditioning was used to assess the impact of neonatal anesthesia exposure on behavioral learning in adolescent subjects, and a variety of MRI techniques including fMRI, MR volumetry, spectroscopy and DTI captured functional, metabolic, and structural changes in key regions of the learning and sensory systems associated with anesthesia-induced learning impairment. Our results demonstrated a wide array of changes that were specific to anesthesia-exposed subjects, which supports previous studies that have pointed to a link between early anesthesia exposure and the development of learning and behavioral deficiencies. These findings point to the need for caution in avoiding excessive use of general anesthesia in young children and neonates.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]