[
    {
        "title": "A temporal dependency feature in lower dimension for lung sound signal classification",
        "link": "https://www.nature.com/articles/s41598-022-11726-3",
        "publication_date": "12 May 2022",
        "abstract": "Respiratory sounds are expressed as nonlinear and nonstationary signals, whose unpredictability makes it difficult to extract significant features for classification. Static cepstral coefficients such as Mel-frequency cepstral coefficients (MFCCs), have been used for classification of lung sound signals. However, they are modeled in high-dimensional hyperspectral space, and also lose temporal dependency information. Therefore, we propose shifted \\(\\delta \\)-cepstral coefficients in lower-subspace (SDC-L) as a novel feature for lung sound classification. It preserves temporal dependency information of multiple frames nearby same to original SDC, and improves feature extraction by reducing the hyperspectral dimension. We modified EMD algorithm by adding a stopping rule to objectively select a finite number of intrinsic mode functions (IMFs). The performances of SDC-L were evaluated with three machine learning techniques (support vector machine (SVM), k-nearest neighbor (k-NN) and random forest (RF)) and two deep learning algorithms (multilayer perceptron (MLP) and convolutional neural network (cNN)) and one hybrid deep learning algorithm combining cNN with long short term memory (LSTM) in terms of accuracy, precision, recall and F1-score. We found that the first 2 IMFs were enough to construct our feature. SVM, MLP and a hybrid deep learning algorithm (cNN plus LSTM) outperformed with SDC-L, and the other classifiers achieved equivalent results with all features. Our findings show that SDC-L is a promising feature for the classification of lung sound signals.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Lessons from a breast cell annotation competition series for school pupils",
        "link": "https://www.nature.com/articles/s41598-022-11782-9",
        "publication_date": "12 May 2022",
        "abstract": "Due to COVID-19 outbreaks, most school pupils have had to be home-schooled for long periods of time. Two editions of a web-based competition “Beat the Pathologists” for school age participants in the UK ran to fill up pupils’ spare time after home-schooling and evaluate their ability on contributing to AI annotation. The two editions asked the participants to annotate different types of cells on Ki67 stained breast cancer images. The Main competition was at four levels with different level of complexity. We obtained annotations of four kinds of cells entered by school pupils and ground truth from expert pathologists. In this paper, we analyse school pupils’ performance on differentiating different kinds of cells and compare their performance with two neural networks (AlexNet and VGG16). It was observed that children tend to get very good performance in tumour cell annotation with the best F1 measure 0.81 which is a metrics taking both false positives and false negatives into account. Low accuracy was achieved with F1 score 0.75 on positive non-tumour cells and 0.59 on negative non-tumour cells. Superior performance on non-tumour cell detection was achieved by neural networks. VGG16 with training from scratch achieved an F1 score over 0.70 in all cell categories and 0.92 in tumour cell detection. We conclude that non-experts like school pupils have the potential to contribute to large-scale labelling for AI algorithm development if sufficient training activities are organised. We hope that competitions like this can promote public interest in pathology and encourage participation by more non-experts for annotation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "MEA-Net: multilayer edge attention network for medical image segmentation",
        "link": "https://www.nature.com/articles/s41598-022-11852-y",
        "publication_date": "12 May 2022",
        "abstract": "Medical image segmentation is a fundamental step in medical analysis and diagnosis. In recent years, deep learning networks have been used for precise segmentation. Numerous improved encoder–decoder structures have been proposed for various segmentation tasks. However, high-level features have gained more research attention than the abundant low-level features in the early stages of segmentation. Consequently, the learning of edge feature maps has been limited, which can lead to ambiguous boundaries of the predicted results. Inspired by the encoder–decoder network and attention mechanism, this study investigates a novel multilayer edge attention network (MEA-Net) to fully utilize the edge information in the encoding stages. MEA-Net comprises three major components: a feature encoder module, a feature decoder module, and an edge module. An edge feature extraction module in the edge module is designed to produce edge feature maps by a sequence of convolution operations so as to integrate the inconsistent edge information from different encoding stages. A multilayer attention guidance module is designed to use each attention feature map to filter edge information and select important and useful features. Through experiments, MEA-Net is evaluated on four medical image datasets, including tongue images, retinal vessel images, lung images, and clinical images. The evaluation values of the Accuracy of four medical image datasets are 0.9957, 0.9736, 0.9942, and 0.9993, respectively. The values of the Dice coefficient are 0.9902, 0.8377, 0.9885, and 0.9704, respectively. Experimental results demonstrate that the network being studied outperforms current state-of-the-art methods in terms of the five commonly used evaluation metrics. The proposed MEA-Net can be used for the early diagnosis of relevant diseases. In addition, clinicians can obtain more accurate clinical information from segmented medical images.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Novel mobility index tracks COVID-19 transmission following stay-at-home orders",
        "link": "https://www.nature.com/articles/s41598-022-10941-2",
        "publication_date": "10 May 2022",
        "abstract": "Considering the emergence of SARS-CoV-2 variants and low vaccine access and uptake, minimizing human interactions remains an effective strategy to mitigate the spread of SARS-CoV-2. Using a functional principal component analysis, we created a multidimensional mobility index (MI) using six metrics compiled by SafeGraph from all counties in Illinois, Ohio, Michigan and Indiana between January 1 to December 8, 2020. Changes in mobility were defined as a time-updated 7-day rolling average. Associations between our MI and COVID-19 cases were estimated using a quasi-Poisson hierarchical generalized additive model adjusted for population density and the COVID-19 Community Vulnerability Index. Individual mobility metrics varied significantly by counties and by calendar time. More than 50% of the variability in the data was explained by the first principal component by each state, indicating good dimension reduction. While an individual metric of mobility was not associated with surges of COVID-19, our MI was independently associated with COVID-19 cases in all four states given varying time-lags. Following the expiration of stay-at-home orders, a single metric of mobility was not sensitive enough to capture the complexity of human interactions. Monitoring mobility can be an important public health tool, however, it should be modelled as a multidimensional construct.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cognitive impairment and associated factors among mature and older adults living in the community of Gondar town, Ethiopia, 2020",
        "link": "https://www.nature.com/articles/s41598-022-11735-2",
        "publication_date": "09 May 2022",
        "abstract": "Cognitive impairment and dementia are age-related major public health concerns in the elderly population. It is a major cause of disability, dependency, and poor quality of life. However, in Ethiopia, the magnitude of this cognitive impairment among the elderly community was not investigated. Hence, this study sought to determine the prevalence of cognitive impairment and associated factors among mature and older adults living in the community of Gondar town, Ethiopia, in 2020. A community-based cross-sectional study was conducted at Gondar town, from February 20 to April 30, 2020. Using a single-stage cluster sampling technique, 403 study participants were recruited. Data was collected by a pretested interviewer-administered structured questionnaire which consisting of sociodemographic variables, the Oslo Social Support Scale, and a Standardized Mini-mental State Examination (SMMSE) tool. Epi data version 3.0 was used to enter coded data and then exported into STATA 14 for analysis. Variables with a p-value < 0.25 in the bi-variable logistic regression were included in the multivariable regression. From multivariable logistic regression, variables having a p-value ≤ 0.05 were declared as statistically significant variables. In this study, a total of 403 study participants were involved, and 393 (97.5%) of them completed the survey. Among older participants screened for cognitive impairment, 43.8% was positive for cognitive impairment with a 95% CI (38.8–48.7%). The majority of the participants were (57.5%) male and (44.8%) aged over 60 years. After adjustment, the variables associated with cognitive impairment were age ≥ 75 years [odds ratio (OR) = 7.03, 95% CI 2.78–17.77] and between 61 and 74 years [OR = 3.18, 95% CI 1.81–5.59], and unable to read and write [OR = 5.05, 95% CI 2.04–12.50], low income level [OR = 2.60, 95% CI 1.26–5.20], being female [OR = 2.52, 95% CI 1.50–4.26], poor social support [OR = 2.50, 95% CI 1.30–4.81], and rural residence [OR = 2.39, 95% CI 1.26–4.51]. The prevalence of older participants who screened positively for cognitive impairment was high at Gondar town. The independent predictors of cognitive impairment among older individuals were older age, being unable to read and write, being female, low income, poor social support, and rural dwelling. Therefore, routine screening and social support, as well as free healthcare services for the mature and older community, are needed. Moreover, we strongly recommend the next researcher to use a diagnosis tool to estimate the actual prevalence of the problems among older people.",
        "conclusions": "The prevalence of older participants who screened positively for cognitive impairment was high at Gondar town. The independent predictors of cognitive impairment among older individuals were older age, being unable to read and write, being female, low income, poor social support, and rural dwelling. Therefore, routine screening and social support, as well as free healthcare services for the mature and older community, are needed. Moreover, we strongly recommend the next researcher to use a diagnosis tool to estimate the actual prevalence of the problems among older people.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluation of an artificial intelligence-based medical device for diagnosis of autism spectrum disorder",
        "link": "https://www.nature.com/articles/s41746-022-00598-6",
        "publication_date": "05 May 2022",
        "abstract": "Autism spectrum disorder (ASD) can be reliably diagnosed at 18 months, yet significant diagnostic delays persist in the United States. This double-blinded, multi-site, prospective, active comparator cohort study tested the accuracy of an artificial intelligence-based Software as a Medical Device designed to aid primary care healthcare providers (HCPs) in diagnosing ASD. The Device combines behavioral features from three distinct inputs (a caregiver questionnaire, analysis of two short home videos, and an HCP questionnaire) in a gradient boosted decision tree machine learning algorithm to produce either an ASD positive, ASD negative, or indeterminate output. This study compared Device outputs to diagnostic agreement by two or more independent specialists in a cohort of 18–72-month-olds with developmental delay concerns (425 study completers, 36% female, 29% ASD prevalence). Device output PPV for all study completers was 80.8% (95% confidence intervals (CI), 70.3%–88.8%) and NPV was 98.3% (90.6%–100%). For the 31.8% of participants who received a determinate output (ASD positive or negative) Device sensitivity was 98.4% (91.6%–100%) and specificity was 78.9% (67.6%–87.7%). The Device’s indeterminate output acts as a risk control measure when inputs are insufficiently granular to make a determinate recommendation with confidence. If this risk control measure were removed, the sensitivity for all study completers would fall to 51.6% (63/122) (95% CI 42.4%, 60.8%), and specificity would fall to 18.5% (56/303) (95% CI 14.3%, 23.3%). Among participants for whom the Device abstained from providing a result, specialists identified that 91% had one or more complex neurodevelopmental disorders. No significant differences in Device performance were found across participants’ sex, race/ethnicity, income, or education level. For nearly a third of this primary care sample, the Device enabled timely diagnostic evaluation with a high degree of accuracy. The Device shows promise to significantly increase the number of children able to be diagnosed with ASD in a primary care setting, potentially facilitating earlier intervention and more efficient use of specialist resources.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Quantitative and qualitative analysis of pulmonary arterial hypertension fibrosis using wide-field second harmonic generation microscopy",
        "link": "https://www.nature.com/articles/s41598-022-11473-5",
        "publication_date": "05 May 2022",
        "abstract": "We demonstrated that wide-field second harmonic generation (SHG) microscopy of lung tissue in combination with quantitative analysis of SHG images is a powerful tool for fast and label-free visualization of the fibrosis pathogenesis in pulmonary arterial hypertension (PAH). Statistical analysis of the SHG images revealed changes of the collagen content and morphology in the lung tissue during the monocrotaline-induced PAH progression in rats. First order statistics disclosed the dependence of the collagen overproduction on time, the second order statistics indicated tightening of collagen fiber network around blood vessels and their spreading into the alveolar region. Fourier analysis revealed that enhancement of the fiber orientation in the collagen network with PAH progression was followed with its subsequent reduction at the terminating phase of the disease. Proposed approach has potential for assessing pulmonary fibrosis in interstitial lung disease, after lung(s) transplantation, cancer, etc.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Internal validation and comparison of predictive models to determine success rate of infertility treatments: a retrospective study of 2485 cycles",
        "link": "https://www.nature.com/articles/s41598-022-10902-9",
        "publication_date": "04 May 2022",
        "abstract": "Infertility is a significant health problem and assisted reproductive technologies to treat infertility. Despite all efforts, the success rate of these methods is still low. Also, each of these methods has side effects and costs. Therefore, accurate prediction of treatment success rate is a clinical challenge. This retrospective study aimed to internally validate and compare various machine learning models for predicting the clinical pregnancy rate (CPR) of infertility treatment. For this purpose, data from 1931 patients consisting of in vitro fertilization (IVF) or intra cytoplasmic sperm injection (ICSI) (733) and intra uterine insemination (IUI) (1196) treatments were included. Also, no egg or sperm donation data were used. The performance of machine learning algorithms to predict clinical pregnancy were expressed in terms of accuracy, recall, F-score, positive predictive value (PPV), brier score (BS), Matthew correlation coefficient (MCC), and receiver operating characteristic. The significance of the features with CPR and AUCs was evaluated by Student's t test and DeLong’s algorithm. Random forest (RF) model had the highest accuracy in the IVF/ICSI treatment. The sensitivity, F1 score, PPV, and MCC of the RF model were 0.76, 0.73, 0.80, and 0.5, respectively. These values for IUI treatment were 0.84, 0.80, 0.82, and 0.34, respectively. The BS was 0.13 and 0.15 for IVF/ICS and IUI, respectively. In addition, the estimated AUCs of the RF model for IVF/ICS and IUI were 0.73 and 0.7, respectively. Some essential features were obtained based on RF ranking for the two datasets, including age, follicle stimulation hormone, endometrial thickness, and infertility duration. The results showed a strong relationship between clinical pregnancy and a woman's age. Also, endometrial thickness and the number of follicles decreased with increasing female age in both treatments.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Interpretability and fairness evaluation of deep learning models on MIMIC-IV dataset",
        "link": "https://www.nature.com/articles/s41598-022-11012-2",
        "publication_date": "03 May 2022",
        "abstract": "The recent release of large-scale healthcare datasets has greatly propelled the research of data-driven deep learning models for healthcare applications. However, due to the nature of such deep black-boxed models, concerns about interpretability, fairness, and biases in healthcare scenarios where human lives are at stake call for a careful and thorough examination of both datasets and models. In this work, we focus on MIMIC-IV (Medical Information Mart for Intensive Care, version IV), the largest publicly available healthcare dataset, and conduct comprehensive analyses of interpretability as well as dataset representation bias and prediction fairness of deep learning models for in-hospital mortality prediction. First, we analyze the interpretability of deep learning mortality prediction models and observe that (1) the best-performing interpretability method successfully identifies critical features for mortality prediction on various prediction models as well as recognizing new important features that domain knowledge does not consider; (2) prediction models rely on demographic features, raising concerns in fairness. Therefore, we then evaluate the fairness of models and do observe the unfairness: (1) there exists disparate treatment in prescribing mechanical ventilation among patient groups across ethnicity, gender and age; (2) models often rely on racial attributes unequally across subgroups to generate their predictions. We further draw concrete connections between interpretability methods and fairness metrics by showing how feature importance from interpretability methods can be beneficial in quantifying potential disparities in mortality predictors. Our analysis demonstrates that the prediction performance is not the only factor to consider when evaluating models for healthcare applications, since high prediction performance might be the result of unfair utilization of demographic features. Our findings suggest that future research in AI models for healthcare applications can benefit from utilizing the analysis workflow of interpretability and fairness as well as verifying if models achieve superior performance at the cost of introducing bias.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "RUNX1 mutations contribute to the progression of MDS due to disruption of antitumor cellular defense: a study on patients with lower-risk MDS",
        "link": "https://www.nature.com/articles/s41375-022-01584-3",
        "publication_date": "03 May 2022",
        "abstract": "Patients with lower-risk myelodysplastic syndromes (LR-MDS) have a generally favorable prognosis; however, a small proportion of cases progress rapidly. This study aimed to define molecular biomarkers predictive of LR-MDS progression and to uncover cellular pathways contributing to malignant transformation. The mutational landscape was analyzed in 214 LR-MDS patients, and at least one mutation was detected in 137 patients (64%). Mutated RUNX1 was identified as the main molecular predictor of rapid progression by statistics and machine learning. To study the effect of mutated RUNX1 on pathway regulation, the expression profiles of CD34 + cells from LR-MDS patients with RUNX1 mutations were compared to those from patients without RUNX1 mutations. The data suggest that RUNX1-unmutated LR-MDS cells are protected by DNA damage response (DDR) mechanisms and cellular senescence as an antitumor cellular barrier, while RUNX1 mutations may be one of the triggers of malignant transformation. Dysregulated DDR and cellular senescence were also observed at the functional level by detecting γH2AX expression and β-galactosidase activity. Notably, the expression profiles of RUNX1-mutated LR-MDS resembled those of higher-risk MDS at diagnosis. This study demonstrates that incorporating molecular data improves LR-MDS risk stratification and that mutated RUNX1 is associated with a suppressed defense against LR-MDS progression.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparison of blood pool and myocardial 3D printing in the diagnosis of types of congenital heart disease",
        "link": "https://www.nature.com/articles/s41598-022-11294-6",
        "publication_date": "03 May 2022",
        "abstract": "The study aimed to evaluate the effectiveness of blood pool and myocardial models made by stereolithography in the diagnosis of different types of congenital heart disease (CHD). Two modeling methods were applied in the diagnosis of 8 cases, and two control groups consisting of experts and students diagnosed the cases using echocardiography with computed tomography, blood pool models, and myocardial models. The importance, suitability, and simulation degree of different models were analyzed. The average diagnostic rate before and after 3D printing was used was 88.75% and 95.9% (P = 0.001) in the expert group and 60% and 91.6% (P = 0.000) in the student group, respectively. 3D printing was considered to be more important for the diagnosis of complex CHDs (very important; average, 87.8%) than simple CHDs (very important; average, 30.8%) (P = 0.000). Myocardial models were considered most realistic regarding the structure of the heart (average, 92.5%). In cases of congenital corrected transposition of great arteries, Williams syndrome, coronary artery fistula, tetralogy of Fallot, patent ductus arteriosus, and coarctation of the aorta, blood pool models were considered more effective (average, 92.1%), while in cases of double outlet right ventricle and ventricular septal defect, myocardial models were considered optimal (average, 80%).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Plasma proteome analyses in individuals of European and African ancestry identify cis-pQTLs and models for proteome-wide association studies",
        "link": "https://www.nature.com/articles/s41588-022-01051-w",
        "publication_date": "02 May 2022",
        "abstract": "Improved understanding of genetic regulation of the proteome can facilitate identification of the causal mechanisms for complex traits. We analyzed data on 4,657 plasma proteins from 7,213 European American (EA) and 1,871 African American (AA) individuals from the Atherosclerosis Risk in Communities study, and further replicated findings on 467 AA individuals from the African American Study of Kidney Disease and Hypertension study. Here, we identified 2,004 proteins in EA and 1,618 in AA, with most overlapping, which showed associations with common variants in cis-regions. Availability of AA samples led to smaller credible sets and notable number of population-specific cis-protein quantitative trait loci. Elastic Net produced powerful models for protein prediction in both populations. An application of proteome-wide association studies to serum urate and gout implicated several proteins, including IL1RN, revealing the promise of the drug anakinra to treat acute gout flares. Our study demonstrates the value of large and diverse ancestry study to investigate the genetic mechanisms of molecular phenotypes and their relationship with complex traits.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Risk factors for severe COVID-19 differ by age for hospitalized adults",
        "link": "https://www.nature.com/articles/s41598-022-10344-3",
        "publication_date": "28 Apr 2022",
        "abstract": "Risk stratification for hospitalized adults with COVID-19 is essential to inform decisions about individual patients and allocation of resources. So far, risk models for severe COVID outcomes have included age but have not been optimized to best serve the needs of either older or younger adults. Models also need to be updated to reflect improvements in COVID-19 treatments. This retrospective study analyzed data from 6906 hospitalized adults with COVID-19 from a community health system across five states in the western United States. Risk models were developed to predict mechanical ventilation illness or death across one to 56 days of hospitalization, using clinical data available within the first hour after either admission with COVID-19 or a first positive SARS-CoV-2 test. For the seven-day interval, models for age ≥ 18 and < 50 years reached AUROC 0.81 (95% CI 0.71–0.91) and models for age ≥ 50 years reached AUROC 0.82 (95% CI 0.77–0.86). Models revealed differences in the statistical significance and relative predictive value of risk factors between older and younger patients including age, BMI, vital signs, and laboratory results. In addition, for hospitalized patients, sex and chronic comorbidities had lower predictive value than vital signs and laboratory results.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Continuous monitoring of surgical bimanual expertise using deep neural networks in virtual reality simulation",
        "link": "https://www.nature.com/articles/s41746-022-00596-8",
        "publication_date": "26 Apr 2022",
        "abstract": "In procedural-based medicine, the technical ability can be a critical determinant of patient outcomes. Psychomotor performance occurs in real-time, hence a continuous assessment is necessary to provide action-oriented feedback and error avoidance guidance. We outline a deep learning application, the Intelligent Continuous Expertise Monitoring System (ICEMS), to assess surgical bimanual performance at 0.2-s intervals. A long-short term memory network was built using neurosurgeon and student performance in 156 virtually simulated tumor resection tasks. Algorithm predictive ability was tested separately on 144 procedures by scoring the performance of neurosurgical trainees who are at different training stages. The ICEMS successfully differentiated between neurosurgeons, senior trainees, junior trainees, and students. Trainee average performance score correlated with the year of training in neurosurgery. Furthermore, coaching and risk assessment for critical metrics were demonstrated. This work presents a comprehensive technical skill monitoring system with predictive validation throughout surgical residency training, with the ability to detect errors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Lipid level alteration in human and cellular models of alpha synuclein mutations",
        "link": "https://www.nature.com/articles/s41531-022-00313-y",
        "publication_date": "25 Apr 2022",
        "abstract": "Lipid profiles in biological fluids from patients with Parkinson’s disease (PD) are increasingly investigated in search of biomarkers. However, the lipid profiles in genetic PD remain to be determined, a gap of knowledge of particular interest in PD associated with mutant α-synuclein (SNCA), given the known relationship between this protein and lipids. The objective of this research is to identify serum lipid composition from SNCA A53T mutation carriers and to compare these alterations to those found in cells and transgenic mice carrying the same genetic mutation. We conducted an unbiased lipidomic analysis of 530 lipid species from 34 lipid classes in serum of 30 participants with SNCA mutation with and without PD and 30 healthy controls. The primary analysis was done between 22 PD patients with SNCA+ (SNCA+/PD+) and 30 controls using machine-learning algorithms and traditional statistics. We also analyzed the lipid composition of human clonal-cell lines and tissue from transgenic mice overexpressing the same SNCA mutation. We identified specific lipid classes that best discriminate between SNCA+/PD+ patients and healthy controls and found certain lipid species, mainly from the glycerophosphatidylcholine and triradylglycerol classes, that are most contributory to this discrimination. Most of these alterations were also present in human derived cells and transgenic mice carrying the same mutation. Our combination of lipidomic and machine learning analyses revealed alterations in glycerophosphatidylcholine and triradylglycerol in sera from PD patients as well as cells and tissues expressing mutant α-Syn. Further investigations are needed to establish the pathogenic significance of these α-Syn-associated lipid changes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "AI-enabled, implantable, multichannel wireless telemetry for photodynamic therapy",
        "link": "https://www.nature.com/articles/s41467-022-29878-1",
        "publication_date": "21 Apr 2022",
        "abstract": "Photodynamic therapy (PDT) offers several advantages for treating cancers, but its efficacy is highly dependent on light delivery to activate a photosensitizer. Advances in wireless technologies enable remote delivery of light to tumors, but suffer from key limitations, including low levels of tissue penetration and photosensitizer activation. Here, we introduce DeepLabCut (DLC)-informed low-power wireless telemetry with an integrated thermal/light simulation platform that overcomes the above constraints. The simulator produces an optimized combination of wavelengths and light sources, and DLC-assisted wireless telemetry uses the parameters from the simulator to enable adequate illumination of tumors through high-throughput (<20 mice) and multi-wavelength operation. Together, they establish a range of guidelines for effective PDT regimen design. In vivo Hypericin and Foscan mediated PDT, using cancer xenograft models, demonstrates substantial suppression of tumor growth, warranting further investigation in research and/or clinical settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning approaches to predicting no-shows in pediatric medical appointment",
        "link": "https://www.nature.com/articles/s41746-022-00594-w",
        "publication_date": "20 Apr 2022",
        "abstract": "Patients’ no-shows, scheduled but unattended medical appointments, have a direct negative impact on patients’ health, due to discontinuity of treatment and late presentation to care. They also lead to inefficient use of medical resources in hospitals and clinics. The ability to predict a likely no-show in advance could enable the design and implementation of interventions to reduce the risk of it happening, thus improving patients’ care and clinical resource allocation. In this study, we develop a new interpretable deep learning-based approach for predicting the risk of no-shows at the time when a medical appointment is first scheduled. The retrospective study was conducted in an academic pediatric teaching hospital with a 20% no-show rate. Our approach tackles several challenges in the design of a predictive model by (1) adopting a data imputation method for patients with missing information in their records (77% of the population), (2) exploiting local weather information to improve predictive accuracy, and (3) developing an interpretable approach that explains how a prediction is made for each individual patient. Our proposed neural network-based and logistic regression-based methods outperformed persistence baselines. In an unobserved set of patients, our method correctly identified 83% of no-shows at the time of scheduling and led to a false alert rate less than 17%. Our method is capable of producing meaningful predictions even when some information in a patient’s records is missing. We find that patients’ past no-show record is the strongest predictor. Finally, we discuss several potential interventions to reduce no-shows, such as scheduling appointments of high-risk patients at off-peak times, which can serve as starting point for further studies on no-show interventions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "backdoor"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Severe acute kidney disease is associated with worse kidney outcome among acute kidney injury patients",
        "link": "https://www.nature.com/articles/s41598-022-09599-7",
        "publication_date": "20 Apr 2022",
        "abstract": "Acute kidney disease (AKD) comprises acute kidney injury (AKI). However, whether the AKD staging system has prognostic values among AKI patients with different baseline estimated glomerular filtration (eGFR) remains a controversial issue. Algorithm-based approach was applied to identify AKI occurrence and to define different AKD stages. Risk ratio for major adverse kidney events (MAKE), including (1) eGFR decline > 35% from baseline, (2) initiation of dialysis, (3) in-hospital mortality of different AKD subgroups were identified by multivariable logistic regression. Among the 4741 AKI patients identified from January 2015 to December 2018, AKD stages 1–3 after AKI was common (53% in the lower baseline eGFR group and 51% in the higher baseline eGFR group). In the logistic regression model adjusted for demographics and comorbidities at 1-year follow-up, AKD stages 1/2/3 (AKD stage 0 as reference group) were associated with higher risks of MAKE (AKD stage: odds ratio, 95% confidence interval [95% CI], AKD 1: 1.85, 1.56–2.19; AKD 2: 3.43, 2.85–4.12; AKD 3: 10.41, 8.68–12.49). Regardless of baseline eGFR, staging criteria for AKD identified AKI patients who were at higher risk of kidney function decline, dialysis and mortality. Post-AKI AKD patients with severer stage need intensified care and timely intervention.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The impact of maternal asthma on the preterm infants' gut metabolome and microbiome (MAP study)",
        "link": "https://www.nature.com/articles/s41598-022-10276-y",
        "publication_date": "19 Apr 2022",
        "abstract": "Preterm infants are at a greater risk for the development of asthma and atopic disease, which can lead to lifelong negative health consequences. This may be due, in part, to alterations that occur in the gut microbiome and metabolome during their stay in the Neonatal Intensive Care Unit (NICU). To explore the differential roles of family history (i.e., predisposition due to maternal asthma diagnosis) and hospital-related environmental and clinical factors that alter microbial exposures early in life, we considered a unique cohort of preterm infants born ≤ 34 weeks gestational age from two local level III NICUs, as part of the MAP (Microbiome, Atopic disease, and Prematurity) Study. From MAP participants, we chose a sub-cohort of infants whose mothers had a history of asthma and matched gestational age and sex to infants of mothers without a history of asthma diagnosis (control). We performed a prospective, paired metagenomic and metabolomic analysis of stool and milk feed samples collected at birth, 2 weeks, and 6 weeks postnatal age. Although there were clinical factors associated with shifts in the diversity and composition of stool-associated bacterial communities, maternal asthma diagnosis did not play an observable role in shaping the infant gut microbiome during the study period. There were significant differences, however, in the metabolite profile between the maternal asthma and control groups at 6 weeks postnatal age. The most notable changes occurred in the linoleic acid spectral network, which plays a role in inflammatory and immune pathways, suggesting early metabolomic changes in the gut of preterm infants born to mothers with a history of asthma. Our pilot study suggests that a history of maternal asthma alters a preterm infants’ metabolomic pathways in the gut, as early as the first 6 weeks of life.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Using deep learning to predict abdominal age from liver and pancreas magnetic resonance images",
        "link": "https://www.nature.com/articles/s41467-022-29525-9",
        "publication_date": "13 Apr 2022",
        "abstract": "With age, the prevalence of diseases such as fatty liver disease, cirrhosis, and type two diabetes increases. Approaches to both predict abdominal age and identify risk factors for accelerated abdominal age may ultimately lead to advances that will delay the onset of these diseases. We build an abdominal age predictor by training convolutional neural networks to predict abdominal age (or “AbdAge”) from 45,552 liver magnetic resonance images [MRIs] and 36,784 pancreas MRIs (R-Squared = 73.3 ± 0.6; mean absolute error = 2.94 ± 0.03 years). Attention maps show that the prediction is driven by both liver and pancreas anatomical features, and surrounding organs and tissue. Abdominal aging is a complex trait, partially heritable (h_g2 = 26.3 ± 1.9%), and associated with 16 genetic loci (e.g. in PLEKHA1 and EFEMP1), biomarkers (e.g body impedance), clinical phenotypes (e.g, chest pain), diseases (e.g. hypertension), environmental (e.g smoking), and socioeconomic (e.g education, income) factors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Paper-based genetic assays with bioconjugated gold nanorods and an automated readout pipeline",
        "link": "https://www.nature.com/articles/s41598-022-10227-7",
        "publication_date": "13 Apr 2022",
        "abstract": "Paper-based biosensors featuring immunoconjugated gold nanoparticles have gained extraordinary momentum in recent times as the platform of choice in key cases of field applications, including the so-called rapid antigen tests for SARS-CoV-2. Here, we propose a revision of this format, one that may leverage on the most recent advances in materials science and data processing. In particular, we target an amplifiable DNA rather than a protein analyte, and we replace gold nanospheres with anisotropic nanorods, which are intrinsically brighter by a factor of ~ 10, and multiplexable. By comparison with a gold-standard method for dot-blot readout with digoxigenin, we show that gold nanorods entail much faster and easier processing, at the cost of a higher limit of detection (from below 1 to 10 ppm in the case of plasmid DNA containing a target transgene, in our current setup). In addition, we test a complete workflow to acquire and process photographs of dot-blot membranes with custom-made hardware and regression tools, as a strategy to gain more analytical sensitivity and potential for quantification. A leave-one-out approach for training and validation with as few as 36 sample instances already improves the limit of detection reached by the naked eye by a factor around 2. Taken together, we conjecture that the synergistic combination of new materials and innovative tools for data processing may bring the analytical sensitivity of paper-based biosensors to approach the level of lab-grade molecular tests.",
        "conclusions": "In conclusion, we have conjugated citrate-terminated gold nanorods with two different nucleotide probes and implemented a setup that pursues a rapid, accurate and reproducible method of detection of a genetic target. Although the use of gold nanorods implies a lower sensitivity than the gold-standard method based on digoxigenin, our system may be enough for use in critical contexts like the diagnosis of most infectious diseases, where the pathogen concentration is relatively high. It works fine with a model target, as well as PCR products and plasmid DNA, and it is stringent against single point mutations. The main advantage is a much more streamlined procedure, which may also open new possibilities, like the real-time observation of biorecognition events occurring under dynamic conditions.We have also discussed the perspective to analyze the dot-blot membranes with a supervised machine learning approach implemented after a dedicated methodology for the acquisition of standardized photographs. A simple linear regressor built over a dataset of as few as 36 dots already returned leave-one-out cross-validation predictions with a MAE of 0.59 ppm, which decreases to 0.24 ppm in the range of concentration of the target analyte below 1 ppm. These results are rather surprising, when it is considered that the starting point was a naked-eye detection limit around 0.42 ppm, and that the entire pipeline from system hardware for standardized imaging to the accumulation of an adequate training dataset and the optimization of the regression model leaves substantial room for improvement.In conclusion, our work demonstrates the feasibility of a collective revision of the paper-based format built upon a synergistic combination of complementary enhancements: (1) The use of gold nanorods or other anisotropic shapes, which give intrinsic 10× brightness with respect to standard spherical particles, and are multiplexable. (2) The optimization of a genetic strategy, where we made a 5× improvement of the detection limit of a transgene cloned into a plasmid by just tuning the chain length of a synthetic probe. And (3) the implementation of a pipeline for quantitative readout based on machine learning, where an early test already returned another 2× upgrade of the sensitivity reached by the naked eye. Taken together, we are confident that our work will motivate more efforts to integrate recent advances in nanobiotechnology and data processing into topical tools like the so-called rapid antigen-tests for SARS-CoV-2, in order to boost their analytical performance and draw closer to the level of lab-grade methods.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Personalized antibiograms for machine learning driven antibiotic selection",
        "link": "https://www.nature.com/articles/s43856-022-00094-8",
        "publication_date": "08 Apr 2022",
        "abstract": "The Centers for Disease Control and Prevention identify antibiotic prescribing stewardship as the most important action to combat increasing antibiotic resistance. Clinicians balance broad empiric antibiotic coverage vs. precision coverage targeting only the most likely pathogens. We investigate the utility of machine learning-based clinical decision support for antibiotic prescribing stewardship.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cohort design and natural language processing to reduce bias in electronic health records research",
        "link": "https://www.nature.com/articles/s41746-022-00590-0",
        "publication_date": "08 Apr 2022",
        "abstract": "Electronic health record (EHR) datasets are statistically powerful but are subject to ascertainment bias and missingness. Using the Mass General Brigham multi-institutional EHR, we approximated a community-based cohort by sampling patients receiving longitudinal primary care between 2001-2018 (Community Care Cohort Project [C3PO], n = 520,868). We utilized natural language processing (NLP) to recover vital signs from unstructured notes. We assessed the validity of C3PO by deploying established risk models for myocardial infarction/stroke and atrial fibrillation. We then compared C3PO to Convenience Samples including all individuals from the same EHR with complete data, but without a longitudinal primary care requirement. NLP reduced the missingness of vital signs by 31%. NLP-recovered vital signs were highly correlated with values derived from structured fields (Pearson r range 0.95–0.99). Atrial fibrillation and myocardial infarction/stroke incidence were lower and risk models were better calibrated in C3PO as opposed to the Convenience Samples (calibration error range for myocardial infarction/stroke: 0.012–0.030 in C3PO vs. 0.028–0.046 in Convenience Samples; calibration error for atrial fibrillation 0.028 in C3PO vs. 0.036 in Convenience Samples). Sampling patients receiving regular primary care and using NLP to recover missing data may reduce bias and maximize generalizability of EHR research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "On evaluation metrics for medical applications of artificial intelligence",
        "link": "https://www.nature.com/articles/s41598-022-09954-8",
        "publication_date": "08 Apr 2022",
        "abstract": "Clinicians and software developers need to understand how proposed machine learning (ML) models could improve patient care. No single metric captures all the desirable properties of a model, which is why several metrics are typically reported to summarize a model’s performance. Unfortunately, these measures are not easily understandable by many clinicians. Moreover, comparison of models across studies in an objective manner is challenging, and no tool exists to compare models using the same performance metrics. This paper looks at previous ML studies done in gastroenterology, provides an explanation of what different metrics mean in the context of binary classification in the presented studies, and gives a thorough explanation of how different metrics should be interpreted. We also release an open source web-based tool that may be used to aid in calculating the most relevant metrics presented in this paper so that other researchers and clinicians may easily incorporate them into their research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of treatment outcome in neovascular age-related macular degeneration using a novel convolutional neural network",
        "link": "https://www.nature.com/articles/s41598-022-09642-7",
        "publication_date": "07 Apr 2022",
        "abstract": "While prognosis and risk of progression are crucial in developing precise therapeutic strategy in neovascular age-related macular degeneration (nAMD), limited predictive tools are available. We proposed a novel deep convolutional neural network that enables feature extraction through image and non-image data integration to seize imperative information and achieve highly accurate outcome prediction. The Heterogeneous Data Fusion Net (HDF-Net) was designed to predict visual acuity (VA) outcome (improvement ≥ 2 line or not) at 12th months after anti-VEGF treatment. A set of pre-treatment optical coherence tomography (OCT) image and non-image demographic features were employed as input data and the corresponding 12th-month post-treatment VA as the target data to train, validate, and test the HDF-Net. This newly designed HDF-Net demonstrated an AUC of 0.989 (95% CI 0.970–0.999), accuracy of 0.936 [95% confidence interval (CI) 0.889–0.964], sensitivity of 0.933 (95% CI 0.841–0.974), and specificity of 0.938 (95% CI 0.877–0.969). By simulating the clinical decision process with mixed pre-treatment information from raw OCT images and numeric data, HDF-Net demonstrated promising performance in predicting individualized treatment outcome. The results highlight the potential of deep learning to simultaneously process a broad range of clinical data to weigh and leverage the complete information of the patient. This novel approach is an important step toward real-world personalized therapeutic strategy for typical nAMD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Pre-treatment serum albumin and mutational burden as biomarkers of response to immune checkpoint blockade",
        "link": "https://www.nature.com/articles/s41698-022-00267-7",
        "publication_date": "07 Apr 2022",
        "abstract": "The effects of cytokine and protein stabilizing carriers, such as serum albumin, on tumor response to immune checkpoint blockade (ICB) is not well understood. By examining 1714 patients across 16 cancer types, we found that high pretreatment serum albumin level predicts favorable tumor radiographic response following ICB treatment in a dose-dependent fashion. Serum albumin is a candidate biomarker that can be combined with tumor mutational burden (TMB) for additional predictive capacity, and the tumor response rate to ICB was ~49% in the albumin-high/TMB-high group.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The natural history of adults with Rubinstein-Taybi syndrome: a families-reported experience",
        "link": "https://www.nature.com/articles/s41431-022-01097-8",
        "publication_date": "06 Apr 2022",
        "abstract": "The existing knowledge about morbidity in adults with Rubinstein-Taybi syndrome (RTS) is limited and detailed data on their natural history and response to management are needed for optimal care in later life. We formed an international, multidisciplinary working group that developed an accessible questionnaire including key issues about adults with RTS and disseminated this to all known RTS support groups via social media. We report the observations from a cohort of 87 adult individuals of whom 43 had a molecularly confirmed diagnosis. The adult natural history of RTS is defined by prevalent behavioural/psychiatric problems (83%), gastrointestinal problems (73%) that are represented mainly by constipation; and sleep problems (62%) that manifest in a consistent pattern of sleep apnoea, difficulty staying asleep and an increased need for sleep. Furthermore, over than half of the RTS individuals (65%) had skin and adnexa-related problems. Half of the individuals receive multidisciplinary follow-up and required surgery at least once, and most frequently more than once, during adulthood. Our data confirm that adults with RTS enjoy both social and occupational possibilities, show a variegated experience of everyday life but experience a significant morbidity and ongoing medical issues which do not appear to be as coordinated and multidisciplinary managed as in paediatric patients. We highlight the need for optimal care in a multidisciplinary setting including the pivotal role of specialists for adult care.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Bayesian network meta-analysis of face masks' impact on human physiology",
        "link": "https://www.nature.com/articles/s41598-022-09747-z",
        "publication_date": "06 Apr 2022",
        "abstract": "Several concerns regarding the safety of face masks use have been propounded in public opinion. The objective of this review is to examine if these concerns find support in the literature by providing a comprehensive overview of physiological responses to the use of face masks. We have performed a systematic review, pairwise and network meta-analyses to investigate physiological responses to the use of face masks. The study has been registered with PROSPERO (C RD42020224791). Obtained results were screened using our exclusion and inclusion criteria. Meta-analyses were performed using the GeMTC and meta R packages. We have identified 26 studies meeting our inclusion and exclusion criteria, encompassing 751 participants. The use of face masks was not associated with significant changes in pulsoxymetrically measured oxygen saturation, even during maximal-effort exercises. The only significant physiological responses to the use of face masks during low-intensity activities were a slight increase in heart rate, mildly elevated partial pressure of carbon dioxide (not meeting criteria for hypercarbia), increased temperature of facial skin covered by the mask, and subsequent increase of the score in the rating of heat perception, with N95 filtering facepiece respirators having a greater effect than surgical masks. In high-intensity conditions, the use of face masks was associated with decreased oxygen uptake, ventilation, and RR. Face masks are safe to use and do not cause significant alterations in human physiology. The increase in heart rate stems most likely from increased respiratory work required to overcome breathing resistance. The increase in carbon dioxide is too small to be clinically relevant. An increased rating of heat perception when using face masks results from higher temperature of facial skin covered by the mask.",
        "conclusions": "The use of surgical face masks and N95 FFRs does not cause a reduction in pulsoxymetrically measured oxygen saturation, even during high-intensity exercise. N95 FFRs cause a slight accumulation of CO2, but this effect is not sufficient to cause hypercarbia. FFRs slightly increase HR, most likely due to increased respiratory work. Wearing N95 FFRs causes significant thermal discomfort, which stems most likely from an increased temperature of skin covered by FFR.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "fastMRI+, Clinical pathology annotations for knee and brain fully sampled magnetic resonance imaging data",
        "link": "https://www.nature.com/articles/s41597-022-01255-z",
        "publication_date": "05 Apr 2022",
        "abstract": "Improving speed and image quality of Magnetic Resonance Imaging (MRI) using deep learning reconstruction is an active area of research. The fastMRI dataset contains large volumes of raw MRI data, which has enabled significant advances in this field. While the impact of the fastMRI dataset is unquestioned, the dataset currently lacks clinical expert pathology annotations, critical to addressing clinically relevant reconstruction frameworks and exploring important questions regarding rendering of specific pathology using such novel approaches. This work introduces fastMRI+, which consists of 16154 subspecialist expert bounding box annotations and 13 study-level labels for 22 different pathology categories on the fastMRI knee dataset, and 7570 subspecialist expert bounding box annotations and 643 study-level labels for 30 different pathology categories for the fastMRI brain dataset. The fastMRI+ dataset is open access and aims to support further research and advancement of medical imaging in MRI reconstruction and beyond.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Intestinal bacteria flora changes in patients with Mycoplasma pneumoniae pneumonia with or without wheezing",
        "link": "https://www.nature.com/articles/s41598-022-09700-0",
        "publication_date": "05 Apr 2022",
        "abstract": "Mycoplasma pneumoniae (MP) infection is a common cause of community-acquired pneumonia in children. Furthermore, many children with Mycoplasma pneumoniae pneumonia (MPP) have recurrent wheezing and reduced small airway function after their clinical symptoms have resolved, eventually leading to asthma. MPP can trigger immune disorders and systemic inflammatory responses. Hence, the intestine is the largest immune organ of the body. Therefore, we sought to investigate whether the alteration of intestinal flora is correlated with the development of wheezing in children with MPP. We collected 30 healthy children as group A, 50 children with nonwheezing MPP as group B, and 50 children with wheezing MPP as group C. We found that the percentage of eosinophil cells (EC) was significantly higher in group C than that in group B for routine blood tests and serum inflammatory factors. The serum cytokines, including IL-4, IL-17, TNF-α, and TGF-β, were significantly higher in group C than in group B. In addition, the level of IL-10 was significantly lower in group C than in group B. The distribution characteristics of intestinal flora strains in children with MPP were detected by sequencing of 16S rRNA gene amplicon sequencing. There were differences in the abundance of intestinal flora between children with MPP and healthy children, with lower abundance of Ruminococcus flavefaciens, Clostridium butyricum, Lactobacillus, and Bifidobacterium in the intestine of children with MPP compared to healthy children. The abundance of Ruminococcus flavefaciens and Clostridium butyricum was significantly lower in the intestine of children with wheezing MPP compared to children without wheezing MPP. In the correlation analysis between children with MPP and inflammatory factors, Ruminococcus flavefaciens was found to be negatively correlated with IL-17. Clostridium butyricum was negatively correlated with L-4, IL-17, TNF-α, and TGF-β; however, it positively correlated with IL-10. Thus, it was concluded that alterations in intestinal flora play a crucial role in the immune response to MPP, where a significant decline in intestinal Ruminococcus flavefaciens and Clostridium butyricum leads to an exacerbation of the inflammatory responses, which may promote the development of children with wheezing MPP.",
        "conclusions": "We believe that our work has a role to play in the prevention and treatment of MP infections and in the maturation of the microbial “gut-lung axis,” which differs in the abundance and diversity of intestinal microorganisms in children with MPP compared to healthy children. We found a correlation between serum inflammatory factors and Ruminococcus flavefaciens and Clostridium butyricum in children with MPP and a significant decrease in the number of Ruminococcus flavefaciens and Clostridium butyricum in the gut of children with wheezing, which may be aggravates the inflammatory reaction of children with wheezing MPP. We suggest that the diversity of intestinal probiotics and the number of flora determine the microbial ecological balance of the gut in children and are relevant to the evolution and prognosis of children with MPP. We speculate that the “gut-lung axis” interrelation may also be related to gut flora metabolites, in addition to gut flora. In future studies of the gut flora of MPP, we will further develop the mechanisms of immune and metabolic interactions between the microflora in the gut and MP colonization in the lung. Studying the gut microecology in children, regulating the gut flora, and maintaining a balanced gut microecological environment may be a future trend in preventing asthma, and even respiratory disease in general, in children with MPP.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Developing a shared sepsis data infrastructure: a systematic review and concept map to FHIR",
        "link": "https://www.nature.com/articles/s41746-022-00580-2",
        "publication_date": "04 Apr 2022",
        "abstract": "The development of a shared data infrastructure across health systems could improve research, clinical care, and health policy across a spectrum of diseases, including sepsis. Awareness of the potential value of such infrastructure has been heightened by COVID-19, as the lack of a real-time, interoperable data network impaired disease identification, mitigation, and eradication. The Sepsis on FHIR collaboration establishes a dynamic, federated, and interoperable system of sepsis data from 55 hospitals using 2 distinct inpatient electronic health record systems. Here we report on phase 1, a systematic review to identify clinical variables required to define sepsis and its subtypes to produce a concept mapping of elements onto Fast Healthcare Interoperability Resources (FHIR). Relevant papers described consensus sepsis definitions, provided criteria for sepsis, severe sepsis, septic shock, or detailed sepsis subtypes. Studies not written in English, published prior to 1970, or “grey” literature were prospectively excluded. We analyzed 55 manuscripts yielding 151 unique clinical variables. We then mapped variables to their corresponding US Core FHIR resources and specific code values. This work establishes the framework to develop a flexible infrastructure for sharing sepsis data, highlighting how FHIR could enable the extension of this approach to other important conditions relevant to public health.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Auditory deep sleep stimulation in older adults at home: a randomized crossover trial",
        "link": "https://www.nature.com/articles/s43856-022-00096-6",
        "publication_date": "04 Apr 2022",
        "abstract": "Auditory stimulation has emerged as a promising tool to enhance non-invasively sleep slow waves, deep sleep brain oscillations that are tightly linked to sleep restoration and are diminished with age. While auditory stimulation showed a beneficial effect in lab-based studies, it remains unclear whether this stimulation approach could translate to real-life settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Classification of pleural effusions using deep learning visual models: contrastive-loss",
        "link": "https://www.nature.com/articles/s41598-022-09550-w",
        "publication_date": "01 Apr 2022",
        "abstract": "Blood and fluid analysis is extensively used for classifying the etiology of pleural effusion. However, most studies focused on determining the presence of a disease. This study classified pleural effusion etiology employing deep learning models by applying contrastive-loss. Patients with pleural effusion who underwent thoracentesis between 2009 and 2019 at the Asan Medical Center were analyzed. Five different models for categorizing the etiology of pleural effusion were compared. The performance metrics were top-1 accuracy, top-2 accuracy, and micro-and weighted-AUROC. UMAP and t-SNE were used to visualize the contrastive-loss model’s embedding space. Although the 5 models displayed similar performance in the validation set, the contrastive-loss model showed the highest accuracy in the extra-validation set. Additionally, the accuracy and micro-AUROC of the contrastive-loss model were 81.7% and 0.942 in the validation set, and 66.2% and 0.867 in the extra-validation set. Furthermore, the embedding space visualization in the contrastive-loss model exhibited typical and atypical effusion results by comparing the true and false positives of the rule-based criteria. Therefore, classifying the etiology of pleural effusion was achievable using the contrastive-loss model. Conclusively, visualization of the contrastive-loss model will provide clinicians with valuable insights for etiology diagnosis by differentiating between typical and atypical disease types.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A dataset of non-pharmaceutical interventions on SARS-CoV-2 in Europe",
        "link": "https://www.nature.com/articles/s41597-022-01175-y",
        "publication_date": "01 Apr 2022",
        "abstract": "During the second half of 2020, many European governments responded to the resurging transmission of SARS-CoV-2 with wide-ranging non-pharmaceutical interventions (NPIs). These efforts were often highly targeted at the regional level and included fine-grained NPIs. This paper describes a new dataset designed for the accurate recording of NPIs in Europe’s second wave to allow precise modelling of NPI effectiveness. The dataset includes interventions from 114 regions in 7 European countries during the period from the 1st August 2020 to the 9th January 2021. The paper includes NPI definitions tailored to the second wave following an exploratory data collection. Each entry has been extensively validated by semi-independent double entry, comparison with existing datasets, and, when necessary, discussion with local epidemiologists. The dataset has considerable potential for use in disentangling the effectiveness of NPIs and comparing the impact of interventions across different phases of the pandemic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Implementation of an interactive virtual microscope laboratory system in teaching oral histopathology",
        "link": "https://www.nature.com/articles/s41598-022-09473-6",
        "publication_date": "31 Mar 2022",
        "abstract": "Laboratory course acts as a key component of histopathology education. Recent trends of incorporating visual and interactive technology in active and inquiry-based learning pedagogical methods have led to significant improvement of histopathology laboratory courses. The present work aimed to describe interactive virtual microscope laboratory system (IVMLS) as a virtual platform for teaching histopathology in order to improve the quality and efficiency of teaching. The system is based on interactive technology and consists of interactive software, slide-reading software, teaching resources and integrated auxiliary equipment. It allows real-time interaction between teachers and students and provides students with a wealth of learning and review materials. In order to evaluate the effectiveness of the system, we conducted a comparative study with the use of light microscope (LM) as a method. Specifically, we compared the results of six assignments and one laboratory final exam between IVMLS group and LM group to analyse the impact of IVMLS on students' academic performance. A questionnaire survey was also conducted to obtain students' attitudes and views on this system. There was no overall difference in assignment performance between IVMLS group and LM group. But laboratory final test grades increased from a mean of 62% (43.8–80.0, 95% CI) before to 83% (71.0–94.2, 95% CI) after implement IVMLS, suggesting highly significant (p < 0.001) improvement on students' histopathology laboratory performance. Feedback of the questionnaire was positive, indicating that students were satisfied with the system, which they believed improved student communication and teacher-student interaction, increased learning resources, increased their focus on learning, and facilitated their independent thinking process. This study proves that IVMLS is an efficient and feasible teaching technology and improves students' academic performance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multivariate genomic and transcriptomic determinants of imaging-derived personalized therapeutic needs in Parkinson’s disease",
        "link": "https://www.nature.com/articles/s41598-022-09506-0",
        "publication_date": "31 Mar 2022",
        "abstract": "Due to the marked interpersonal neuropathologic and clinical heterogeneity of Parkinson's disease (PD), current interventions are not personalized and fail to benefit all patients. Furthermore, we continue to lack well-established methods and clinical tests to tailor interventions at the individual level in PD. Here, we identify the genetic determinants of individual-tailored treatment needs derived from longitudinal multimodal neuroimaging data in 294 PD patients (PPMI data). Advanced multivariate statistical analysis revealed that both genomic and blood transcriptomic data significantly explain (P < 0.01, FWE-corrected) the interindividual variability in therapeutic needs associated with dopaminergic, functional, and structural brain reorganization. We confirmed a high overlap between the identified highly predictive molecular pathways and determinants of levodopa clinical responsiveness, including well-known (Wnt signaling, angiogenesis, dopaminergic activity) and recently discovered (immune markers, gonadotropin-releasing hormone receptor) pathways/components. In addition, the observed strong correspondence between the identified genomic and baseline-transcriptomic determinants of treatment needs/response supports the genome's active role at the time of patient evaluation (i.e., beyond individual genetic predispositions at birth). This study paves the way for effectively combining genomic, transcriptomic and neuroimaging data for implementing successful individually tailored interventions in PD and extending our pathogenetic understanding of this multifactorial and heterogeneous disorder.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The Mexican magnetic resonance imaging dataset of patients with cocaine use disorder: SUDMEX CONN",
        "link": "https://www.nature.com/articles/s41597-022-01251-3",
        "publication_date": "31 Mar 2022",
        "abstract": "Cocaine use disorder (CUD) is a substance use disorder (SUD) characterized by compulsion to seek, use and abuse of cocaine, with severe health and economic consequences for the patients, their families and society. Due to the lack of successful treatments and high relapse rate, more research is needed to understand this and other SUD. Here, we present the SUDMEX CONN dataset, a Mexican open dataset of 74 CUD patients (9 female) and matched 64 healthy controls (6 female) that includes demographic, cognitive, clinical, and magnetic resonance imaging (MRI) data. MRI data includes: 1) structural (T1-weighted), 2) multishell high-angular resolution diffusion-weighted (DWI-HARDI) and 3) functional (resting state fMRI) sequences. The repository contains unprocessed MRI data available in brain imaging data structure (BIDS) format with corresponding metadata available at the OpenNeuro data sharing platform. Researchers can pursue brain variability between these groups or use a single group for a larger population sample.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Impact of recording length and other arrhythmias on atrial fibrillation detection from wrist photoplethysmogram using smartwatches",
        "link": "https://www.nature.com/articles/s41598-022-09181-1",
        "publication_date": "30 Mar 2022",
        "abstract": "This study aimed to evaluate whether quantitative analysis of wrist photoplethysmography (PPG) could detect atrial fibrillation (AF). Continuous electrocardiograms recorded using an electrophysiology recording system and PPG obtained using a wrist-worn smartwatch were simultaneously collected from patients undergoing catheter ablation or electrical cardioversion. PPG features were extracted from 10, 25, 40, and 80 heartbeats of the split segments. Machine learning with a support vector machine and random forest approach were used to detect AF. A total of 116 patients were evaluated. We annotated > 117 h of PPG. A total of 6475 and 3957 segments of 25-beat pulse-to-pulse intervals (PPIs) were annotated as AF and sinus rhythm, respectively. The accuracy of the 25 PPIs yielded a test area under the receiver operating characteristic curve (AUC) of 0.9676, which was significantly better than the AUC for the 10 PPIs (0.9453; P < .001). PPGs obtained from another 38 patients with frequent premature ventricular/atrial complexes (PVCs/PACs) were used to evaluate the impact of other arrhythmias on diagnostic accuracy. The new AF detection algorithm achieved an AUC of 0.9680. The appropriate data length of PPG for optimizing the PPG analytics program was 25 heartbeats. Algorithm modification using a machine learning approach shows robustness to PVCs/PACs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "High-speed light-sheet microscopy for the in-situ acquisition of volumetric histological images of living tissue",
        "link": "https://www.nature.com/articles/s41551-022-00849-7",
        "publication_date": "28 Mar 2022",
        "abstract": "Histological examinations typically require the excision of tissue, followed by its fixation, slicing, staining, mounting and imaging, with timeframes ranging from minutes to days. This process may remove functional tissue, may miss abnormalities through under-sampling, prevents rapid decision-making, and increases costs. Here, we report the feasibility of microscopes based on swept confocally aligned planar excitation technology for the volumetric histological imaging of intact living tissue in real time. The systems’ single-objective, light-sheet geometry and 3D imaging speeds enable roving image acquisition, which combined with 3D stitching permits the contiguous analysis of large tissue areas, as well as the dynamic assessment of tissue perfusion and function. Implemented in benchtop and miniaturized form factors, the microscopes also have high sensitivity, even for weak intrinsic fluorescence, allowing for the label-free imaging of diagnostically relevant histoarchitectural structures, as we show for pancreatic disease in living mice, for chronic kidney disease in fresh human kidney tissues, and for oral mucosa in a healthy volunteer. Miniaturized high-speed light-sheet microscopes for in-situ volumetric histological imaging may facilitate the point-of-care detection of diverse cellular-level biomarkers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Estimated date of delivery with electronic medical records by a hybrid GBDT-GRU model",
        "link": "https://www.nature.com/articles/s41598-022-08664-5",
        "publication_date": "22 Mar 2022",
        "abstract": "An accurate estimated date of delivery (EDD) helps pregnant women make adequate preparations before delivery and avoid the panic of parturition. EDD is normally derived from some formulates or estimated by doctors based on last menstruation period and ultrasound examinations. This study attempted to combine antenatal examinations and electronic medical records to develop a hybrid model based on Gradient Boosting Decision Tree and Gated Recurrent Unit (GBDT-GRU). Besides exploring the features that affect the EDD, GBDT-GRU model obtained the results by dynamic prediction of different stages. The mean square error (MSE) and coefficient of determination (R2) were used to compare the performance among the different prediction methods. In addition, we evaluated predictive performances of different prediction models by comparing the proportion of pregnant women under the error of different days. Experimental results showed that the performance indexes of hybrid GBDT-GRU model outperformed other prediction methods because it focuses on analyzing the time-series predictors of pregnancy. The results of this study are helpful for the development of guidelines for clinical delivery treatments, as it can assist clinicians in making correct decisions during obstetric examinations.",
        "conclusions": "In this paper, a hybrid model of a GBDT model and GRU model was proposed to predict EDD. For a more accurate EDD, we established a hybrid model of the parameters related to pregnant women and fetal physical examination. The results show that GBDT-GRU achieves a satisfactory outcome in the experiment and the accuracy of the EDD can be improved by adjusting the number of features. Therefore, our hybrid model is an effective method to support clinical decision making and artificial intelligence methods have great application potential in obstetrical practice. Future studies should also solve the problem of predicting the EDD within the scope of preterm delivery.",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning-enabled assessment of cardiac allograft rejection from endomyocardial biopsies",
        "link": "https://www.nature.com/articles/s41591-022-01709-2",
        "publication_date": "21 Mar 2022",
        "abstract": "Endomyocardial biopsy (EMB) screening represents the standard of care for detecting allograft rejections after heart transplant. Manual interpretation of EMBs is affected by substantial interobserver and intraobserver variability, which often leads to inappropriate treatment with immunosuppressive drugs, unnecessary follow-up biopsies and poor transplant outcomes. Here we present a deep learning-based artificial intelligence (AI) system for automated assessment of gigapixel whole-slide images obtained from EMBs, which simultaneously addresses detection, subtyping and grading of allograft rejection. To assess model performance, we curated a large dataset from the United States, as well as independent test cohorts from Turkey and Switzerland, which includes large-scale variability across populations, sample preparations and slide scanning instrumentation. The model detects allograft rejection with an area under the receiver operating characteristic curve (AUC) of 0.962; assesses the cellular and antibody-mediated rejection type with AUCs of 0.958 and 0.874, respectively; detects Quilty B lesions, benign mimics of rejection, with an AUC of 0.939; and differentiates between low-grade and high-grade rejections with an AUC of 0.833. In a human reader study, the AI system showed non-inferior performance to conventional assessment and reduced interobserver variability and assessment time. This robust evaluation of cardiac allograft rejection paves the way for clinical trials to establish the efficacy of AI-assisted EMB assessment and its potential for improving heart transplant outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Navigation of frameless fixation for gamma knife radiosurgery using fixed augmented reality",
        "link": "https://www.nature.com/articles/s41598-022-08390-y",
        "publication_date": "16 Mar 2022",
        "abstract": "Augmented reality (AR) offers a new medical treatment approach. We aimed to evaluate frameless (mask) fixation navigation using a 3D-printed patient model with fixed-AR technology for gamma knife radiosurgery (GKRS). Fixed-AR navigation was developed using the inside-out method with visual inertial odometry algorithms, and the flexible Quick Response marker was created for object-feature recognition. Virtual 3D-patient models for AR-rendering were created via 3D-scanning utilizing TrueDepth and cone-beam computed tomography (CBCT) to generate a new GammaKnife Icon™ model. A 3D-printed patient model included fiducial markers, and virtual 3D-patient models were used to validate registration accuracy. Registration accuracy between initial frameless fixation and re-fixation navigated fixed-AR was validated through visualization and quantitative method. The quantitative method was validated through set-up errors, fiducial marker coordinates, and high-definition motion management (HDMM) values. A 3D-printed model and virtual models were correctly overlapped under frameless fixation. Virtual models from both 3D-scanning and CBCT were enough to tolerate the navigated frameless re-fixation. Although the CBCT virtual model consistently delivered more accurate results, 3D-scanning was sufficient. Frameless re-fixation accuracy navigated in virtual models had mean set-up errors within 1 mm and 1.5° in all axes. Mean fiducial marker differences from coordinates in virtual models were within 2.5 mm in all axes, and mean 3D errors were within 3 mm. Mean HDMM difference values in virtual models were within 1.5 mm of initial HDMM values. The variability from navigation fixed-AR is enough to consider repositioning frameless fixation without CBCT scanning for treating patients fractionated with large multiple metastases lesions (> 3 cm) who have difficulty enduring long beam-on time. This system could be applied to novel GKRS navigation for frameless fixation with reduced preparation time.",
        "conclusions": "We demonstrated that fixed-AR navigation is a useful tool for frameless fixation without CBCT for GKRS. This method using conventional equipment and fixed-AR with inside-out tracking could be directly adapted to GKRS. Overall, when planning for small lesions or eloquent areas, frameless fixation and repositioning with CBCT scanning should be considered. However, in cases of patients with large metastases, no eloquent area and continual movements under frameless fixation could be navigated well with re-fixation and repositioning using a fixed-AR system without CBCT scanning.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A hybrid machine learning/deep learning COVID-19 severity predictive model from CT images and clinical data",
        "link": "https://www.nature.com/articles/s41598-022-07890-1",
        "publication_date": "14 Mar 2022",
        "abstract": "COVID-19 clinical presentation and prognosis are highly variable, ranging from asymptomatic and paucisymptomatic cases to acute respiratory distress syndrome and multi-organ involvement. We developed a hybrid machine learning/deep learning model to classify patients in two outcome categories, non-ICU and ICU (intensive care admission or death), using 558 patients admitted in a northern Italy hospital in February/May of 2020. A fully 3D patient-level CNN classifier on baseline CT images is used as feature extractor. Features extracted, alongside with laboratory and clinical data, are fed for selection in a Boruta algorithm with SHAP game theoretical values. A classifier is built on the reduced feature space using CatBoost gradient boosting algorithm and reaching a probabilistic AUC of 0.949 on holdout test set. The model aims to provide clinical decision support to medical doctors, with the probability score of belonging to an outcome class and with case-based SHAP interpretation of features importance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A study on sex estimation by using machine learning algorithms with parameters obtained from computerized tomography images of the cranium",
        "link": "https://www.nature.com/articles/s41598-022-07415-w",
        "publication_date": "11 Mar 2022",
        "abstract": "The aim of this study is to test whether sex prediction can be made by using machine learning algorithms (ML) with parameters taken from computerized tomography (CT) images of cranium and mandible skeleton which are known to be dimorphic. CT images of the cranium skeletons of 150 men and 150 women were included in the study. 25 parameters determined were tested with different ML algorithms. Accuracy (Acc), Specificity (Spe), Sensitivity (Sen), F1 score (F1), Matthews correlation coefficient (Mcc) values were included as performance criteria and Minitab 17 package program was used in descriptive statistical analyses. p ≤ 0.05 value was considered as statistically significant. In ML algorithms, the highest prediction was found with 0.90 Acc, 0.80 Mcc, 0.90 Spe, 0.90 Sen, 0.90 F1 values as a result of LR algorithms. As a result of confusion matrix, it was found that 27 of 30 males and 27 of 30 females were predicted correctly. Acc ratios of other MLs were found to be between 0.81 and 0.88. It has been concluded that the LR algorithm to be applied to the parameters obtained from CT images of the cranium skeleton will predict sex with high accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Searching for optimal machine learning model to classify mild cognitive impairment (MCI) subtypes using multimodal MRI data",
        "link": "https://www.nature.com/articles/s41598-022-08231-y",
        "publication_date": "11 Mar 2022",
        "abstract": "The intervention at the stage of mild cognitive impairment (MCI) is promising for preventing Alzheimer’s disease (AD). This study aims to search for the optimal machine learning (ML) model to classify early and late MCI (EMCI and LMCI) subtypes using multimodal MRI data. First, the tract-based spatial statistics (TBSS) analyses showed LMCI-related white matter changes in the Corpus Callosum. The ROI-based tractography addressed the connected cortical areas by affected callosal fibers. We then prepared two feature subsets for ML by measuring resting-state functional connectivity (TBSS-RSFC method) and graph theory metrics (TBSS-Graph method) in these cortical areas, respectively. We also prepared feature subsets of diffusion parameters in the regions of LMCI-related white matter alterations detected by TBSS analyses. Using these feature subsets, we trained and tested multiple ML models for EMCI/LMCI classification with cross-validation. Our results showed the ensemble ML model (AdaBoost) with feature subset of diffusion parameters achieved better performance of mean accuracy 70%. The useful brain regions for classification were those, including frontal, parietal lobe, Corpus Callosum, cingulate regions, insula, and thalamus regions. Our findings indicated the optimal ML model using diffusion parameters might be effective to distinguish LMCI from EMCI subjects at the prodromal stage of AD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Large scale validation of an early-age eye-tracking biomarker of an autism spectrum disorder subtype",
        "link": "https://www.nature.com/articles/s41598-022-08102-6",
        "publication_date": "11 Mar 2022",
        "abstract": "Few clinically validated biomarkers of ASD exist which can rapidly, accurately, and objectively identify autism during the first years of life and be used to support optimized treatment outcomes and advances in precision medicine. As such, the goal of the present study was to leverage both simple and computationally-advanced approaches to validate an eye-tracking measure of social attention preference, the GeoPref Test, among 1,863 ASD, delayed, or typical toddlers (12–48 months) referred from the community or general population via a primary care universal screening program. Toddlers participated in diagnostic and psychometric evaluations and the GeoPref Test: a 1-min movie containing side-by-side dynamic social and geometric images. Following testing, diagnosis was denoted as ASD, ASD features, LD, GDD, Other, typical sibling of ASD proband, or typical. Relative to other diagnostic groups, ASD toddlers exhibited the highest levels of visual attention towards geometric images and those with especially high fixation levels exhibited poor clinical profiles. Using the 69% fixation threshold, the GeoPref Test had 98% specificity, 17% sensitivity, 81% PPV, and 65% NPV. Sensitivity increased to 33% when saccades were included, with comparable validity across sex, ethnicity, or race. The GeoPref Test was also highly reliable up to 24 months following the initial test. Finally, fixation levels among twins concordant for ASD were significantly correlated, indicating that GeoPref Test performance may be genetically driven. As the GeoPref Test yields few false positives (~ 2%) and is equally valid across demographic categories, the current findings highlight the ability of the GeoPref Test to rapidly and accurately detect autism before the 2nd birthday in a subset of children and serve as a biomarker for a unique ASD subtype in clinical trials.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Quantitative interocular comparison of total corneal surface area and corneal diameter in patients with highly asymmetric keratoconus",
        "link": "https://www.nature.com/articles/s41598-022-08021-6",
        "publication_date": "11 Mar 2022",
        "abstract": "Keratoconus is a progressive corneal disorder which is frequently asymmetric. The aetiology of keratoconus remains unclear, and the concept of keratoconus as an ectatic disorder has been challenged recently. We carried out a retrospective study in 160 eyes of 80 patients, to evaluate and compare interocular differences in corneal diameter and surface area in patients with unilateral or highly asymmetric keratoconus (UHAKC). Calculations were performed using raw topographic elevation data derived from topographic measurements using Orbscan II, and we extrapolated surface areas up to measured corneal diameter. We also evaluated inter-eye correlation, and correlation between corneal surface area, corneal diameter and keratoconus severity. Our results showed a statistically significant but not clinically important greater corneal diameter (12.14 mm and 12.17 mm; p = 0.04), and corneal surface area (paired t-test, p < 0.0001; p = 0.0009 respectively) in more affected eyes. Inter-eye comparison revealed corneal diameter, anterior chamber depth, and corneal surface area were strongly correlated between eyes. Corneal surface area remained strongly correlated, and Bland–Altman analysis also showed strong inter-ocular agreement. Our results show that in patients with UHAKC the interocular difference in corneal diameter and corneal surface area is clinically insignificant, and are consistent with a redistribution, rather than increase, of corneal surface area with keratoconus progression.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of hearing recovery in unilateral sudden sensorineural hearing loss using artificial intelligence",
        "link": "https://www.nature.com/articles/s41598-022-07881-2",
        "publication_date": "10 Mar 2022",
        "abstract": "Despite the significance of predicting the prognosis of idiopathic sudden sensorineural hearing loss (ISSNHL), no predictive models have been established. This study used artificial intelligence to develop prognosis models to predict recovery from ISSNHL. We retrospectively reviewed the medical data of 453 patients with ISSNHL (men, 220; women, 233; mean age, 50.3 years) who underwent treatment at a tertiary hospital between January 2021 and December 2019 and were followed up after 1 month. According to Siegel’s criteria, 203 patients recovered in 1 month. Demographic characteristics, clinical and laboratory data, and pure-tone audiometry were analyzed. Logistic regression (baseline), a support vector machine, extreme gradient boosting, a light gradient boosting machine, and multilayer perceptron were used. The outcomes were the area under the receiver operating characteristic curve (AUROC) primarily, area under the precision-recall curve, Brier score, balanced accuracy, and F1 score. The light gradient boosting machine model had the best AUROC and balanced accuracy. Together with multilayer perceptron, it was also significantly superior to logistic regression in terms of AUROC. Using the SHapley Additive exPlanation method, we found that the initial audiogram shape is the most important prognostic factor. Machine/deep learning methods were successfully established to predict the prognosis of ISSNHL.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "secDrug: a pipeline to discover novel drug combinations to kill drug-resistant multiple myeloma cells using a greedy set cover algorithm and single-cell multi-omics",
        "link": "https://www.nature.com/articles/s41408-022-00636-2",
        "publication_date": "09 Mar 2022",
        "abstract": "Multiple myeloma, the second-most common hematopoietic malignancy in the United States, still remains an incurable disease with dose-limiting toxicities and resistance to primary drugs like proteasome inhibitors (PIs) and Immunomodulatory drugs (IMiDs).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Impact of urban structure on infectious disease spreading",
        "link": "https://www.nature.com/articles/s41598-022-06720-8",
        "publication_date": "09 Mar 2022",
        "abstract": "The ongoing SARS-CoV-2 pandemic has been holding the world hostage for several years now. Mobility is key to viral spreading and its restriction is the main non-pharmaceutical interventions to fight the virus expansion. Previous works have shown a connection between the structural organization of cities and the movement patterns of their residents. This puts urban centers in the focus of epidemic surveillance and interventions. Here we show that the organization of urban flows has a tremendous impact on disease spreading and on the amenability of different mitigation strategies. By studying anonymous and aggregated intra-urban flows in a variety of cities in the United States and other countries, and a combination of empirical analysis and analytical methods, we demonstrate that the response of cities to epidemic spreading can be roughly classified in two major types according to the overall organization of those flows. Hierarchical cities, where flows are concentrated primarily between mobility hotspots, are particularly vulnerable to the rapid spread of epidemics. Nevertheless, mobility restrictions in such types of cities are very effective in mitigating the spread of a virus. Conversely, in sprawled cities which present many centers of activity, the spread of an epidemic is much slower, but the response to mobility restrictions is much weaker and less effective. Investing resources on early monitoring and prompt ad-hoc interventions in more vulnerable cities may prove helpful in containing and reducing the impact of future pandemics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    }
]