[
    {
        "title": "Simulation of a machine learning enabled learning health system for risk prediction using synthetic patient data",
        "link": "https://www.nature.com/articles/s41598-022-23011-4",
        "publication_date": "26 Oct 2022",
        "abstract": "When enabled by machine learning (ML), Learning Health Systems (LHS) hold promise for improving the effectiveness of healthcare delivery to patients. One major barrier to LHS research and development is the lack of access to EHR patient data. To overcome this challenge, this study demonstrated the feasibility of developing a simulated ML-enabled LHS using synthetic patient data. The ML-enabled LHS was initialized using a dataset of 30,000 synthetic Synthea patients and a risk prediction XGBoost base model for lung cancer. 4 additional datasets of 30,000 patients were generated and added to the previous updated dataset sequentially to simulate addition of new patients, resulting in datasets of 60,000, 90,000, 120,000 and 150,000 patients. New XGBoost models were built in each instance, and performance improved with data size increase, attaining 0.936 recall and 0.962 AUC (area under curve) in the 150,000 patients dataset. The effectiveness of the new ML-enabled LHS process was verified by implementing XGBoost models for stroke risk prediction on the same Synthea patient populations. By making the ML code and synthetic patient data publicly available for testing and training, this first synthetic LHS process paves the way for more researchers to start developing LHS with real patient data.",
        "conclusions": "In conclusion, this simulation study created the first synthetic LHS, i.e. ML-enabled learning health system of synthetic patients. It has demonstrated the effectiveness of the new LHS process, in which a risk prediction LHS can be created by building a XGBoost base model for any given target disease such as lung cancer or stroke from existing EHR data. With its intrinsically data-centric approach, the LHS can continuously learn from new patient data over time to improve the ML model performance, and ultimately achieve high recall and precision (> 95%) for disease risk prediction. The resulting synthetic data ML model cannot be used in real care delivery, so it is the LHS process that can be followed to build disease risk prediction LHS with real patient data. Finally, because real data is different from synthetic data, real data ML models can be optimized further by hyperparameter tuning.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence-based methods for fusion of electronic health records and imaging data",
        "link": "https://www.nature.com/articles/s41598-022-22514-4",
        "publication_date": "26 Oct 2022",
        "abstract": "Healthcare data are inherently multimodal, including electronic health records (EHR), medical images, and multi-omics data. Combining these multimodal data sources contributes to a better understanding of human health and provides optimal personalized healthcare. The most important question when using multimodal data is how to fuse them—a field of growing interest among researchers. Advances in artificial intelligence (AI) technologies, particularly machine learning (ML), enable the fusion of these different data modalities to provide multimodal insights. To this end, in this scoping review, we focus on synthesizing and analyzing the literature that uses AI techniques to fuse multimodal medical data for different clinical applications. More specifically, we focus on studies that only fused EHR with medical imaging data to develop various AI methods for clinical applications. We present a comprehensive analysis of the various fusion strategies, the diseases and clinical outcomes for which multimodal fusion was used, the ML algorithms used to perform multimodal fusion for each clinical application, and the available multimodal medical datasets. We followed the PRISMA-ScR (Preferred Reporting Items for Systematic Reviews and Meta-Analyses Extension for Scoping Reviews) guidelines. We searched Embase, PubMed, Scopus, and Google Scholar to retrieve relevant studies. After pre-processing and screening, we extracted data from 34 studies that fulfilled the inclusion criteria. We found that studies fusing imaging data with EHR are increasing and doubling from 2020 to 2021. In our analysis, a typical workflow was observed: feeding raw data, fusing different data modalities by applying conventional machine learning (ML) or deep learning (DL) algorithms, and finally, evaluating the multimodal fusion through clinical outcome predictions. Specifically, early fusion was the most used technique in most applications for multimodal learning (22 out of 34 studies). We found that multimodality fusion models outperformed traditional single-modality models for the same task. Disease diagnosis and prediction were the most common clinical outcomes (reported in 20 and 10 studies, respectively) from a clinical outcome perspective. Neurological disorders were the dominant category (16 studies). From an AI perspective, conventional ML models were the most used (19 studies), followed by DL models (16 studies). Multimodal data used in the included studies were mostly from private repositories (21 studies). Through this scoping review, we offer new insights for researchers interested in knowing the current state of knowledge within this research field.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multilayer perceptron-based prediction of stroke mimics in prehospital triage",
        "link": "https://www.nature.com/articles/s41598-022-22919-1",
        "publication_date": "26 Oct 2022",
        "abstract": "The identification of stroke mimics (SMs) in patients with stroke could lead to delayed diagnosis and waste of medical resources. Multilayer perceptron (MLP) was proved to be an accurate tool for clinical applications. However, MLP haven’t been applied in patients with suspected stroke onset within 24 h. Here, we aimed to develop a MLP model to predict SM in patients. We retrospectively reviewed the data of patients with a prehospital diagnosis of suspected stroke between July 2017 and June 2021. SMs were confirmed during hospitalization. We included demographic information, clinical manifestations, medical history, and systolic and diastolic pressure on admission. First, the cohort was randomly divided into a training set (70%) and an external testing set (30%). Then, the least absolute shrinkage and selection operator (LASSO) method was used in feature selection and an MLP model was trained based on the selected items. Then, we evaluated the performance of the model using the ten-fold cross validation method. Finally, we used the external testing set to compare the MLP model with FABS scoring system (FABS) and TeleStroke Mimic Score (TM-Score) using a receiver operator characteristic (ROC) curve. In total, 402 patients were included. Of these, 82 (20.5%) were classified as SMs. During the ten-fold cross validation, the mean area under the ROC curve (AUC) of 10 training sets and 10 validation sets were 0.92 and 0.87, respectively. In the external testing set, the AUC of the MLP model was significantly higher than that of the FABS (0.855 vs. 0.715, P = 0.038) and TM-Score (0.855 vs. 0.646, P = 0.006). The MLP model had significantly better performance in predicting SMs than FABS and TM-Score.",
        "conclusions": "The restricted time window requires a more accurate and intelligent classifier during prehospital triage. The MLP model is an effective tool for differentiating stroke and SM patients, and performs better than other SM probability scales for prehospital stroke recognition. Further prospective validations are needed for MLP model in a larger sample-size data.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting radiocephalic arteriovenous fistula success with machine learning",
        "link": "https://www.nature.com/articles/s41746-022-00710-w",
        "publication_date": "25 Oct 2022",
        "abstract": "After creation of a new arteriovenous fistula (AVF), assessment of readiness for use is an important clinical task. Accurate prediction of successful use is challenging, and augmentation of the physical exam with ultrasound has become routine. Herein, we propose a point-of-care tool based on machine learning to enhance prediction of successful unassisted radiocephalic arteriovenous fistula (AVF) use. Our analysis includes pooled patient-level data from 704 patients undergoing new radiocephalic AVF creation, eligible for hemodialysis, and enrolled in the 2014–2019 international multicenter PATENCY-1 or PATENCY-2 randomized controlled trials. The primary outcome being predicted is successful unassisted AVF use within 1-year, defined as 2-needle cannulation for hemodialysis for ≥90 days without preceding intervention. Logistic, penalized logistic (lasso and elastic net), decision tree, random forest, and boosted tree classification models were built with a training, tuning, and testing paradigm using a combination of baseline clinical characteristics and 4–6 week ultrasound parameters. Performance assessment includes receiver operating characteristic curves, precision-recall curves, calibration plots, and decision curves. All modeling approaches except the decision tree have similar discrimination performance and comparable net-benefit (area under the ROC curve 0.78–0.81, accuracy 69.1–73.6%). Model performance is superior to Kidney Disease Outcome Quality Initiative and University of Alabama at Birmingham ultrasound threshold criteria. The lasso model is presented as the final model due to its parsimony, retaining only 3 covariates: larger outflow vein diameter, higher flow volume, and absence of >50% luminal stenosis. A point-of-care online calculator is deployed to facilitate AVF assessment in the clinic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Survival analysis of localized prostate cancer with deep learning",
        "link": "https://www.nature.com/articles/s41598-022-22118-y",
        "publication_date": "24 Oct 2022",
        "abstract": "In recent years, data-driven, deep-learning-based models have shown great promise in medical risk prediction. By utilizing the large-scale Electronic Health Record data found in the U.S. Department of Veterans Affairs, the largest integrated healthcare system in the United States, we have developed an automated, personalized risk prediction model to support the clinical decision-making process for localized prostate cancer patients. This method combines the representative power of deep learning and the analytical interpretability of parametric regression models and can implement both time-dependent and static input data. To collect a comprehensive evaluation of model performances, we calculate time-dependent C-statistics \\(C_{\\text {td}}\\) over 2-, 5-, and 10-year time horizons using either a composite outcome or prostate cancer mortality as the target event. The composite outcome combines the Prostate-Specific Antigen (PSA) test, metastasis, and prostate cancer mortality. Our longitudinal model Recurrent Deep Survival Machine (RDSM) achieved \\(C_{\\text {td}}\\) 0.85 (0.83), 0.80 (0.83), and 0.76 (0.81), while the cross-sectional model Deep Survival Machine (DSM) attained \\(C_{\\text {td}}\\) 0.85 (0.82), 0.80 (0.82), and 0.76 (0.79) for the 2-, 5-, and 10-year composite (mortality) outcomes, respectively. In addition to estimating the survival probability, our method can quantify the uncertainty associated with the prediction. The uncertainty scores show a consistent correlation with the prediction accuracy. We find PSA and prostate cancer stage information are the most important indicators in risk prediction. Our work demonstrates the utility of the data-driven machine learning model in prostate cancer risk prediction, which can play a critical role in the clinical decision system.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Mouse tissue glycome atlas 2022 highlights inter-organ variation in major N-glycan profiles",
        "link": "https://www.nature.com/articles/s41598-022-21758-4",
        "publication_date": "24 Oct 2022",
        "abstract": "This study presents “mouse tissue glycome atlas” representing the profiles of major N-glycans of mouse glycoproteins that may define their essential functions in the surface glycocalyx of mouse organs/tissues and serum-derived extracellular vesicles (exosomes). Cell surface glycocalyx composed of a variety of N-glycans attached covalently to the membrane proteins, notably characteristic “N-glycosylation patterns” of the glycocalyx, plays a critical role for the regulation of cell differentiation, cell adhesion, homeostatic immune response, and biodistribution of secreted exosomes. Given that the integrity of cell surface glycocalyx correlates significantly with maintenance of the cellular morphology and homeostatic immune functions, dynamic alterations of N-glycosylation patterns in the normal glycocalyx caused by cellular abnormalities may serve as highly sensitive and promising biomarkers. Although it is believed that inter-organs variations in N-glycosylation patterns exist, information of the glycan diversity in mouse organs/tissues remains to be elusive. Here we communicate for the first-time N-glycosylation patterns of 16 mouse organs/tissues, serum, and serum-derived exosomes of Slc:ddY mice using an established solid-phase glycoblotting platform for the rapid, easy, and high throughput MALDI-TOFMS-based quantitative glycomics. The present results elicited occurrence of the organ/tissue-characteristic N-glycosylation patterns that can be discriminated to each other. Basic machine learning analysis using this N-glycome dataset enabled classification between 16 mouse organs/tissues with the highest F1 score (69.7–100%) when neural network algorithm was used. A preliminary examination demonstrated that machine learning analysis of mouse lung N-glycome dataset by random forest algorithm allows for the discrimination of lungs among the different mouse strains such as the outbred mouse Slc:ddY, inbred mouse DBA/2Crslc, and systemic lupus erythematosus model mouse MRL-lpr/lpr with the highest F1 score (74.5–83.8%). Our results strongly implicate importance of “human organ/tissue glycome atlas” for understanding the crucial and diversified roles of glycocalyx determined by the organ/tissue-characteristic N-glycosylation patterns and the discovery research for N-glycome-based disease-specific biomarkers and therapeutic targets.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Feasibility of the optimal cerebral perfusion pressure value identification without a delay that is too long",
        "link": "https://www.nature.com/articles/s41598-022-22566-6",
        "publication_date": "22 Oct 2022",
        "abstract": "Optimal cerebral perfusion pressure (CPPopt)-targeted treatment of traumatic brain injury (TBI) patients requires 2–8 h multi-modal monitoring data accumulation to identify CPPopt value for individual patient. Minimizing the time required for monitoring data accumulation is needed to improve the efficacy of CPPopt-targeted therapy. A retrospective analysis of multimodal physiological monitoring data from 87 severe TBI patients was performed by separately representing cerebrovascular autoregulation (CA) indices in relation to CPP, arterial blood pressure (ABP), and intracranial pressure (ICP) to improve the existing CPPopt identification algorithms. Machine learning (ML)-based algorithms were developed for automatic identification of informative data segments that were used for reliable CPPopt, ABPopt, ICPopt and the lower/upper limits of CA (LLCA/ULCA) identification. The reference datasets of the informative data segments and, artifact-distorted segments, and the datasets of different clinical situations were used for training the ML-based algorithms, allowing us to choose the appropriate individualized CPP-, ABP- or ICP-guided management for 79% of the full monitoring time for the studied population. The developed ML-based algorithms allow us to recognize informative physiological ABP/ICP variations within 24 min intervals with an accuracy up to 79% (compared to the initial accuracy of 74%) and use these segments for timely optimal value identification or CA limits determination in CPP, ABP or ICP data. Prospective clinical studies are needed to prove the efficiency of the developed algorithms.",
        "conclusions": "A retrospective study of 87 severe TBI patients with multimodal monitoring data showed the potential to improve algorithms for personalized CPPopt values by reducing the monitoring data accumulation time.The developed ML-based algorithms allow us to recognize the informative physiological ABP/ICP variations within 24 min intervals and use these segments for the timely determination of optimal value or CA limits identification in CPP, ABP or ICP data. It has also been shown that ML-based identification of appropriate individualized CPP-, ABP- or ICP-guided management from a 2-h monitoring window is possible in 79% of the full monitoring time of the studied population data.Prospective clinical studies are guaranteed to prove the efficiency of the developed algorithms.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A machine learning approach to explore predictors of graft detachment following posterior lamellar keratoplasty: a nationwide registry study",
        "link": "https://www.nature.com/articles/s41598-022-22223-y",
        "publication_date": "21 Oct 2022",
        "abstract": "Machine learning can be used to explore the complex multifactorial patterns underlying postsurgical graft detachment after endothelial corneal transplantation surgery and to evaluate the marginal effect of various practice pattern modulations. We included all posterior lamellar keratoplasty procedures recorded in the Dutch Cornea Transplant Registry from 2015 through 2018 and collected the center-specific practice patterns using a questionnaire. All available data regarding the donor, recipient, surgery, and practice pattern, were coded into 91 factors that might be associated with the occurrence of a graft detachment. In this research, we used three machine learning methods; a regularized logistic regression (lasso), classification tree analysis (CTA), and random forest classification (RFC), to select the most predictive subset of variables for graft detachment. A total of 3647 transplants were included in our analysis and the overall prevalence of graft detachment was 9.9%. In an independent test set the area under the curve for the lasso, CTA, and RFC was 0.70, 0.65, and 0.72, respectively. Identified risk factors included: a Descemet membrane endothelial keratoplasty procedure, prior graft failure, and the use of sulfur hexafluoride gas. Factors with a reduced risk included: performing combined procedures, using pre-cut donor tissue, and a pre-operative laser iridotomy. These results can help surgeons to review their practice patterns and generate hypotheses for empirical research regarding the origins of graft detachments.",
        "conclusions": "Here, we report the use of three different machine learning models to explore factors that can predict the probability of graft detachment following posterior lamellar keratoplasty. The predictive power was similar between all three models and is considered to be acceptable (ranging from 0.65 to 0.72). Our identification of predictive factors can help surgeons make evidence-based changes of their practice patterns, provide insight in the marginal contribution to surgical safety of current practices, and can help generate hypotheses for empirical clinical research regarding the origins of graft detachments. Particularly, this study can function as a data-driven protocol standardization of future prospective studies regarding posterior lamellar keratoplasties.A major strength of this study is our access to an extensive, nationwide dataset and the inclusion of practice patterns in our analysis of a national cornea transplantation registry. The real-world data of the transplantation registry are represented with practically absent inclusion bias, owing to the obligatory and incentivized data-entry in the register. The assessment of both linear and non-linear relationships between a wide range of factors is unique and revealed the complex interactions between factors8,11,12,27,36. Moreover, the presented approach enables the evaluation of the numerous modulations of practice patterns in use and the relative impact of proposed key factors, particularly of value in the rapidly evolving field of surgery in which assessing these practice patterns independently in a clinical study would not be feasible.Despite these strengths several limitations warrant discussion. None of our three models explain all of the variance in our dataset, and not all factors that can affect graft detachment are registered in our dataset (e.g., patient’s behavior and compliance, unrecorded intraoperative events). Furthermore, the register lacks comprehensive contextual information and the completeness and correctness of the data in the registry could not be validated. This lack of contextual information is exemplified by our finding of unknown and/or missing observations in the model output; the interpretation of which is ambiguous and full of assumptions. We therefore chose to not report these outputs. With respect to the practice patterns, we cannot exclude response/recall bias regarding the replies to the questionnaire. Although the surgical protocols for DSEK and DMEK overlap to a large degree, they also differ in several respects. By aggregating the two procedures into a single database, procedure-specific predictive factors might not be identified. Certain predictive factors, such as aphakia, were relatively rare and therefore lack the necessary power to appear in the model output, whilst experts agree on the added risk of this particular condition. Therefore, the effect of certain variables cannot be estimated reliably. Finally, the retrospective nature of the study should be noted. Prospective validation of the results is essential to evaluate the usefulness of the models and possible applications in clinical practice.The effect of donor-related factors, recipient-related factors, surgery-related factors, and practice patterns on the prevalence of graft detachment is an ongoing topic of discussion. Many surgeons in the Netherlands are transitioning from DSEK to DMEK37, and our results indicate that DMEK is associated with an increased risk of graft detachment, consistent with previous studies4,5,6. This increased risk may be due in part to increased difficulty when handling the DMEK graft and/or the fact the DMEK graft edge is more prone to curling up, thus lifting the graft from the recipient’s stromal bed38,39. In addition, partial detachments are more common after DMEK, possibly increasing the rate of rebubbling of the graft compared to DSEK40. Alternatively, the increased risk associated with DMEK may partially be related to the surgeon’s learning curve. Indeed, from 2016 to 2018 the prevalence of graft detachment decreased more steeply for DMEK than for DSEK4. In our model, we attempted to correct for this learning curve by excluding the first 20 DMEK surgeries performed at each clinic, although the results in Table 1 suggest a shallower learning curve; thus, our model may have overestimated the effect of the DMEK procedure and DMEK specific factors.Our results show a diffuse pattern of donor age, recipient age, donor cause of death, and the interval between donor death and surgery. Regarding these factors, our analyses are inconclusive. Regarding preparation techniques, our results are consistent with previous studies that found no difference between pre-cut and surgeon-cut tissues13,15. Graft marking was associated with an increased risk of detachment in the Lasso model only. However, in the Netherlands graft marking is infrequently practiced, clouding the full assessment of the effect of this practice. Furthermore, and consistent with previous findings, our models indicate that patients who had one or more previously failed grafts had a higher risk of detachment36.We also found that several types of graft insertion devices were associated with an increased risk graft detachment; however, we consider the choice of insertion device a proxy for idiosyncratic surgeon factors too subtle to be captured in our register or questionnaire. We opted not to enter to individual surgeon or center as a model factor, as this study is not designed as an exercise in benchmarking. Notwithstanding, these expected between-surgeon differences might now be attributed to proxy parameters. The insertion tools themselves are known to increase the risk of endothelial damage, although no significant differences have been found between the various commercially available insertion devices8,20,21. Furthermore, we found that a graft diameter > 8.4 mm may be associated with a reduced risk of graft detachment. Several groups previously hypothesized that a larger graft may overlap with the retained Descemet membrane in the recipient, thus inhibiting graft attachment22,23. However, no effect of graft size compared to the descemetorhexis size was found. Both DMEK and DSEK are increasingly combined with other procedures such as cataract surgery. In none of our models a combination of procedures was associated with an increased risk risk of graft detachment. Combining these results with previous studies we can conclude that combining surgical procedures does not increase the risk of graft detachment12,25,26. Finally, two of the three models in our study found that pre-operative laser peripheral iridotomy was more protective than surgical peripheral iridectomy, although none of the models found that surgical peripheral iridectomy substantially increased the risk of detachment. This difference between laser iridotomy and surgical iridectomy may be due to the increased risk of intraoperative fibrin formation during surgical iridectomy41.Interestingly, we found that using air as the tamponade agent was not associated with an increased risk of graft detachment, while using SF6 gas appeared to increase the risk of graft detachment. This finding is in contrast with previous studies suggesting that the use of SF6 gas may reduce the risk of graft detachment32,42,43. This discrepancy may be explained in part by the recent transition of surgeons to using SF6 gas together with the concomitant transition to performing DMEK (with a subsequent increased risk of detachment in their learning curve). Nevertheless, we believe that the previously reported putative benefits associated with using SF6 gas might have been overestimated relative to all other factors and is exemplified by continued reports of relatively high rates of graft detachment5,6,12,40,44,45. After posterior lamellar keratoplasties, patients are instructed to remain in the supine position in order to maximize the beneficial effects of AC tamponade, and the length of time in this position can affect the risk of graft detachment. The results of our study indicate that strictly imposing a supine duration of at least 2 h reduced the risk of graft detachment. Similar results were also found if the patients were instructed to remain in the supine position for 48 h following surgery, consistent with the routine practice of most surgeons9,28.Lastly, several previously suggested risk and protective factors were not identified by our models. For example, we found no effect of increasing intraocular pressure above physiological limits for a certain time, consistent with previous studies suggesting that overpressuring of the eye after graft insertion has only a limited protective effect30,46,47. Similarly, we found no increased risk of complications either during or following surgery; however, this apparent lack of effect may have been due to the relatively low incidence of these events.In conclusion, we applied a supervised machine learning approach to a nationwide dataset and identified the most relevant factors for predicting graft detachment following posterior lamellar keratoplasties. Our analysis revealed that performing a DMEK procedure, the use of SF6 gas, and previous graft failure increased the risk of detachment, whereas performing a DSEK procedure, preoperative laser iridotomy, larger graft size, remaining strictly supine for at least 2 h, and a recommendation for staying in the supine position for 48 h reduced the risk of detachment. In contrast, performing a combined procedures and the use of pre-cut tissue had no effect on the risk of graft detachment, neither did overpressuring of the eye after graft-insertion. These results can help surgeons improve their practice patterns and can help researchers formulate new, testable hypotheses. Future studies should focus on improving the performance of machine learning approaches by including more detailed, contextual information. Importantly, these models’ “in silico” predictions should be tested in clinical practice.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Forecasting SARS-CoV-2 transmission and clinical risk at small spatial scales by the application of machine learning architectures to syndromic surveillance data",
        "link": "https://www.nature.com/articles/s42256-022-00538-9",
        "publication_date": "21 Oct 2022",
        "abstract": "Timely and well-informed syndromic surveillance is essential for effective public health policy. The monitoring of traditional epidemiological indicators can be lagged and misleading, which hampers efforts to identify hotspot locations. The increasing predominance of digitalized healthcare-seeking behaviour necessitates that it is fully exploited for the public benefit of effective pandemic management. Using the highest-resolution spatial data for Google Trends relative search volumes, Google mobility, telecoms mobility, National Health Service Pathways calls and website testing journeys, we have developed a machine learning early indicator modelling approach of SARS-CoV-2 transmission and clinical risk at small geographic scales. We trained shallow learning algorithms as the baseline against a geospatial neural network architecture that we termed the spatio-integrated long short-term memory (SI-LSTM) algorithm. The SI-LSTM algorithm was able to—for the assessed temporal periods—accurately identify hotspot locations over time horizons of a month or more with an accuracy in excess of 99%, and an improved performance of up to 15% against the shallow learning algorithms. Furthermore, in public health operational use, this model highlighted the localized exponential growth of the Alpha variant in late 2020, the Delta variant in April 2021 and the Omicron variant in November 2021 within the United Kingdom prior to their spatial dispersion and growth being confirmed by clinical data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning models for identifying predictors of clinical outcomes with first-line immune checkpoint inhibitor therapy in advanced non-small cell lung cancer",
        "link": "https://www.nature.com/articles/s41598-022-20061-6",
        "publication_date": "21 Oct 2022",
        "abstract": "Immune checkpoint inhibitors (ICIs) are standard-of-care as first-line (1L) therapy for advanced non-small cell lung cancer (aNSCLC) without actionable oncogenic driver mutations. While clinical trials demonstrated benefits of ICIs over chemotherapy, variation in outcomes across patients has been observed and trial populations may not be representative of clinical practice. Predictive models can help understand heterogeneity of treatment effects, identify predictors of meaningful clinical outcomes, and may inform treatment decisions. We applied machine learning (ML)-based survival models to a real-world cohort of patients with aNSCLC who received 1L ICI therapy extracted from a US-based electronic health record database. Model performance was evaluated using metrics including concordance index (c-index), and we used explainability techniques to identify significant predictors of overall survival (OS) and progression-free survival (PFS). The ML model achieved c-indices of 0.672 and 0.612 for OS and PFS, respectively, and Kaplan–Meier survival curves showed significant differences between low- and high-risk groups for OS and PFS (both log-rank test p < 0.0001). Identified predictors were mostly consistent with the published literature and/or clinical expectations and largely overlapped for OS and PFS; Eastern Cooperative Oncology Group performance status, programmed cell death-ligand 1 expression levels, and serum albumin were among the top 5 predictors for both outcomes. Prospective and independent data set evaluation is required to confirm these results.",
        "conclusions": "We developed a GBDT-CPH model in combination with explainability techniques to identify predictors of OS and PFS among patients with aNSCLC who used ICI-containing regimens as 1L therapy. The GBDT-CPH model improved performance relative to traditional survival models for both OS and PFS. Predictors identified by GBDT-CPH and SHAP significantly overlapped for OS and PFS. Furthermore, we demonstrated that the identified predictors are mostly consistent with the published literature and/or clinical expectations. These results confirm that the application of ML models in combination with EHR data can provide insight regarding clinical outcomes among aNSCLC patients treated with 1L ICIs.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Neuromelanin and T2*-MRI for the assessment of genetically at-risk, prodromal, and symptomatic Parkinson’s disease",
        "link": "https://www.nature.com/articles/s41531-022-00405-9",
        "publication_date": "21 Oct 2022",
        "abstract": "MRI was suggested as a promising method for the diagnosis and assessment of Parkinson’s Disease (PD). We aimed to assess the sensitivity of neuromelanin-MRI and T2* with radiomics analysis for detecting PD, identifying individuals at risk, and evaluating genotype-related differences. Patients with PD and non-manifesting (NM) participants [NM-carriers (NMC) and NM-non-carriers (NMNC)], underwent MRI and DAT-SPECT. Imaging-based metrics included 48 neuromelanin and T2* radiomics features and DAT-SPECT specific-binding-ratios (SBR), were extracted from several brain regions. Imaging values were assessed for their correlations with age, differences between groups, and correlations with the MDS-likelihood-ratio (LR) score. Several machine learning classifiers were evaluated for group classification. A total of 127 participants were included: 46 patients with PD (62.3 ± 10.0 years) [15:LRRK2-PD, 16:GBA-PD, and 15:idiopathic-PD (iPD)], 47 NMC (51.5 ± 8.3 years) [24:LRRK2-NMC and 23:GBA-NMC], and 34 NMNC (53.5 ± 10.6 years). No significant correlations were detected between imaging parameters and age. Thirteen MRI-based parameters and radiomics features demonstrated significant differences between PD and NMNC groups. Support-Vector-Machine (SVM) classifier achieved the highest performance (AUC = 0.77). Significant correlations were detected between LR scores and two radiomic features. The classifier successfully identified two out of three NMC who converted to PD. Genotype-related differences were detected based on radiomic features. SBR values showed high sensitivity in all analyses. In conclusion, neuromelanin and T2* MRI demonstrated differences between groups and can be used for the assessment of individuals at-risk in cases when DAT-SPECT can’t be performed. Combining neuromelanin and T2*-MRI provides insights into the pathophysiology underlying PD, and suggests that iron accumulation precedes neuromelanin depletion during the prodromal phase.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "CT and cone-beam CT of ablative radiation therapy for pancreatic cancer with expert organ-at-risk contours",
        "link": "https://www.nature.com/articles/s41597-022-01758-9",
        "publication_date": "21 Oct 2022",
        "abstract": "We describe a dataset from patients who received ablative radiation therapy for locally advanced pancreatic cancer (LAPC), consisting of computed tomography (CT) and cone-beam CT (CBCT) images with physician-drawn organ-at-risk (OAR) contours. The image datasets (one CT for treatment planning and two CBCT scans at the time of treatment per patient) were collected from 40 patients. All scans were acquired with the patient in the treatment position and in a deep inspiration breath-hold state. Six radiation oncologists delineated the gastrointestinal OARs consisting of small bowel, stomach and duodenum, such that the same physician delineated all image sets belonging to the same patient. Two trained medical physicists further edited the contours to ensure adherence to delineation guidelines. The image and contour files are available in DICOM format and are publicly available from The Cancer Imaging Archive (https://doi.org/10.7937/TCIA.ESHQ-4D90, Version 2). The dataset can serve as a criterion standard for evaluating the accuracy and reliability of deformable image registration and auto-segmentation algorithms, as well as a training set for deep-learning-based methods.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Gene signature of m6A RNA regulators in diagnosis, prognosis, treatment, and immune microenvironment for cervical cancer",
        "link": "https://www.nature.com/articles/s41598-022-22211-2",
        "publication_date": "21 Oct 2022",
        "abstract": "Continuing studies imply that m6A RNA modification is involved in the development of cervical cancer (CC), but lack strong support on recurrence and diagnosis prediction. In this research, a comprehensive analysis of 33 m6A regulators was performed to fulfill them. Here, we performed diagnostic and prognosis models and identified key regulators, respectively. Then the CC patients were separated into two clusters in accordance with 33 regulators, and participants in the cluster 1 had a worse prognosis. Subsequently, the m6AScore was calculated to quantify the m6A modification pattern based on regulators and we found that patients in cluster 1 had higher m6AScore. Afterwards, immune microenvironment, cell infiltration, escape analyses and tumor burden mutation analyses were executed, and results showed that m6AScore was correlated with them, but to a limited extent. Interestingly, HLAs and immune checkpoint expression, and immunophenoscore in patients with high-m6AScores were significantly lower than those in the low-m6AScore group. These suggested the m6AScores might be used to predict the feasibility of immunotherapy in patients. Results provided a distinctive perspective on m6A modification and theoretical basis for CC diagnosis, prognosis, clinical treatment strategies, and potential mechanism exploration.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of malignant lymph nodes in NSCLC by machine-learning classifiers using EBUS-TBNA and PET/CT",
        "link": "https://www.nature.com/articles/s41598-022-21637-y",
        "publication_date": "20 Oct 2022",
        "abstract": "Accurate determination of lymph-node (LN) metastases is a prerequisite for high precision radiotherapy. The primary aim is to characterise the performance of PET/CT-based machine-learning classifiers to predict LN-involvement by endobronchial ultrasound-guided transbronchial needle aspiration (EBUS-TBNA) in stage-III NSCLC. Prediction models for LN-positivity based on [18F]FDG-PET/CT features were built using logistic regression and machine-learning models random forest (RF) and multilayer perceptron neural network (MLP) for stage-III NSCLC before radiochemotherapy. A total of 675 LN-stations were sampled in 180 patients. The logistic and RF models identified SUVmax, the short-axis LN-diameter and the echelon of the considered LN among the most important parameters for EBUS-positivity. Adjusting the sensitivity of machine-learning classifiers to that of the expert-rater of 94.5%, MLP (P = 0.0061) and RF models (P = 0.038) showed lower misclassification rates (MCR) than the standard-report, weighting false positives and false negatives equally. Increasing the sensitivity of classifiers from 94.5 to 99.3% resulted in increase of MCR from 13.3/14.5 to 29.8/34.2% for MLP/RF, respectively. PET/CT-based machine-learning classifiers can achieve a high sensitivity (94.5%) to detect EBUS-positive LNs at a low misclassification rate. As the specificity decreases rapidly above that level, a combined test of a PET/CT-based MLP/RF classifier and EBUS-TBNA is recommended for radiation target volume definition.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning-based classification for lung opacities in chest x-ray radiographs through batch control and sensitivity regulation",
        "link": "https://www.nature.com/articles/s41598-022-22506-4",
        "publication_date": "20 Oct 2022",
        "abstract": "In this study, we implemented a system to classify lung opacities from frontal chest x-ray radiographs. We also proposed a training method to address the class imbalance problem presented in the dataset. We participated in the Radiological Society of America (RSNA) 2018 Pneumonia Detection Challenge and used the datasets provided by the RSNA for further research. Using convolutional neural networks, we implemented a training procedure termed batch control to manipulate the data distribution of positive and negative cases in each training batch. The batch control method regulated and stabilized the performance of the deep-learning models, allowing the adaptive sensitivity of the network models to meet the specific application. The convolutional neural network is practical for classifying lung opacities on chest x-ray radiographs. The batch control method is advantageous for sensitivity regulation and optimization for class-unbalanced datasets.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An external validation study of the Score for Emergency Risk Prediction (SERP), an interpretable machine learning-based triage score for the emergency department",
        "link": "https://www.nature.com/articles/s41598-022-22233-w",
        "publication_date": "19 Oct 2022",
        "abstract": "Emergency departments (EDs) are experiencing complex demands. An ED triage tool, the Score for Emergency Risk Prediction (SERP), was previously developed using an interpretable machine learning framework. It achieved a good performance in the Singapore population. We aimed to externally validate the SERP in a Korean cohort for all ED patients and compare its performance with Korean triage acuity scale (KTAS). This retrospective cohort study included all adult ED patients of Samsung Medical Center from 2016 to 2020. The outcomes were 30-day and in-hospital mortality after the patients’ ED visit. We used the area under the receiver operating characteristic curve (AUROC) to assess the performance of the SERP and other conventional scores, including KTAS. The study population included 285,523 ED visits, of which 53,541 were after the COVID-19 outbreak (2020). The whole cohort, in-hospital, and 30 days mortality rates were 1.60%, and 3.80%. The SERP achieved an AUROC of 0.821 and 0.803, outperforming KTAS of 0.679 and 0.729 for in-hospital and 30-day mortality, respectively. SERP was superior to other scores for in-hospital and 30-day mortality prediction in an external validation cohort. SERP is a generic, intuitive, and effective triage tool to stratify general patients who present to the emergency department.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "HBEGF-TNF induce a complex outer retinal pathology with photoreceptor cell extrusion in human organoids",
        "link": "https://www.nature.com/articles/s41467-022-33848-y",
        "publication_date": "19 Oct 2022",
        "abstract": "Human organoids could facilitate research of complex and currently incurable neuropathologies, such as age-related macular degeneration (AMD) which causes blindness. Here, we establish a human retinal organoid system reproducing several parameters of the human retina, including some within the macula, to model a complex combination of photoreceptor and glial pathologies. We show that combined application of TNF and HBEGF, factors associated with neuropathologies, is sufficient to induce photoreceptor degeneration, glial pathologies, dyslamination, and scar formation: These develop simultaneously and progressively as one complex phenotype. Histologic, transcriptome, live-imaging, and mechanistic studies reveal a previously unknown pathomechanism: Photoreceptor neurodegeneration via cell extrusion. This could be relevant for aging, AMD, and some inherited diseases. Pharmacological inhibitors of the mechanosensor PIEZO1, MAPK, and actomyosin each avert pathogenesis; a PIEZO1 activator induces photoreceptor extrusion. Our model offers mechanistic insights, hypotheses for neuropathologies, and it could be used to develop therapies to prevent vision loss or to regenerate the retina in patients suffering from AMD and other diseases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Synthesizing realistic high-resolution retina image by style-based generative adversarial network and its utilization",
        "link": "https://www.nature.com/articles/s41598-022-20698-3",
        "publication_date": "15 Oct 2022",
        "abstract": "Realistic image synthesis based on deep learning is an invaluable technique for developing high-performance computer aided diagnosis systems while protecting patient privacy. However, training a generative adversarial network (GAN) for image synthesis remains challenging because of the large amounts of data required for training various kinds of image features. This study aims to synthesize retinal images indistinguishable from real images and evaluate the efficacy of the synthesized images having a specific disease for augmenting class imbalanced datasets. The synthesized images were validated via image Turing tests, qualitative analysis by retinal specialists, and quantitative analyses on amounts and signal-to-noise ratios of vessels. The efficacy of synthesized images was verified by deep learning-based classification performance. Turing test shows that accuracy, sensitivity, and specificity of 54.0 ± 12.3%, 71.1 ± 18.8%, and 36.9 ± 25.5%, respectively. Here, sensitivity represents correctness to find real images among real datasets. Vessel amounts and average SNR comparisons show 0.43% and 1.5% difference between real and synthesized images. The classification performance after augmenting synthesized images outperforms every ratio of imbalanced real datasets. Our study shows the realistic retina images were successfully generated with insignificant differences between the real and synthesized images and shows great potential for practical applications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying pre-existing conditions and multimorbidity patterns associated with in-hospital mortality in patients with COVID-19",
        "link": "https://www.nature.com/articles/s41598-022-20176-w",
        "publication_date": "15 Oct 2022",
        "abstract": "We investigated the association between a wide range of comorbidities and COVID-19 in-hospital mortality and assessed the influence of multi morbidity on the risk of COVID-19-related death using a large, regional cohort of 6036 hospitalized patients. This retrospective cohort study was conducted using Patient Administration System Admissions and Discharges data. The International Classification of Diseases 10th edition (ICD-10) diagnosis codes were used to identify common comorbidities and the outcome measure. Individuals with lymphoma (odds ratio [OR], 2.78;95% CI,1.64–4.74), metastatic cancer (OR, 2.17; 95% CI,1.25–3.77), solid tumour without metastasis (OR, 1.67; 95% CI,1.16–2.41), liver disease (OR: 2.50, 95% CI,1.53–4.07), congestive heart failure (OR, 1.69; 95% CI,1.32–2.15), chronic obstructive pulmonary disease (OR, 1.43; 95% CI,1.18–1.72), obesity (OR, 5.28; 95% CI,2.92–9.52), renal disease (OR, 1.81; 95% CI,1.51–2.19), and dementia (OR, 1.44; 95% CI,1.17–1.76) were at increased risk of COVID-19 mortality. Asthma was associated with a lower risk of death compared to non-asthma controls (OR, 0.60; 95% CI,0.42–0.86). Individuals with two (OR, 1.79; 95% CI, 1.47–2.20; P < 0.001), and three or more comorbidities (OR, 1.80; 95% CI, 1.43–2.27; P < 0.001) were at increasingly higher risk of death when compared to those with no underlying conditions. Furthermore, multi morbidity patterns were analysed by identifying clusters of conditions in hospitalised COVID-19 patients using k-mode clustering, an unsupervised machine learning technique. Six patient clusters were identified, with recognisable co-occurrences of COVID-19 with different combinations of diseases, namely, cardiovascular (100%) and renal (15.6%) diseases in patient Cluster 1; mental and neurological disorders (100%) with metabolic and endocrine diseases (19.3%) in patient Cluster 2; respiratory (100%) and cardiovascular (15.0%) diseases in patient Cluster 3, cancer (5.9%) with genitourinary (9.0%) as well as metabolic and endocrine diseases (9.6%) in patient Cluster 4; metabolic and endocrine diseases (100%) and cardiovascular diseases (69.1%) in patient Cluster 5; mental and neurological disorders (100%) with cardiovascular diseases (100%) in patient Cluster 6. The highest mortality of 29.4% was reported in Cluster 6.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automated detection of pain levels using deep feature extraction from shutter blinds-based dynamic-sized horizontal patches with facial images",
        "link": "https://www.nature.com/articles/s41598-022-21380-4",
        "publication_date": "14 Oct 2022",
        "abstract": "Pain intensity classification using facial images is a challenging problem in computer vision research. This work proposed a patch and transfer learning-based model to classify various pain intensities using facial images. The input facial images were segmented into dynamic-sized horizontal patches or “shutter blinds”. A lightweight deep network DarkNet19 pre-trained on ImageNet1K was used to generate deep features from the shutter blinds and the undivided resized segmented input facial image. The most discriminative features were selected from these deep features using iterative neighborhood component analysis, which were then fed to a standard shallow fine k-nearest neighbor classifier for classification using tenfold cross-validation. The proposed shutter blinds-based model was trained and tested on datasets derived from two public databases—University of Northern British Columbia-McMaster Shoulder Pain Expression Archive Database and Denver Intensity of Spontaneous Facial Action Database—which both comprised four pain intensity classes that had been labeled by human experts using validated facial action coding system methodology. Our shutter blinds-based classification model attained more than 95% overall accuracy rates on both datasets. The excellent performance suggests that the automated pain intensity classification model can be deployed to assist doctors in the non-verbal detection of pain using facial images in various situations (e.g., non-communicative patients or during surgery). This system can facilitate timely detection and management of pain.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Convolutional neural network-based classification of cervical intraepithelial neoplasias using colposcopic image segmentation for acetowhite epithelium",
        "link": "https://www.nature.com/articles/s41598-022-21692-5",
        "publication_date": "14 Oct 2022",
        "abstract": "Colposcopy is a test performed to detect precancerous lesions of cervical cancer. Since cervical cancer progresses slowly, finding and treating precancerous lesions helps prevent cervical cancer. In particular, it is clinically important to detect high-grade squamous intraepithelial lesions (HSIL) that require surgical treatment among precancerous lesions of cervix. There have been several studies using convolutional neural network (CNN) for classifying colposcopic images. However, no studies have been reported on using the segmentation technique to detect HSIL. In present study, we aimed to examine whether the accuracy of a CNN model in detecting HSIL from colposcopic images can be improved when segmentation information for acetowhite epithelium is added. Without segmentation information, ResNet-18, 50, and 101 achieved classification accuracies of 70.2%, 66.2%, and 69.3%, respectively. The experts classified the same test set with accuracies of 74.6% and 73.0%. After adding segmentation information of acetowhite epithelium to the original images, the classification accuracies of ResNet-18, 50, and 101 improved to 74.8%, 76.3%, and 74.8%, respectively. We demonstrated that the HSIL detection accuracy improved by adding segmentation information to the CNN model, and the improvement in accuracy was consistent across different ResNets.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Investigation of radiomics based intra-patient inter-tumor heterogeneity and the impact of tumor subsampling strategies",
        "link": "https://www.nature.com/articles/s41598-022-20931-z",
        "publication_date": "14 Oct 2022",
        "abstract": "While radiomics analysis has been applied for localized cancer disease, its application to the metastatic setting involves a non-exhaustive lesion subsampling strategy which may sidestep the intrapatient tumoral heterogeneity, hindering the reproducibility and the therapeutic response performance. Our aim was to evaluate if radiomics features can capture intertumoral intrapatient heterogeneity, and the impact of tumor subsampling on the computed heterogeneity. To this end, We delineated and extracted radiomics features of all visible tumors from single acquisition pre-treatment computed tomography of patients with metastatic lung cancer (cohort L) and confirmed our results on a larger cohort of patients with metastatic melanoma (cohort M). To quantify the captured heterogeneity, the absolute coefficient of variation (CV) of each radiomics index was calculated at the patient-level and a sensitivity analysis was performed using only a subset of all extracted features robust to the segmentation step. The extent of information loss by six commonly used tumor sampling strategies was then assessed. A total of 602 lesions were segmented from 43 patients (median age 57, 4.9% female). All robust radiomics indexes exhibited at least 20% of variation with significant heterogeneity both in heavily and oligo metastasized patients, and also at the organ level. None of the segmentation subsampling strategies were able to recover the true tumoral heterogeneity obtained by exhaustive tumor sampling. Image-based inter-tumor intra-patient heterogeneity can be successfully grasped by radiomics analyses. Failing to take into account this kind of heterogeneity will lead to inconsistent predictive algorithms. Guidelines to standardize the tumor sampling step and/or AI-driven tools to alleviate the segmentation effort are required.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Chronic gvhd dictionary—eurograft cost action initiative consensus report",
        "link": "https://www.nature.com/articles/s41409-022-01837-w",
        "publication_date": "13 Oct 2022",
        "abstract": "Chronic graft versus host disease (cGVHD) affects patients after allogeneic hematopoietic stem cell transplantation (alloHSCT). This orphan disease poses a challenge for clinicians and researchers. The purpose of the cGVHD Dictionary is to provide a standardized structure for cGVHD databases on an international level, reconciling differences in data retrieval and facilitate database merging. It is derived from several consensus meetings of the EUROGRAFT consortium (European Cooperation in Science and Technology—COST Action CA17138) followed by a consensus process involving European Society for Blood and Marrow Transplantation (EBMT), US GvHD consortium and Center for International Bone Marrow Transplant Registry (CIBMTR). Databases used for the dictionary were: the National Institutes of Health (NIH) database, the Center for International Blood and Marrow Transplant Research, Applying Biomarkers to Minimize Long Term Effects of Childhood/Adolescent Cancer Treatment - Pediatric Blood and Marrow Transplant Consortium database, EBMT registry, the German-Austrian-Swiss GvHD registry, Italian Blood and Marrow Transplantation Society registry and Regensburg-Göttingen-Newcastle HSCT dataset. A four-part cGVHD Dictionary was formed based on the databases, consensus, and evidence in the literature. The Dictionary is divided into: (1) Patient characteristics, (2) Transplant characteristics, (3) cGVHD characteristics and (4) patient-reported quality of life, symptom burden and functional indicators.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A stacking ensemble machine learning model to predict alpha-1 antitrypsin deficiency-associated liver disease clinical outcomes based on UK Biobank data",
        "link": "https://www.nature.com/articles/s41598-022-21389-9",
        "publication_date": "11 Oct 2022",
        "abstract": "Alpha-1 antitrypsin deficiency associated liver disease (AATD-LD) is a rare genetic disorder and not well-recognized. Predicting the clinical outcomes of AATD-LD and defining patients more likely to progress to advanced liver disease are crucial for better understanding AATD-LD progression and promoting timely medical intervention. We aimed to develop a tailored machine learning (ML) model to predict the disease progression of AATD-LD. This analysis was conducted through a stacking ensemble learning model by combining five different ML algorithms with 58 predictor variables using nested five-fold cross-validation with repetitions based on the UK Biobank data. Performance of the model was assessed through prediction accuracy, area under the receiver operating characteristic (AUROC), and area under the precision-recall curve (AUPRC). The importance of predictor contributions was evaluated through a feature importance permutation method. The proposed stacking ensemble ML model showed clinically meaningful accuracy and appeared superior to any single ML algorithms in the ensemble, e.g., the AUROC for AATD-LD was 68.1%, 75.9%, 91.2%, and 67.7% for all-cause mortality, liver-related death, liver transplant, and all-cause mortality or liver transplant, respectively. This work supports the use of ML to address the unanswered clinical questions with clinically meaningful accuracy using real-world data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A mobile-optimized artificial intelligence system for gestational age and fetal malpresentation assessment",
        "link": "https://www.nature.com/articles/s43856-022-00194-5",
        "publication_date": "11 Oct 2022",
        "abstract": "Fetal ultrasound is an important component of antenatal care, but shortage of adequately trained healthcare workers has limited its adoption in low-to-middle-income countries. This study investigated the use of artificial intelligence for fetal ultrasound in under-resourced settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Developing a resiliency model for survival without major morbidity in preterm infants",
        "link": "https://www.nature.com/articles/s41372-022-01521-3",
        "publication_date": "11 Oct 2022",
        "abstract": "Develop and validate a resiliency score to predict survival and survival without neonatal morbidity in preterm neonates <32 weeks of gestation using machine learning.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Influence of the microbiome, diet and genetics on inter-individual variation in the human plasma metabolome",
        "link": "https://www.nature.com/articles/s41591-022-02014-8",
        "publication_date": "10 Oct 2022",
        "abstract": "The levels of the thousands of metabolites in the human plasma metabolome are strongly influenced by an individual’s genetics and the composition of their diet and gut microbiome. Here, by assessing 1,183 plasma metabolites in 1,368 extensively phenotyped individuals from the Lifelines DEEP and Genome of the Netherlands cohorts, we quantified the proportion of inter-individual variation in the plasma metabolome explained by different factors, characterizing 610, 85 and 38 metabolites as dominantly associated with diet, the gut microbiome and genetics, respectively. Moreover, a diet quality score derived from metabolite levels was significantly associated with diet quality, as assessed by a detailed food frequency questionnaire. Through Mendelian randomization and mediation analyses, we revealed putative causal relationships between diet, the gut microbiome and metabolites. For example, Mendelian randomization analyses support a potential causal effect of Eubacterium rectale in decreasing plasma levels of hydrogen sulfite—a toxin that affects cardiovascular function. Lastly, based on analysis of the plasma metabolome of 311 individuals at two time points separated by 4 years, we observed a positive correlation between the stability of metabolite levels and the amount of variance in the levels of that metabolite that could be explained in our analysis. Altogether, characterization of factors that explain inter-individual variation in the plasma metabolome can help design approaches for modulating diet or the gut microbiome to shape a healthy metabolome.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based derivation and external validation of a tool to predict death and development of organ failure in hospitalized patients with COVID-19",
        "link": "https://www.nature.com/articles/s41598-022-20724-4",
        "publication_date": "08 Oct 2022",
        "abstract": "COVID-19 mortality risk stratification tools could improve care, inform accurate and rapid triage decisions, and guide family discussions regarding goals of care. A minority of COVID-19 prognostic tools have been tested in external cohorts. Our objective was to compare machine learning algorithms and develop a tool for predicting subsequent clinical outcomes in COVID-19. We conducted a retrospective cohort study that included hospitalized patients with COVID-19 from March 2020 to March 2021. Seven Hundred Twelve consecutive patients from University of Washington  and 345 patients from Tongji Hospital in China were included. We applied three different machine learning algorithms to clinical and laboratory data collected within the initial 24 h of hospital admission to determine the risk of in-hospital mortality, transfer to the intensive care unit, shock requiring vasopressors, and receipt of renal replacement therapy. Mortality risk models were derived, internally validated in UW and externally validated in Tongji Hospital. The risk models for ICU transfer, shock and RRT were derived and internally validated in the UW dataset but were unable to be externally validated due to a lack of data on these outcomes. Among the UW dataset, 122 patients died (17%) during hospitalization and the mean days to hospital mortality was 15.7 +/− 21.5 (mean +/− SD). Elastic net logistic regression resulted in a C-statistic for in-hospital mortality of 0.72 (95% CI, 0.64 to 0.81) in the internal validation and 0.85 (95% CI, 0.81 to 0.89) in the external validation set. Age, platelet count, and white blood cell count were the most important predictors of mortality. In the sub-group of patients > 50 years of age, the mortality prediction model continued to perform with a C-statistic of 0.82 (95% CI:0.76,0.87). Prediction models also performed well for shock and RRT in the UW dataset but functioned with lower accuracy for ICU transfer. We trained, internally and externally validated a prediction model using data collected within 24 h of hospital admission to predict in-hospital mortality on average two weeks prior to death. We also developed models to predict RRT and shock with high accuracy. These models could be used to improve triage decisions, resource allocation, and support clinical trial enrichment.",
        "conclusions": "We developed prediction models with high discrimination for mortality, shock and RRT. The in-hospital mortality model performed well in the internal validation set and showed improved accuracy in the external validation set. Key variables that informed the in-hospital mortality prediction model included age, white blood cell count and platelet count. The mortality prediction model on average was able to identify future risk of mortality 2 weeks prior to the clinical outcome. All variables to develop the prediction models used clinical variables collected within the first day of hospital admission. These machine learning derived prediction models could be used to improve triage decisions, resource allocation, and support clinical trial enrichment in patients hospitalized with COVID-19.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multi-omics disease module detection with an explainable Greedy Decision Forest",
        "link": "https://www.nature.com/articles/s41598-022-21417-8",
        "publication_date": "07 Oct 2022",
        "abstract": "Machine learning methods can detect complex relationships between variables, but usually do not exploit domain knowledge. This is a limitation because in many scientific disciplines, such as systems biology, domain knowledge is available in the form of graphs or networks, and its use can improve model performance. We need network-based algorithms that are versatile and applicable in many research areas. In this work, we demonstrate subnetwork detection based on multi-modal node features using a novel Greedy Decision Forest (GDF) with inherent interpretability. The latter will be a crucial factor to retain experts and gain their trust in such algorithms. To demonstrate a concrete application example, we focus on bioinformatics, systems biology and particularly biomedicine, but the presented methodology is applicable in many other domains as well. Systems biology is a good example of a field in which statistical data-driven machine learning enables the analysis of large amounts of multi-modal biomedical data. This is important to reach the future goal of precision medicine, where the complexity of patients is modeled on a system level to best tailor medical decisions, health practices and therapies to the individual patient. Our proposed explainable approach can help to uncover disease-causing network modules from multi-omics data to better understand complex diseases such as cancer.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An assessment tool for computer-assisted semen analysis (CASA) algorithms",
        "link": "https://www.nature.com/articles/s41598-022-20943-9",
        "publication_date": "07 Oct 2022",
        "abstract": "Computer-Assisted Semen Analysis (CASA) enables reliable analysis of semen images, and is designed to process large number of images with high consistency, accuracy, and repeatability. Design and testing of CASA algorithms can be accelerated greatly if reliable simulations of semen images under a variety of conditions and sample quality modes are available. Using life-like simulation of semen images can quantify the performance of existing and proposed CASA algorithms, since the parameters of the simulated image are known and controllable. We present simulation models for sperm cell image and swimming modes observed in real 2D (top-down) images of sperm cells in laboratory specimen. The models simulate human sperm using four (4) types of swimming, namely linear mean, circular, hyperactive, and immotile (or dead). The simulation models are used in studying algorithms for segmentation, localization, and tracking of sperm cells. Several segmentation and localization algorithms were tested under varying levels of noise, and then compared using precision, recall, and the optimal subpattern assignment (OSPA) metric. Images of real human semen sample were used to validate the segmentation and localization observations obtained from simulations. An example is given of sperm cell tracking on simulated semen images of cells using the different tracking algorithms (nearest neighbor (NN), global nearest neighbor (GNN), probabilistic data association filter (PDAF), and joint probabilistic data association filter (JPDAF)). Tracking performance was evaluated through multi-object tracking precision (MOTP) and multi-object tracking accuracy (MOTA). Simulation models enable objective assessments of semen image processing algorithms. We demonstrate the use of a new simulation tool to assess and compare segmentation, localization, and tracking methods. The simulation software allows testing along a large spectrum of parameter values that control the appearance and behavior of simulated semen images. Users can generate scenarios of different characteristics and assess the effectiveness of different CASA algorithms in these environments. The simulation was used to assess and compare algorithms for segmentation and tracking of sperm cells in semen images.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Generic surgical process model for minimally invasive liver treatment methods",
        "link": "https://www.nature.com/articles/s41598-022-19891-1",
        "publication_date": "06 Oct 2022",
        "abstract": "Surgical process modelling is an innovative approach that aims to simplify the challenges involved in improving surgeries through quantitative analysis of a well-established model of surgical activities. In this paper, surgical process model strategies are applied for the analysis of different Minimally Invasive Liver Treatments (MILTs), including ablation and surgical resection of the liver lesions. Moreover, a generic surgical process model for these differences in MILTs is introduced. The generic surgical process model was established at three different granularity levels. The generic process model, encompassing thirteen phases, was verified against videos of MILT procedures and interviews with surgeons. The established model covers all the surgical and interventional activities and the connections between them and provides a foundation for extensive quantitative analysis and simulations of MILT procedures for improving computer-assisted surgery systems, surgeon training and evaluation, surgeon guidance and planning systems and evaluation of new technologies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence in (gastrointestinal) healthcare: patients’ and physicians’ perspectives",
        "link": "https://www.nature.com/articles/s41598-022-20958-2",
        "publication_date": "06 Oct 2022",
        "abstract": "Artificial intelligence (AI) is entering into daily life and has the potential to play a significant role in healthcare. Aim was to investigate the perspectives (knowledge, experience, and opinion) on AI in healthcare among patients with gastrointestinal (GI) disorders, gastroenterologists, and GI-fellows. In this prospective questionnaire study 377 GI-patients, 35 gastroenterologists, and 45 GI-fellows participated. Of GI-patients, 62.5% reported to be familiar with AI and 25.0% of GI-physicians had work-related experience with AI. GI-patients preferred their physicians to use AI (mean 3.9) and GI-physicians were willing to use AI (mean 4.4, on 5-point Likert-scale). More GI-physicians believed in an increase in quality of care (81.3%) than GI-patients (64.9%, χ2(2) = 8.2, p = 0.017). GI-fellows expected AI implementation within 6.0 years, gastroenterologists within 4.2 years (t(76) =  − 2.6, p = 0.011), and GI-patients within 6.1 years (t(193) =  − 2.0, p = 0.047). GI-patients and GI-physicians agreed on the most important advantages of AI in healthcare: improving quality of care, time saving, and faster diagnostics and shorter waiting times. The most important disadvantage for GI-patients was the potential loss of personal contact, for GI-physicians this was insufficiently developed IT infrastructures. GI-patients and GI-physicians hold positive perspectives towards AI in healthcare. Patients were significantly more reserved compared to GI-fellows and GI-fellows were more reserved compared to gastroenterologists.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Modeling of smoking intensity by age at smoking onset among Iranian adult male using generalized additive model",
        "link": "https://www.nature.com/articles/s41598-022-21194-4",
        "publication_date": "06 Oct 2022",
        "abstract": "Because the age at which a person first starts smoking has such a strong correlation with future smoking behaviours, it's crucial to examine its relationship with smoking intensity. However, it is still challenging to accurately prove this relationship due to limitations in the methodology of the performed studies. Therefore the main purpose of this study is to evaluate the potential risk factors affecting the intensity of smoking, especially the age of smoking onset among Iranian adult male smokers over 18 years of age using a  generalized additive model (GAM). In GAM a latent variable with logistic distribution and identity link function was considered. Data from 913 Iranian male current smokers over the age of 18 was evaluated from a national cross-sectional survey of non-communicable disease (NCD) risk factors in 2016. Individuals were classified into: light, moderate, and heavy smokers. A GAM was used to assess the relationship. The results showed that 246 (26.9%) subjects were light smokers, 190 (20.8%) subjects were moderate smokers and 477 (52.2%) subjects were heavy smokers. According to the GAM results, the relationship was nonlinear and smokers who started smoking at a younger age were more likely to become heavy smokers. The factors of unemployment (OR = 1.364, 95% CI 0.725–2.563), retirement (OR = 1.217, 95% CI 0.667–2.223), and exposure to secondhand smoke at home (OR = 1.364, 95% CI 1.055–1.763) increased the risk of heavy smoking. but, smokers with high-income (OR = 0.742, 95% CI 0.552–0.998) had a low tendency to heavy smoking. GAM identified the nonlinear relationship between the age of onset of smoking and smoking intensity. Tobacco control programs should be focused on young and adolescent groups and poorer socio-economic communities.",
        "conclusions": "According to the results of this study, poorer socioeconomic status as well as starting smoking at a younger age is associated with heavy smoking. Also, men in the age group of 40 to 70 years had higher consumption intensity than other age groups. Therefore, more intensive consumption and its adverse consequences in adulthood can be predicted by these factors.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Convolutional neural network-based respiration analysis of electrical activities of the diaphragm",
        "link": "https://www.nature.com/articles/s41598-022-21165-9",
        "publication_date": "05 Oct 2022",
        "abstract": "The electrical activity of the diaphragm (Edi) is considered a new respiratory vital sign for monitoring breathing patterns and efforts during ventilator care. However, the Edi signal contains irregular noise from complex causes, which makes reliable breathing analysis difficult. Deep learning was implemented to accurately detect the Edi signal peaks and analyze actual neural breathing in premature infants. Edi signals were collected from 17 premature infants born before gestational age less than 32 weeks, who received ventilatory support with a non-invasive neurally adjusted ventilatory assist. First, a local maximal detection method that over-detects candidate Edi peaks was used. Subsequently, a convolutional neural network-based deep learning was implemented to classify candidates into final Edi peaks. Our approach showed superior performance in all aspects of respiratory Edi peak detection and neural breathing analysis compared with the currently used recording technique in the ventilator. The method obtained a f1-score of 0.956 for the Edi peak detection performance and \\({R}^{2}\\) value of 0.823 for respiratory rates based on the number of Edi peaks. The proposed technique can achieve a more reliable analysis of Edi signals, including evaluation of the respiration rate in premature infants.",
        "conclusions": "We proposed a deep learning-based two-stage method to analyze the Edi of premature infants with a large amount of noise in the signal. The proposed method estimated the respiratory rates of premature infants more reliably by detecting Edi peaks more precisely. Because the proposed method showed promising results in all aspects of respiratory Edi peak detection performance in comparison with other methods, it could be used as a pre-processing step in building a respiration big data registry for analysis or machine learning processes.In the future, this research can be extended to studies of (1) real-time Edi signal monitoring that provides information on the patient’s respiration, and (2) detection of inspiration beginning for breathing support during ventilator-assisted delivery through a manner similar to this study. These two additional studies based on the proposed method will help premature infants who require precise respiratory monitoring and assistance.",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A whole-body FDG-PET/CT Dataset with manually annotated Tumor Lesions",
        "link": "https://www.nature.com/articles/s41597-022-01718-3",
        "publication_date": "04 Oct 2022",
        "abstract": "We describe a publicly available dataset of annotated Positron Emission Tomography/Computed Tomography (PET/CT) studies. 1014 whole body Fluorodeoxyglucose (FDG)-PET/CT datasets (501 studies of patients with malignant lymphoma, melanoma and non small cell lung cancer (NSCLC) and 513 studies without PET-positive malignant lesions (negative controls)) acquired between 2014 and 2018 were included. All examinations were acquired on a single, state-of-the-art PET/CT scanner. The imaging protocol consisted of a whole-body FDG-PET acquisition and a corresponding diagnostic CT scan. All FDG-avid lesions identified as malignant based on the clinical PET/CT report were manually segmented on PET images in a slice-per-slice (3D) manner. We provide the anonymized original DICOM files of all studies as well as the corresponding DICOM segmentation masks. In addition, we provide scripts for image processing and conversion to different file formats (NIfTI, mha, hdf5). Primary diagnosis, age and sex are provided as non-imaging information. We demonstrate how this dataset can be used for deep learning-based automated analysis of PET/CT data and provide the trained deep learning model.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Energy intake estimation using a novel wearable sensor and food images in a laboratory (pseudo-free-living) meal setting: quantification and contribution of sources of error",
        "link": "https://www.nature.com/articles/s41366-022-01225-w",
        "publication_date": "03 Oct 2022",
        "abstract": "Dietary assessment methods not relying on self-report are needed. The Automatic Ingestion Monitor 2 (AIM-2) combines a wearable camera that captures food images with sensors that detect food intake. We compared energy intake (EI) estimates of meals derived from AIM-2 chewing sensor signals, AIM-2 images, and an internet-based diet diary, with researcher conducted weighed food records (WFR) as the gold standard.",
        "conclusions": "Here, we presented a novel wearable sensor system that can estimate EI of meals from sensors and images without the need of any fiducial markers in the images. The sensor-based model had the best results compared with WFR versus image analysis or an internet-based food diary. The greatest sources of error were from portion size inaccuracies due to nutritionist error and inaccurate portion sizes of foods in the reference databases used for image analysis, suggesting that focus on these two sources of error should be guiding future development of improved computer-based methods for food image analysis than currently exist. Overall, the findings provide good evidence that the sensor-based model may provide a valid estimate of meal EI in a simulated free-living environment. Developmental research is still needed before the method can be widely used.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Understanding multimorbidity trajectories in Scotland using sequence analysis",
        "link": "https://www.nature.com/articles/s41598-022-20546-4",
        "publication_date": "01 Oct 2022",
        "abstract": "Understanding how multiple conditions develop over time is of growing interest, but there is currently limited methodological development on the topic, especially in understanding how multimorbidity (the co-existence of at least two chronic conditions) develops longitudinally and in which order diseases occur. We aim to describe how a longitudinal method, sequence analysis, can be used to understand the sequencing of common chronic diseases that lead to multimorbidity and the socio-demographic factors and health outcomes associated with typical disease trajectories. We use the Scottish Longitudinal Study (SLS) linking the Scottish census 2001 to disease registries, hospitalisation and mortality records. SLS participants aged 40–74 years at baseline were followed over a 10-year period (2001–2011) for the onset of three commonly occurring diseases: diabetes, cardiovascular disease (CVD), and cancer. We focused on participants who transitioned to at least two of these conditions over the follow-up period (N = 6300). We use sequence analysis with optimal matching and hierarchical cluster analysis to understand the process of disease sequencing and to distinguish typical multimorbidity trajectories. Socio-demographic differences between specific disease trajectories were evaluated using multinomial logistic regression. Poisson and Cox regressions were used to assess differences in hospitalisation and mortality outcomes between typical trajectories. Individuals who transitioned to multimorbidity over 10 years were more likely to be older and living in more deprived areas than the rest of the population. We found seven typical trajectories: later fast transition to multimorbidity, CVD start with slow transition to multimorbidity, cancer start with slow transition to multimorbidity, diabetes start with slow transition to multimorbidity, fast transition to both diabetes and CVD, fast transition to multimorbidity and death, fast transition to both cancer and CVD. Those who quickly transitioned to multimorbidity and death were the most vulnerable, typically older, less educated, and more likely to live in more deprived areas. They also experienced higher number of hospitalisations and overnight stays while still alive. Sequence analysis can strengthen our understanding of typical disease trajectories when considering a few key diseases. This may have implications for more active clinical review of patients beginning quick transition trajectories.",
        "conclusions": "Understanding the sociodemographic profile and outcomes of diverse typical trajectories of multimorbidity is complex. This complexity was revealed using sequence analysis based on a small set of commonly occurring diseases (diabetes, CVD and cancer) to characterise trajectories to multimorbidity. Further methodological work should consider scaling up to more diseases, or if disease progression data were available, using multi-channel sequence analysis to explore parallel detailed disease trajectories. However, when considering more than a few diseases, other methods, such as machine learning, may be more appropriate. Scaling up, however, will come with the challenge of interpreting findings and drawing meaningful conclusions from a very large number of trajectories.",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine-learning algorithms for asthma, COPD, and lung cancer risk assessment using circulating microbial extracellular vesicle data and their application to assess dietary effects",
        "link": "https://www.nature.com/articles/s12276-022-00846-5",
        "publication_date": "30 Sept 2022",
        "abstract": "Although mounting evidence suggests that the microbiome has a tremendous influence on intractable disease, the relationship between circulating microbial extracellular vesicles (EVs) and respiratory disease remains unexplored. Here, we developed predictive diagnostic models for COPD, asthma, and lung cancer by applying machine learning to microbial EV metagenomes isolated from patient serum and coded by their accumulated taxonomic hierarchy. All models demonstrated high predictive strength with mean AUC values ranging from 0.93 to 0.99 with various important features at the genus and phylum levels. Application of the clinical models in mice showed that various foods reduced high-fat diet-associated asthma and lung cancer risk, while COPD was minimally affected. In conclusion, this study offers a novel methodology for respiratory disease prediction and highlights the utility of serum microbial EVs as data-rich features for noninvasive diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluation of electrolyte element composition in human tissue by laser-induced breakdown spectroscopy (LIBS)",
        "link": "https://www.nature.com/articles/s41598-022-20825-0",
        "publication_date": "30 Sept 2022",
        "abstract": "Laser-induced breakdown spectroscopy (LIBS) enables the direct measurement of cell electrolyte concentrations. The utility of LIBS spectra in biomarker studies is limited because these studies rarely consider basic physical principles. The aim of this study was to test the suitability of LIBS spectra as an analytical method for biomarker assays and to evaluate the composition of electrolyte elements in human biomaterial. LIBS as an analytical method was evaluated by establishing KCl calibration curves to demonstrate linearity, by the correct identification of emission lines with corresponding reference spectra, and by the feasibility to use LIBS in human biomaterial, analyzing striated muscle tissues from the oral regions of two patients. Lorentzian peak fit and peak area calculations resulted in better linearity and reduced shot-to-shot variance. Correct quantitative measurement allowed for differentiation of human biomaterial between patients, and determination of the concentration ratios of main electrolytes within human tissue. The clinical significance of LIBS spectra should be evaluated using peak area rather than peak intensity. LIBS might be a promising tool for analyzing a small group of living cells. Due to linearity, specificity and robustness of the proposed analytical method, LIBS could be a component of future biomarker studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cost-effective methylome sequencing of cell-free DNA for accurately detecting and locating cancer",
        "link": "https://www.nature.com/articles/s41467-022-32995-6",
        "publication_date": "29 Sept 2022",
        "abstract": "Early cancer detection by cell-free DNA faces multiple challenges: low fraction of tumor cell-free DNA, molecular heterogeneity of cancer, and sample sizes that are not sufficient to reflect diverse patient populations. Here, we develop a cancer detection approach to address these challenges. It consists of an assay, cfMethyl-Seq, for cost-effective sequencing of the cell-free DNA methylome (with > 12-fold enrichment over whole genome bisulfite sequencing in CpG islands), and a computational method to extract methylation information and diagnose patients. Applying our approach to 408 colon, liver, lung, and stomach cancer patients and controls, at 97.9% specificity we achieve 80.7% and 74.5% sensitivity in detecting all-stage and early-stage cancer, and 89.1% and 85.0% accuracy for locating tissue-of-origin of all-stage and early-stage cancer, respectively. Our approach cost-effectively retains methylome profiles of cancer abnormalities, allowing us to learn new features and expand to other cancer types as training cohorts grow.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Transformer and group parallel axial attention co-encoder for medical image segmentation",
        "link": "https://www.nature.com/articles/s41598-022-20440-z",
        "publication_date": "27 Sept 2022",
        "abstract": "U-Net has become baseline standard in the medical image segmentation tasks, but it has limitations in explicitly modeling long-term dependencies. Transformer has the ability to capture long-term relevance through its internal self-attention. However, Transformer is committed to modeling the correlation of all elements, but its awareness of local foreground information is not significant. Since medical images are often presented as regional blocks, local information is equally important. In this paper, we propose the GPA-TUNet by considering local and global information synthetically. Specifically, we propose a new attention mechanism to highlight local foreground information, called group parallel axial attention (GPA). Furthermore, we effectively combine GPA with Transformer in encoder part of model. It can not only highlight the foreground information of samples, but also reduce the negative influence of background information on the segmentation results. Meanwhile, we introduced the sMLP block to improve the global modeling capability of network. Sparse connectivity and weight sharing are well achieved by applying it. Extensive experiments on public datasets confirm the excellent performance of our proposed GPA-TUNet. In particular, on Synapse and ACDC datasets, mean DSC(%) reached 80.37% and 90.37% respectively, mean HD95(mm) reached 20.55 and 1.23 respectively.",
        "conclusions": "In this paper, we propose a new attention mechanism: Group Parallel Axial Attention (GPA), which enables local information modeling by computing feature weights in parallel with attention in different directions (horizontal and vertical) of the image. Combining GPA with Transformer, co-encoder GPA-TUNet is constructed to explore performance for medical image segmentation. It not only obtains sample local correlations by GPA based on pixel level, but also encodes powerful global context by Transformer with image features as sequences. Furthermore, we introduce sMLP to strengthen the global information dependence, which relies on sparse connections and weight sharing. The whole structure adopts U-shape structure, thus also preserving the coarse-grained features of CNN. Extensive experiments demonstrate that GPA-TUNet jointly models local information dependencies and global correlation dependencies properly. It is especially remarkable for the segmentation performance of organs with large axial spans. Compared with various other existing methods, GPA-TUNet achieves optimal segmentation results on two different publicly available datasets. GPA-TUNet has poor segmentation performance for small organs. The reason is that there are fewer axial reference pixels for small organs, and the model easily misjudges foreground information as background information. For the shortcomings of this paper, we will continue to improve in the future.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Estimating individual treatment effect on disability progression in multiple sclerosis using deep learning",
        "link": "https://www.nature.com/articles/s41467-022-33269-x",
        "publication_date": "26 Sept 2022",
        "abstract": "Disability progression in multiple sclerosis remains resistant to treatment. The absence of a suitable biomarker to allow for phase 2 clinical trials presents a high barrier for drug development. We propose to enable short proof-of-concept trials by increasing statistical power using a deep-learning predictive enrichment strategy. Specifically, a multi-headed multilayer perceptron is used to estimate the conditional average treatment effect (CATE) using baseline clinical and imaging features, and patients predicted to be most responsive are preferentially randomized into a trial. Leveraging data from six randomized clinical trials (n = 3,830), we first pre-trained the model on the subset of relapsing-remitting MS patients (n = 2,520), then fine-tuned it on a subset of primary progressive MS (PPMS) patients (n = 695). In a separate held-out test set of PPMS patients randomized to anti-CD20 antibodies or placebo (n = 297), the average treatment effect was larger for the 50% (HR, 0.492; 95% CI, 0.266-0.912; p = 0.0218) and 30% (HR, 0.361; 95% CI, 0.165-0.79; p = 0.008) predicted to be most responsive, compared to 0.743 (95% CI, 0.482-1.15; p = 0.179) for the entire group. The same model could also identify responders to laquinimod in another held-out test set of PPMS patients (n = 318). Finally, we show that using this model for predictive enrichment results in important increases in power.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automated detection of enlarged extraocular muscle in Graves’ ophthalmopathy with computed tomography and deep neural network",
        "link": "https://www.nature.com/articles/s41598-022-20279-4",
        "publication_date": "26 Sept 2022",
        "abstract": "This study aimed to develop a diagnostic software system to evaluate the enlarged extraocular muscles (EEM) in patients with Graves’ ophthalmopathy (GO) by a deep neural network.This prospective observational study involved 371 participants (199 EEM patients with GO and 172 controls with normal extraocular muscles) whose extraocular muscles were examined with orbital coronal computed tomography. When at least one rectus muscle (right or left superior, inferior, medial, or lateral) in the patients was 4.0 mm or larger, it was classified as an EEM patient with GO. We used 222 images of the data from patients as the training data, 74 images as the validation test data, and 75 images as the test data to “train” the deep neural network to judge the thickness of the extraocular muscles on computed tomography. We then validated the performance of the network. In the test data, the area under the curve was 0.946 (95% confidence interval (CI) 0.894–0.998), and receiver operating characteristic analysis demonstrated 92.5% (95% CI 0.796–0.984) sensitivity and 88.6% (95% CI 0.733–0.968) specificity. The results suggest that the deep learning system with the deep neural network can detect EEM in patients with GO.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Short-term local predictions of COVID-19 in the United Kingdom using dynamic supervised machine learning algorithms",
        "link": "https://www.nature.com/articles/s43856-022-00184-7",
        "publication_date": "24 Sept 2022",
        "abstract": "Short-term prediction of COVID-19 epidemics is crucial to decision making. We aimed to develop supervised machine-learning algorithms on multiple digital metrics including symptom search trends, population mobility, and vaccination coverage to predict local-level COVID-19 growth rates in the UK.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Forecasting admissions in psychiatric hospitals before and during Covid-19: a retrospective study with routine data",
        "link": "https://www.nature.com/articles/s41598-022-20190-y",
        "publication_date": "23 Sept 2022",
        "abstract": "The COVID-19 pandemic has strong effects on most health care systems. Forecasting of admissions can help for the efficient organisation of hospital care. We aimed to forecast the number of admissions to psychiatric hospitals before and during the COVID-19 pandemic and we compared the performance of machine learning models and time series models. This would eventually allow to support timely resource allocation for optimal treatment of patients. We used admission data from 9 psychiatric hospitals in Germany between 2017 and 2020. We compared machine learning models with time series models in weekly, monthly and yearly forecasting before and during the COVID-19 pandemic. A total of 90,686 admissions were analysed. The models explained up to 90% of variance in hospital admissions in 2019 and 75% in 2020 with the effects of the COVID-19 pandemic. The best models substantially outperformed a one-step seasonal naïve forecast (seasonal mean absolute scaled error (sMASE) 2019: 0.59, 2020: 0.76). The best model in 2019 was a machine learning model (elastic net, mean absolute error (MAE): 7.25). The best model in 2020 was a time series model (exponential smoothing state space model with Box-Cox transformation, ARMA errors and trend and seasonal components, MAE: 10.44). Models forecasting admissions one week in advance did not perform better than monthly and yearly models in 2019 but they did in 2020. The most important features for the machine learning models were calendrical variables. Model performance did not vary much between different modelling approaches before the COVID-19 pandemic and established forecasts were substantially better than one-step seasonal naïve forecasts. However, weekly time series models adjusted quicker to the COVID-19 related shock effects. In practice, multiple individual forecast horizons could be used simultaneously, such as a yearly model to achieve early forecasts for a long planning period and weekly models to adjust quicker to sudden changes.",
        "conclusions": "Accurate forecasting of hospital admissions can help for the efficient organisation of hospital care and for the adjustment of resources to sudden changes in patient volumes. We found a substantial improvement of forecasting accuracy in comparison to a seasonally adjusted naïve baseline forecast. Model performance did not vary much between different modelling approaches and different forecasting horizons before the COVID-19 pandemic. However, weekly time series models adjusted quicker to the COVID-19 related shock effects. In practice, multiple individual forecast horizons could be used simultaneously, such as a yearly model to achieve early forecasts for a long planning period and weekly models to provided more precise forecasts that adjust quicker to sudden changes.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Integrated multimodal artificial intelligence framework for healthcare applications",
        "link": "https://www.nature.com/articles/s41746-022-00689-4",
        "publication_date": "20 Sept 2022",
        "abstract": "Artificial intelligence (AI) systems hold great promise to improve healthcare over the next decades. Specifically, AI systems leveraging multiple data sources and input modalities are poised to become a viable method to deliver more accurate results and deployable pipelines across a wide range of applications. In this work, we propose and evaluate a unified Holistic AI in Medicine (HAIM) framework to facilitate the generation and testing of AI systems that leverage multimodal inputs. Our approach uses generalizable data pre-processing and machine learning modeling stages that can be readily adapted for research and deployment in healthcare environments. We evaluate our HAIM framework by training and characterizing 14,324 independent models based on HAIM-MIMIC-MM, a multimodal clinical database (N = 34,537 samples) containing 7279 unique hospitalizations and 6485 patients, spanning all possible input combinations of 4 data modalities (i.e., tabular, time-series, text, and images), 11 unique data sources and 12 predictive tasks. We show that this framework can consistently and robustly produce models that outperform similar single-source approaches across various healthcare demonstrations (by 6–33%), including 10 distinct chest pathology diagnoses, along with length-of-stay and 48 h mortality predictions. We also quantify the contribution of each modality and data source using Shapley values, which demonstrates the heterogeneity in data modality importance and the necessity of multimodal inputs across different healthcare-relevant tasks. The generalizable properties and flexibility of our Holistic AI in Medicine (HAIM) framework could offer a promising pathway for future multimodal predictive systems in clinical and operational healthcare settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Label-free intraoperative histology of bone tissue via deep-learning-assisted ultraviolet photoacoustic microscopy",
        "link": "https://www.nature.com/articles/s41551-022-00940-z",
        "publication_date": "19 Sept 2022",
        "abstract": "Obtaining frozen sections of bone tissue for intraoperative examination is challenging. To identify the bony edge of resection, orthopaedic oncologists therefore rely on pre-operative X-ray computed tomography or magnetic resonance imaging. However, these techniques do not allow for accurate diagnosis or for intraoperative confirmation of the tumour margins, and in bony sarcomas, they can lead to bone margins up to 10-fold wider (1,000-fold volumetrically) than necessary. Here, we show that real-time three-dimensional contour-scanning of tissue via ultraviolet photoacoustic microscopy in reflection mode can be used to intraoperatively evaluate undecalcified and decalcified thick bone specimens, without the need for tissue sectioning. We validate the technique with gold-standard haematoxylin-and-eosin histology images acquired via a traditional optical microscope, and also show that an unsupervised generative adversarial network can virtually stain the ultraviolet-photoacoustic-microscopy images, allowing pathologists to readily identify cancerous features. Label-free and slide-free histology via ultraviolet photoacoustic microscopy may allow for rapid diagnoses of bone-tissue pathologies and aid the intraoperative determination of tumour margins.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification and characterization of the kynurenine pathway in the pond snail Lymnaea stagnalis",
        "link": "https://www.nature.com/articles/s41598-022-19652-0",
        "publication_date": "16 Sept 2022",
        "abstract": "Dysregulation of the kynurenine pathway (KP) is implicated in many human diseases and disorders, from immunological, metabolic, neurodegenerative, and neuropsychiatric conditions to cancer, and represents an appealing target for new therapeutic approaches. In this intricate scenario, invertebrates, like Lymnaea stagnalis (LS), provide a flexible tool to unravel the complexity of the KP. Starting from the available LS genome and transcriptome, we identified putative transcripts of all KP enzymes containing an ORF; each predicted protein possessed a high degree of sequence conservation to known orthologues of other invertebrate and vertebrate model organisms. Sequences were confirmed by qualitative PCR and sequencing. At the same time, the qRT-PCR analysis revealed that Lym IDO-like, Lym TDO-like, Lym AFMID-like, Lym KMO-like, Lym AADAT-like, Lym KYAT I/III-like, Lym KYNU-like, Lym HAAO-like, and Lym ACMSD-like showed widespread tissue expression. Then, tryptophan, kynurenine, kynurenic acid, anthranilic acid, 3-hydroxy-kynurenine, xanthurenic acid, picolinic acid, and quinolinic acid were identified in the hemolymph of LS by UHPLC-Q exactive mass spectrometer. Our study provides the most thorough characterization to date of the KP in an invertebrate model, supporting the value of LS for future functional studies of this pathway at the cellular, synaptic, and behavioral levels.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Medication history-wide association studies for pharmacovigilance of pregnant patients",
        "link": "https://www.nature.com/articles/s43856-022-00181-w",
        "publication_date": "16 Sept 2022",
        "abstract": "Systematic exclusion of pregnant people from interventional clinical trials has created a public health emergency for millions of patients through a dearth of robust safety data for common drugs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A radiomics-based study for differentiating parasellar cavernous hemangiomas from meningiomas",
        "link": "https://www.nature.com/articles/s41598-022-19770-9",
        "publication_date": "15 Sept 2022",
        "abstract": "To investigate the value of the radiomic models for differentiating parasellar cavernous hemangiomas from meningiomas and to compare the classification performance with different MR sequences and classifiers. A total of 96 patients with parasellar tumors (40 cavernous hemangiomas and 56 meningiomas) were enrolled in this retrospective multiple-center study. Univariate and multivariate analyses were performed to identify the clinical factors and semantic features of MRI scans. Radiomics features were extracted from five MRI sequences using radiomics software. Three feature selection methods and six classifiers were evaluated in the training cohort to construct favorable radiomic machine-learning classifiers. The performance of different classifiers was evaluated using the AUC and compared to neuroradiologists. The detection rates of T1WI, T2WI, and CE-T1WI for parasellar cavernous hemangiomas and meningiomas were approximately 100%. In contrast, the ADC maps had the detection rate of 18/22 and 19/25, respectively, (AUC, 0.881) with 2.25 cm as the critical value diameter. Radiomics models with the SVM and KNN classifiers based on T2WI and ADC maps had favorable predictive performances (AUC > 0.90 and F-score value > 0.80). These models outperformed MRI model (AUC 0.805) and neuroradiologists (AUC, 0.756 and 0.545, respectively). Radiomic models based on T2WI and ADC and combined with SVM and KNN classifiers have the potential to be a viable method for differentiating parasellar hemangiomas from meningiomas. T2WI is more universally applicable than ADC values due to its higher detection rate for parasellar tumors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]