[
    {
        "title": "Multimodal deep learning for Alzheimer’s disease dementia assessment",
        "link": "https://www.nature.com/articles/s41467-022-31037-5",
        "publication_date": "20 Jun 2022",
        "abstract": "Worldwide, there are nearly 10 million new cases of dementia annually, of which Alzheimer’s disease (AD) is the most common. New measures are needed to improve the diagnosis of individuals with cognitive impairment due to various etiologies. Here, we report a deep learning framework that accomplishes multiple diagnostic steps in successive fashion to identify persons with normal cognition (NC), mild cognitive impairment (MCI), AD, and non-AD dementias (nADD). We demonstrate a range of models capable of accepting flexible combinations of routinely collected clinical information, including demographics, medical history, neuropsychological testing, neuroimaging, and functional assessments. We then show that these frameworks compare favorably with the diagnostic accuracy of practicing neurologists and neuroradiologists. Lastly, we apply interpretability methods in computer vision to show that disease-specific patterns detected by our models track distinct patterns of degenerative changes throughout the brain and correspond closely with the presence of neuropathological lesions on autopsy. Our work demonstrates methodologies for validating computational predictions with established standards of medical diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Using random forest to identify longitudinal predictors of health in a 30-year cohort study",
        "link": "https://www.nature.com/articles/s41598-022-14632-w",
        "publication_date": "20 Jun 2022",
        "abstract": "Due to the wealth of exposome data from longitudinal cohort studies that is currently available, the need for methods to adequately analyze these data is growing. We propose an approach in which machine learning is used to identify longitudinal exposome-related predictors of health, and illustrate its potential through an application. Our application involves studying the relation between exposome and self-perceived health based on the 30-year running Doetinchem Cohort Study. Random Forest (RF) was used to identify the strongest predictors due to its favorable prediction performance in prior research. The relation between predictors and outcome was visualized with partial dependence and accumulated local effects plots. To facilitate interpretation, exposures were summarized by expressing them as the average exposure and average trend over time. The RF model’s ability to discriminate poor from good self-perceived health was acceptable (Area-Under-the-Curve = 0.707). Nine exposures from different exposome-related domains were largely responsible for the model’s performance, while 87 exposures seemed to contribute little to the performance. Our approach demonstrates that ML can be interpreted more than widely believed, and can be applied to identify important longitudinal predictors of health over the life course in studies with repeated measures of exposure. The approach is context-independent and broadly applicable.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Integration of feature vectors from raw laboratory, medication and procedure names improves the precision and recall of models to predict postoperative mortality and acute kidney injury",
        "link": "https://www.nature.com/articles/s41598-022-13879-7",
        "publication_date": "17 Jun 2022",
        "abstract": "Manuscripts that have successfully used machine learning (ML) to predict a variety of perioperative outcomes often use only a limited number of features selected by a clinician. We hypothesized that techniques leveraging a broad set of features for patient laboratory results, medications, and the surgical procedure name would improve performance as compared to a more limited set of features chosen by clinicians. Feature vectors for laboratory results included 702 features total derived from 39 laboratory tests, medications consisted of a binary flag for 126 commonly used medications, procedure name used the Word2Vec package for create a vector of length 100. Nine models were trained: baseline features, one for each of the three types of data Baseline + Each data type, (all features, and then all features with feature reduction algorithm. Across both outcomes the models that contained all features (model 8) (Mortality ROC-AUC 94.32 ± 1.01, PR-AUC 36.80 ± 5.10 AKI ROC-AUC 92.45 ± 0.64, PR-AUC 76.22 ± 1.95) was superior to models with only subsets of features. Featurization techniques leveraging a broad away of clinical data can improve performance of perioperative prediction models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Confounding factors need to be accounted for in assessing bias by machine learning algorithms",
        "link": "https://www.nature.com/articles/s41591-022-01847-7",
        "publication_date": "16 Jun 2022",
        "abstract": "arising from L. Seyyed-Kalantari et al. Nature Medicine https://doi.org/10.1038/s41591-021-01595-0 (2021).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A computerized diagnostic model for automatically evaluating placenta accrete spectrum disorders based on the combined MR radiomics-clinical signatures",
        "link": "https://www.nature.com/articles/s41598-022-14454-w",
        "publication_date": "16 Jun 2022",
        "abstract": "We aimed to establish a computerized diagnostic model to predict placenta accrete spectrum (PAS) disorders based on T2-weighted MR imaging. We recruited pregnant women with clinically suspected PAS disorders between January 2015 and December 2018 in our institution. All preoperative T2-weighted imaging (T2WI) MR images were manually outlined on the picture archive communication system terminal server. A nnU-Net network for automatic segmentation and the corresponding radiomics features extracted from the segmented region were applied to build a radiomics-clinical model for PAS disorders identification. Taking the surgical or pathological findings as the reference standard, we compared this computerized model’s diagnostic performance in detecting PAS disorders. In the training cohort, our model combining both radiomics and clinical characteristics yielded an accuracy of 0.771, a sensitivity of 0.854, and a specificity of 0.750 in identifying PAS disorders. In the testing cohort, this model achieved a segmentation mean Dice coefficient of 0.890 and yielded an accuracy of 0.825, a sensitivity of 0.830 and a specificity of 0.822. In the external validation cohort, this computer-aided diagnostic model yielded an accuracy of 0.690, a sensitivity of 0.929 and a specificity of 0.467 in identifying placenta increta. In the present study, a machine learning model based on preoperative T2WI-based imaging had high accuracy in identifying PAS disorders in respect of surgical and histological findings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A dataset of simulated patient-physician medical interviews with a focus on respiratory cases",
        "link": "https://www.nature.com/articles/s41597-022-01423-1",
        "publication_date": "16 Jun 2022",
        "abstract": "Artificial Intelligence (AI) is playing a major role in medical education, diagnosis, and outbreak detection through Natural Language Processing (NLP), machine learning models and deep learning tools. However, in order to train AI to facilitate these medical fields, well-documented and accurate medical conversations are needed. The dataset presented covers a series of medical conversations in the format of Objective Structured Clinical Examinations (OSCE), with a focus on respiratory cases in audio format and corresponding text documents. These cases were simulated, recorded, transcribed, and manually corrected with the underlying aim of providing a comprehensive set of medical conversation data to the academic and industry community. Potential applications include speech recognition detection for speech-to-text errors, training NLP models to extract symptoms, detecting diseases, or for educational purposes, including training an avatar to converse with healthcare professional students as a standardized patient during clinical examinations. The application opportunities for the presented dataset are vast, given that this calibre of data is difficult to access and costly to develop.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Single-cell profiling of the antigen-specific response to BNT162b2 SARS-CoV-2 RNA vaccine",
        "link": "https://www.nature.com/articles/s41467-022-31142-5",
        "publication_date": "16 Jun 2022",
        "abstract": "RNA-based vaccines against SARS-CoV-2 have proven critical to limiting COVID-19 disease severity and spread. Cellular mechanisms driving antigen-specific responses to these vaccines, however, remain uncertain. Here we identify and characterize antigen-specific cells and antibody responses to the RNA vaccine BNT162b2 using multiple single-cell technologies for in depth analysis of longitudinal samples from a cohort of healthy participants. Mass cytometry and unbiased machine learning pinpoint an expanding, population of antigen-specific memory CD4+ and CD8+ T cells with characteristics of follicular or peripheral helper cells. B cell receptor sequencing suggest progression from IgM, with apparent cross-reactivity to endemic coronaviruses, to SARS-CoV-2-specific IgA and IgG memory B cells and plasmablasts. Responding lymphocyte populations correlate with eventual SARS-CoV-2 IgG, and a participant lacking these cell populations failed to sustain SARS-CoV-2-specific antibodies and experienced breakthrough infection. These integrated proteomic and genomic platforms identify an antigen-specific cellular basis of RNA vaccine-based immunity.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Ureaplasma and Prevotella colonization with Lactobacillus abundance during pregnancy facilitates term birth",
        "link": "https://www.nature.com/articles/s41598-022-13871-1",
        "publication_date": "16 Jun 2022",
        "abstract": "Ureaplasma and Prevotella infections are well-known bacteria associated with preterm birth. However, with the development of metagenome sequencing techniques, it has been found that not all Ureaplasma and Prevotella colonizations cause preterm birth. The purpose of this study was to determine the association between Ureaplasma and Prevotella colonization with the induction of preterm birth even in the presence of Lactobacillus. In this matched case–control study, a total of 203 pregnant Korean women were selected and their cervicovaginal fluid samples were collected during mid-pregnancy. The microbiome profiles of the cervicovaginal fluid were analyzed using 16S rRNA gene amplification. Sequencing data were processed using QIIME1.9.1. Statistical analyses were performed using R software, and microbiome analysis was performed using the MicrobiomeAnalyst and Calypso software. A positive correlation between Ureaplasma and other genera was highly related to preterm birth, but interestingly, there was a negative correlation with Lactobacillus and term birth, with the same pattern observed with Prevotella. Ureaplasma and Prevotella colonization with Lactobacillus abundance during pregnancy facilitates term birth, although Ureaplasma and Prevotella are associated with preterm birth. Balanced colonization between Lactobacillus and Ureaplasma and Prevotella is important to prevent preterm birth.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Building reliable radiomic models using image perturbation",
        "link": "https://www.nature.com/articles/s41598-022-14178-x",
        "publication_date": "16 Jun 2022",
        "abstract": "Radiomic model reliability is a central premise for its clinical translation. Presently, it is assessed using test–retest or external data, which, unfortunately, is often scarce in reality. Therefore, we aimed to develop a novel image perturbation-based method (IPBM) for the first of its kind toward building a reliable radiomic model. We first developed a radiomic prognostic model for head-and-neck cancer patients on a training (70%) and evaluated on a testing (30%) cohort using C-index. Subsequently, we applied the IPBM to CT images of both cohorts (Perturbed-Train and Perturbed-Test cohort) to generate 60 additional samples for both cohorts. Model reliability was assessed using intra-class correlation coefficient (ICC) to quantify consistency of the C-index among the 60 samples in the Perturbed-Train and Perturbed-Test cohorts. Besides, we re-trained the radiomic model using reliable RFs exclusively (ICC > 0.75) to validate the IPBM. Results showed moderate model reliability in Perturbed-Train (ICC: 0.565, 95%CI 0.518–0.615) and Perturbed-Test (ICC: 0.596, 95%CI 0.527–0.670) cohorts. An enhanced reliability of the re-trained model was observed in Perturbed-Train (ICC: 0.782, 95%CI 0.759–0.815) and Perturbed-Test (ICC: 0.825, 95%CI 0.782–0.867) cohorts, indicating validity of the IPBM. To conclude, we demonstrated capability of the IPBM toward building reliable radiomic models, providing community with a novel model reliability assessment strategy prior to prospective evaluation.",
        "conclusions": "This study proposed a radiomic model reliability assessment method using perturbations. This method identifies unreliable models by comparing the model's performance on the training dataset with the performance achieved on random perturbations of the training dataset. Using this approach could help the radiomics community to build more reliable models for future clinical applications.",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cluster analysis categorizes five phenotypes of pulmonary tuberculosis",
        "link": "https://www.nature.com/articles/s41598-022-13526-1",
        "publication_date": "16 Jun 2022",
        "abstract": "Tuberculosis (TB) has a heterogeneous phenotype, which makes it challenging to diagnose. Our study aimed to identify TB phenotypes through cluster analysis and compare their initial symptomatic, microbiological and radiographic characteristics. We systemically collected data of notified TB patients notified in Korea and constructed a prospective, observational cohort database. Cluster analysis was performed using K-means clustering, and the variables to be included were determined by correlation network. A total of 4,370 subjects with pulmonary TB were enrolled in the study. Based on the correlation network, age and body mass index (BMI) were selected for the cluster analysis. Five clusters were identified and characterised as follows: (1) middle-aged overweight male dominance, (2) young-aged relatively female dominance without comorbidities, (3) middle-aged underweight male dominance, (4) overweight elderly with comorbidities and (5) underweight elderly with comorbidities. All clusters had distinct demographic and symptomatic characteristics. Initial microbiologic burdens and radiographic features also varied, including the presence of cavities and bilateral infiltration, which reflect TB-related severity. Cluster analysis of age and BMI identified five phenotypes of pulmonary TB with significant differences at initial clinical presentations. Further studies are necessary to validate our results and to assess their clinical implications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Technical report: an online international weight control registry to inform precision approaches to healthy weight management",
        "link": "https://www.nature.com/articles/s41366-022-01158-4",
        "publication_date": "16 Jun 2022",
        "abstract": "Personalizing approaches to prevention and treatment of obesity will be a crucial aspect of precision health initiatives. However, in considering individual susceptibility to obesity, much remains to be learned about how to support healthy weight management in different population subgroups, environments and geographical locations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning for comprehensive prediction of high risk for Alzheimer’s disease based on chromatic pupilloperimetry",
        "link": "https://www.nature.com/articles/s41598-022-13999-0",
        "publication_date": "15 Jun 2022",
        "abstract": "Currently there are no reliable biomarkers for early detection of Alzheimer's disease (AD) at the preclinical stage. This study assessed the pupil light reflex (PLR) for focal red and blue light stimuli in central and peripheral retina in 125 cognitively normal middle age subjects (45–71 years old) at high risk for AD due to a family history of the disease (FH+), and 61 age-similar subjects with no family history of AD (FH−) using Chromatic Pupilloperimetry coupled with Machine Learning (ML). All subjects had normal ophthalmic assessment, and normal retinal and optic nerve thickness by optical coherence tomography. No significant differences were observed between groups in cognitive function and volumetric brain MRI. Chromatic pupilloperimetry-based ML models were highly discriminative in differentiating subjects with and without AD family history, using transient PLR for focal red (primarily cone-mediated), and dim blue (primarily rod-mediated) light stimuli. Features associated with transient pupil response latency (PRL) achieved Area Under the Curve Receiver Operating Characteristic (AUC-ROC) of 0.90 ± 0.051 (left-eye) and 0.87 ± 0.048 (right-eye). Parameters associated with the contraction arm of the rod and cone-mediated PLR were more discriminative compared to parameters associated with the relaxation arm and melanopsin-mediated PLR. Significantly shorter PRL for dim blue light was measured in the FH+ group in two test targets in the temporal visual field in right eye that had highest relative weight in the ML algorithm (mean ± standard error, SE 0.449 s ± 0.007 s vs. 0.478 s ± 0.010 s, p = 0.038). Taken together our study suggests that subtle focal changes in pupil contraction latency may be detected in subjects at high risk to develop AD, decades before the onset of AD clinical symptoms. The dendrites of melanopsin containing retinal ganglion cells may be affected very early at the preclinical stages of AD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Intelligent wearable allows out-of-the-lab tracking of developing motor abilities in infants",
        "link": "https://www.nature.com/articles/s43856-022-00131-6",
        "publication_date": "15 Jun 2022",
        "abstract": "Early neurodevelopmental care needs better, effective and objective solutions for assessing infants’ motor abilities. Novel wearable technology opens possibilities for characterizing spontaneous movement behavior. This work seeks to construct and validate a generalizable, scalable, and effective method to measure infants’ spontaneous motor abilities across all motor milestones from lying supine to fluent walking.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Small-molecule metabolome identifies potential therapeutic targets against COVID-19",
        "link": "https://www.nature.com/articles/s41598-022-14050-y",
        "publication_date": "15 Jun 2022",
        "abstract": "Respiratory viruses are transmitted and acquired via the nasal mucosa, and thereby may influence the nasal metabolome composed of biochemical products produced by both host cells and microbes. Studies of the nasal metabolome demonstrate virus-specific changes that sometimes correlate with viral load and disease severity. Here, we evaluate the nasopharyngeal metabolome of COVID-19 infected individuals and report several small molecules that may be used as potential therapeutic targets. Specimens were tested by qRT-PCR with target primers for three viruses: Influenza A (INFA), respiratory syncytial virus (RSV), and SARS-CoV-2, along with unaffected controls. The nasopharyngeal metabolome was characterized using an LC–MS/MS-based screening kit capable of quantifying 141 analytes. A machine learning model identified 28 discriminating analytes and correctly categorized patients with a viral infection with an accuracy of 96% (R2 = 0.771, Q2 = 0.72). A second model identified 5 analytes to differentiate COVID19-infected patients from those with INFA or RSV with an accuracy of 85% (R2 = 0.442, Q2 = 0.301). Specifically, Lysophosphatidylcholines-a-C18:2 (LysoPCaC18:2) concentration was significantly increased in COVID19 patients (P < 0.0001), whereas beta-hydroxybutyric acid, Methionine sulfoxide, succinic acid, and carnosine concentrations were significantly decreased (P < 0.0001). This study demonstrates that COVID19 infection results in a unique nasopharyngeal metabolomic signature with carnosine and LysoPCaC18:2 as potential therapeutic targets.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Heart age estimated using explainable advanced electrocardiography",
        "link": "https://www.nature.com/articles/s41598-022-13912-9",
        "publication_date": "14 Jun 2022",
        "abstract": "Electrocardiographic (ECG) Heart Age conveying cardiovascular risk has been estimated by both Bayesian and artificial intelligence approaches. We hypothesised that explainable measures from the 10-s 12-lead ECG could successfully predict Bayesian 5-min ECG Heart Age. Advanced analysis was performed on ECGs from healthy subjects and patients with cardiovascular risk or proven heart disease. Regression models were used to predict patients’ Bayesian 5-min ECG Heart Ages from their standard, resting 10-s 12-lead ECGs. The difference between 5-min and 10-s ECG Heart Ages were analyzed, as were the differences between 10-s ECG Heart Age and the chronological age (the Heart Age Gap). In total, 2,771 subjects were included (n = 1682 healthy volunteers, n = 305 with cardiovascular risk factors, n = 784 with cardiovascular disease). Overall, 10-s Heart Age showed strong agreement with the 5-min Heart Age (R2 = 0.94, p < 0.001, mean ± SD bias 0.0 ± 5.1 years). The Heart Age Gap was 0.0 ± 5.7 years in healthy individuals, 7.4 ± 7.3 years in subjects with cardiovascular risk factors (p < 0.001), and 14.3 ± 9.2 years in patients with cardiovascular disease (p < 0.001). Heart Age can be accurately estimated from a 10-s 12-lead ECG in a transparent and explainable fashion based on known ECG measures, without deep neural network-type artificial intelligence techniques. The Heart Age Gap increases markedly with cardiovascular risk and disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The two decades brainclinics research archive for insights in neurophysiology (TDBRAIN) database",
        "link": "https://www.nature.com/articles/s41597-022-01409-z",
        "publication_date": "14 Jun 2022",
        "abstract": "In neuroscience, electroencephalography (EEG) data is often used to extract features (biomarkers) to identify neurological or psychiatric dysfunction or to predict treatment response. At the same time neuroscience is becoming more data-driven, made possible by computational advances. In support of biomarker development and methodologies such as training Artificial Intelligent (AI) networks we present the extensive Two Decades-Brainclinics Research Archive for Insights in Neurophysiology (TDBRAIN) EEG database. This clinical lifespan database (5–89 years) contains resting-state, raw EEG-data complemented with relevant clinical and demographic data of a heterogenous collection of 1274 psychiatric patients collected between 2001 to 2021. Main indications included are Major Depressive Disorder (MDD; N = 426), attention deficit hyperactivity disorder (ADHD; N = 271), Subjective Memory Complaints (SMC: N = 119) and obsessive-compulsive disorder (OCD; N = 75). Demographic-, personality- and day of measurement data are included in the database. Thirty percent of clinical and treatment outcome data will remain blinded for prospective validation and replication purposes. The TDBRAIN database and code are available on the Brainclinics Foundation website at www.brainclinics.com/resources and on Synapse at www.synapse.org/TDBRAIN.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Association of FXI activity with thrombo-inflammation, extracellular matrix, lipid metabolism and apoptosis in venous thrombosis",
        "link": "https://www.nature.com/articles/s41598-022-13174-5",
        "publication_date": "13 Jun 2022",
        "abstract": "Animal experiments and early phase human trials suggest that inhibition of factor XIa (FXIa) safely prevents venous thromboembolism (VTE), and specific murine models of sepsis have shown potential efficacy in alleviating cytokine storm. These latter findings support the role of FXI beyond coagulation. Here, we combine targeted proteomics, machine learning and bioinformatics, to discover associations between FXI activity (FXI:C) and the plasma protein profile of patients with VTE. FXI:C was measured with a modified activated partial prothrombin time (APTT) clotting time assay. Proximity extension assay-based protein profiling was performed on plasma collected from subjects from the Genotyping and Molecular Phenotyping of Venous Thromboembolism (GMP-VTE) Project, collected during an acute VTE event (n = 549) and 12-months after (n = 187). Among 444 proteins investigated, N = 21 and N = 66 were associated with FXI:C during the acute VTE event and at 12 months follow-up, respectively. Seven proteins were identified as FXI:C-associated at both time points. These FXI-related proteins were enriched in immune pathways related to causes of thrombo-inflammation, extracellular matrix interaction, lipid metabolism, and apoptosis. The results of this study offer important new avenues for future research into the multiple properties of FXI, which are of high clinical interest given the current development of FXI inhibitors.",
        "conclusions": "This study reports the associations between FXI:C and an extensive set of plasma proteins in the clinical setting of venous thrombosis by exploratory high-throughput targeted proteomics. The identified FXI-associated proteins are involved in several known pathways related to specific causes of thrombo-inflammation such as IL-1, NF-κβ and TLR4 signalling pathways, in addition to relevant mechanisms including apoptosis and tissue remodelling. Given its complex interactions with the immune system, inhibition of FXI could induce a host of pleiotropic effects beyond inhibition of coagulation. Future studies should validate and determine the clinical relevance of these findings, especially to define the optimal clinical use of FXI inhibitors.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep learning model to classify neoplastic state and tissue origin from transcriptomic data",
        "link": "https://www.nature.com/articles/s41598-022-13665-5",
        "publication_date": "11 Jun 2022",
        "abstract": "Application of deep learning methods to transcriptomic data has the potential to enhance the accuracy and efficiency of tissue classification and cell state identification. Herein, we developed a multitask deep learning model for tissue classification combining publicly available whole transcriptomic (RNA-seq) datasets of non-neoplastic, neoplastic and peri-neoplastic tissue to classify disease state, tissue origin and neoplastic subclass. RNA-seq data from a total of 10,116 patient samples processed through a common pipeline were used for model training and validation. The model achieved 99% accuracy for disease state classification (ROC-AUC of 0.98) and 97% accuracy for tissue origin (ROC-AUC of 0.99). Moreover, the model achieved an accuracy of 92% (ROC-AUC 0.95) for neoplastic subclassification. This is the first multitask deep learning algorithm developed for tissue classification employing a uniform pipeline analysis of transcriptomic data with multiple tissue classifiers. This model serves as a framework for incorporating large transcriptomic datasets across conditions to facilitate clinical diagnosis and cell-based treatment strategies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "COVID-19 hospitalizations forecasts using internet search data",
        "link": "https://www.nature.com/articles/s41598-022-13162-9",
        "publication_date": "11 Jun 2022",
        "abstract": "As the COVID-19 spread over the globe and new variants of COVID-19 keep occurring, reliable real-time forecasts of COVID-19 hospitalizations are critical for public health decisions on medical resources allocations. This paper aims to forecast future 2 weeks national and state-level COVID-19 new hospital admissions in the United States. Our method is inspired by the strong association between public search behavior and hospitalization admissions and is extended from a previously-proposed influenza tracking model, AutoRegression with GOogle search data (ARGO). Our LASSO-penalized linear regression method efficiently combines Google search information and COVID-19 related time series information with dynamic training and rolling window prediction. Compared to other publicly available models collected from COVID-19 forecast hub, our method achieves substantial error reduction in a retrospective out-of-sample evaluation from Jan 4, 2021, to Dec 27, 2021. Overall, we showed that our method is flexible, self-correcting, robust, accurate, and interpretable, making it a potentially powerful tool to assist healthcare officials and decision making for the current and future infectious disease outbreaks.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep neural network trained on gigapixel images improves lymph node metastasis detection in clinical settings",
        "link": "https://www.nature.com/articles/s41467-022-30746-1",
        "publication_date": "10 Jun 2022",
        "abstract": "The pathological identification of lymph node (LN) metastasis is demanding and tedious. Although convolutional neural networks (CNNs) possess considerable potential in improving the process, the ultrahigh-resolution of whole slide images hinders the development of a clinically applicable solution. We design an artificial-intelligence-assisted LN assessment workflow to facilitate the routine counting of metastatic LNs. Unlike previous patch-based approaches, our proposed method trains CNNs by using 5-gigapixel images, obviating the need for lesion-level annotations. Trained on 5907 LN images, our algorithm identifies metastatic LNs in gastric cancer with a slide-level area under the receiver operating characteristic curve (AUC) of 0.9936. Clinical experiments reveal that the workflow significantly improves the sensitivity of micrometastasis identification (81.94% to 95.83%, P < .001) and isolated tumor cells (67.95% to 96.15%, P < .001) in a significantly shorter review time (−31.5%, P < .001). Cross-site evaluation indicates that the algorithm is highly robust (AUC = 0.9829).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Defining brain-based OCD patient profiles using task-based fMRI and unsupervised machine learning",
        "link": "https://www.nature.com/articles/s41386-022-01353-x",
        "publication_date": "09 Jun 2022",
        "abstract": "While much research has highlighted phenotypic heterogeneity in obsessive compulsive disorder (OCD), less work has focused on heterogeneity in neural activity. Conventional neuroimaging approaches rely on group averages that assume homogenous patient populations. If subgroups are present, these approaches can increase variability and can lead to discrepancies in the literature. They can also obscure differences between various subgroups. To address this issue, we used unsupervised machine learning to identify subgroup clusters of patients with OCD who were assessed by task-based fMRI. We predominantly focused on activation of cognitive control and performance monitoring neurocircuits, including three large-scale brain networks that have been implicated in OCD (the frontoparietal network, cingulo-opercular network, and default mode network). Participants were patients with OCD (n = 128) that included both adults (ages 24–45) and adolescents (ages 12–17), as well as unaffected controls (n = 64). Neural assessments included tests of cognitive interference and error processing. We found three patient clusters, reflecting a “normative” cluster that shared a brain activation pattern with unaffected controls (65.9% of clinical participants), as well as an “interference hyperactivity” cluster (15.2% of clinical participants) and an “error hyperactivity” cluster (18.9% of clinical participants). We also related these clusters to demographic and clinical correlates. After post-hoc correction for false discovery rates, the interference hyperactivity cluster showed significantly longer reaction times than the other patient clusters, but no other between-cluster differences in covariates were detected. These findings increase precision in patient characterization, reframe prior neurobehavioral research in OCD, and provide a starting point for neuroimaging-guided treatment selection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A new generative adversarial network for medical images super resolution",
        "link": "https://www.nature.com/articles/s41598-022-13658-4",
        "publication_date": "09 Jun 2022",
        "abstract": "For medical image analysis, there is always an immense need for rich details in an image. Typically, the diagnosis will be served best if the fine details in the image are retained and the image is available in high resolution. In medical imaging, acquiring high-resolution images is challenging and costly as it requires sophisticated and expensive instruments, trained human resources, and often causes operation delays. Deep learning based super resolution techniques can help us to extract rich details from a low-resolution image acquired using the existing devices. In this paper, we propose a new Generative Adversarial Network (GAN) based architecture for medical images, which maps low-resolution medical images to high-resolution images. The proposed architecture is divided into three steps. In the first step, we use a multi-path architecture to extract shallow features on multiple scales instead of single scale. In the second step, we use a ResNet34 architecture to extract deep features and upscale the features map by a factor of two. In the third step, we extract features of the upscaled version of the image using a residual connection-based mini-CNN and again upscale the feature map by a factor of two. The progressive upscaling overcomes the limitation for previous methods in generating true colors. Finally, we use a reconstruction convolutional layer to map back the upscaled features to a high-resolution image. Our addition of an extra loss term helps in overcoming large errors, thus, generating more realistic and smooth images. We evaluate the proposed architecture on four different medical image modalities: (1) the DRIVE and STARE datasets of retinal fundoscopy images, (2) the BraTS dataset of brain MRI, (3) the ISIC skin cancer dataset of dermoscopy images, and (4) the CAMUS dataset of cardiac ultrasound images. The proposed architecture achieves superior accuracy compared to other state-of-the-art super-resolution architectures.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "VitalDB, a high-fidelity multi-parameter vital signs database in surgical patients",
        "link": "https://www.nature.com/articles/s41597-022-01411-5",
        "publication_date": "08 Jun 2022",
        "abstract": "In modern anesthesia, multiple medical devices are used simultaneously to comprehensively monitor real-time vital signs to optimize patient care and improve surgical outcomes. However, interpreting the dynamic changes of time-series biosignals and their correlations is a difficult task even for experienced anesthesiologists. Recent advanced machine learning technologies have shown promising results in biosignal analysis, however, research and development in this area is relatively slow due to the lack of biosignal datasets for machine learning. The VitalDB (Vital Signs DataBase) is an open dataset created specifically to facilitate machine learning studies related to monitoring vital signs in surgical patients. This dataset contains high-resolution multi-parameter data from 6,388 cases, including 486,451 waveform and numeric data tracks of 196 intraoperative monitoring parameters, 73 perioperative clinical parameters, and 34 time-series laboratory result parameters. All data is stored in the public cloud after anonymization. The dataset can be freely accessed and analysed using application programming interfaces and Python library. The VitalDB public dataset is expected to be a valuable resource for biosignal research and development.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting biochemical recurrence of prostate cancer with artificial intelligence",
        "link": "https://www.nature.com/articles/s43856-022-00126-3",
        "publication_date": "08 Jun 2022",
        "abstract": "The first sign of metastatic prostate cancer after radical prostatectomy is rising PSA levels in the blood, termed biochemical recurrence. The prediction of recurrence relies mainly on the morphological assessment of prostate cancer using the Gleason grading system. However, in this system, within-grade morphological patterns and subtle histopathological features are currently omitted, leaving a significant amount of prognostic potential unexplored.",
        "conclusions": "In summary, we have developed a deep-learning-based visual biomarker for prostate cancer recurrence based on tissue microarray hotspots of prostatectomies. The DLS marker provides a continuous score predicting the speed of biochemical recurrence. We obtained an odds ratio of 3.32 (CI 1.63–6.77; p = 0.001) for a nested case-control study from Johns Hopkins Hospital, matched on Gleason sum on other factors. Additionally, we obtained an HR of 3.02 (CI 1.10–8.29; p = 0.03) for an external validation cohort from the New York Langone hospital, adjusted for ISUP grade, pathological stage, preoperative PSA concentration, and surgical margins status. Thus, this visual biomarker may provide prognostic information in addition to the current morphological ISUP grade.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Assessment of liver cirrhosis severity with extracellular volume fraction MRI",
        "link": "https://www.nature.com/articles/s41598-022-13340-9",
        "publication_date": "08 Jun 2022",
        "abstract": "We aimed to investigate the diagnostic utility of MRI extracellular volume fraction (ECV) for the assessment of liver cirrhosis severity as defined by Child–Pugh class. In this retrospective study, 90 patients (68 cirrhotic patients and 22 controls), who underwent multiparametric liver MRI, were identified. Hepatic T1 relaxation times and ECV were assessed. Clinical scores of liver disease severity were calculated. One-way analysis of variance (ANOVA) followed by Tukey’s multiple comparison test, Spearman’s correlation coefficient, and receiver operating characteristic (ROC) analysis were used for statistical analysis. In cirrhotic patients, hepatic native T1 increased depending on Child–Pugh class (620.5 ± 78.9 ms (Child A) vs. 666.6 ± 73.4 ms (Child B) vs. 828.4 ± 91.2 ms (Child C), P < 0.001). ECV was higher in cirrhotic patients compared to the controls (40.1 ± 11.9% vs. 25.9 ± 4.5%, P < 0.001) and increased depending of Child–Pugh class (33.3 ± 6.0% (Child A) vs. 39.6 ± 4.9% (Child B) vs. 52.8 ± 1.2% (Child C), P < 0.001). ECV correlated with Child–Pugh score (r = 0.64, P < 0.001). ECV allowed differentiating between Child–Pugh classes A and B, and B and C with an AUC of 0.785 and 0.944 (P < 0.001, respectively). The diagnostic performance of ECV for differentiating between Child–Pugh classes A and B, and B and C was higher compared to hepatic native T1 (AUC: 0.651 and 0.910) and MELD score (AUC: 0.740 and 0.795) (P < 0.05, respectively). MRI-derived ECV correlated with Child–Pugh score and had a high diagnostic performance for the discrimination of different Child–Pugh classes. ECV might become a valuable non-invasive biomarker for the assessment of liver cirrhosis severity.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning generalizability across healthcare settings: insights from multi-site COVID-19 screening",
        "link": "https://www.nature.com/articles/s41746-022-00614-9",
        "publication_date": "07 Jun 2022",
        "abstract": "As patient health information is highly regulated due to privacy concerns, most machine learning (ML)-based healthcare studies are unable to test on external patient cohorts, resulting in a gap between locally reported model performance and cross-site generalizability. Different approaches have been introduced for developing models across multiple clinical sites, however less attention has been given to adopting ready-made models in new settings. We introduce three methods to do this—(1) applying a ready-made model “as-is” (2); readjusting the decision threshold on the model’s output using site-specific data and (3); finetuning the model using site-specific data via transfer learning. Using a case study of COVID-19 diagnosis across four NHS Hospital Trusts, we show that all methods achieve clinically-effective performances (NPV > 0.959), with transfer learning achieving the best results (mean AUROCs between 0.870 and 0.925). Our models demonstrate that site-specific customization improves predictive performance when compared to other ready-made approaches.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting persistent central serous chorioretinopathy using multiple optical coherence tomographic images by deep learning",
        "link": "https://www.nature.com/articles/s41598-022-13473-x",
        "publication_date": "04 Jun 2022",
        "abstract": "We sought to predict whether central serous chorioretinopathy (CSC) will persist after 6 months using multiple optical coherence tomography (OCT) images by deep convolutional neural network (CNN). This was a multicenter, retrospective, cohort study. Multiple OCT images, including B-scan and en face images of retinal thickness (RT), mid-retina, ellipsoid zone (EZ) layer, and choroidal layer, were collected from 832 eyes of 832 CSC patients (593 self-resolving and 239 persistent). Each image set and concatenated set were divided into training (70%), validation (15%), and test (15%) sets. Training and validation were performed using ResNet50 CNN architecture for predicting CSC requiring treatment. Model performance was analyzed using the test set. The accuracy of prediction was 0.8072, 0.9200, 0.6480, and 0.9200 for B-scan, RT, mid-retina, EZ, and choroid modalities, respectively. When image sets with high accuracy were concatenated, the accuracy was 0.9520, 0.8800, and 0.9280 for B-scan + RT, B-scan + EZ, and EZ + RT, respectively. OCT B-scan, RT, and EZ en face images demonstrated good performances for predicting the prognosis of CSC using CNN. The performance improved when these sets were concatenated. The results of this study can serve as a reference for choosing an optimal treatment for CSC patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prenatal stress perturbs fetal iron homeostasis in a sex specific manner",
        "link": "https://www.nature.com/articles/s41598-022-13633-z",
        "publication_date": "04 Jun 2022",
        "abstract": "The adverse effects of maternal prenatal stress (PS) on child’s neurodevelopment warrant the establishment of biomarkers that enable early interventional therapeutic strategies. We performed a prospective matched double cohort study screening 2000 pregnant women in third trimester with Cohen Perceived Stress Scale-10 (PSS-10) questionnaire; 164 participants were recruited and classified as stressed and control group (SG, CG). Fetal cord blood iron parameters of 107 patients were measured at birth. Transabdominal electrocardiograms-based Fetal Stress Index (FSI) was derived. We investigated sex contribution to group differences and conducted causal inference analyses to assess the total effect of PS exposure on iron homeostasis using a directed acyclic graph (DAG) approach. Differences are reported for p < 0.05 unless noted otherwise. Transferrin saturation was lower in male stressed neonates. The minimum adjustment set of the DAG to estimate the total effect of PS exposure on fetal ferritin iron biomarkers consisted of maternal age and socioeconomic status: SG revealed a 15% decrease in fetal ferritin compared with CG. Mean FSI was higher among SG than among CG. FSI-based timely detection of fetuses affected by PS can support early individualized iron supplementation and neurodevelopmental follow-up to prevent long-term sequelae due to PS-exacerbated impairment of the iron homeostasis.",
        "conclusions": "We show that during third trimester PS exerts a sex-dependent effect on fetal iron homeostasis and on the fetal ANS measured by FSI, an ECG-derived measure of chronic stress transfer from mother to fetus. The reported biomarkers open novel avenues of research into the association between PS and adverse neurodevelopmental outcomes. They can contribute to development of novel therapeutic intervention strategies39,40.We propose the following aspects of future research: First, do the changes we report represent a healthy or maladaptive response to PS? Second, will applying FSI monitoring during pregnancy permit to track a “deviating neurodevelopmental trajectory” and when exactly during gestation do these changes occur? The non-invasive fetal monitoring with FSI tracking may help answer these questions. Third, what is the significance and therapeutic opportunity of the discovery that PS can impact fetal iron homeostasis? Do female fetuses possess more successful compensatory mechanisms in response to PS than males do? The sex-specific effects of this impact warrant further investigations. Fourth, which role may iron supplementation play in this context as a corrective therapeutic option2,41? Our findings indicate that we will need to consider the sex when devising therapeutic strategies to compensate for the intrauterine adversity due to PS42.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Empirical analyses and simulations showed that different machine and statistical learning methods had differing performance for predicting blood pressure",
        "link": "https://www.nature.com/articles/s41598-022-13015-5",
        "publication_date": "03 Jun 2022",
        "abstract": "Machine learning is increasingly being used to predict clinical outcomes. Most comparisons of different methods have been based on empirical analyses in specific datasets. We used Monte Carlo simulations to determine when machine learning methods perform better than statistical learning methods in a specific setting. We evaluated six learning methods: stochastic gradient boosting machines using trees as the base learners, random forests, artificial neural networks, the lasso, ridge regression, and linear regression estimated using ordinary least squares (OLS). Our simulations were informed by empirical analyses in patients with acute myocardial infarction (AMI) and congestive heart failure (CHF) and used six data-generating processes, each based on one of the six learning methods, to simulate continuous outcomes in the derivation and validation samples. The outcome was systolic blood pressure at hospital discharge, a continuous outcome. We applied the six learning methods in each of the simulated derivation samples and evaluated performance in the simulated validation samples. The primary observation was that neural networks tended to result in estimates with worse predictive accuracy than the other five methods in both disease samples and across all six data-generating processes. Boosted trees and OLS regression tended to perform well across a range of scenarios.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Low expression of IGFBP4 and TAGLN accelerate the poor overall survival of osteosarcoma",
        "link": "https://www.nature.com/articles/s41598-022-13163-8",
        "publication_date": "03 Jun 2022",
        "abstract": "Osteosarcoma is a common malignant bone tumor characterized by the production of osteoid stroma by the tumor. However, effect of IGFBP4 and TAGLN on the survival of osteosarcoma is unclear. The GEO database was used to identify the differentially expressed genes (DEGs) between control samples and osteosarcoma. Genes for biological process (BP), cellular composition (CC), and molecular function (MF) were examined using DAVID, Metascape, and GSEA. GSE14359 and GSE36001 were downloaded in the GEO database. GEO2R was used to find DEGs between control samples and osteosarcoma. The cytoHubb also found the hub genes of IGFBP4 and TAGLN. The Kaplan–Meier method was used to analyze overall survival. A total of 134 patients with osteosarcoma were enrolled in this study. The RNA levels of IGFBP4 and TAGLN were evaluated by RT-qPCR. The correlation between IGFBP4 and TAGLN expression and their associations with clinical indicators were analyzed using Spearman's rho test and Pearson's Chi-squared test. Univariate and multivariate Cox regression analyses were used to determine the potential prognostic factors. And the animal model was used to verify the role of hub genes on the osteosarcoma by the RT-qPCR and immunofluorescence. Support Vector Machine (SVM) was performed to construct the correlation among the expression of IGFBP4, TAGLN, and osteosarcoma. Through bioinformatics, IGFBP4 and TAGLN were identified as the hub genes of osteosarcoma. And osteosarcoma patients with high expression levels of IGFBP4 (HR = 0.56, P = 0.013) and TAGLN (HR = 0.52, P = 0.012) had better overall survival times than those with low expression levels. The results showed that pathologic grade (P = 0.017), tumor metastasis (P < 0.001), and enneking stage (P < 0.001) were significantly correlated with IGFBP4. Also, pathologic grade (P = 0.002), tumor metastasis (P < 0.001), and enneking stage (P < 0.001) were significantly related to the TAGLN. Spearman’s correlation coefficient displayed that IGFBP4 were significantly correlated with the tumor metastasis (ρ = − 0.843, P < 0.001), enneking stage (ρ = − 0.500, P < 0.001), and TAGLN (ρ = 0.821, P < 0.001). IGFBP4 (HR = 0.252, 95% CI 0.122–0.517, P < 0.001) and TAGLN (HR = 0.155, 95% CI 0.089–0.269, P < 0.001) were significantly associated with overall survival. Based on the qPCR and immunofluorescence, IGFBP4 and TAGLN were down-regulated in the osteosarcoma tissue than the control group. And the SVM presented that there exists strong relationship among the expression of IGFBP4, TAGLN, and osteosarcoma. IGFBP4 and TAGLN may be attractive molecular targets for osteosarcoma, opening a new avenue for research into the disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Using generative adversarial networks for genome variant calling from low depth ONT sequencing data",
        "link": "https://www.nature.com/articles/s41598-022-12346-7",
        "publication_date": "30 May 2022",
        "abstract": "Genome variant calling is a challenging yet critical task for subsequent studies. Existing methods almost rely on high depth DNA sequencing data. Performance on low depth data drops a lot. Using public Oxford Nanopore (ONT) data of human being from the Genome in a Bottle (GIAB) Consortium, we trained a generative adversarial network for low depth variant calling. Our method, noted as LDV-Caller, can project high depth sequencing information from low depth data. It achieves 94.25% F1 score on low depth data, while the F1 score of the state-of-the-art method on two times higher depth data is 94.49%. By doing so, the price of genome-wide sequencing examination can reduce deeply. In addition, we validated the trained LDV-Caller model on 157 public Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) samples. The mean sequencing depth of these samples is 2982. The LDV-Caller yields 92.77% F1 score using only 22x sequencing depth, which demonstrates our method has potential to analyze different species with only low depth sequencing data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification and epidemiological characterization of Type-2 diabetes sub-population using an unsupervised machine learning approach",
        "link": "https://www.nature.com/articles/s41387-022-00206-2",
        "publication_date": "27 May 2022",
        "abstract": "Studies on Type-2 Diabetes Mellitus (T2DM) have revealed heterogeneous sub-populations in terms of underlying pathologies. However, the identification of sub-populations in epidemiological datasets remains unexplored. We here focus on the detection of T2DM clusters in epidemiological data, specifically analysing the National Family Health Survey-4 (NFHS-4) dataset from India containing a wide spectrum of features, including medical history, dietary and addiction habits, socio-economic and lifestyle patterns of 10,125 T2DM patients.",
        "conclusions": "From a data science perspective, this analysis addresses the issue of diverse data types. We have shown that for such data conventional application of dimension reduction approaches might not be fruitful. We develop a workflow that contributes to finding meaningful and interpretable clusters such that the distribution of clusters is not biased by the data types.The existence of a significant non-obese T2DM patient sub-population belonging to a younger age group and having larger proportions of rural residents raise a lower quality of life, indicating the need for different screening criteria for T2DM among rural Indian residents. The obese T2DM cluster with around 90% of people sticking to the non-vegetarian diet calls for the need for dietary guidelines for T2DM patients having a non-vegetarian dietary pattern.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Outcome prediction for acute kidney injury among hospitalized children via eXtreme Gradient Boosting algorithm",
        "link": "https://www.nature.com/articles/s41598-022-13152-x",
        "publication_date": "27 May 2022",
        "abstract": "Acute kidney injury (AKI) is common among hospitalized children and is associated with a poor prognosis. The study sought to develop machine learning-based models for predicting adverse outcomes among hospitalized AKI children. We performed a retrospective study of hospitalized AKI patients aged 1 month to 18 years in the Second Xiangya Hospital of Central South University in China from 2015 to 2020. The primary outcomes included major adverse kidney events within 30 days (MAKE30) (death, new renal replacement therapy, and persistent renal dysfunction) and 90-day adverse outcomes (chronic dialysis and death). The state-of-the-art machine learning algorithm, eXtreme Gradient Boosting (XGBoost), and the traditional logistic regression were used to establish prediction models for MAKE30 and 90-day adverse outcomes. The models’ performance was evaluated by split-set test. A total of 1394 pediatric AKI patients were included in the study. The incidence of MAKE30 and 90-day adverse outcomes was 24.1% and 8.1%, respectively. In the test set, the area under the receiver operating characteristic curve (AUC) of the XGBoost model was 0.810 (95% CI 0.763–0.857) for MAKE30 and 0.851 (95% CI 0.785–0.916) for 90-day adverse outcomes, The AUC of the logistic regression model was 0.786 (95% CI 0.731–0.841) for MAKE30 and 0.759 (95% CI 0.654–0.864) for 90-day adverse outcomes. A web-based risk calculator can facilitate the application of the XGBoost models in daily clinical practice. In conclusion, XGBoost showed good performance in predicting MAKE30 and 90-day adverse outcomes, which provided clinicians with useful tools for prognostic assessment in hospitalized AKI children.",
        "conclusions": "In conclusion, we determined the incidence and outcomes of AKI among hospitalized children and developed machine learning-based prediction models for MAKE30 and 90-day adverse outcomes using the XGBoost algorithm. The XGBoost models showed good predictive performance in all hospitalized AKI children and in different subgroups. We further established a web-based risk calculator to promote the clinical application of the XGBoost models, which provided clinicians with useful tools for prognostic assessment in hospitalized AKI children. Future multi-center prospective studies are required to demonstrate the robustness and clinical effectiveness of the prediction models.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of a deep learning model that predicts Bi-level positive airway pressure failure",
        "link": "https://www.nature.com/articles/s41598-022-12984-x",
        "publication_date": "26 May 2022",
        "abstract": "Delaying intubation for patients failing Bi-Level Positive Airway Pressure (BIPAP) may be associated with harm. The objective of this study was to develop a deep learning model capable of aiding clinical decision making by predicting Bi-Level Positive Airway Pressure (BIPAP) failure. This was a retrospective cohort study in a tertiary pediatric intensive care unit (PICU) between 2010 and 2020. Three machine learning models were developed to predict BIPAP failure: two logistic regression models and one deep learning model, a recurrent neural network with a Long Short-Term Memory (LSTM-RNN) architecture. Model performance was evaluated in a holdout test set. 175 (27.7%) of 630 total BIPAP sessions were BIPAP failures. Patients in the BIPAP failure group were on BIPAP for a median of 32.8 (9.2–91.3) hours prior to intubation. Late BIPAP failure (intubation after using BIPAP > 24 h) patients had fewer 28-day Ventilator Free Days (13.40 [0.68–20.96]), longer ICU length of stay and more post-extubation BIPAP days compared to those who were intubated ≤ 24 h from BIPAP initiation. An AUROC above 0.5 indicates that a model has extracted new information, potentially valuable to the clinical team, about BIPAP failure. Within 6 h of BIPAP initiation, the LSTM-RNN model predicted which patients were likely to fail BIPAP with an AUROC of 0.81 (0.80, 0.82), superior to all other models. Within 6 h of BIPAP initiation, the LSTM-RNN model would identify nearly 80% of BIPAP failures with a 50% false alarm rate, equal to an NNA of 2. In conclusion, a deep learning method using readily available data from the electronic health record can identify which patients on BIPAP are likely to fail with good discrimination, oftentimes days before they are intubated in usual practice.",
        "conclusions": "A machine learning model using electronic health record data from children on BIPAP can identify children with high likelihood of failing BIPAP, with a relatively modest false alarm rate. We suggest external validation of this model in additional ICUs to test its generalizability, followed by a clinical trial to determine if it results in improved outcomes for children with acute respiratory failure on BIPAP.",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Developing and validating a multivariable prediction model which predicts progression of intermediate to late age-related macular degeneration—the PINNACLE trial protocol",
        "link": "https://www.nature.com/articles/s41433-022-02097-0",
        "publication_date": "25 May 2022",
        "abstract": "Age-related macular degeneration (AMD) is characterised by a progressive loss of central vision. Intermediate AMD is a risk factor for progression to advanced stages categorised as geographic atrophy (GA) and neovascular AMD. However, rates of progression to advanced stages vary between individuals. Recent advances in imaging and computing technologies have enabled deep phenotyping of intermediate AMD. The aim of this project is to utilise machine learning (ML) and advanced statistical modelling as an innovative approach to discover novel features and accurately quantify markers of pathological retinal ageing that can individualise progression to advanced AMD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Learning models for forecasting hospital resource utilization for COVID-19 patients in Canada",
        "link": "https://www.nature.com/articles/s41598-022-12491-z",
        "publication_date": "24 May 2022",
        "abstract": "Hospitals in Canada are facing a crisis-level shortage of critical supplies and equipment during the COVID-19 pandemic. This motivates us to create predictive models that can use Canada COVID-19 data and pandemic-related factors to accurately forecast 5 quantities—three related to hospital resource utilization (i.e., the number of hospital beds, ICU beds, and ventilators that will be needed by COVID-19 patients) and two to the pandemic progress (i.e., the number of COVID-19 cases and COVID-19 deaths)—several weeks in advance. We developed a machine learning method that can use information (i.e., resource utilization, pandemic progress, population mobility, weather condition, and public policy) currently known about a region since March 2020, to learn multiple temporal convolutional network (TCN) models every week; each used for forecasting the weekly average of one of these 5 quantities in Canada (respectively, in six specific provinces) for each, in the next 1 (resp., 2,3,4) weeks. To validate the effectiveness of our method, we compared our method, versus other standard models, on the COVID-19 data and hospital resource data, on the tasks of predicting the 116 values (for Canada and its six most populated provinces), every week from Oct 2020 to July 2021, and the 20 values (only for Canada) for four specific times within 9 July to 31 Dec 2021. Experimental results show that our 4640 TCN models (each forecasting a regional target for a specific future time, on a specific date) can produce accurate 1,2,3,4-week forecasts of the utilization of every hospital resource and pandemic progress for each week from 2 Oct 2020 to 2 July 2021, as well as 80 TCN models for each of the four specified times within 9 July and 31 Dec 2021. Compared to other baseline and state-of-the-art predictive models, our TCN models yielded the best forecasts, with the lowest mean absolute percentage error (MAPE). Additional experiments, on the IHME COVID-19 data, demonstrate the effectiveness of our TCN models, in comparison with IHME forecasts. Each of our TCN models used a pre-defined set of features; we experimentally validate the effectiveness of these features by showing that these models perform better than other models that instead used other features. Overall, these experimental results demonstrate that our method can accurately forecast hospital resource utilization and pandemic progress for Canada and for each of the six provinces.",
        "conclusions": "This paper provided a method that learns TCN-models that can forecast many useful healthcare quantities, including the need for hospital beds, ICU beds, and ventilators. These models incorporate the complex interplay of many factors—including regional mobility, weather, and public policy—to produce accurate forecasts that can help decision-makers make effective, accurate decisions. We have provided a method for effectively learning these TCN models for various target-region, and horizon-specific forecasts, including the weekly average number of hospital beds, ICU beds, ventilators, cases, and deaths in Canada and six provinces (AB, BC, MB, ON, QC, SK) for up-to-4 weeks in the future. The numerous experiments demonstrated that our method is more accurate (in terms of MAPE) than four state-of-the-art predictive models. We also demonstrated that our method can accurately forecast the weekly average number of cases and deaths in the future.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Gene-expression profiles of pretreatment biopsies predict complete response of rectal cancer patients to preoperative chemoradiotherapy",
        "link": "https://www.nature.com/articles/s41416-022-01842-2",
        "publication_date": "21 May 2022",
        "abstract": "Preoperative (neoadjuvant) chemoradiotherapy (CRT) and total mesorectal excision is the standard treatment for rectal cancer patients (UICC stage II/III). Up to one-third of patients treated with CRT achieve a pathological complete response (pCR). These patients could be spared from surgery and its associated morbidity and mortality, and assigned to a “watch and wait” strategy. However, reliably identifying pCR based on clinical or imaging parameters remains challenging.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cross-sectional metabolic subgroups and 10-year follow-up of cardiometabolic multimorbidity in the UK Biobank",
        "link": "https://www.nature.com/articles/s41598-022-12198-1",
        "publication_date": "21 May 2022",
        "abstract": "We assigned 329,908 UK Biobank participants into six subgroups based on a self-organizing map of 51 biochemical measures (blinded for clinical outcomes). The subgroup with the most favorable metabolic traits was chosen as the reference. Hazard ratios (HR) for incident disease were modeled by Cox regression. Enrichment ratios (ER) of incident multi-morbidity versus randomly expected co-occurrence were evaluated by permutation tests; ER is like HR but captures co-occurrence rather than event frequency. The subgroup with high urinary excretion without kidney stress (HR = 1.24) and the subgroup with the highest apolipoprotein B and blood pressure (HR = 1.52) were associated with ischemic heart disease (IHD). The subgroup with kidney stress, high adiposity and inflammation was associated with IHD (HR = 2.11), cancer (HR = 1.29), dementia (HR = 1.70) and mortality (HR = 2.12). The subgroup with high liver enzymes and triglycerides was at risk of diabetes (HR = 15.6). Multimorbidity was enriched in metabolically favorable subgroups (3.4 ≤ ER ≤ 4.0) despite lower disease burden overall; the relative risk of co-occurring disease was higher in the absence of obvious metabolic dysfunction. These results provide synergistic insight into metabolic health and its associations with cardiovascular disease in a large population sample.",
        "conclusions": "The SOM subtypes provided a descriptive framework of how combinations of multiple risk factors are associated with diverging cardiometabolic disease outcomes within a population. The new information is useful for the development of targeted interventions for specific subgroups; potential applications include phenotypically guided trials of new treatments where participants are selected based on their full phenotypic profile (e.g. cardiovascular drug trials designed for persons with inflammatory kidney stress vs. persons with diabetogenic liver stress). Such designs will provide more targeted information on the exact type of patient who will benefit the most from the treatment. We also see potential to adopt metabolic profiles as a new approach to assess the health and aggregate disease burden in a population. For example, subtype prevalences can provide phenotypically specific information on how changes in environmental risk factors influence the aggregate disease burden in different segments of the population over time.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A pediatric wrist trauma X-ray dataset (GRAZPEDWRI-DX) for machine learning",
        "link": "https://www.nature.com/articles/s41597-022-01328-z",
        "publication_date": "20 May 2022",
        "abstract": "Digital radiography is widely available and the standard modality in trauma imaging, often enabling to diagnose pediatric wrist fractures. However, image interpretation requires time-consuming specialized training. Due to astonishing progress in computer vision algorithms, automated fracture detection has become a topic of research interest. This paper presents the GRAZPEDWRI-DX dataset containing annotated pediatric trauma wrist radiographs of 6,091 patients, treated at the Department for Pediatric Surgery of the University Hospital Graz between 2008 and 2018. A total number of 10,643 studies (20,327 images) are made available, typically covering posteroanterior and lateral projections. The dataset is annotated with 74,459 image tags and features 67,771 labeled objects. We de-identified all radiographs and converted the DICOM pixel data to 16-Bit grayscale PNG images. The filenames and the accompanying text files provide basic patient information (age, sex). Several pediatric radiologists annotated dataset images by placing lines, bounding boxes, or polygons to mark pathologies like fractures or periosteal reactions. They also tagged general image characteristics. This dataset is publicly available to encourage computer vision research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Murine cardiac fibrosis localization using adaptive Bayesian cardiac strain imaging in vivo",
        "link": "https://www.nature.com/articles/s41598-022-12579-6",
        "publication_date": "20 May 2022",
        "abstract": "An adaptive Bayesian regularized cardiac strain imaging (ABR-CSI) algorithm for in vivo murine myocardial function assessment is presented. We report on 31 BALB/CJ mice (n = 17 females, n = 14 males), randomly stratified into three surgical groups: myocardial infarction (MI, n = 10), ischemia–reperfusion (IR, n = 13) and control (sham, n = 8) imaged pre-surgery (baseline- BL), and 1, 2, 7 and 14 days post-surgery using a high frequency ultrasound imaging system (Vevo 2100). End-systole (ES) radial and longitudinal strain images were used to generate cardiac fibrosis maps using binary thresholding. Percentage fibrotic myocardium (PFM) computed from regional fibrosis maps demonstrated statistically significant differences post-surgery in scar regions. For example, the MI group had significantly higher PFMRadial (%) values in the anterior mid region (p = 0.006) at Day 14 (n = 8, 42.30 ± 14.57) compared to BL (n = 12, 1.32 ± 0.85). A random forest classifier automatically detected fibrotic regions from ground truth Masson’s trichrome stained histopathology whole slide images. Both PFMRadial (r = 0.70) and PFMLongitudinal (r = 0.60) results demonstrated strong, positive correlation with PFMHistopathology (p < 0.001).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Rituximab versus tocilizumab in rheumatoid arthritis: synovial biopsy-based biomarker analysis of the phase 4 R4RA randomized trial",
        "link": "https://www.nature.com/articles/s41591-022-01789-0",
        "publication_date": "19 May 2022",
        "abstract": "Patients with rheumatoid arthritis (RA) receive highly targeted biologic therapies without previous knowledge of target expression levels in the diseased tissue. Approximately 40% of patients do not respond to individual biologic therapies and 5–20% are refractory to all. In a biopsy-based, precision-medicine, randomized clinical trial in RA (R4RA; n = 164), patients with low/absent synovial B cell molecular signature had a lower response to rituximab (anti-CD20 monoclonal antibody) compared with that to tocilizumab (anti-IL6R monoclonal antibody) although the exact mechanisms of response/nonresponse remain to be established. Here, in-depth histological/molecular analyses of R4RA synovial biopsies identify humoral immune response gene signatures associated with response to rituximab and tocilizumab, and a stromal/fibroblast signature in patients refractory to all medications. Post-treatment changes in synovial gene expression and cell infiltration highlighted divergent effects of rituximab and tocilizumab relating to differing response/nonresponse mechanisms. Using ten-by-tenfold nested cross-validation, we developed machine learning algorithms predictive of response to rituximab (area under the curve (AUC) = 0.74), tocilizumab (AUC = 0.68) and, notably, multidrug resistance (AUC = 0.69). This study supports the notion that disease endotypes, driven by diverse molecular pathology pathways in the diseased tissue, determine diverse clinical and treatment–response phenotypes. It also highlights the importance of integration of molecular pathology signatures into clinical algorithms to optimize the future use of existing medications and inform the development of new drugs for refractory patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "CT-based deep learning enables early postoperative recurrence prediction for intrahepatic cholangiocarcinoma",
        "link": "https://www.nature.com/articles/s41598-022-12604-8",
        "publication_date": "19 May 2022",
        "abstract": "Preoperatively accurate evaluation of risk for early postoperative recurrence contributes to maximizing the therapeutic success for intrahepatic cholangiocarcinoma (iCCA) patients. This study aimed to investigate the potential of deep learning (DL) algorithms for predicting postoperative early recurrence through the use of preoperative images. We collected the dataset, including preoperative plain computed tomography (CT) images, from 41 patients undergoing curative surgery for iCCA at multiple institutions. We built a CT patch-based predictive model using a residual convolutional neural network and used fivefold cross-validation. The prediction accuracy of the model was analyzed. We defined early recurrence as recurrence within a year after surgical resection. Of the 41 patients, early recurrence was observed in 20 (48.8%). A total of 71,081 patches were extracted from the entire segmented tumor area of each patient. The average accuracy of the ResNet model for predicting early recurrence was 98.2% for the training dataset. In the validation dataset, the average sensitivity, specificity, and accuracy were 97.8%, 94.0%, and 96.5%, respectively. Furthermore, the area under the receiver operating characteristic curve was 0.994. Our CT-based DL model exhibited high predictive performance in projecting postoperative early recurrence, proposing a novel insight into iCCA management.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Detection of cognitive decline by spinal posture assessment in health exams of the general older population",
        "link": "https://www.nature.com/articles/s41598-022-12605-7",
        "publication_date": "19 May 2022",
        "abstract": "The recent increase in the older adult population has led to a higher prevalence of cognitive impairment, which is often overlooked in routine health examinations. Citizens aged 50–89 years were targeted for this cohort survey by random sampling from the resident registry of a cooperating town in 2014. A total of 411 participants (202 male and 209 female) were enrolled. We analyzed the distribution of cognitive function test scores as determined by Montreal Cognitive Assessment and Mini-Mental State Examination tests in each age (50’s, 60’s, 70’s and 80’s) and sex group to examine whether cognitive decline could be detected by sagittal spinal balance measurement based on a radiological approach. Sagittal spinal balance was quantitatively measured as sagittal vertical axis (SVA). We observed significant associations for higher age and/or SVA anteriorization with lower cognitive function. In males, spinal balance anteriorization was associated with cognitive decline independently of age, with combinations of age and SVA also making valid cognitive decline determinations; male cases of SVA ≥ 100 mm at any age, SVA ≥ 90 mm at ≥ 70 years, and SVA ≥ 70 mm at ≥ 80 years were all more likely to have cognitive decline than cases below those values. For females, cognitive decline was more likely in cases of SVA ≥ 70 mm, regardless of age. Thus, spinal balance anteriorization can be regarded as an easily visible indicator of latent cognitive decline in community-dwelling older people.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Subchondral tibial bone texture of conventional X-rays predicts total knee arthroplasty",
        "link": "https://www.nature.com/articles/s41598-022-12083-x",
        "publication_date": "18 May 2022",
        "abstract": "Lacking disease-modifying osteoarthritis drugs (DMOADs) for knee osteoarthritis (KOA), Total Knee Arthroplasty (TKA) is often considered an important clinical outcome. Thus, it is important to determine the most relevant factors that are associated with the risk of TKA. The present study aims to develop a model based on a combination of X-ray trabecular bone texture (TBT) analysis, and clinical and radiological information to predict TKA risk in patients with or at risk of developing KOA. This study involved 4382 radiographs, obtained from the OsteoArthritis Initiative (OAI) cohort. Cases were defined as patients with TKA on at least one knee prior to the 108-month follow-up time point and controls were defined as patients who had never undergone TKA. The proposed TKA-risk prediction model, combining TBT parameters and Kellgren–Lawrence (KL) grades, was performed using logistic regression. The proposed model achieved an AUC of 0.92 (95% Confidence Interval [CI] 0.90, 0.93), while the KL model achieved an AUC of 0.86 (95% CI 0.84, 0.86; p < 0.001). This study presents a new TKA prediction model with a good performance permitting the identification of at risk patient with a good sensitivy and specificity, with a 60% increase in TKA case prediction as reflected by the recall values.",
        "conclusions": "The model presented in this study, involving TBT analysis of conventional knee radiographs associated with radiological scoring (KL scores), improves the long-term prediction of TKA risk in patients with KOA.The clinical decision-making process in TKA is complex53. Early detection and assessment of KOA prognostic factors are crucial for developing management and treatments that aim at preventing irreversible damage to the knee joint leading to arthroplasty. Identifying the most at-risk patients who may undergo total knee arthroplasty (TKA) could be the basis of a more aggressive therapeutic approach to prevent KOA progression.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Preclinical trial of noncontact anthropometric measurement using IR-UWB radar",
        "link": "https://www.nature.com/articles/s41598-022-12209-1",
        "publication_date": "17 May 2022",
        "abstract": "Anthropometric profiles are important indices for assessing medical conditions, including malnutrition, obesity, and growth disorders. Noncontact methods for estimating those parameters could have considerable value in many practical situations, such as the assessment of young, uncooperative infants or children and the prevention of infectious disease transmission. The purpose of this study was to investigate the feasibility of obtaining noncontact anthropometric measurements using the impulse-radio ultrawideband (IR-UWB) radar sensor technique. A total of 45 healthy adults were enrolled, and a convolutional neural network (CNN) algorithm was implemented to analyze data extracted from IR-UWB radar. The differences (root-mean-square error, RMSE) between values from the radar and bioelectrical impedance analysis (BIA) as a reference in the measurement of height, weight, and body mass index (BMI) were 2.78, 5.31, and 2.25, respectively; predicted data from the radar highly agreed with those from the BIA. The intraclass correlation coefficients (ICCs) were 0.93, 0.94, and 0.83. In conclusion, IR-UWB radar can provide accurate estimates of anthropometric parameters in a noncontact manner; this study is the first to support the radar sensor as an applicable method in clinical situations.",
        "conclusions": "For the first time, we demonstrated that an innovative, noncontact, novel, effective method, IR-UWB radar technology integrated with a machine learning algorithm, can measure anthropometric profiles successfully with substantial agreement with BIA in adults. Further studies with younger age groups and better algorithms are warranted before the proposed system can be widely used in clinical practice with the robustness of radar.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "CT-based radiomics signature for differentiation between cardiac tumors and thrombi: a retrospective, multicenter study",
        "link": "https://www.nature.com/articles/s41598-022-12229-x",
        "publication_date": "17 May 2022",
        "abstract": "The study aimed to develop and validate whether the computed tomography (CT) radiomics analysis is effective in differentiating cardiac tumors and thrombi. For this retrospective study, a radiomics model was developed on the basis of a training dataset of 192 patients (61.9 ± 13.3 years, 90 men) with cardiac masses detected in cardiac CT from January 2010 to September 2019. We constructed three models for discriminating between a cardiac tumor and a thrombus: a radiomics model, a clinical model, which included clinical and conventional CT variables, and a model that combined clinical and radiomics models. In the training dataset, the radiomics model and the combined model yielded significantly higher differentiation performance between cardiac tumors and cardiac thrombi than the clinical model (AUC 0.973 vs 0.870, p < 0.001 and AUC 0.983 vs 0.870, p < 0.001, respectively). In the external validation dataset with 63 patients (59.8 ± 13.2 years, 26 men), the combined model yielded a larger AUC compared to the clinical model (AUC 0.911 vs 0.802, p = 0.037). CT radiomics analysis is effective in differentiating cardiac tumors and thrombi. In conclusion, the combination of clinical, conventional CT, and radiomics features demonstrated an additional benefit in differentiating between cardiac tumor and thrombi compared to clinical data and conventional CT features alone.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Detecting sleep outside the clinic using wearable heart rate devices",
        "link": "https://www.nature.com/articles/s41598-022-11792-7",
        "publication_date": "13 May 2022",
        "abstract": "The adoption of multisensor wearables presents the opportunity of longitudinal monitoring of sleep in large populations. Personalized yet device-agnostic algorithms can sidestep laborious human annotations and objectify cross-cohort comparisons. We developed and tested a heart rate-based algorithm that captures inter- and intra-individual sleep differences in free-living conditions and does not require human input. We evaluated it on four study cohorts using different research- and consumer-grade devices for over 2000 nights. Recording periods included both 24 h free-living and conventional lab-based night-only data. We compared our optimized method against polysomnography, sleep diaries and sleep periods produced through a state-of-the-art acceleration based method. Against sleep diaries, the algorithm yielded a mean squared error of 0.04–0.06 and a total sleep time (TST) deviation of \\(-\\)2.70 (± 5.74) and 12.80 (± 3.89) minutes, respectively. When evaluated with PSG lab studies, the MSE ranged between 0.06 and 0.11 yielding a time deviation between \\(-\\)29.07 and \\(-\\)55.04 minutes. These results showcase the value of this open-source, device-agnostic algorithm for the reliable inference of sleep in free-living conditions and in the absence of annotations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Improving the design stage of air pollution studies based on wind patterns",
        "link": "https://www.nature.com/articles/s41598-022-11939-6",
        "publication_date": "13 May 2022",
        "abstract": "A growing literature in economics and epidemiology has exploited changes in wind patterns as a source of exogenous variation to better measure the acute health effects of air pollution. Since the distribution of wind components is not randomly distributed over time and related to other weather parameters, multivariate regression models are used to adjust for these confounding factors. However, this type of analysis relies on its ability to correctly adjust for all confounding factors and extrapolate to units without empirical counterfactuals. As an alternative to current practices and to gauge the extent of these issues, we propose to implement a causal inference pipeline to embed this type of observational study within an hypothetical randomized experiment. We illustrate this approach using daily data from Paris, France, over the 2008–2018 period. Using the Neyman–Rubin potential outcomes framework, we first define the treatment of interest as the effect of North-East winds on particulate matter concentrations compared to the effects of other wind directions. We then implement a matching algorithm to approximate a pairwise randomized experiment. It adjusts nonparametrically for observed confounders while avoiding model extrapolation by discarding treated days without similar control days. We find that the effective sample size for which treated and control units are comparable is surprisingly small. It is however reassuring that results on the matched sample are consistent with a standard regression analysis of the initial data. We finally carry out a quantitative bias analysis to check whether our results could be altered by an unmeasured confounder: estimated effects seem robust to a relatively large hidden bias. Our causal inference pipeline is a principled approach to improve the design of air pollution studies based on wind patterns.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Non-volatile organic compounds in exhaled breath particles correspond to active tuberculosis",
        "link": "https://www.nature.com/articles/s41598-022-12018-6",
        "publication_date": "13 May 2022",
        "abstract": "Human breath contains trace amounts of non-volatile organic compounds (NOCs) which might provide non-invasive methods for evaluating individual health. In previous work, we demonstrated that lipids detected in exhaled breath aerosol (EBA) could be used as markers of active tuberculosis (TB). Here, we advanced our analytical platform for characterizing small metabolites and lipids in EBA samples collected from participants enrolled in clinical trials designed to identify molecular signatures of active TB. EBA samples from 26 participants with active TB and 73 healthy participants were processed using a dual-phase extraction method, and metabolites and lipids were identified via mass spectrometry database matching. In total, 13 metabolite and 9 lipid markers were identified with statistically different optimized relative standard deviation values between individuals diagnosed with active TB and the healthy controls. Importantly, EBA lipid profiles can be used to separate the two sample types, indicating the diagnostic potential of the identified molecules. A feature ranking algorithm reduced this number to 10 molecules, with the membrane glycerophospholipid, phosphatidylinositol 24:4, emerging as the top driver of segregation between the two groups. These results support the use of this approach to identify consistent NOC signatures from EBA samples in active TB cases. This suggests the potential to apply this method to other human diseases which alter respiratory NOC release.",
        "conclusions": "In this study, we demonstrated that rich NOCs can be extracted from human exhaled breath using an advanced analytical approach and the analysis could provide an attractive solution for human disease diagnosis. We advanced NOC analysis in human breath in several aspects. Using a comprehensive molecule extraction method, we have shown that hundreds of metabolites and lipids can be collected from human breath. Most importantly, the extraction method is rapid and has the potential to be used for high-volume sample processing in a clinical setting. By integrating MS-based non-targeted omics and sophisticated data analysis, we demonstrated that identified molecule signatures can differentiate active TB cases from healthy individuals based on the assigned importance of each molecule.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Short-term causal effects of common treatments in ambulatory children and young adults with cerebral palsy: three machine learning estimates",
        "link": "https://www.nature.com/articles/s41598-022-11875-5",
        "publication_date": "12 May 2022",
        "abstract": "Orthopedic and neurological impairments (e.g., muscle contractures, spasticity) are often treated in children and young adults with cerebral palsy (CP). Due to challenges arising from combinatorics, research funding priorities, and medical practicalities, and despite extensive study, the evidence base is weak. Our goal was to estimate the short-term effectiveness of 13 common orthopedic and neurological treatments at four different levels of outcome in children and young adults diagnosed with CP. The outcome levels considered were body structures, specific gait kinematic deviations, overall gait kinematic deviations, and functional mobility. We used three well-establish causal inference approaches (direct matching, virtual twins, and Bayesian causal forests) and a large clinical gait analysis database to estimate the average treatment effect on the treated (ATT). We then examined the effectiveness across treatments, methods, and outcome levels. The dataset consisted of 2851 limbs from 933 individuals (some individuals underwent multiple treatment episodes). Current treatments have medium effects on body structures, but modest to minimal effects on gait and functional mobility. The median ATT of 13 common treatments in children and young adults with CP, measured as Cohen’s D, bordered on medium at the body structures level (median [IQR] = 0.42 [0.05, 0.60]) and became smaller as we moved along the causal chain through specific kinematic deviations (0.21 [0.01, 0.33]), overall kinematic deviations (0.09 [0.03, 0.19]), and functional mobility (-0.01 [-0.06, 0.13]). Further work is needed to understand the source of heterogeneous treatment effects, which are large in this patient population. Replication or refutation of these findings by other centers will be valuable to establish the generalizability of these results and for benchmarking of best practices.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]