[
    {
        "title": "Clinical trials are becoming more complex: a machine learning analysis of data from over 16,000 trials",
        "link": "https://www.nature.com/articles/s41598-024-53211-z",
        "publication_date": "12 Feb 2024",
        "abstract": "The past decade has seen substantial innovation in clinical trials, including new trial formats, endpoints, and others. Also there have been regulatory changes, increasing competitive pressures and other external factors which impact clinical trials. In parallel, trial timelines have increased and success rates remain stubbornly low. This has led many observers to question whether clinical trials have become overly complex and if this complexity is always needed. Here we present a large-scale analysis of protocols and other data from over 16,000 trials. Using a machine learning algorithm, we automatically assessed key features of these trials, such as number of endpoints, number of inclusion–exclusion criteria and others. Using a regression analysis we combined these features into a new metric, the Trial Complexity Score, which correlates with overall clinical trial duration. Looking at this score across different clinical phases and therapeutic areas we see substantial increases over time, suggesting that clinical trials are indeed becoming more complex. We discuss drivers of increasing trial complexity, necessary or helpful (‘good’) complexity versus unnecessary (‘bad’) complexity, and we explore mechanisms of how sponsors of clinical trials can reduce trial complexity where appropriate.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Digital health technologies and machine learning augment patient reported outcomes to remotely characterise rheumatoid arthritis",
        "link": "https://www.nature.com/articles/s41746-024-01013-y",
        "publication_date": "12 Feb 2024",
        "abstract": "Digital measures of health status captured during daily life could greatly augment current in-clinic assessments for rheumatoid arthritis (RA), to enable better assessment of disease progression and impact. This work presents results from weaRAble-PRO, a 14-day observational study, which aimed to investigate how digital health technologies (DHT), such as smartphones and wearables, could augment patient reported outcomes (PRO) to determine RA status and severity in a study of 30 moderate-to-severe RA patients, compared to 30 matched healthy controls (HC). Sensor-based measures of health status, mobility, dexterity, fatigue, and other RA specific symptoms were extracted from daily iPhone guided tests (GT), as well as actigraphy and heart rate sensor data, which was passively recorded from patients’ Apple smartwatch continuously over the study duration. We subsequently developed a machine learning (ML) framework to distinguish RA status and to estimate RA severity. It was found that daily wearable sensor-outcomes robustly distinguished RA from HC participants (F1, 0.807). Furthermore, by day 7 of the study (half-way), a sufficient volume of data had been collected to reliably capture the characteristics of RA participants. In addition, we observed that the detection of RA severity levels could be improved by augmenting standard patient reported outcomes with sensor-based features (F1, 0.833) in comparison to using PRO assessments alone (F1, 0.759), and that the combination of modalities could reliability measure continuous RA severity, as determined by the clinician-assessed RAPID-3 score at baseline (r2, 0.692; RMSE, 1.33). The ability to measure the impact of the disease during daily life—through objective and remote digital outcomes—paves the way forward to enable the development of more patient-centric and personalised measurements for use in RA clinical trials.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A novel CNN architecture for accurate early detection and classification of Alzheimer’s disease using MRI data",
        "link": "https://www.nature.com/articles/s41598-024-53733-6",
        "publication_date": "12 Feb 2024",
        "abstract": "Alzheimer’s disease (AD) is a debilitating neurodegenerative disorder that requires accurate diagnosis for effective management and treatment. In this article, we propose an architecture for a convolutional neural network (CNN) that utilizes magnetic resonance imaging (MRI) data from the Alzheimer’s disease Neuroimaging Initiative (ADNI) dataset to categorize AD. The network employs two separate CNN models, each with distinct filter sizes and pooling layers, which are concatenated in a classification layer. The multi-class problem is addressed across three, four, and five categories. The proposed CNN architecture achieves exceptional accuracies of 99.43%, 99.57%, and 99.13%, respectively. These high accuracies demonstrate the efficacy of the network in capturing and discerning relevant features from MRI images, enabling precise classification of AD subtypes and stages. The network architecture leverages the hierarchical nature of convolutional layers, pooling layers, and fully connected layers to extract both local and global patterns from the data, facilitating accurate discrimination between different AD categories. Accurate classification of AD carries significant clinical implications, including early detection, personalized treatment planning, disease monitoring, and prognostic assessment. The reported accuracy underscores the potential of the proposed CNN architecture to assist medical professionals and researchers in making precise and informed judgments regarding AD patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Validation of sleep-staging accuracy for an in-home sleep electroencephalography device compared with simultaneous polysomnography in patients with obstructive sleep apnea",
        "link": "https://www.nature.com/articles/s41598-024-53827-1",
        "publication_date": "12 Feb 2024",
        "abstract": "Efforts to simplify standard polysomnography (PSG) in laboratories, especially for obstructive sleep apnea (OSA), and assess its agreement with portable electroencephalogram (EEG) devices are limited. We aimed to evaluate the agreement between a portable EEG device and type I PSG in patients with OSA and examine the EEG-based arousal index’s ability to estimate apnea severity. We enrolled 77 Japanese patients with OSA who underwent simultaneous type I PSG and portable EEG monitoring. Combining pulse rate, oxygen saturation (SpO2), and EEG improved sleep staging accuracy. Bland–Altman plots, paired t-tests, and receiver operating characteristics curves were used to assess agreement and screening accuracy. Significant small biases were observed for total sleep time, sleep latency, awakening after falling asleep, sleep efficiency, N1, N2, and N3 rates, arousal index, and apnea indexes. All variables showed > 95% agreement in the Bland–Altman analysis, with interclass correlation coefficients of 0.761–0.982, indicating high inter-instrument validity. The EEG-based arousal index demonstrated sufficient power for screening AHI ≥ 15 and ≥ 30 and yielded promising results in predicting apnea severity. Portable EEG device showed strong agreement with type I PSG in patients with OSA. These suggest that patients with OSA may assess their condition at home.",
        "conclusions": "In patients with OSA, our portable EEG device demonstrated good agreement with type I PSG, although more work is required to improve the agreement for N1 and N3 screening. Measurements could be conducted in a home setting, significantly reducing the burden on patients with OSA. Furthermore, the EEG-based arousal index, which predicts the degree of apnea without the need for a separate device to measure respiratory events, showed good results even with the portable EEG device in this study. This suggests that patients with OSA may be able to comfortably use this device in their homes to determine their degree of apnea.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of xerostomia in elderly based on clinical characteristics and salivary flow rate with machine learning",
        "link": "https://www.nature.com/articles/s41598-024-54120-x",
        "publication_date": "10 Feb 2024",
        "abstract": "Xerostomia may be accompanied by changes in salivary flow rate and the incidence increases in elderly. We aimed to use machine learning algorithms, to identify significant predictors for the presence of xerostomia. This study is the first to predict xerostomia with salivary flow rate in elderly based on artificial intelligence. In a cross-sectional study, 829 patients with oral discomfort were enrolled, and six features (sex, age, unstimulated and stimulated salivary flow rates (UFR and SFR, respectively), number of systemic diseases, and medication usage) were used in four machine learning algorithms to predict the presence of xerostomia. The incidence of xerostomia increased with age. The SFR was significantly higher than the UFR, and the UFR and SFR were significantly correlated. The UFR, but not SFR, decreased with age significantly. In patients more than 60 years of age, the UFR had a significantly higher predictive accuracy for xerostomia than the SFR. Using machine learning algorithms with tenfold cross-validation, the prediction accuracy increased significantly. In particular, the prediction accuracy of the multilayer perceptron (MLP) algorithm that combined UFR and SFR data was significantly better than either UFR or SFR individually. Moreover, when sex, age, number of systemic diseases, and number of medications were added to the MLP model, the prediction accuracy increased from 56 to 68%.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A comparative study of explainable ensemble learning and logistic regression for predicting in-hospital mortality in the emergency department",
        "link": "https://www.nature.com/articles/s41598-024-54038-4",
        "publication_date": "10 Feb 2024",
        "abstract": "This study addresses the challenges associated with emergency department (ED) overcrowding and emphasizes the need for efficient risk stratification tools to identify high-risk patients for early intervention. While several scoring systems, often based on logistic regression (LR) models, have been proposed to indicate patient illness severity, this study aims to compare the predictive performance of ensemble learning (EL) models with LR for in-hospital mortality in the ED. A cross-sectional single-center study was conducted at the ED of Imam Reza Hospital in northeast Iran from March 2016 to March 2017. The study included adult patients with one to three levels of emergency severity index. EL models using Bagging, AdaBoost, random forests (RF), Stacking and extreme gradient boosting (XGB) algorithms, along with an LR model, were constructed. The training and validation visits from the ED were randomly divided into 80% and 20%, respectively. After training the proposed models using tenfold cross-validation, their predictive performance was evaluated. Model performance was compared using the Brier score (BS), The area under the receiver operating characteristics curve (AUROC), The area and precision–recall curve (AUCPR), Hosmer–Lemeshow (H–L) goodness-of-fit test, precision, sensitivity, accuracy, F1-score, and Matthews correlation coefficient (MCC). The study included 2025 unique patients admitted to the hospital’s ED, with a total percentage of hospital deaths at approximately 19%. In the training group and the validation group, 274 of 1476 (18.6%) and 152 of 728 (20.8%) patients died during hospitalization, respectively. According to the evaluation of the presented framework, EL models, particularly Bagging, predicted in-hospital mortality with the highest AUROC (0.839, CI (0.802–0.875)) and AUCPR = 0.64 comparable in terms of discrimination power with LR (AUROC (0.826, CI (0.787–0.864)) and AUCPR = 0.61). XGB achieved the highest precision (0.83), sensitivity (0.831), accuracy (0.842), F1-score (0.833), and the highest MCC (0.48). Additionally, the most accurate models in the unbalanced dataset belonged to RF with the lowest BS (0.128). Although all studied models overestimate mortality risk and have insufficient calibration (P > 0.05), stacking demonstrated relatively good agreement between predicted and actual mortality. EL models are not superior to LR in predicting in-hospital mortality in the ED. Both EL and LR models can be considered as screening tools to identify patients at risk of mortality.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A novel theta-controlled vibrotactile brain–computer interface to treat chronic pain: a pilot study",
        "link": "https://www.nature.com/articles/s41598-024-53261-3",
        "publication_date": "10 Feb 2024",
        "abstract": "Limitations in chronic pain therapies necessitate novel interventions that are effective, accessible, and safe. Brain–computer interfaces (BCIs) provide a promising modality for targeting neuropathology underlying chronic pain by converting recorded neural activity into perceivable outputs. Recent evidence suggests that increased frontal theta power (4–7 Hz) reflects pain relief from chronic and acute pain. Further studies have suggested that vibrotactile stimulation decreases pain intensity in experimental and clinical models. This longitudinal, non-randomized, open-label pilot study's objective was to reinforce frontal theta activity in six patients with chronic upper extremity pain using a novel vibrotactile neurofeedback BCI system. Patients increased their BCI performance, reflecting thought-driven control of neurofeedback, and showed a significant decrease in pain severity (1.29 ± 0.25 MAD, p = 0.03, q = 0.05) and pain interference (1.79 ± 1.10 MAD p = 0.03, q = 0.05) scores without any adverse events. Pain relief significantly correlated with frontal theta modulation. These findings highlight the potential of BCI-mediated cortico-sensory coupling of frontal theta with vibrotactile stimulation for alleviating chronic pain.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cardiac arrhythmias classification using photoplethysmography database",
        "link": "https://www.nature.com/articles/s41598-024-53142-9",
        "publication_date": "09 Feb 2024",
        "abstract": "Worldwide, Cardiovascular Diseases (CVDs) are the leading cause of death. Patients at high cardiovascular risk require long-term follow-up for early CVDs detection. Generally, cardiac arrhythmia detection through the electrocardiogram (ECG) signal has been the basis of many studies. This technique does not provide sufficient information in addition to a high false alarm potential. In addition, the electrodes used to record the ECG signal are not suitable for long-term monitoring. Recently, the photoplethysmogram (PPG) signal has attracted great interest among scientists as it provides a non-invasive, inexpensive, and convenient source of information related to cardiac activity. In this paper, the PPG signal (online database Physio Net Challenge 2015) is used to classify different cardiac arrhythmias, namely, tachycardia, bradycardia, ventricular tachycardia, and ventricular flutter/fibrillation. The PPG signals are pre-processed and analyzed utilizing various signal-processing techniques to eliminate noise and artifacts, which forms a stage of signal preparation prior to the feature extraction process. A set of 41 PPG features is used for cardiac arrhythmias' classification through the application of four machine-learning techniques, namely, Decision Trees (DT), Support Vector Machines (SVM), K-Nearest Neighbors (KNNs), and Ensembles. Principal Component Analysis (PCA) technique is used for dimensionality reduction and feature extraction while preserving the most important information in the data. The results show a high-throughput evaluation with an accuracy of 98.4% for the KNN technique with a sensitivity of 98.3%, 95%, 96.8%, and 99.7% for bradycardia, tachycardia, ventricular flutter/fibrillation, and ventricular tachycardia, respectively. The outcomes of this work provide a tool to correlate the properties of the PPG signal with cardiac arrhythmias and thus the early diagnosis and treatment of CVDs.",
        "conclusions": "This study utilized a public online database of PPG signals (PhysioNet Challenge 2015) to classify different cardiac arrhythmias, such as bradycardia, tachycardia, ventricular tachycardia, and ventricular flutter/fibrillation. The PPG features were divided into three sets namely, training, validation, and testing. All PPG signals were preprocessed and features were extracted to be considered as input vectors for the classification model. Four machine learning techniques, namely decision tree (DT), k-nearest neighbors (KNN), support vector machine (SVM), and ensemble, were utilized in the classification process. The results demonstrated a high level of accuracy in classifying different arrhythmias, with an overall accuracy of 98.4% and sensitivities of 98.3%, 95%, 96.8%, and 99.7% for Bradycardia, Tachycardia, Ventricular Flutter/Fibrillation, and Ventricular Tachycardia, respectively. Furthermore, this study demonstrated that high accuracy in classifying cardiac arrhythmias could be achieved using only one type of bio-signal, specifically the PPG signal, and a limited number of features. This represents a significant advancement in the development of a monitoring system for detecting and classifying various cardiac arrhythmias.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An individually adjusted approach for communicating epidemiological results on health and lifestyle to patients",
        "link": "https://www.nature.com/articles/s41598-024-53275-x",
        "publication_date": "08 Feb 2024",
        "abstract": "If scientific research on modifiable risk factors was more accessible to the general population there is a potential to prevent disease and promote health. Mobile applications can automatically combine individual characteristics and statistical models of health to present scientific information as individually tailored visuals, and thus there is untapped potential in incorporating scientific research into apps aimed at promoting healthier lifestyles. As a proof-of-concept, we develop a statistical model of the relationship between Self-rated-health (SRH) and lifestyle-related factors, and a simple app for conveying its effects through a visualisation that sets the individual as the frame of reference. Using data from the 6th (n = 12 981, 53.4% women and 46.6% men) and 7th (n = 21 083, 52.5% women and 47.5% men) iteration of the Tromsø population survey, we fitted a mixed effects linear regression model that models mean SRH as a function of self-reported intensity and frequency of physical activity (PA), BMI, mental health symptoms (HSCL-10), smoking, support from friends, and HbA1c ≥ 6.5%. We adjusted for socioeconomic and demographic factors and comorbidity. We designed a simple proof-of-concept app to register relevant user information, and use the SRH-model to translate the present status of the user into suggestions for lifestyle changes along with predicted health effects. SRH was strongly related to modifiable health factors. The strongest modifiable predictors of SRH were mental health symptoms and PA. The mean adjusted difference in SRH between those with 10-HSCL index = 1.85 (threshold for mental distress) and HSCL-10 = 1 was 0.59 (CI 0.61–0.57). Vigorous physical activity (exercising to exhaustion ≥ 4 days/week relative to sedentary) was associated with an increase on the SRH scale of 0.64 (CI 0.56–0.73). Physical activity intensity and frequency interacted positively, with large PA-volume (frequency ⨯ intensity) being particularly predictive of high SRH. Incorporating statistical models of health into lifestyle apps have great potential for effectively communicating complex health research to a general audience. Such an approach could improve lifestyle apps by helping to make the recommendations more scientifically rigorous and personalised, and offer a more comprehensive overview of lifestyle factors and their importance.",
        "conclusions": "A digital educational tool for presenting scientific findings that utilises user data to adjust the presentation can potentially convey research findings more effectively than standard guidelines. They can visualise the information from a point of reference that is tailored to the user, simplify the presentation by showing only relevant findings, and facilitate engagement and understanding by allowing the user to interact with the information, and convey health information in a way that is more easily translated into actionable steps. SRH was found to be strongly associated with lifestyle factors. The most predictive modifiable health risk factors were symptoms of mental health, physical activity levels, and BMI. PA frequency and intensity were found to interact positively on SRH, suggesting that PA that high volume is particularly important for good SRH.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Crystallization kinetics of nanoconfined GeTe slabs in GeTe/TiTe\\(_2\\)-like superlattices for phase change memories",
        "link": "https://www.nature.com/articles/s41598-024-53192-z",
        "publication_date": "08 Feb 2024",
        "abstract": "Superlattices made of alternating blocks of the phase change compound Sb\\(_2\\)Te\\(_3\\) and of TiTe\\(_2\\) confining layers have been recently proposed for applications in neuromorphic devices. The Sb\\(_2\\)Te\\(_3\\)/TiTe\\(_2\\) heterostructure allows for a better control of multiple intermediate resistance states and for a lower drift with time of the electrical resistance of the amorphous phase. However, Sb\\(_2\\)Te\\(_3\\) suffers from a low data retention due to a low crystallization temperature T\\(_x\\). Substituting Sb\\(_2\\)Te\\(_3\\) with a phase change compound with a higher T\\(_x\\), such as GeTe, seems an interesting option in this respect. Nanoconfinement might, however, alters the crystallization kinetics with respect to the bulk. In this work, we investigated the crystallization process of GeTe nanoconfined in geometries mimicking GeTe/TiTe\\(_2\\) superlattices by means of molecular dynamics simulations with a machine learning potential. The simulations reveal that nanoconfinement induces a mild reduction in the crystal growth velocities which would not hinder the application of GeTe/TiTe\\(_2\\) heterostructures in neuromorphic devices with superior data retention.",
        "conclusions": "In summary, we performed MD simulations on the crystallization kinetics of ultrathin (3 nm) slabs of GeTe confined by capping layers aimed at mimicking the TiTe\\(_2\\) spacers in so far hypothetical GeTe/TiTe\\(_2\\) superlattices. This system is analog to the Sb\\(_2\\)Te\\(_3\\)/ TiTe\\(_2\\) heterostructure proposed in Ref.7 for applications in neuromorphic devices. The replacement of Sb\\(_2\\)Te\\(_3\\) by GeTe would raise the crystallization temperature of the amorphous phase to improve the data retention. Since nanoconfinement is known to slow down the crystallization kinetics, for instance in elemental Sb9, we have investigated here nanoconfined GeTe to explore its potential applications in GeTe/TiTe\\(_2\\) superlattices. The simulations show that nanoconfinement leads to a decrease of the crystal growth velocity \\(v_g\\) with respect to the bulk amorphous phase at the same density, set here to that of the crystalline \\(\\alpha\\) phase. The reduction in \\(v_g\\), about a factor two at the temperature of maximal crystallization speed, is however rather minor in the perspective application in neuromorphic devices. As opposed to what found experimentally for Sb\\(_2\\)Te\\(_3\\) and elemental Sb7,9, we do not observe a reduction of structural relaxations, i.e. aging, in nanoconfined GeTe with respect to the bulk. However, we must remark that we have investigated structural relaxation in the amorphous phase on a time scale (4 ns at 400-350 K) much shorter than that considered experimentally to monitor the resistance drift (from seconds to hours at 300 K) in Sb\\(_2\\)Te\\(_3\\)/TiTe\\(_2\\) superlattices7 and in ultrathin GeTe layers (3 nm) in memory cells35. Therefore, we can not exclude that a mitigation of the drift could also be achieved in nanoconfined GeTe on the time scale of interest for the operation of the devices. In conclusions, MD simulation support the idea of investigating GeTe/TiTe\\(_2\\) superlattices for applications in neuromorphic devices with improved data retention that we here put forward to future experimental work.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automated design of nighttime braces for adolescent idiopathic scoliosis with global shape optimization using a patient-specific finite element model",
        "link": "https://www.nature.com/articles/s41598-024-53586-z",
        "publication_date": "08 Feb 2024",
        "abstract": "Adolescent idiopathic scoliosis is a complex three-dimensional deformity of the spine, the moderate forms of which require treatment with an orthopedic brace. Existing brace design approaches rely mainly on empirical manual processes, vary considerably depending on the training and expertise of the orthotist, and do not always guarantee biomechanical effectiveness. To address these issues, we propose a new automated design method for creating bespoke nighttime braces requiring virtually no user input in the process. From standard biplanar radiographs and a surface topography torso scan, a personalized finite element model of the patient is created to simulate bracing and the resulting spine growth over the treatment period. Then, the topography of an automatically generated brace is modified and simulated over hundreds of iterations by a clinically driven optimization algorithm aiming to improve brace immediate and long-term effectiveness while respecting safety thresholds. This method was clinically tested on 17 patients prospectively recruited. The optimized braces showed a highly effective immediate correction of the thoracic and lumbar curves (70% and 90% respectively), with no modifications needed to fit the braces onto the patients. In addition, the simulated lumbar lordosis and thoracic apical rotation were improved by 5° ± 3° and 2° ± 3° respectively. Our approach distinguishes from traditional brace design as it relies solely on biomechanically validated models of the patient’s digital twin and a design strategy that is entirely abstracted from empirical knowledge. It provides clinicians with an efficient way to create effective braces without relying on lengthy manual processes and variable orthotist expertise to ensure a proper correction of scoliosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multi-instance learning based lung nodule system for assessment of CT quality after small-field-of-view reconstruction",
        "link": "https://www.nature.com/articles/s41598-024-53797-4",
        "publication_date": "07 Feb 2024",
        "abstract": "Small-field-of-view reconstruction CT images (sFOV-CT) increase the pixel density across airway structures and reduce partial volume effects. Multi-instance learning (MIL) is proposed as a weakly supervised machine learning method, which can automatically assess the image quality. The aim of this study was to evaluate the disparities between conventional CT (c-CT) and sFOV-CT images using a lung nodule system based on MIL and assessments from radiologists. 112 patients who underwent chest CT were retrospectively enrolled in this study between July 2021 to March 2022. After undergoing c-CT examinations, sFOV-CT images with small-field-of-view were reconstructed. Two radiologists analyzed all c-CT and sFOV-CT images, including features such as location, nodule type, size, CT values, and shape signs. Then, an MIL-based lung nodule system objectively analyzed the c-CT (c-MIL) and sFOV-CT (sFOV-MIL) to explore their differences. The signal-to-noise ratio of lungs (SNR-lung) and contrast-to-noise ratio of nodules (CNR-nodule) were calculated to evaluate the quality of CT images from another perspective. The subjective evaluation by radiologists showed that feature of minimal CT value (p = 0.019) had statistical significance between c-CT and sFOV-CT. However, most features (all with p < 0.05), except for nodule type, location, volume, mean CT value, and vacuole sign (p = 0.056–1.000), had statistical differences between c-MIL and sFOV-MIL by MIL system. The SNR-lung between c-CT and sFOV-CT had no statistical significance, while the CNR-nodule showed statistical difference (p = 0.007), and the CNR of sFOV-CT was higher than that of c-CT. In detecting the difference between c-CT and sFOV-CT, features extracted by the MIL system had more statistical differences than those evaluated by radiologists. The image quality of those two CT images was different, and the CNR-nodule of sFOV-CT was higher than that of c-CT.",
        "conclusions": "In conclusion, we have demonstrated that MIL system is better equipped to detect the difference between c-CT and sFOV-CT than subjective evaluation by radiologists. Our findings show that their image quality is statistically different, and the CNR-nodule of sFOV-CT is higher than that of c-CT. Therefore, sFOV reconstruction based on c-CT images is conducive to improve the conspicuity of pulmonary nodules.",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Altered resting-state functional connectivity in newborns with hypoxic ischemic encephalopathy assessed using high-density functional near-infrared spectroscopy",
        "link": "https://www.nature.com/articles/s41598-024-53256-0",
        "publication_date": "07 Feb 2024",
        "abstract": "Hypoxic-ischemic encephalopathy (HIE) results from a lack of oxygen to the brain during the perinatal period. HIE can lead to mortality and various acute and long-term morbidities. Improved bedside monitoring methods are needed to identify biomarkers of brain health. Functional near-infrared spectroscopy (fNIRS) can assess resting-state functional connectivity (RSFC) at the bedside. We acquired resting-state fNIRS data from 21 neonates with HIE (postmenstrual age [PMA] = 39.96), in 19 neonates the scans were acquired post-therapeutic hypothermia (TH), and from 20 term-born healthy newborns (PMA = 39.93). Twelve HIE neonates also underwent resting-state functional magnetic resonance imaging (fMRI) post-TH. RSFC was calculated as correlation coefficients amongst the time courses for fNIRS and fMRI data, respectively. The fNIRS and fMRI RSFC maps were comparable. RSFC patterns were then measured with graph theory metrics and compared between HIE infants and healthy controls. HIE newborns showed significantly increased clustering coefficients, network efficiency and modularity compared to controls. Using a support vector machine algorithm, RSFC features demonstrated good performance in classifying the HIE and healthy newborns in separate groups. Our results indicate the utility of fNIRS-connectivity patterns as potential biomarkers for HIE and fNIRS as a new bedside tool for newborns with HIE.",
        "conclusions": "In this study, we determined the utility of fNIRS to assess RSFC as a potential biomarker for brain health in term-born neonates with HIE. By incorporating a multimodal neuroimaging investigation using fNIRS, fMRI and structural MRI, we showed that fNIRS-based RSFC patterns were comparable to those seen with fMRI and that these metrics were predictive of brain volumes. We further demonstrated that fNIRS-based RSFC maps differed between HIE and healthy newborns. Lastly, fNIRS-based connectivity metrics performed well in machine learning models to determine diagnostic group membership. Overall, study findings indicate that altered fNIRS-based RSFC patterns can be potential biomarkers of HIE. fNIRS at the bedside could be complementary to other imaging modalities in terms of characterizing neonatal brain function.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Association between alkaline phosphatase to albumin ratio and mortality among patients with sepsis",
        "link": "https://www.nature.com/articles/s41598-024-53384-7",
        "publication_date": "07 Feb 2024",
        "abstract": "The alkaline phosphatase-to-albumin ratio (APAR) is correlated to worse prognosis in coronary artery disease, cancer, and acute renal failure. However, the relationship between APAR and sepsis prognosis has received little research. The content of this research was to investigate the prognostic relationship between APAR and sepsis. And validate the stability of the correlation in 90-days and 1-year mortality. Retrospective cohort research was conducted basing MIMIC-IV database (version 2.0). The hazard ratio (HR) and 95% confidence interval (Cl) were computed using multivariate Cox regression analysis. In addition, plots of survival curves and subgroup analyzes were conducted. Receiver operating characteristic (ROC) curves were also used. 9741 participants were included in this investigation. The 90-days mortality was 32.8%, and the 1-year mortality was 42.0%. After controlling for confounders, the adjusted HRs (95% CI) for tertile 2 (2.2–3.8) and tertile 3 (> 3.8) were 1.37 (1.25–1.51) and 1.74 (1.58–1.91), respectively. The Kaplan–Meier curve analysis showed a higher probability of 90-days death in the higher APAR group. The area under the curve (AUC) of APAR was 0.674 and could reach 0.709 after combining the Oxford Acute Severity of Illness Score (OASIS). This study demonstrates that APAR is significantly related to bad clinical outcomes in sepsis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Preoperative CT and survival data for patients undergoing resection of colorectal liver metastases",
        "link": "https://www.nature.com/articles/s41597-024-02981-2",
        "publication_date": "06 Feb 2024",
        "abstract": "The liver is a common site for the development of metastases in colorectal cancer. Treatment selection for patients with colorectal liver metastases (CRLM) is difficult; although hepatic resection will cure a minority of CRLM patients, recurrence is common. Reliable preoperative prediction of recurrence could therefore be a valuable tool for physicians in selecting the best candidates for hepatic resection in the treatment of CRLM. It has been hypothesized that evidence for recurrence could be found via quantitative image analysis on preoperative CT imaging of the future liver remnant before resection. To investigate this hypothesis, we have collected preoperative hepatic CT scans, clinicopathologic data, and recurrence/survival data, from a large, single-institution series of patients (n = 197) who underwent hepatic resection of CRLM. For each patient, we also created segmentations of the liver, vessels, tumors, and future liver remnant. The largest of its kind, this dataset is a resource that may aid in the development of quantitative imaging biomarkers and machine learning models for the prediction of post-resection hepatic recurrence of CRLM.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Homologous Recombination Deficiency Unrelated to Platinum and PARP Inhibitor Response in Cell Line Libraries",
        "link": "https://www.nature.com/articles/s41597-024-03018-4",
        "publication_date": "06 Feb 2024",
        "abstract": "While large publicly available cancer cell line databases are invaluable for preclinical drug discovery and biomarker development, the association between homologous recombination deficiency (HRD) and drug sensitivity in these resources remains unclear. In this study, we comprehensively analyzed molecular profiles and drug screening data from the Cancer Cell Line Encyclopedia. Unexpectedly, gene alterations in BRCA1/2 or homologous recombination-related genes, HRD scores, or mutational signature 3 were not positively correlated with sensitivity to platinum agents or PARP inhibitors. Rather, higher HRD scores and mutational signature 3 were significantly associated with resistance to these agents in multiple assays. These findings were consistent when analyzing exclusively breast and ovarian cancer cell lines and when using data from the COSMIC Cell Line Project. Collectively, the existing data from established cancer cell lines do not reflect the expected association between HRD status and drug response to platinum agents and PARP inhibitors in clinical tumors. This discrepancy may extend to other tumor characteristics, highlighting the importance of recognizing potential limitations in cell line data for researchers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A clinically applicable connectivity signature for glioblastoma includes the tumor network driver CHI3L1",
        "link": "https://www.nature.com/articles/s41467-024-45067-8",
        "publication_date": "06 Feb 2024",
        "abstract": "Tumor microtubes (TMs) connect glioma cells to a network with considerable relevance for tumor progression and therapy resistance. However, the determination of TM-interconnectivity in individual tumors is challenging and the impact on patient survival unresolved. Here, we establish a connectivity signature from single-cell RNA-sequenced (scRNA-Seq) xenografted primary glioblastoma (GB) cells using a dye uptake methodology, and validate it with recording of cellular calcium epochs and clinical correlations. Astrocyte-like and mesenchymal-like GB cells have the highest connectivity signature scores in scRNA-sequenced patient-derived xenografts and patient samples. In large GB cohorts, TM-network connectivity correlates with the mesenchymal subtype and dismal patient survival. CHI3L1 gene expression serves as a robust molecular marker of connectivity and functionally influences TM networks. The connectivity signature allows insights into brain tumor biology, provides a proof-of-principle that tumor cell TM-connectivity is relevant for patients’ prognosis, and serves as a robust prognostic biomarker.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cellular heterogeneity of pluripotent stem cell-derived cardiomyocyte grafts is mechanistically linked to treatable arrhythmias",
        "link": "https://www.nature.com/articles/s44161-023-00419-3",
        "publication_date": "06 Feb 2024",
        "abstract": "Preclinical data have confirmed that human pluripotent stem cell-derived cardiomyocytes (PSC-CMs) can remuscularize the injured or diseased heart, with several clinical trials now in planning or recruitment stages. However, because ventricular arrhythmias represent a complication following engraftment of intramyocardially injected PSC-CMs, it is necessary to provide treatment strategies to control or prevent engraftment arrhythmias (EAs). Here, we show in a porcine model of myocardial infarction and PSC-CM transplantation that EAs are mechanistically linked to cellular heterogeneity in the input PSC-CM and resultant graft. Specifically, we identify atrial and pacemaker-like cardiomyocytes as culprit arrhythmogenic subpopulations. Two unique surface marker signatures, signal regulatory protein α (SIRPA)+CD90−CD200+ and SIRPA+CD90−CD200−, identify arrhythmogenic and non-arrhythmogenic cardiomyocytes, respectively. Our data suggest that modifications to current PSC-CM-production and/or PSC-CM-selection protocols could potentially prevent EAs. We further show that pharmacologic and interventional anti-arrhythmic strategies can control and potentially abolish these arrhythmias.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multimodal machine learning for modeling infant head circumference, mothers’ milk composition, and their shared environment",
        "link": "https://www.nature.com/articles/s41598-024-52323-w",
        "publication_date": "05 Feb 2024",
        "abstract": "Links between human milk (HM) and infant development are poorly understood and often focus on individual HM components. Here we apply multi-modal predictive machine learning to study HM and head circumference (a proxy for brain development) among 1022 mother-infant dyads of the CHILD Cohort. We integrated HM data (19 oligosaccharides, 28 fatty acids, 3 hormones, 28 chemokines) with maternal and infant demographic, health, dietary and home environment data. Head circumference was significantly predictable at 3 and 12 months. Two of the most associated features were HM n3-polyunsaturated fatty acid C22:6n3 (docosahexaenoic acid, DHA; p = 9.6e−05) and maternal intake of fish (p = 4.1e−03), a key dietary source of DHA with established relationships to brain function. Thus, using a systems biology approach, we identified meaningful relationships between HM and brain development, which validates our statistical approach, gives credence to the novel associations we observed, and sets the foundation for further research with additional cohorts and HM analytes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Closing the accessibility gap to mental health treatment with a personalized self-referral chatbot",
        "link": "https://www.nature.com/articles/s41591-023-02766-x",
        "publication_date": "05 Feb 2024",
        "abstract": "Inequality in treatment access is a pressing issue in most healthcare systems across many medical disciplines. In mental healthcare, reduced treatment access for minorities is ubiquitous but remedies are sparse. Here we demonstrate that digital tools can reduce the accessibility gap by addressing several key barriers. In a multisite observational study of 129,400 patients within England’s NHS services, we evaluated the impact of a personalized artificial intelligence-enabled self-referral chatbot on patient referral volume and diversity in ethnicity, gender and sexual orientation. We found that services that used this digital solution identified substantially increased referrals (15% increase versus 6% increase in control services). Critically, this increase was particularly pronounced in minorities, such as nonbinary (179% increase) and ethnic minority individuals (29% increase). Using natural language processing to analyze qualitative feedback from 42,332 individuals, we found that the chatbot’s human-free nature and the patients’ self-realization of their need for treatment were potential drivers for the observed improvement in the diversity of access. This provides strong evidence that digital tools may help overcome the pervasive inequality in mental healthcare.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning enables non-Gaussian investigation of changes to peripheral nerves related to electrical stimulation",
        "link": "https://www.nature.com/articles/s41598-024-53284-w",
        "publication_date": "02 Feb 2024",
        "abstract": "Electrical stimulation of the peripheral nervous system (PNS) is becoming increasingly important for the therapeutic treatment of numerous disorders. Thus, as peripheral nerves are increasingly the target of electrical stimulation, it is critical to determine how, and when, electrical stimulation results in anatomical changes in neural tissue. We introduce here a convolutional neural network and support vector machines for cell segmentation and analysis of histological samples of the sciatic nerve of rats stimulated with varying current intensities. We describe the methodologies and present results that highlight the validity of the approach: machine learning enabled highly efficient nerve measurement collection, while multivariate analysis revealed notable changes to nerves’ anatomy, even when subjected to levels of stimulation thought to be safe according to the Shannon current limits.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Malaria seroepidemiology in very low transmission settings in the Peruvian Amazon",
        "link": "https://www.nature.com/articles/s41598-024-52239-5",
        "publication_date": "02 Feb 2024",
        "abstract": "Despite progress towards malaria reduction in Peru, measuring exposure in low transmission areas is crucial for achieving elimination. This study focuses on two very low transmission areas in Loreto (Peruvian Amazon) and aims to determine the relationship between malaria exposure and proximity to health facilities. Individual data was collected from 38 villages in Indiana and Belen, including geo-referenced households and blood samples for microscopy, PCR and serological analysis. A segmented linear regression model identified significant changes in seropositivity trends among different age groups. Local Getis-Ord Gi* statistic revealed clusters of households with high (hotspots) or low (coldspots) seropositivity rates. Findings from 4000 individuals showed a seropositivity level of 2.5% (95%CI: 2.0%-3.0%) for P. falciparum and 7.8% (95%CI: 7.0%-8.7%) for P. vivax, indicating recent or historical exposure. The segmented regression showed exposure reductions in the 40–50 age group (β1 = 0.043, p = 0.003) for P. vivax and the 50–60 age group (β1 = 0.005, p = 0.010) for P. falciparum. Long and extreme distance villages from Regional Hospital of Loreto exhibited higher malaria exposure compared to proximate and medium distance villages (p < 0.001). This study showed the seropositivity of malaria in two very low transmission areas and confirmed the spatial pattern of hotspots as villages become more distant.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Determination of biomarker candidates for the placenta accreta spectrum by plasma proteomic analysis",
        "link": "https://www.nature.com/articles/s41598-024-53324-5",
        "publication_date": "02 Feb 2024",
        "abstract": "Placenta accreta spectrum (PAS) presents a significant obstetric challenge, associated with considerable maternal and fetal-neonatal morbidity and mortality. Nevertheless, it is imperative to acknowledge that a noteworthy subset of PAS cases remains undetected until the time of delivery, thereby contributing to an augmented incidence of morbidity among the affected individuals. The delayed identification of PAS not only hinders timely intervention but also exacerbates the associated health risks for both the maternal and fetal outcomes. This underscores the urgency to innovate strategies for early PAS diagnosis. In this study, we aimed to explore plasma proteins as potential diagnostic biomarkers for PAS. Integrated transcriptome and proteomic analyses were conducted to establish a novel diagnostic approach. A cohort of 15 pregnant women diagnosed with PAS and delivering at Inonu University Faculty of Medicine between 01/04/2021 and 01/01/2023, along with a matched control group of 15 pregnant women without PAS complications, were enrolled. Plasma protein identification utilized enzymatic digestion and liquid chromatography-tandem mass spectrometry techniques. Proteomic analysis identified 228 plasma proteins, of which 85 showed significant differences (P < 0.001) between PAS and control cases. We refined this to a set of 20 proteins for model construction, resulting in a highly accurate classification model (96.9% accuracy). Notable associations were observed for proteins encoded by P01859 (Immunoglobulin heavy constant gamma 2), P02538 (Keratin type II cytoskeletal 6A), P29622 [Kallistatin (also known as Serpin A4)], P17900 (Ganglioside GM2 activator Calmodulin-like protein 5), and P01619 (Immunoglobulin kappa variable 3–20), with fold changes indicating their relevance in distinguishing PAS from control groups. In conclusion, our study has identified novel plasma proteins that could serve as potential biomarkers for early diagnosis of PAS in pregnant women. Further research and validation in larger PAS cohorts are necessary to determine the clinical utility and reliability of these proteomic biomarkers for diagnosing PAS.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Linking gene expression to clinical outcomes in pediatric Crohn’s disease using machine learning",
        "link": "https://www.nature.com/articles/s41598-024-52678-0",
        "publication_date": "01 Feb 2024",
        "abstract": "Pediatric Crohn’s disease (CD) is characterized by a severe disease course with frequent complications. We sought to apply machine learning-based models to predict risk of developing future complications in pediatric CD using ileal and colonic gene expression. Gene expression data was generated from 101 formalin-fixed, paraffin-embedded (FFPE) ileal and colonic biopsies obtained from treatment-naïve CD patients and controls. Clinical outcomes including development of strictures or fistulas and progression to surgery were analyzed using differential expression and modeled using machine learning. Differential expression analysis revealed downregulation of pathways related to inflammation and extra-cellular matrix production in patients with strictures. Machine learning-based models were able to incorporate colonic gene expression and clinical characteristics to predict outcomes with high accuracy. Models showed an area under the receiver operating characteristic curve (AUROC) of 0.84 for strictures, 0.83 for remission, and 0.75 for surgery. Genes with potential prognostic importance for strictures (REG1A, MMP3, and DUOX2) were not identified in single gene differential analysis but were found to have strong contributions to predictive models. Our findings in FFPE tissue support the importance of colonic gene expression and the potential for machine learning-based models in predicting outcomes for pediatric CD.",
        "conclusions": "Pediatric CD patients who experience complications show a distinct colonic transcriptome at the time of diagnosis. Machine learning can use this information to predict future outcomes, including strictures, remission, or progression to surgery. Applied to larger, multi-institutional datasets, this approach can develop prognostic models to support clinicians in identifying which patients are at highest risk of CD-specific complications and tailor therapies to improve outcomes.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A clinical microscopy dataset to develop a deep learning diagnostic test for urinary tract infection",
        "link": "https://www.nature.com/articles/s41597-024-02975-0",
        "publication_date": "01 Feb 2024",
        "abstract": "Urinary tract infection (UTI) is a common disorder. Its diagnosis can be made by microscopic examination of voided urine for markers of infection. This manual technique is technically difficult, time-consuming and prone to inter-observer errors. The application of computer vision to this domain has been slow due to the lack of a clinical image dataset from UTI patients. We present an open dataset containing 300 images and 3,562 manually annotated urinary cells labelled into seven classes of clinically significant cell types. It is an enriched dataset acquired from the unstained and untreated urine of patients with symptomatic UTI using a simple imaging system. We demonstrate that this dataset can be used to train a Patch U-Net, a novel deep learning architecture with a random patch generator to recognise urinary cells. Our hope is, with this dataset, UTI diagnosis will be made possible in nearly all clinical settings by using a simple imaging system which leverages advanced machine learning techniques.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Domain adaptation via Wasserstein distance and discrepancy metric for chest X-ray image classification",
        "link": "https://www.nature.com/articles/s41598-024-53311-w",
        "publication_date": "01 Feb 2024",
        "abstract": "Deep learning technology can effectively assist physicians in diagnosing chest radiographs. Conventional domain adaptation methods suffer from inaccurate lesion region localization, large errors in feature extraction, and a large number of model parameters. To address these problems, we propose a novel domain-adaptive method WDDM to achieve abnormal identification of chest radiographic images by combining Wasserstein distance and difference measures. Specifically, our method uses BiFormer as a multi-scale feature extractor to extract deep feature representations of data samples, which focuses more on discriminant features than convolutional neural networks and Swin Transformer. In addition, based on the loss minimization of Wasserstein distance and contrast domain differences, the source domain samples closest to the target domain are selected to achieve similarity and dissimilarity across domains. Experimental results show that compared with the non-transfer method that directly uses the network trained in the source domain to classify the target domain, our method has an average AUC increase of 14.8% and above. In short, our method achieves higher classification accuracy and better generalization performance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Spatiotemporal patterns of throwing muscle synergies in yips-affected baseball players",
        "link": "https://www.nature.com/articles/s41598-024-52332-9",
        "publication_date": "01 Feb 2024",
        "abstract": "“Yips” are involuntary movements that interfere with the automatic execution of sports movements. However, how the coordination among the various muscles necessary for sports movements is impaired in athletes with yips remains to be fully understood. This study aimed to assess whether muscle synergy analysis through non-negative matrix factorization (NMF) could identify impaired spatiotemporal muscle coordination in baseball players with throwing yips. Twenty-two college baseball players, including 12 with and 10 without yips symptoms participated in the study. Electromyographic activity was recorded from 13 ipsilateral upper extremity muscles during full-effort throwing. Muscle synergies were extracted through NMF. Cluster analysis was conducted to identify any common spatiotemporal patterns of muscle synergies in players with yips. Whether individual players with yips showed deviations in spatiotemporal patterns of muscle synergies compared with control players was also investigated. Four muscle synergies were extracted for each player, but none were specific to the yips group. However, a more detailed analysis of individual players revealed that two of the three players who presented dystonic symptoms during the experiment exhibited specific patterns that differed from those in control players. By contrast, each player whose symptoms were not reproduced during the experiment presented spatiotemporal patterns of muscle synergies similar to those of the control group. The results of this study indicate no common spatiotemporal pattern of muscle synergies specific to the yips group. Furthermore, these results suggest that the spatiotemporal pattern of muscle synergies in baseball throwing motion is not impaired in situations where symptoms are not reproduced even if the players have yips symptoms. However, muscle synergy analysis can identify the characteristics of muscle coordination of players who exhibit dystonic movements. These findings can be useful in developing personalized therapeutic strategies based on individual characteristics of yips symptoms.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Retinal vessel volume reference database derived from volume-rendered optical coherence tomography angiography",
        "link": "https://www.nature.com/articles/s41598-024-53000-8",
        "publication_date": "01 Feb 2024",
        "abstract": "Optical coherence tomography angiography (OCTA) enables three-dimensional reconstruction of the functional blood vessels in the retina. Therefore, it enables the quantification of 3D retinal vessel parameters such as surface area and vessel volume. In spite of the widespread use of OCTA, no representative volume-rendered vessel volume (VV) data are published to date. In this study, OCTA 3 × 3 mm macular cubes were processed with volume-rendering techniques to measure VV in 203 eyes from 107 healthy volunteers. Generalized linear models (GLM) were constructed to assess the impact of age, gender, visual acuity (VA), spherical equivalent (SE), and axial length (AL) on VV. Overall mean VV was 0.23 ± 0.05mm3. Age and axial length showed a negative correlation with VV. However, GLM model analysis found that AL exerted the most pronounced influence on VV. No statistically significant associations were identified between gender or between left and right eyes. This is the first study to assess 3D OCTA VV and its naturally occurring variations in a large series of healthy subjects. It offers novel insights into the characterization of normal retinal vascular anatomy in healthy individuals, contributing to a valuable reference for future research in this field.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Incorporating longitudinal history of risk factors into atherosclerotic cardiovascular disease risk prediction using deep learning",
        "link": "https://www.nature.com/articles/s41598-024-51685-5",
        "publication_date": "31 Jan 2024",
        "abstract": "It is increasingly clear that longitudinal risk factor levels and trajectories are related to risk for atherosclerotic cardiovascular disease (ASCVD) above and beyond single measures. Currently used in clinical care, the Pooled Cohort Equations (PCE) are based on regression methods that predict ASCVD risk based on cross-sectional risk factor levels. Deep learning (DL) models have been developed to incorporate longitudinal data for risk prediction but its benefit for ASCVD risk prediction relative to the traditional Pooled Cohort Equations (PCE) remain unknown. Our study included 15,565 participants from four cardiovascular disease cohorts free of baseline ASCVD who were followed for adjudicated ASCVD. Ten-year ASCVD risk was calculated in the training set using our benchmark, the PCE, and a longitudinal DL model, Dynamic-DeepHit. Predictors included those incorporated in the PCE: sex, race, age, total cholesterol, high density lipid cholesterol, systolic and diastolic blood pressure, diabetes, hypertension treatment and smoking. The discrimination and calibration performance of the two models were evaluated in an overall hold-out testing dataset. Of the 15,565 participants in our dataset, 2170 (13.9%) developed ASCVD. The performance of the longitudinal DL model that incorporated 8 years of longitudinal risk factor data improved upon that of the PCE [AUROC: 0.815 (CI 0.782–0.844) vs 0.792 (CI 0.760–0.825)] and the net reclassification index was 0.385. The brier score for the DL model was 0.0514 compared with 0.0542 in the PCE. Incorporating longitudinal risk factors in ASCVD risk prediction using DL can improve model discrimination and calibration.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Generative deep learning furthers the understanding of local distributions of fat and muscle on body shape and health using 3D surface scans",
        "link": "https://www.nature.com/articles/s43856-024-00434-w",
        "publication_date": "30 Jan 2024",
        "abstract": "Body shape, an intuitive health indicator, is deterministically driven by body composition. We developed and validated a deep learning model that generates accurate dual-energy X-ray absorptiometry (DXA) scans from three-dimensional optical body scans (3DO), enabling compositional analysis of the whole body and specified subregions. Previous works on generative medical imaging models lack quantitative validation and only report quality metrics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Impact of medical technologies may be predicted using constructed graph bibliometrics",
        "link": "https://www.nature.com/articles/s41598-024-52233-x",
        "publication_date": "29 Jan 2024",
        "abstract": "Scientific research is driven by allocation of funding to different research projects based in part on the predicted scientific impact of the work. Data-driven algorithms can inform decision-making of scarce funding resources by identifying likely high-impact studies using bibliometrics. Compared to standardized citation-based metrics alone, we utilize a machine learning pipeline that analyzes high-dimensional relationships among a range of bibliometric features to improve the accuracy of predicting high-impact research. Random forest classification models were trained using 28 bibliometric features calculated from a dataset of 1,485,958 publications in medicine to retrospectively predict whether a publication would become high-impact. For each random forest model, the balanced accuracy score was above 0.95 and the area under the receiver operating characteristic curve was above 0.99. The high performance of high impact research prediction using our proposed models show that machine learning technologies are promising algorithms that can support funding decision-making for medical research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "The Swiss Spinal Cord Injury Cohort Study (SwiSCI) biobank: from concept to reality",
        "link": "https://www.nature.com/articles/s41393-024-00958-x",
        "publication_date": "29 Jan 2024",
        "abstract": "To describe the concept, establishment and the operationalization of the biobank of the Swiss Spinal Cord Injury Cohort Study (SwiSCI), the available biosamples, and demographic and clinical characteristics of study participants.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A comparative patient-level prediction study in OMOP CDM: applicative potential and insights from synthetic data",
        "link": "https://www.nature.com/articles/s41598-024-52723-y",
        "publication_date": "27 Jan 2024",
        "abstract": "The emergence of collaborations, which standardize and combine multiple clinical databases across different regions, provide a wealthy source of data, which is fundamental for clinical prediction models, such as patient-level predictions. With the aid of such large data pools, researchers are able to develop clinical prediction models for improved disease classification, risk assessment, and beyond. To fully utilize this potential, Machine Learning (ML) methods are commonly required to process these large amounts of data on disease-specific patient cohorts. As a consequence, the Observational Health Data Sciences and Informatics (OHDSI) collaborative develops a framework to facilitate the application of ML models for these standardized patient datasets by using the Observational Medical Outcomes Partnership (OMOP) common data model (CDM). In this study, we compare the feasibility of current web-based OHDSI approaches, namely ATLAS and “Patient-level Prediction” (PLP), against a native solution (R based) to conduct such ML-based patient-level prediction analyses in OMOP. This will enable potential users to select the most suitable approach for their investigation. Each of the applied ML solutions was individually utilized to solve the same patient-level prediction task. Both approaches went through an exemplary benchmarking analysis to assess the weaknesses and strengths of the PLP R-Package. In this work, the performance of this package was subsequently compared versus the commonly used native R-package called Machine Learning in R 3 (mlr3), and its sub-packages. The approaches were evaluated on performance, execution time, and ease of model implementation. The results show that the PLP package has shorter execution times, which indicates great scalability, as well as intuitive code implementation, and numerous possibilities for visualization. However, limitations in comparison to native packages were depicted in the implementation of specific ML classifiers (e.g., Lasso), which may result in a decreased performance for real-world prediction problems. The findings here contribute to the overall effort of developing ML-based prediction models on a clinical scale and provide a snapshot for future studies that explicitly aim to develop patient-level prediction models in OMOP CDM.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Rural Indonesian adolescents’ smoking behaviours during the COVID-19 pandemic: rapid survey and cotinine test of school-attend adolescents in Gunung Kidul, Yogyakarta",
        "link": "https://www.nature.com/articles/s41598-023-50123-2",
        "publication_date": "26 Jan 2024",
        "abstract": "The COVID-19 pandemic is predicted to affect adolescent smoking behaviours. We aim to map profiles of adolescents’ smoking behaviours in a rural district in Indonesia during the COVID-19 pandemic and validate their smoking exposures using cotinine tests. This study applied an online survey followed by cotinine tests for high-school students in Gunung Kidul, Yogyakarta. The participants were asked to complete the survey and participate in a cotinine test. Univariate and multivariate regressions were performed to seek potential determinants of the smoking status and diagnostic accuracy of the cotinine test. A total of 281 participants completed the survey, with 19.6% (n = 55) and 22.8% (n = 64) being ever-smokers and current smokers. The impacts of the pandemics on their smoking behaviours were found in the urgency and numbers of daily smoked cigarettes. Univariate regression analysis revealed age, gender, learning mode, and whether father/friend smokes correlate with the adolescents’ smoking behaviours. Multivariate regression analysis revealed that the odds of planning to stop smoking were 0.01 (95% CI 0.001–0.22, p-value 0.003) for having positive attitudes towards cigarettes compared to none. Of the 65 cotinine tests, 19 tested positive, with the sensitivity and specificity of the cotinine test at 94.7% and 95.6%. The prevalence of adolescent smoking during the COVID-19 pandemic in Gunung Kidul is high, with the impacts of the pandemic on the urgency and number of cigarette smoke. There are opportunities to help them stop smoking by providing reliable quit-tobacco access and advocacy in collaboration with schools, parents, and health providers.",
        "conclusions": "The prevalence of high-school adolescent smokers in Gunung Kidul district in Yogyakarta during the COVID-19 pandemic was high. The pandemic’s impacts are particularly on the urgency to smoke and the number of daily smoked cigarettes. Factors associated with adolescent smoking behaviours were particularly the social environment, such as their family or peers who are smokers, and also the changing learning modes from offline to online/hybrid mode. Results of the cotinine tests also confirm the students’ exposures to tobacco with a high sensitivity and specificity rate compared to their answers based on the questionnaire. Further research is needed to provide accessible and reliable stop-smoking services for adolescents, collaborating with schools, families and health providers.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "An artificial neural network model for evaluating the risk of hyperuricaemia in type 2 diabetes mellitus",
        "link": "https://www.nature.com/articles/s41598-024-52550-1",
        "publication_date": "25 Jan 2024",
        "abstract": "Type 2 diabetes with hyperuricaemia may lead to gout, kidney damage, hypertension, coronary heart disease, etc., further aggravating the condition of diabetes as well as adding to the medical and financial burden. To construct a risk model for hyperuricaemia in patients with type 2 diabetes mellitus based on artificial neural network, and to evaluate the effectiveness of the risk model to provide directions for the prevention and control of the disease in this population. From June to December 2022, 8243 patients with type 2 diabetes were recruited from six community service centers for questionnaire and physical examination. Secondly, the collected data were used to select suitable variables and based on the comparison results, logistic regression was used to screen the variable characteristics. Finally, three risk models for evaluating the risk of hyperuricaemia in type 2 diabetes mellitus were developed using an artificial neural network algorithm and evaluated for performance. A total of eleven factors affecting the development of hyperuricaemia in patients with type 2 diabetes mellitus in this study, including gender, waist circumference, diabetes medication use, diastolic blood pressure, γ-glutamyl transferase, blood urea nitrogen, triglycerides, low-density lipoprotein cholesterol, high-density lipoprotein cholesterol, fasting glucose and estimated glomerular filtration rate. Among the generated models, baseline & biochemical risk model had the best performance with cutoff, area under the curve, accuracy, recall, specificity, positive likelihood ratio, negative likelihood ratio, precision, negative predictive value, KAPPA and F1-score were 0.488, 0.744, 0.689, 0.625, 0.749, 2.489, 0.501, 0.697, 0.684, 0.375 and 0.659. In addition, its Brier score was 0.169 and the calibration curve also showed good agreement between fitting and observation. The constructed artificial neural network model has better efficacy and facilitates the reduction of the harm caused by type 2 diabetes mellitus combined with hyperuricaemia.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Task design for crowdsourced glioma cell annotation in microscopy images",
        "link": "https://www.nature.com/articles/s41598-024-51995-8",
        "publication_date": "23 Jan 2024",
        "abstract": "Crowdsourcing has been used in computational pathology to generate cell and cell nuclei annotations for machine learning. Herein, we broaden its scope to the previously unsolved challenging task of glioma cell detection. This requires multiplexed immunofluorescence microscopy due to diffuse invasiveness and exceptional similarity between glioma cells and reactive astrocytes. In four pilot experiments, we iteratively developed a task design enabling high-quality annotations by crowdworkers on Amazon Mechanical Turk. We applied majority or weighted vote and validated them against ground truth in the final setting. On the base of a YOLO convolutional neural network architecture, we used these consensus labels for training with different image representations regarding colors, intensities, and immmunohistochemical marker combinations. A crowd of 712 workers defined aggregated point annotations in 235 images with an average \\(F_1\\) score of 0.627 for majority vote. The networks resulted in acceptable \\(F_1\\) scores up to 0.69 for YOLOv8 on average and indicated first evidence for transferability to images lacking tumor markers, especially in IDH-wildtype glioblastoma. Our work confirms feasibility of crowdsourcing to generate labels suitable for training of machine learning tools in the challenging and clinically relevant use case of glioma microenvironment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The Molecular Twin artificial-intelligence platform integrates multi-omic data to predict outcomes for pancreatic adenocarcinoma patients",
        "link": "https://www.nature.com/articles/s43018-023-00697-7",
        "publication_date": "22 Jan 2024",
        "abstract": "Contemporary analyses focused on a limited number of clinical and molecular biomarkers have been unable to accurately predict clinical outcomes in pancreatic ductal adenocarcinoma. Here we describe a precision medicine platform known as the Molecular Twin consisting of advanced machine-learning models and use it to analyze a dataset of 6,363 clinical and multi-omic molecular features from patients with resected pancreatic ductal adenocarcinoma to accurately predict disease survival (DS). We show that a full multi-omic model predicts DS with the highest accuracy and that plasma protein is the top single-omic predictor of DS. A parsimonious model learning only 589 multi-omic features demonstrated similar predictive performance as the full multi-omic model. Our platform enables discovery of parsimonious biomarker panels and performance assessment of outcome prediction models learning from resource-intensive panels. This approach has considerable potential to impact clinical care and democratize precision cancer medicine worldwide.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning prediction of the failure of high-flow nasal oxygen therapy in patients with acute respiratory failure",
        "link": "https://www.nature.com/articles/s41598-024-52061-z",
        "publication_date": "21 Jan 2024",
        "abstract": "Acute respiratory failure (ARF) is a prevalent and serious condition in intensive care unit (ICU), often associated with high mortality rates. High-flow nasal oxygen (HFNO) therapy has gained popularity for treating ARF in recent years. However, there is a limited understanding of the factors that predict HFNO failure in ARF patients. This study aimed to explore early indicators of HFNO failure in ARF patients, utilizing machine learning (ML) algorithms to more accurately pinpoint individuals at elevated risk of HFNO failure. Utilizing ML algorithms, we developed seven predictive models. Their performance was evaluated using various metrics, including the area under the receiver operating characteristic curve, calibration curve, and precision recall curve. The study enrolled 700 patients, with 490 in the training group and 210 in the validation group. The overall HFNO failure rate was 14.1% among the 700 patients. The ML algorithms demonstrated robust performance in our study. This research underscores the potential of ML techniques in creating clinically relevant models for predicting HFNO outcomes in ARF patients. These models could play a pivotal role in enhancing the risk management of HFNO, leading to more patient-centered and personalized care approaches.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "High dimensional predictions of suicide risk in 4.2 million US Veterans using ensemble transfer learning",
        "link": "https://www.nature.com/articles/s41598-024-51762-9",
        "publication_date": "20 Jan 2024",
        "abstract": "We present an ensemble transfer learning method to predict suicide from Veterans Affairs (VA) electronic medical records (EMR). A diverse set of base models was trained to predict a binary outcome constructed from reported suicide, suicide attempt, and overdose diagnoses with varying choices of study design and prediction methodology. Each model used twenty cross-sectional and 190 longitudinal variables observed in eight time intervals covering 7.5 years prior to the time of prediction. Ensembles of seven base models were created and fine-tuned with ten variables expected to change with study design and outcome definition in order to predict suicide and combined outcome in a prospective cohort. The ensemble models achieved c-statistics of 0.73 on 2-year suicide risk and 0.83 on the combined outcome when predicting on a prospective cohort of \\(\\sim\\) 4.2 M veterans. The ensembles rely on nonlinear base models trained using a matched retrospective nested case-control (Rcc) study cohort and show good calibration across a diversity of subgroups, including risk strata, age, sex, race, and level of healthcare utilization. In addition, a linear Rcc base model provided a rich set of biological predictors, including indicators of suicide, substance use disorder, mental health diagnoses and treatments, hypoxia and vascular damage, and demographics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "“KAIZEN” method realizing implementation of deep-learning models for COVID-19 CT diagnosis in real world hospitals",
        "link": "https://www.nature.com/articles/s41598-024-52135-y",
        "publication_date": "19 Jan 2024",
        "abstract": "Numerous COVID-19 diagnostic imaging Artificial Intelligence (AI) studies exist. However, none of their models were of potential clinical use, primarily owing to methodological defects and the lack of implementation considerations for inference. In this study, all development processes of the deep-learning models are performed based on strict criteria of the “KAIZEN checklist”, which is proposed based on previous AI development guidelines to overcome the deficiencies mentioned above. We develop and evaluate two binary-classification deep-learning models to triage COVID-19: a slice model examining a Computed Tomography (CT) slice to find COVID-19 lesions; a series model examining a series of CT images to find an infected patient. We collected 2,400,200 CT slices from twelve emergency centers in Japan. Area Under Curve (AUC) and accuracy were calculated for classification performance. The inference time of the system that includes these two models were measured. For validation data, the slice and series models recognized COVID-19 with AUCs and accuracies of 0.989 and 0.982, 95.9% and 93.0% respectively. For test data, the models’ AUCs and accuracies were 0.958 and 0.953, 90.0% and 91.4% respectively. The average inference time per case was 2.83 s. Our deep-learning system realizes accuracy and inference speed high enough for practical use. The systems have already been implemented in four hospitals and eight are under progression. We released an application software and implementation code for free in a highly usable state to allow its use in Japan and globally.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cardiac output estimation using ballistocardiography: a feasibility study in healthy subjects",
        "link": "https://www.nature.com/articles/s41598-024-52300-3",
        "publication_date": "19 Jan 2024",
        "abstract": "There is no reliable automated non-invasive solution for monitoring circulation and guiding treatment in prehospital emergency medicine. Cardiac output (CO) monitoring might provide a solution, but CO monitors are not feasible/practical in the prehospital setting. Non-invasive ballistocardiography (BCG) measures heart contractility and tracks CO changes. This study analyzed the feasibility of estimating CO using morphological features extracted from BCG signals. In 20 healthy subjects ECG, carotid/abdominal BCG, and invasive arterial blood pressure based CO were recorded. BCG signals were adaptively processed to isolate the circulatory component from carotid (CCc) and abdominal (CCa) BCG. Then, 66 features were computed on a beat-to-beat basis to characterize amplitude/duration/area/length of the fluctuation in CCc and CCa. Subjects’ data were split into development set (75%) to select the best feature subset with which to build a machine learning model to estimate CO and validation set (25%) to evaluate model’s performance. The model showed a mean absolute error, percentage error and 95% limits of agreement of 0.83 L/min, 30.2% and − 2.18–1.89 L/min respectively in the validation set. BCG showed potential to reliably estimate/track CO. This method is a promising first step towards an automated, non-invasive and reliable CO estimator that may be tested in prehospital emergencies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Mobilise-D insights to estimate real-world walking speed in multiple conditions with a wearable device",
        "link": "https://www.nature.com/articles/s41598-024-51766-5",
        "publication_date": "19 Jan 2024",
        "abstract": "This study aimed to validate a wearable device’s walking speed estimation pipeline, considering complexity, speed, and walking bout duration. The goal was to provide recommendations on the use of wearable devices for real-world mobility analysis. Participants with Parkinson’s Disease, Multiple Sclerosis, Proximal Femoral Fracture, Chronic Obstructive Pulmonary Disease, Congestive Heart Failure, and healthy older adults (n = 97) were monitored in the laboratory and the real-world (2.5 h), using a lower back wearable device. Two walking speed estimation pipelines were validated across 4408/1298 (2.5 h/laboratory) detected walking bouts, compared to 4620/1365 bouts detected by a multi-sensor reference system. In the laboratory, the mean absolute error (MAE) and mean relative error (MRE) for walking speed estimation ranged from 0.06 to 0.12 m/s and − 2.1 to 14.4%, with ICCs (Intraclass correlation coefficients) between good (0.79) and excellent (0.91). Real-world MAE ranged from 0.09 to 0.13, MARE from 1.3 to 22.7%, with ICCs indicating moderate (0.57) to good (0.88) agreement. Lower errors were observed for cohorts without major gait impairments, less complex tasks, and longer walking bouts. The analytical pipelines demonstrated moderate to good accuracy in estimating walking speed. Accuracy depended on confounding factors, emphasizing the need for robust technical validation before clinical application.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "SpasticSim: a synthetic data generation method for upper limb spasticity modelling in neurorehabilitation",
        "link": "https://www.nature.com/articles/s41598-024-51993-w",
        "publication_date": "18 Jan 2024",
        "abstract": "In neurorehabilitation, assessment of functional problems is essential to define optimal rehabilitation treatments. Usually, this assessment process requires distinguishing between impaired and non-impaired behavior of limbs. One of the common muscle motor disorders affecting limbs is spasticity, which is complicated to quantify objectively due to the complex nature of motor control. Thus, the lack of heterogeneous samples of patients constituting an acceptable amount of data is an obstacle which is relevant to understanding the behavior of spasticity and, consequently, quantifying it. In this article, we use the 3D creation suite Blender combined with the MBLab add-on to generate synthetic samples of human body models, aiming to be as sufficiently representative as possible to real human samples. Exporting these samples to OpenSim and performing four specific upper limb movements, we analyze the muscle behavior by simulating the six degrees of spasticity contemplated by the Modified Ashworth Scale (MAS). The complete dataset of patients and movements is open-source and available for future research. This approach advocates the potential to generate synthetic data for testing and validating musculoskeletal models.",
        "conclusions": "The purpose of the current study was to determine the viability of synthetic data generation for clinical purposes. The results of this research support the idea that 3D anatomical recreation could be effective in the field of modelling musculoskeletal injuries. Prior to this study, it was difficult to make predictions about how possible were to export human body samples to manipulate in OpenSim, but the results lays the groundwork for future combination of VR and sensorimotor impairment modelling. Once again, collaboration between researchers and medical practitioners is critical in order to build appropriate systems that support the development of new and profitable methods in the clinical area.Further research needs to be done to establish how Spasticity simulation changes the model because one source of weakness in this study which could have affected the measurements was the quality of Spasticity plugin and the absence of real samples. A reasonable approach to tackle this issue could be to validate the model with selected real patients because more information on real cases would help us to establish a greater degree of accuracy on this matter. Therefore, the challenge now is to develop a robust and accurate plugin verified with real patients that allows modelling in OpenSim not only for Spasticity but it also for other motor disorders as Parkinson’s. The empirical findings in this study made available for all researches provide a basis for future studies.Also, a natural progression of this work will be analyse the possibility to generate the synthetic data with an efficient and faster method. The complete process of generation, transformation and computation requires a large amount of time and consumes a lot of computational resources, becoming one of the main areas for improvement. OpenSim provides the opportunity to create new models with python70 and we could accomplish specific models with predefined movements with no need of an additional software and a fully automate workflow.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": [
                "model control"
            ]
        }
    },
    {
        "title": "Full resolution reconstruction of whole-mount sections from digitized individual tissue fragments",
        "link": "https://www.nature.com/articles/s41598-024-52007-5",
        "publication_date": "17 Jan 2024",
        "abstract": "Whole-mount sectioning is a technique in histopathology where a full slice of tissue, such as a transversal cross-section of a prostate specimen, is prepared on a large microscope slide without further sectioning into smaller fragments. Although this technique can offer improved correlation with pre-operative imaging and is paramount for multimodal research, it is not commonly employed due to its technical difficulty, associated cost and cumbersome integration in (digital) pathology workflows. In this work, we present a computational tool named PythoStitcher which reconstructs artificial whole-mount sections from digitized tissue fragments, thereby bringing the benefits of whole-mount sections to pathology labs currently unable to employ this technique. Our proposed algorithm consists of a multi-step approach where it (i) automatically determines how fragments need to be reassembled, (ii) iteratively optimizes the stitch using a genetic algorithm and (iii) efficiently reconstructs the final artificial whole-mount section on full resolution (0.25 µm/pixel). PythoStitcher was validated on a total of 198 cases spanning five datasets with a varying number of tissue fragments originating from different organs from multiple centers. PythoStitcher successfully reconstructed the whole-mount section in 86–100% of cases for a given dataset with a residual registration mismatch of 0.65–2.76 mm on automatically selected landmarks. It is expected that our algorithm can aid pathology labs unable to employ whole-mount sectioning through faster clinical case evaluation and improved radiology-pathology correlation workflows.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An all-ultrasound cranial imaging method to establish the relationship between cranial FUS incidence angle and transcranial attenuation in non-human primates in 3D",
        "link": "https://www.nature.com/articles/s41598-024-51623-5",
        "publication_date": "17 Jan 2024",
        "abstract": "Focused ultrasound (FUS) is a non-invasive and non-ionizing technique which deploys ultrasound waves to induce bio-effects. When paired with acoustically active particles such as microbubbles (MBs), it can open the blood brain barrier (BBB) to facilitate drug delivery otherwise inhibited due to the presence of BBB. One of the parameters that affects the FUS beam propagation is the beam incidence angle on the skull. Prior work by our group has shown that, as incidence angles deviate from 90°, FUS focal pressures attenuate and result in a smaller BBB opening volume. The incidence angles calculated in our prior studies were in 2D and used skull information from CT. The study presented herein develops methods to calculate incidence angle in 3D in non-human primate (NHP) skull fragments using harmonic ultrasound imaging without using ionizing radiation. Our results show that ultrasound harmonic imaging is capable of accurately depicting features such as sutures and eye-sockets of the skull. Furthermore, we were able to reproduce previously reported relationships between the incidence angle and FUS beam attenuation. We also show feasibility of performing ultrasound harmonic imaging in in-vivo non-human primates. The all-ultrasound method presented herein combined with our neuronavigation system stands to increase more widespread adoption of FUS and render it accessible by eliminating the need for CT cranial mapping.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of sentinel lymph node metastasis in breast cancer patients based on preoperative features: a deep machine learning approach",
        "link": "https://www.nature.com/articles/s41598-024-51244-y",
        "publication_date": "16 Jan 2024",
        "abstract": "Sentinel lymph node (SLN) biopsy is the standard surgical approach to detect lymph node metastasis in breast cancer. Machine learning is a novel tool that provides better accuracy for predicting positive SLN involvement in breast cancer patients. This study obtained data from 2890 surgical cases of breast cancer patients from two referral hospitals in Iran from 2000 to 2021. Patients whose SLN involvement status was identified were included in our study. The dataset consisted of preoperative features, including patient features, gestational factors, laboratory data, and tumoral features. In this study, TabNet, an end-to-end deep learning model, was proposed to predict SLN involvement in breast cancer patients. We compared the accuracy of our model with results from logistic regression analysis. A total of 1832 patients with an average age of 51 ± 12 years were included in our study, of which 697 (25.5%) had SLN involvement. On average, the TabNet model achieved an accuracy of 75%, precision of 81%, specificity of 70%, sensitivity of 87%, and AUC of 0.74, while the logistic model demonstrated an accuracy of 70%, precision of 73%, specificity of 65%, sensitivity of 79%, F1 score of 73%, and AUC of 0.70 in predicting the SLN involvement in patients. Vascular invasion, tumor size, core needle biopsy pathology, age, and FH had the most contributions to the TabNet model. The TabNet model outperformed the logistic regression model in all metrics, indicating that it is more effective in predicting SLN involvement in breast cancer patients based on preoperative data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Dermatologist-like explainable AI enhances trust and confidence in diagnosing melanoma",
        "link": "https://www.nature.com/articles/s41467-023-43095-4",
        "publication_date": "15 Jan 2024",
        "abstract": "Artificial intelligence (AI) systems have been shown to help dermatologists diagnose melanoma more accurately, however they lack transparency, hindering user acceptance. Explainable AI (XAI) methods can help to increase transparency, yet often lack precise, domain-specific explanations. Moreover, the impact of XAI methods on dermatologists’ decisions has not yet been evaluated. Building upon previous research, we introduce an XAI system that provides precise and domain-specific explanations alongside its differential diagnoses of melanomas and nevi. Through a three-phase study, we assess its impact on dermatologists’ diagnostic accuracy, diagnostic confidence, and trust in the XAI-support. Our results show strong alignment between XAI and dermatologist explanations. We also show that dermatologists’ confidence in their diagnoses, and their trust in the support system significantly increase with XAI compared to conventional AI. This study highlights dermatologists’ willingness to adopt such XAI systems, promoting future use in the clinic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Assessing antibody and nanobody nativeness for hit selection and humanization with AbNatiV",
        "link": "https://www.nature.com/articles/s42256-023-00778-3",
        "publication_date": "15 Jan 2024",
        "abstract": "Monoclonal antibodies have emerged as key therapeutics. In particular, nanobodies, small, single-domain antibodies that are naturally expressed in camelids, are rapidly gaining momentum following the approval of the first nanobody drug in 2019. Nonetheless, the development of these biologics as therapeutics remains a challenge. Despite the availability of established in vitro directed-evolution technologies that are relatively fast and cheap to deploy, the gold standard for generating therapeutic antibodies remains discovery from animal immunization or patients. Immune-system-derived antibodies tend to have favourable properties in vivo, including long half-life, low reactivity with self-antigens and low toxicity. Here we present AbNatiV, a deep learning tool for assessing the nativeness of antibodies and nanobodies, that is, their likelihood of belonging to the distribution of immune-system-derived human antibodies or camelid nanobodies. AbNatiV is a multipurpose tool that accurately predicts the nativeness of Fv sequences from any source, including synthetic libraries and computational design. It provides an interpretable score that predicts the likelihood of immunogenicity, and a residue-level profile that can guide the engineering of antibodies and nanobodies indistinguishable from immune-system-derived ones. We further introduce an automated humanization pipeline, which we applied to two nanobodies. Laboratory experiments show that AbNatiV-humanized nanobodies retain binding and stability at par or better than their wild type, unlike nanobodies that are humanized using conventional structural and residue-frequency analysis. We make AbNatiV available as downloadable software and as a webserver.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Large scale plasma proteomics identifies novel proteins and protein networks associated with heart failure development",
        "link": "https://www.nature.com/articles/s41467-023-44680-3",
        "publication_date": "15 Jan 2024",
        "abstract": "Heart failure (HF) causes substantial morbidity and mortality but its pathobiology is incompletely understood. The proteome is a promising intermediate phenotype for discovery of novel mechanisms. We measured 4877 plasma proteins in 13,900 HF-free individuals across three analysis sets with diverse age, geography, and HF ascertainment to identify circulating proteins and protein networks associated with HF development. Parallel analyses in Atherosclerosis Risk in Communities study participants in mid-life and late-life and in Trøndelag Health Study participants identified 37 proteins consistently associated with incident HF independent of traditional risk factors. Mendelian randomization supported causal effects of 10 on HF, HF risk factors, or left ventricular size and function, including matricellular (e.g. SPON1, MFAP4), senescence-associated (FSTL3, IGFBP7), and inflammatory (SVEP1, CCL15, ITIH3) proteins. Protein co-regulation network analyses identified 5 modules associated with HF risk, two of which were influenced by genetic variants that implicated trans hotspots within the VTN and CFH genes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of clinically relevant patient endotypes in traumatic brain injury using latent class analysis",
        "link": "https://www.nature.com/articles/s41598-024-51474-0",
        "publication_date": "14 Jan 2024",
        "abstract": "Traumatic brain injury (TBI) is a complex condition where heterogeneity impedes the advancement of care. Understanding the diverse presentations of TBI is crucial for personalized medicine. Our study aimed to identify clinically relevant patient endotypes in TBI using latent class analysis based on comorbidity data. We used the Medical Information Mart for Intensive Care III database, which includes 2,629 adult TBI patients. We identified five stable endotypes characterized by specific comorbidity profiles: Heart Failure and Arrhythmia, Healthy, Renal Failure with Hypertension, Alcohol Abuse, and Hypertension. Each endotype had distinct clinical characteristics and outcomes: The Heart Failure and Arrhythmia endotype had lower survival rates than the Renal Failure with Hypertension despite featuring fewer comorbidities overall. Patients in the Hypertension endotype had higher rates of neurosurgical intervention but shorter stays in contrast to the Alcohol Abuse endotype which had lower rates of neurosurgical intervention but significantly longer hospital stays. Both endotypes had high overall survival rates comparable to the Healthy endotype. Logistic regression models showed that endotypes improved the predictability of survival compared to individual comorbidities alone. This study validates clinical endotypes as an approach to addressing heterogeneity in TBI and demonstrates the potential of this methodology in other complex conditions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]