[
    {
        "title": "A strategy for cost-effective large language model use at health system-scale",
        "link": "https://www.nature.com/articles/s41746-024-01315-1",
        "publication_date": "18 Nov 2024",
        "abstract": "Large language models (LLMs) can optimize clinical workflows; however, the economic and computational challenges of their utilization at the health system scale are underexplored. We evaluated how concatenating queries with multiple clinical notes and tasks simultaneously affects model performance under increasing computational loads. We assessed ten LLMs of different capacities and sizes utilizing real-world patient data. We conducted >300,000 experiments of various task sizes and configurations, measuring accuracy in question-answering and the ability to properly format outputs. Performance deteriorated as the number of questions and notes increased. High-capacity models, like Llama-3–70b, had low failure rates and high accuracies. GPT-4-turbo-128k was similarly resilient across task burdens, but performance deteriorated after 50 tasks at large prompt sizes. After addressing mitigable failures, these two models can concatenate up to 50 simultaneous tasks effectively, with validation on a public medical question-answering dataset. An economic analysis demonstrated up to a 17-fold cost reduction at 50 tasks using concatenation. These results identify the limits of LLMs for effective utilization and highlight avenues for cost-efficiency at the enterprise scale.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Locomotor performance parameters as predictors of high-performing male soccer teams. A multiple-season study on professional soccer",
        "link": "https://www.nature.com/articles/s41598-024-80181-z",
        "publication_date": "18 Nov 2024",
        "abstract": "This study aims to explore the interplay between locomotor demands and goal differentials to better understand their combined influence on overall success. Spanning three competitive seasons within the male Turkish Super League, this study analyzed all participating teams across 124 matches. Locomotor demands, including total distance (m) covered (TD), distances covered (m) at different speed thresholds (0.21–2.0 m/s; 2.01–4.0 m/s; 4.01–5.5 m/s; and 5.5–7.7 m/s), and the number of accelerations in range of 5.5–7.0 m/s (n), were quantified using an optical tracking system. Subsequently, regression models were employed to predict the total points earned by all teams over the three seasons. The logistic regression model, tailored to predict team categorization as high-points earners (HPE) or low-points earners (LPE) based on locomotor variables, exhibited a mean accuracy of 74%. Notably, total distance covered, running speed intervals between 4.4 and 5.5 m/s, and the number of accelerations in range of 5.5–7.0 m/s emerged as significant predictors of team success. Our findings highlight the pivotal role of running speed (4.01–5.5 m/s), number of accelerations, and total distance in predicting success for high-performing teams. Coaches can leverage these insights to refine training programs, thereby optimizing team performance, and fostering success in competitive environments.",
        "conclusions": "The main findings of the present study showed that running speed from 4.01 to 5.5 m/s, accelerations, and total distance were key predictors of high-point earner teams. The identification of such key predictors of successful teams offers coaches actionable metrics to enhance team performance. Coaches can leverage this evidence for effective training programming, focusing on these locomotor metrics to increase the team’s success.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Examining the relationships between patients’ multimorbidity trajectories and prognostic outcomes after the initial hip fracture",
        "link": "https://www.nature.com/articles/s41598-024-79642-2",
        "publication_date": "16 Nov 2024",
        "abstract": "Hip fractures significantly affect patients’ health and quality of life. Despite therapeutic treatments, many patients continue to experience poor prognoses that include recurrent fractures and mortality, especially the older ones. Therefore, understanding important factors associated with post-fracture prognoses is critical. This study focuses on patients’ multimorbidity trajectories and examines how the trajectory’s time span, number of coexisting chronic diseases, and sequential disease patterns relate to distinct prognostic outcomes. From the National Health Insurance Research Database in Taiwan, we obtain a sample of 128,822 patients who suffered an initial hip fracture between 1996 and 2011. We use this sample to analyze the relationships between multimorbidity trajectories and prognostic outcomes after an initial hip fracture. The results reveal that a patient’s multimorbidity trajectory’s time span and number of chronic diseases significantly associate with his or her post-fracture prognosis. In addition, essential sequential patterns of chronic diseases relate to post-fracture prognoses too. We then leverage the discovered relationships to develop a cross-attention neural network method for estimating patients’ post-fracture prognoses and demonstrate its predictive utilities relative to several prevalent machine leaning methods. This study underscores the importance of leveraging the time span, number of chronic diseases, and sequential disease patterns in patients’ multimorbidity trajectory profile to estimate their prognoses within three years of an initial hip fracture, which can support physicians’ clinical decisions and patient management.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep learning model for predicting blastocyst formation from cleavage-stage human embryos using time-lapse images",
        "link": "https://www.nature.com/articles/s41598-024-79175-8",
        "publication_date": "14 Nov 2024",
        "abstract": "Efficient prediction of blastocyst formation from early-stage human embryos is imperative for improving the success rates of assisted reproductive technology (ART). Clinics transfer embryos at the blastocyst stage on Day-5 but Day-3 embryo transfer offers the advantage of a shorter culture duration, which reduces exposure to laboratory conditions, potentially enhancing embryonic development within a more conducive uterine environment and improving the likelihood of successful pregnancies. In this paper, we present a novel ResNet-GRU deep-learning model to predict blastocyst formation at 72 HPI. The model considers the time-lapse images from the incubator from Day 0 to Day 3. The model predicts blastocyst formation with a validation accuracy of 93% from the cleavage stage. The sensitivity and specificity are 0.97 and 0.77 respectively. The deep learning model presented in this paper will assist the embryologist in identifying the best embryo to transfer at Day 3, leading to improved patient outcomes and pregnancy rates in ART.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "In vivo evaluation of complex polyps with endoscopic optical coherence tomography and deep learning during routine colonoscopy: a feasibility study",
        "link": "https://www.nature.com/articles/s41598-024-78891-5",
        "publication_date": "14 Nov 2024",
        "abstract": "Standard-of-care (SoC) imaging for assessing colorectal polyps during colonoscopy, based on white-light colonoscopy (WLC) and narrow-band imaging (NBI), does not have sufficient accuracy to assess the invasion depth of complex polyps non-invasively during colonoscopy. We aimed to evaluate the feasibility of a custom endoscopic optical coherence tomography (OCT) probe for assessing colorectal polyps during routine colonoscopy. Patients referred for endoscopic treatment of large colorectal polyps were enrolled in this pilot clinical study, which used a side-viewing OCT catheter developed for use with an adult colonoscope. OCT images of polyps were captured during colonoscopy immediately before SoC treatment. A deep learning model was trained to differentiate benign from deeply invasive lesions for real-time diagnosis. 35 polyps from 32 patients were included. OCT imaging added on average 3:40 min (range 1:54–8:20) to the total procedure time. No complications due to OCT were observed. OCT revealed distinct subsurface tissue structures that correlated with histological findings, including tubular adenoma (n = 20), tubulovillous adenoma (n = 10), sessile serrated polyps (n = 3), and invasive cancer (n = 2). The deep learning model achieved an area under the receiver operating characteristic curve (AUROC) of 0.984 (95%CI 0.972–0.996) and Cohen’s kappa of 0.845 (95%CI 0.774–0.915) when compared to gold standard histopathology. OCT is feasible and safe for polyp assessment during routine colonoscopy. When combined with deep learning, OCT offers clinicians increase confidence in identifying deeply invasive cancers, potentially improving clinical decision-making. Compared to previous studies, ours offers a nuanced comparison between not just benign and malignant lesions, but across multiple histological subtypes of polyps.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "AI tool for predicting MGMT methylation in glioblastoma for clinical decision support in resource limited settings",
        "link": "https://www.nature.com/articles/s41598-024-78189-6",
        "publication_date": "14 Nov 2024",
        "abstract": "Glioblastoma is an aggressive brain cancer with a poor prognosis. The O6-methylguanine-DNA methyltransferase (MGMT) gene methylation status is crucial for treatment stratification, yet economic constraints often limit access. This study aims to develop an artificial intelligence (AI) framework for predicting MGMT methylation. Diagnostic magnetic resonance (MR) images in public repositories were used for training. The algorithm created was validated in data from a single institution. All images were segmented according to widely used guidelines for radiotherapy planning and combined with clinical evaluations from neuroradiology experts. Radiomic features and clinical impressions were extracted, tabulated, and used for modeling. Feature selection methods were used to identify relevant phenotypes. A total of 100 patients were used for training and 46 for validation. A total of 343 features were extracted. Eight feature selection methods produced seven independent predictive frameworks. The top-performing ML model was a model post-Least Absolute Shrinkage and Selection Operator (LASSO) feature selection reaching accuracy (ACC) of 0.82, an area under the curve (AUC) of 0.81, a recall of 0.75, and a precision of 0.75. This study demonstrates that integrating clinical and radiotherapy-derived AI-driven phenotypes can predict MGMT methylation. The framework addresses constraints that limit molecular diagnosis access.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Using data from cue presentations results in grossly overestimating semantic BCI performance",
        "link": "https://www.nature.com/articles/s41598-024-79309-y",
        "publication_date": "14 Nov 2024",
        "abstract": "Neuroimaging studies have reported the possibility of semantic neural decoding to identify specific semantic concepts from neural activity. This offers promise for brain-computer interfaces (BCIs) for communication. However, translating these findings into a BCI paradigm has proven challenging. Existing EEG-based semantic decoding studies often rely on neural activity recorded when a cue is present, raising concerns about decoding reliability. To address this, we investigate the effects of cue presentation on EEG-based semantic decoding. In an experiment with a clear separation between cue presentation and mental task periods, we attempt to differentiate between semantic categories of animals and tools in four mental tasks. By using state-of-the-art decoding analyses, we demonstrate significant mean classification accuracies up to 71.3% during cue presentation but not during mental tasks, even with adapted analyses from previous studies. These findings highlight a potential issue when using neural activity recorded during cue presentation periods for semantic decoding. Additionally, our results show that semantic decoding without external cues may be more challenging than current state-of-the-art research suggests. By bringing attention to these issues, we aim to stimulate discussion and drive advancements in the field toward more effective semantic BCI applications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Association between serum calcium and in-hospital mortality in critically ill atrial fibrillation patients from the MIMIC IV database",
        "link": "https://www.nature.com/articles/s41598-024-79015-9",
        "publication_date": "14 Nov 2024",
        "abstract": "Thongprayoon et al. found in a study of 12,599 non-dialysis adult hospitalized patients that serum calcium (SC) disturbances affected more than half of the patients and were associated with increased in-hospital mortality. Similar impacts of SC disturbances on in-hospital mortality have been observed in patients with acute myocardial infarction and the general hospitalized population. Atrial fibrillation (AF), the most common arrhythmia in the intensive care unit (ICU), affects around 6% of critically ill patients. However, the significance of the relationship between SC levels and in-hospital mortality in these patients remains unclear. This study aimed to explore the correlation between SC levels and in-hospital mortality in ICU patients diagnosed with AF. Data from the MIMIC-IV database included 11,621 AF patients (average age 75.59 ± 11.74 years; 42.56% male), with an in-hospital mortality rate of 8.90%. A nonlinear relationship between SC levels and in-hospital mortality was observed. Effect sizes on either side of the inflection point were 0.79 (HR: 0.79, 95% CI 0.67–0.94, P = 0.006) and 1.12 (HR: 1.12, 95% CI 1.01–1.25, P = 0.029). Sensitivity analyses confirmed these results. SC levels around 8.56 mg/dL were associated with the lowest risk of in-hospital mortality, with risks increasing as SC levels deviated from this point. SC levels below this inflection point were linked to more pronounced clinical impacts. This finding has significant clinical implications for clinicians. Therefore, in the treatment of ICU patients with AF, clinicians should closely monitor SC levels, with a focus on maintaining them around 8.56 mg/dL.",
        "conclusions": "In conclusion, our study found that SC levels are an independent prognostic factor for in-hospital mortality among ICU patients with AF. There is a nonlinear association between SC levels and in-hospital mortality, with the lowest mortality risk observed around an SC level of 8.56 mg/dL. SC levels below this inflection point are associated with a more pronounced clinical impact. Therefore, in the treatment of ICU patients with AF, clinicians should closely monitor SC levels, with a focus on maintaining them around 8.56 mg/dL. However, further prospective cohort studies are needed to confirm the relationship between SC levels and AF mortality.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The PERMIT guidelines for designing and implementing all stages of personalised medicine research",
        "link": "https://www.nature.com/articles/s41598-024-79161-0",
        "publication_date": "13 Nov 2024",
        "abstract": "Personalised medicine (PM) research programmes represent the modern paradigm of complex cross-disciplinary research, integrating innovative methodologies and technologies. Methodological research is required to ensure that these programmes generate robust and reproducible evidence. The PERMIT project developed methodological recommendations for each stage of the PM research pipeline. A common methodology was applied to develop the recommendations in collaboration with relevant stakeholders. Each stage was addressed by a dedicated working group, specializing in the subject matter. A series of scoping reviews that mapped the methods used in PM research and a gap analysis were followed by working sessions and workshops where field experts analyzed the gaps and developed recommendations. Through collaborative writing and consensus building exercises, the final recommendations were defined. They provide guidance for the design, implementation and evaluation of PM research, from patient and omics data collection and sample size calculation to the selection of the most appropriate stratification approach, including machine learning modeling, the development and application of reliable preclinical models, and the selection and implementation of the most appropriate clinical trial design. The dissemination and implementation of these recommendations by all stakeholders can improve the quality of PM research, enhance the robustness of evidence, and improve patient care.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multisource representation learning for pediatric knowledge extraction from electronic health records",
        "link": "https://www.nature.com/articles/s41746-024-01320-4",
        "publication_date": "13 Nov 2024",
        "abstract": "Electronic Health Record (EHR) systems are particularly valuable in pediatrics due to high barriers in clinical studies, but pediatric EHR data often suffer from low content density. Existing EHR code embeddings tailored for the general patient population fail to address the unique needs of pediatric patients. To bridge this gap, we introduce a transfer learning approach, MUltisource Graph Synthesis (MUGS), aimed at accurate knowledge extraction and relation detection in pediatric contexts. MUGS integrates graphical data from both pediatric and general EHR systems, along with hierarchical medical ontologies, to create embeddings that adaptively capture both the homogeneity and heterogeneity between hospital systems. These embeddings enable refined EHR feature engineering and nuanced patient profiling, proving particularly effective in identifying pediatric patients similar to specific profiles, with a focus on pulmonary hypertension (PH). MUGS embeddings, resistant to negative transfer, outperform other benchmark methods in multiple applications, advancing evidence-based pediatric research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Brain tumor diagnosis in MRI scans images using Residual/Shuffle Network optimized by augmented Falcon Finch optimization",
        "link": "https://www.nature.com/articles/s41598-024-77523-2",
        "publication_date": "13 Nov 2024",
        "abstract": "Brain tumor diagnosis is an important task in prognosing and treatment planning of the patients with brain cancer. in the meantime, using the Magnetic Resonance Imaging (MRI) as a commonly used non-invasive imaging technique provide the experts a helpful view for detecting the brain tumors. While deep learning methods have shown significant success in analyzing medical images, they often require careful design of architecture and tuning of hyperparameters to achieve optimal results. This study presents a new approach for diagnosing brain tumors in MRI scans using deep learning, focusing on Residual/Shuffle Networks. The designed network structures offer efficient results when compared to traditional deep learning models. To enhance the proposed network for brain tumor classification, a modified metaheuristic algorithm named Augmented Falcon Finch Optimization (AFFO) is introduced. AFFO utilizes bio-inspired principles to effectively search for the best hyperparameter configurations, thereby enhancing the reliability and accuracy of the deep learning model. The performance of the proposed method is evaluated on a standard brain tumor MRI dataset and compared with existing techniques, including ResNet, AlexNet, VGG-16, Inception V3, and U-Net to illustrate the effectiveness of combining Residual/Shuffle Networks with AFFO for brain tumor diagnosis.",
        "conclusions": "An important task in effective care and treatment planning of patients with brain tumor from MRI scans is to accurate diagnosis of brain tumors. Deep learning has emerged as a valuable tool in the analysis of medical images, showing remarkable capabilities in tumor detection and classification. However, conventional deep learning models can be computationally intensive and require careful design of architecture and tuning of hyperparameters to achieve optimal results. This study resolved these issues by introducing a new method for diagnosing brain tumors in MRI scans. The proposed model uses Residual/Shuffle Network incorporate by a modified metaheuristic algorithm, Augmented Falcon Finch Optimization (AFFO), to efficiently provide this task. The proposed AFFO was used to optimized the hyperparameters effectively. The assessment on a standard brain tumor MRI dataset, and comparing with some state of the art models, including ResNet, AlexNet, VGG-16, Inception V3, and U-Net, illustrated the efficacy of the proposed method. The integration of Residual/Shuffle Networks and AFFO led to significant enhancements in classification accuracy compared to existing techniques. This underscores the potential of employing bio-inspired optimization algorithms for optimizing deep learning models in medical image analysis tasks. Future research will focus on testing the applicability of the proposed method on larger and more diverse brain tumor datasets. Furthermore, we plan to explore the use of this framework in other medical image analysis tasks, such as segmentation and monitoring disease progression. By refining the optimization process further and exploring advanced network architectures, we can contribute to the creation of robust and efficient deep learning models for enhanced medical diagnosis and patient care.",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Foundation models for fast, label-free detection of glioma infiltration",
        "link": "https://www.nature.com/articles/s41586-024-08169-3",
        "publication_date": "13 Nov 2024",
        "abstract": "A critical challenge in glioma treatment is detecting tumour infiltration during surgery to achieve safe maximal resection1,2,3. Unfortunately, safely resectable residual tumour is found in the majority of patients with glioma after surgery, causing early recurrence and decreased survival4,5,6. Here we present FastGlioma, a visual foundation model for fast (<10 s) and accurate detection of glioma infiltration in fresh, unprocessed surgical tissue. FastGlioma was pretrained using large-scale self-supervision (around 4 million images) on rapid, label-free optical microscopy, and fine-tuned to output a normalized score that indicates the degree of tumour infiltration within whole-slide optical images. In a prospective, multicentre, international testing cohort of patients with diffuse glioma (n = 220), FastGlioma was able to detect and quantify the degree of tumour infiltration with an average area under the receiver operating characteristic curve of 92.1 ± 0.9%. FastGlioma outperformed image-guided and fluorescence-guided adjuncts for detecting tumour infiltration during surgery by a wide margin in a head-to-head, prospective study (n = 129). The performance of FastGlioma remained high across diverse patient demographics, medical centres and diffuse glioma molecular subtypes as defined by the World Health Organization. FastGlioma shows zero-shot generalization to other adult and paediatric brain tumour diagnoses, demonstrating the potential for our foundation model to be used as a general-purpose adjunct for guiding brain tumour surgeries. These findings represent the transformative potential of medical foundation models to unlock the role of artificial intelligence in the care of patients with cancer.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Leveraging large language models to construct feedback from medical multiple-choice Questions",
        "link": "https://www.nature.com/articles/s41598-024-79245-x",
        "publication_date": "13 Nov 2024",
        "abstract": "Exams like the formative Progress Test Medizin can enhance their effectiveness by offering feedback beyond numerical scores. Content-based feedback, which encompasses relevant information from exam questions, can be valuable for students by offering them insight into their performance on the current exam, as well as serving as study aids and tools for revision. Our goal was to utilize Large Language Models (LLMs) in preparing content-based feedback for the Progress Test Medizin and evaluate their effectiveness in this task. We utilize two popular LLMs and conduct a comparative assessment by performing textual similarity on the generated outputs. Furthermore, we study via a survey how medical practitioners and medical educators assess the capabilities of LLMs and perceive the usage of LLMs for the task of generating content-based feedback for PTM exams. Our findings show that both examined LLMs performed similarly. Both have their own advantages and disadvantages. Our survey results indicate that one LLM produces slightly better outputs; however, this comes at a cost since it is a paid service, while the other is free to use. Overall, medical practitioners and educators who participated in the survey find the generated feedback relevant and useful, and they are open to using LLMs for such tasks in the future. We conclude that while the content-based feedback generated by the LLM may not be perfect, it nevertheless can be considered a valuable addition to the numerical feedback currently provided.",
        "conclusions": "Our findings demonstrate that LLMs can generate content-based feedback from PTM questions, marking the first automated generation of feedback for multiple-choice PTM questions. We conclude that both examined LLMs, i.e., ChatGPT 4.0 and Bing Chat, performed similarly, with neither showing significant deficits in generating feedback from PTM questions. On the contrary, both received an average score of above 4 in regard to the relevance of topics and usefulness of subtopics. However, each LLM has its own advantages and disadvantages: one produces slightly better feedback, as indicated by our survey results, while the other is free to use. Though LLMs are known to generate hallucinated content, we did not find any evidence of this phenomena in our study. Nevertheless, we consider content-based feedback generated by the two examined LLMs as a valuable addition to traditional right-or-wrong feedback, aiding educators in exam preparation and grading. When used correctly, their integration can positively influence and be used as an aid to guide the study path of not only medical students, but also students in general. A potential integration of such LLMs can be especially useful for educational institutions with a shortage of teachers or lecturers, and in cases, where lessons primarily take place online, without direct or limited contact to educators. In a future work of ours, we plan to integrate this type of feedback in a set of multiple runs of the PTM and evaluate its effectiveness on students’ performance and motivation.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Paired-eye comparison of endothelial cell density and vault height after implantable collamer lens implantation",
        "link": "https://www.nature.com/articles/s41598-024-79613-7",
        "publication_date": "12 Nov 2024",
        "abstract": "In clinical practice, the effect of a high vault on corneal endothelial cells after implantable collamer lens (ICL) implantation remains unclear. Many clinicians theoretically assume that a high postoperative vault leads to rapid endothelial damage, but no study has yet proven this hypothesis. We conducted a paired-eye study to compare changes in corneal endothelial cell density (ECD) between high and low postoperative vault groups. This retrospective study included 150 eyes of 75 patients with bilateral postoperative vault levels differing by more than 200 μm after ICL implantation. Patients were followed up for 7 years with ECD measurements, and changes in ECD were assessed between 6 months and 7 years post-surgery. Over the 7-year follow-up period, the percentage of ECD loss was 15.04% and 14.45% in the high- and low-vault groups, respectively. The bilateral paired-eye comparison revealed a significant reduction in ECD in the high-vault group at 3, 5, and 7 years postoperatively (P-value < 0.001). In this paired-eye comparison of long-term observations, a higher vault was associated with greater ECD loss. Our study confirms that a high vault level may be an important risk factor for ECD loss following ICL implantation.",
        "conclusions": "Despite the reported safety of ICL implantation, it is imperative to identify factors contributing to endothelial cell damage and enhance safety measures. Through this paired-eye comparison of long-term observations, we observed a correlation between higher vault and increased ECD loss. Our study underscores the significance of high vault levels as a potential risk factor for ECD loss following ICL implantation. Surgeons should therefore carefully consider ICL size selection, mindful that excessively high vault levels may exacerbate endothelial loss based on the findings of this study.",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Shareable artificial intelligence to extract cancer outcomes from electronic health records for precision oncology research",
        "link": "https://www.nature.com/articles/s41467-024-54071-x",
        "publication_date": "12 Nov 2024",
        "abstract": "Databases that link molecular data to clinical outcomes can inform precision cancer research into novel prognostic and predictive biomarkers. However, outside of clinical trials, cancer outcomes are typically recorded only in text form within electronic health records (EHRs). Artificial intelligence (AI) models have been trained to extract outcomes from individual EHRs. However, patient privacy restrictions have historically precluded dissemination of these models beyond the centers at which they were trained. In this study, the vulnerability of text classification models trained directly on protected health information to membership inference attacks is confirmed. A teacher-student distillation approach is applied to develop shareable models for annotating outcomes from imaging reports and medical oncologist notes. ‘Teacher’ models trained on EHR data from Dana-Farber Cancer Institute (DFCI) are used to label imaging reports and discharge summaries from the Medical Information Mart for Intensive Care (MIMIC)-IV dataset. ‘Student’ models are trained to use these MIMIC documents to predict the labels assigned by teacher models and sent to Memorial Sloan Kettering (MSK) for evaluation. The student models exhibit high discrimination across outcomes in both the DFCI and MSK test sets. Leveraging private labeling of public datasets to distill publishable clinical AI models from academic centers could facilitate deployment of machine learning to accelerate precision oncology research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "membership inference"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Seven-year performance of a clinical metagenomic next-generation sequencing test for diagnosis of central nervous system infections",
        "link": "https://www.nature.com/articles/s41591-024-03275-1",
        "publication_date": "12 Nov 2024",
        "abstract": "Metagenomic next-generation sequencing (mNGS) of cerebrospinal fluid (CSF) is an agnostic method for broad-based diagnosis of central nervous system (CNS) infections. Here we analyzed the 7-year performance of clinical CSF mNGS testing of 4,828 samples from June 2016 to April 2023 performed by the University of California, San Francisco (UCSF) clinical microbiology laboratory. Overall, mNGS testing detected 797 organisms from 697 (14.4%) of 4,828 samples, consisting of 363 (45.5%) DNA viruses, 211 (26.4%) RNA viruses, 132 (16.6%) bacteria, 68 (8.5%) fungi and 23 (2.9%) parasites. We also extracted clinical and laboratory metadata from a subset of the samples (n = 1,164) from 1,053 UCSF patients. Among the 220 infectious diagnoses in this subset, 48 (21.8%) were identified by mNGS alone. The sensitivity, specificity and accuracy of mNGS testing for CNS infections were 63.1%, 99.6% and 92.9%, respectively. mNGS testing exhibited higher sensitivity (63.1%) than indirect serologic testing (28.8%) and direct detection testing from both CSF (45.9%) and non-CSF (15.0%) samples (P < 0.001 for all three comparisons). When only considering diagnoses made by CSF direct detection testing, the sensitivity of mNGS testing increased to 86%. These results justify the routine use of diagnostic mNGS testing for hospitalized patients with suspected CNS infection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Integrated multiomics analysis identified comprehensive crosstalk between diverse programmed cell death patterns and novel molecular subtypes in Hepatocellular Carcinoma",
        "link": "https://www.nature.com/articles/s41598-024-78911-4",
        "publication_date": "11 Nov 2024",
        "abstract": "Hepatocellular carcinoma (HCC) is a highly aggressive malignancy with increasing global prevalence and is one of the leading causes of cancer-related mortality in the human population. Developing robust clinical prediction models and prognostic stratification strategies is crucial for developing individualized treatment plans. A range of novel forms of programmed cell death (PCD) plays a role in the pathological progression and advancement of HCC, and in-depth study of PCD is expected to further improve the prognosis of HCC patients. Sixteen patterns (apoptosis, autophagy, anoikis, lysosome-dependent cell death, immunogenic cell death, necroptosis, ferroptosis, netosis, pyroptosis, disulfidptosis, entotic cell death, cuproptosis, parthanatos, netotic cell death, alkaliptosis, and oxeiptosis) related to PCD were collected from the literatures and used for subsequent analysis. Supervised (Elastic net, Random Forest, XgBoost, and Boruta) and unsupervised (Nonnegative Matrix Factorization, NMF) clustering algorithms were applied to develop and validate a novel classifier for the individualized management of HCC patients at the transcriptomic, proteomic and single-cell levels. Multiple machine learning algorithms developed a programmed cell death index (PCDI) comprising five robust signatures (FTL, G6PD, SLC2A1, HTRA2, and DLAT) in four independent HCC cohorts, and a higher PCDI was predictive of higher pathological grades and worse prognoses. Furthermore, a higher PCDI was found to be correlated with the presence of a repressive tumor immune microenvironment (TME), as determined through an integrated examination of bulk and single-cell transcriptome data. In addition, patients with TP53 mutation had higher PCDI in comparison with TP53 WT patients. Three HCC subtypes were identified through unsupervised clustering (NMF), exhibiting distinct prognoses and significant biological processes, among the three subtypes, PCDcluster 3 was of particular interest as it contained a large proportion of patients with high risk and low metabolic activity. Construction and evaluation of the Nomogram model was drawn based on the multivariate logistic regression analysis, and highlighted the robustness of the Nomogram model in other independent HCC cohorts. Finally, to explore the prognostic value, we also validated the frequent upregulation of DLAT in a real-world cohort of human HCC specimens by qPCR, western blot, and immunohistochemical staining (IHC). Together, our work herein comprehensively emphasized PCD-related patterns and key regulators, such as DLAT, contributed to the evolution and prognosis of tumor foci in HCC patients, and strengthened our understanding of PCD characteristics and promoted more effective risk stratification strategies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Glioma subtype prediction based on radiomics of tumor and peritumoral edema under automatic segmentation",
        "link": "https://www.nature.com/articles/s41598-024-79344-9",
        "publication_date": "10 Nov 2024",
        "abstract": "Comprehensive and non-invasive preoperative molecular diagnosis is important for prognostic and therapy decision-making in adult-type diffuse gliomas. We employed a deep learning method for automatic segmentation of brain gliomas directly from conventional magnetic resonance imaging (MRI) scans of the tumor core and peritumoral edema regions based on available glioma MRI data provided in the BraTS2021. Three-dimensional volumes of interest were segmented from 424 cases of glioma imaging data retrospectively obtained from two medical centers using the segmentation method and radiomic features were extracted. We developed a subtype prediction model based on extracted radiomic features and analyzed significance and correlations between glioma morphological characteristics and pathological features using data from patients with adult-type diffuse glioma. The automated segmentation achieved mean Dice scores of 0.884 and 0.889 for the tumor core and whole tumor, respectively. The area under the receiver operating characteristic curve for the prediction of adult-type diffuse gliomas subtypes was 0.945. “Glioblastoma, IDH-wildtype”, “Astrocytoma, IDH-mutant”, and “Oligodendroglioma, IDH-mutant, 1p/19q-coded” showed AUCs of 0.96, 0.914, and 0.961, respectively, for subtype prediction. Glioma morphological characteristics, molecular and pathological levels, and clinical data showed significant differences and correlations. An automatic segmentation model for gliomas based on 3D U-Nets was developed, and the prediction model for gliomas built using the parameters obtained from the automatic segmentation model showed high overall performance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Influence of experimental conditions on some in-vitro biomechanical properties of the sow’s perineum",
        "link": "https://www.nature.com/articles/s41598-024-77675-1",
        "publication_date": "10 Nov 2024",
        "abstract": "The aim of this work was to develop an experimental protocol that takes into account the influence of experimental conditions on these perineal tissues, before determining their mechanical properties. Samples of each perineal tissue layer were obtained from the skin, the vagina, the external anal sphincter (EAS), the internal anal sphincter (IAS) and anal mucosa of freshly dead sows. They were tested in quasi-static uniaxial tension using the Mach-1 testing machine. Stress-strain curves of each perineal tissue layer before the first damage for each sow were obtained and modeled by hyperelastic laws described by three coefficients: C1, C2, and C3 (Yeoh model). The influence of sample preparation conditions such as tissue freezing, hygrometry and sample orientation were evaluated, and the conditions under which the tests were performed such as the displacement velocity during testing were also evaluated by analysing C1-coefficient. This study suggested that sample preparation conditions such as tissue freezing for 24 h, storage in cellophane paper for two hours and the strain rate did not statistically affect the C1-hyperelastic coefficient for each perineal layer (p > 0.05). Samples should not be stored in saline for 2 h (p < 0.05). Sample orientation did not influence C1-hyperelastic coefficient (p > 0.05). This experimental protocol could be used to study in vitro biomechanical properties of perineal tissues in order to better understand perineal tears during delivery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "QuadTPat: Quadruple Transition Pattern-based explainable feature engineering model for stress detection using EEG signals",
        "link": "https://www.nature.com/articles/s41598-024-78222-8",
        "publication_date": "09 Nov 2024",
        "abstract": "The most cost-effective data collection method is electroencephalography (EEG), which obtains meaningful information about the brain. Therefore, EEG signal processing is crucial for neuroscience and machine learning (ML). Therefore, a new EEG stress dataset has been collected, and an explainable feature engineering (XFE) model has been proposed using the Directed Lobish (DLob) symbolic language. The first phase of this research is the data collection phase, and an EEG stress dataset was gathered from 310 participants. This collected stress dataset contains two classes: (i) stress and (ii) control. An XFE model has been presented to detect stress automatically. The presented XFE model has four main phases, and these are (i) channel transformer and quadruple transition pattern (QuadTPat)-based feature generation, (ii) feature selection deploying cumulative weighted neighborhood component analysis (CWNCA), (iii) explainable results creation with DLob and (iv) classification with t algorithm-based k-nearest neighbors (tkNN) classifier. The proposed XFE model generates a DLob string, and the explainable results were obtained using this string. Moreover, the presented XFE model attained 92.95% and 73.63% classification accuracy, deploying 10-fold and leave-one subject-out (LOSO) cross-validations (CV). According to the classification performances, the recommended QuadTPat-based XFE is a good model for EEG signal classification. Also, the presented QuadTPat-based XFE model is a good model for explainable artificial intelligence (XAI) since TTPat-based XFE is cooperating with the DLob.",
        "conclusions": "This research presents a new explainable artificial intelligence (XAI) approach for stress detection using EEG signals through the development of the QuadTPat-based model. Using the DLob symbolic language, the model not only achieves high classification performance but also provides explainable results by offering insights into brain activity during stress. The model demonstrates its reliability in detecting stress by achieving robust classification accuracy of 92.94% using 10-fold cross-validation and 73.63% with leave-one-subject-out cross-validation.The innovations in this study include the introduction of the QuadTPat feature extraction technique, which captures complex transitions in EEG signals, and the CWNCA feature selector, which effectively identifies the most informative features for classification. The tkNN classifier, developed with these feature engineering techniques, ensures high accuracy in stress classification. The explainable results obtained through the DLob symbolic language provide a clear understanding of brain activity, particularly by highlighting the interactions in the frontal, temporal, parietal, and occipital lobes during stress. The frequent occurrence of FL and FR symbols suggests that the frontal lobe plays an important role in logical thinking, planning, and emotional regulation, while TL and TR symbols indicate the processing of language and auditory information, likely due to the earthquake-related stimuli used in the study. Additionally, the complex connectome diagram obtained shows that stress affects all brain activities.This research not only contributes to the field of automatic stress detection but also enhances the broader understanding of the brain’s response to stress, particularly the complex interactions between different brain regions. The findings have practical implications for real-time stress monitoring systems, personalized medicine, and stress-related interventions. Future research can explore the extension of the DLob symbolic language, its integration with high-density EEG systems, and the application of the model to a wider range of stress factors. Additionally, the results provide a basis for further development of CCT, with potential applications in understanding complex brain networks and their roles in the stress response.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and external validation of an interpretable machine learning model for the prediction of intubation in the intensive care unit",
        "link": "https://www.nature.com/articles/s41598-024-77798-5",
        "publication_date": "08 Nov 2024",
        "abstract": "Given the limited capacity to accurately determine the necessity for intubation in intensive care unit settings, this study aimed to develop and externally validate an interpretable machine learning model capable of predicting the need for intubation among ICU patients. Seven widely used machine learning (ML) algorithms were employed to construct the prediction models. Adult patients from the Medical Information Mart for Intensive Care IV database who stayed in the ICU for longer than 24 h were included in the development and internal validation. The model was subsequently externally validated using the eICU-CRD database. In addition, the SHapley Additive exPlanations method was employed to interpret the influence of individual parameters on the predictions made by the model. A total of 11,988 patients were included in the final cohort for this study. The CatBoost model demonstrated the best performance (AUC: 0.881). In the external validation set, the efficacy of our model was also confirmed (AUC: 0.750), which suggests robust generalization capabilities. The Glasgow Coma Scale (GCS), body mass index (BMI), arterial partial pressure of oxygen (PaO2), respiratory rate (RR) and length of stay (LOS) before ICU were the top 5 features of the CatBoost model with the greatest impact. We developed an externally validated CatBoost model that accurately predicts the need for intubation in ICU patients within 24 to 96 h of admission, facilitating clinical decision-making and has the potential to improve patient outcomes. The prediction model utilizes readily obtainable monitoring parameters and integrates the SHAP method to enhance interpretability, providing clinicians with clear insights into the factors influencing predictions.",
        "conclusions": "We developed a CatBoost prediction model that has undergone external validation and demonstrates superior performance in predicting the need for intubation in critically ill patients within 24 to 96 h of ICU admission. Notably, this model relies exclusively on easily obtainable parameters that are routinely captured during patient monitoring. Furthermore, by incorporating the SHAP method, our model enhances interpretability and offers clinicians valuable insights into the underlying factors influencing patient outcomes.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A molecular video-derived foundation model for scientific drug discovery",
        "link": "https://www.nature.com/articles/s41467-024-53742-z",
        "publication_date": "08 Nov 2024",
        "abstract": "Accurate molecular representation of compounds is a fundamental challenge for prediction of drug targets and molecular properties. In this study, we present a molecular video-based foundation model, named VideoMol, pretrained on 120 million frames of 2 million unlabeled drug-like and bioactive molecules. VideoMol renders each molecule as a video with 60-frame and designs three self-supervised learning strategies on molecular videos to capture molecular representation. We show high performance of VideoMol in predicting molecular targets and properties across 43 drug discovery benchmark datasets. VideoMol achieves high accuracy in identifying antiviral molecules against common diverse disease-specific drug targets (i.e., BACE1 and EP4). Drugs screened by VideoMol show better binding affinity than molecular docking, revealing the effectiveness in understanding the three-dimensional structure of molecules. We further illustrate interpretability of VideoMol using key chemical substructures.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Effect of electrode size and distance to tissue on unipolar and bipolar voltage electrograms and their implications for a near-field cutoff",
        "link": "https://www.nature.com/articles/s41598-024-78627-5",
        "publication_date": "08 Nov 2024",
        "abstract": "Characteristics of electrograms depend on the electrode design and distance to the electric source. Our aim was to assess the impact of electrode design and distance from the myocardial electric source on the unipolar and bipolar electrograms to deduce a far-field cut-off. We retrospectively analyzed left atrial electroanatomical maps of 25 patients acquired using an ablation catheter with a 4.5 mm tip-, mini- and 2 mm ring electrodes. The unipolar and bipolar electrograms were characterized based on peak-to-peak amplitude, signal duration, maximal slope, and relative power of the high frequency spectrum above 50 Hz (HF_rel). The unipolar electrograms of ring electrodes showed an increased amplitude (140%), slope (150%) and HF_rel (16% vs. 11%) compared to the tip- and mini-electrodes. The median amplitude, slope, and HF_rel for the ring electrodes followed a power-law decay with distance with a steep decline up to 4 mm. This near-field cut-off can be identified based on a HF_rel above 10% in unipolar electrograms. In conclusion, we observed a higher unipolar amplitude for small ring-electrodes compared to larger tip-electrodes. The rapid decay of the amplitude, slope, and HF_rel up to a distance of 4 mm is suggestive for near-field cut-off identified based on HF_rel above 50 Hz.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Posterior lenticule laser scan influence the ultra-early postoperative visual acuity and quality of SMILE",
        "link": "https://www.nature.com/articles/s41598-024-78080-4",
        "publication_date": "07 Nov 2024",
        "abstract": "This is a prospective case-control study investigated the factors influencing ultra-early visual acuity and quality after Small Incision Lenticule Extraction (SMILE) surgery, with a specific focus on the morphology and distribution of “black clefts” observed in posterior lenticule laser scanning images. A total of 174 patients who underwent SMILE surgery were included, and their preoperative ocular clinical parameters, visual quality indicators, and posterior lenticule laser scanning images were analyzed. The morphological features of black clefts were calculated using image processing techniques. Univariate and multivariate logistic analyses were conducted to identify factors impacting ultra-early visual acuity recovery, while correlation analysis was used to explore the association between black cleft morphology and postoperative visual quality. The results showed that although patients experienced significant visual acuity improvement one day after surgery, 26% had poor early recovery. Postoperative visual quality parameters were significantly lower, while the Object Scatter Index (OSI) was higher compared to preoperative values. Patients with poor visual recovery had a higher number of irregular black clefts in their laser scanning images. Logistic regression analysis revealed that intraoperative morphological parameters of black clefts were independent factors influencing early postoperative visual acuity recovery. Additionally, correlation analysis demonstrated a negative correlation between black cleft morphology and postoperative visual quality parameters, and a positive correlation with OSI. In conclusion, the morphology and distribution of black clefts during SMILE surgery significantly affect ultra-early postoperative visual acuity and quality, with increased variability in black cleft area leading to higher OSI, thereby impacting visual quality recovery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning model for age-related macular degeneration based on heavy metals: The National Health and Nutrition Examination Survey 2005 to 2008",
        "link": "https://www.nature.com/articles/s41598-024-78412-4",
        "publication_date": "06 Nov 2024",
        "abstract": "Age-related macular degeneration (AMD) is the leading cause of blindness in older people in developed countries. It has been suggested that heavy metal exposure may be associated with the development of AMD, but most studies have focused on the effects of a single metal with traditional methods. In this study, we analyzed the relationship between 13 urinary heavy metal concentrations and AMD using NHANES data between 2005 and 2008. We constructed and compared 11 machine learning models to identify the best model for predicting AMD risk. We further interpreted the models by Permutation Feature Importance (PFI), Partial Dependence Plot (PDP) analysis, and SHapley Additive exPlanations (SHAP) analysis. 216 AMD patients out of 2380 participants. The random forest (RF) model performed optimally in predicting the risk of AMD, with an AUC value of 0.970. PFI analyses revealed that age and urinary cadmium (Cd) were the main factors influencing the risk of AMD. SHAP analyses further confirmed the significance of Cd concentration in predicting the risk of AMD, and we revealed a significant interaction with significant interaction of race. Our study firstly explored the relationship between heavy metal exposure levels and AMD based on machine learning techniques, found that urinary Cd concentration had the greatest impact on AMD, and revealed the superior predictive performance of machine learning methods. Furthermore, our study provided a new perspective for early screening and intervention of AMD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of sentinel lymph node macrometastasis in breast cancer by deep learning based on clinicopathological characteristics",
        "link": "https://www.nature.com/articles/s41598-024-78040-y",
        "publication_date": "06 Nov 2024",
        "abstract": "The axillary lymph node status remains an important prognostic factor in breast cancer, and nodal staging using sentinel lymph node biopsy (SLNB) is routine. Randomized clinical trials provide evidence supporting de-escalation of axillary surgery and omission of SLNB in patients at low risk. However, identifying sentinel lymph node macrometastases (macro-SLNMs) is crucial for planning treatment tailored to the individual patient. This study is the first to explore the capacity of deep learning (DL) models to identify macro-SLNMs based on preoperative clinicopathological characteristics. We trained and validated five multivariable models using a population-based cohort of 18,185 patients. DL models outperform logistic regression, with Transformer showing the strongest results, under the constraint that the sensitivity is no less than 90%, reflecting the sensitivity of SLNB. This highlights the feasibility of noninvasive macro-SLNM prediction using DL. Feature importance analysis revealed that patients with similar characteristics exhibited different nodal status predictions, indicating the need for additional predictors for further improvement.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence-assisted magnetic resonance imaging technology in the differential diagnosis and prognosis prediction of endometrial cancer",
        "link": "https://www.nature.com/articles/s41598-024-78081-3",
        "publication_date": "06 Nov 2024",
        "abstract": "It aimed to analyze the value of deep learning algorithm combined with magnetic resonance imaging (MRI) in the risk diagnosis and prognosis of endometrial cancer (EC). Based on the deep learning convolutional neural network (CNN) architecture residual network with 101 layers (ResNet-101), spatial attention and channel attention modules were introduced to optimize the model. A retrospective collection of MRI image data from 210 EC patients was used for model segmentation and reconstruction, with 140 cases as the test set and 70 cases as the validation set. The performance was compared with traditional ResNet-101 model, ResNet-101 model based on spatial attention mechanism (SA-ResNet-101), and ResNet-101 model based on channel attention mechanism (CA-ResNet-101), using accuracy (AC), precision (PR), recall (RE), and F1 score as evaluation metrics. Among the 70 cases in the validation set, there were 45 cases of low-risk EC and 25 cases of high-risk EC. Using ROC curve analysis, it was found that the area under the curve (AUC) for the diagnosis of high-risk EC of the proposed model in this article (0.918) was visibly larger as against traditional ResNet-101 (0.613), SA-ResNet-101 (0.760), and CA-ResNet-101 models (0.758). The AC, PR, RE, and F1 values of the proposed model for the diagnosis of EC risk were visibly higher (P  < 0.05). In the validation set, postoperative recurrence occurred in 13 cases and did not occur in 57 cases. Using ROC curve analysis, it was found that the AUC for postoperative recurrence prediction of the patients by the proposed model (0.926) was visibly larger as against traditional ResNet-101 (0.620), SA-ResNet-101 (0.729), and CA-ResNet-101 models (0.767). The AC, PR, RE, and F1 values of the proposed model for postoperative recurrence prediction were visibly higher (P  < 0.05). The proposed model in this article, assisted by MRI, presented superior performance in diagnosing high-risk EC patients, with higher sensitivity (Sen) and specificity (Spe), and also demonstrated excellent predictive AC in postoperative recurrence prediction.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Enhanced convolutional neural network architecture optimized by improved chameleon swarm algorithm for melanoma detection using dermatological images",
        "link": "https://www.nature.com/articles/s41598-024-77585-2",
        "publication_date": "06 Nov 2024",
        "abstract": "Early detection and treatment of skin cancer are important for patient recovery and survival. Dermoscopy images can help clinicians for timely identification of cancer, but manual diagnosis is time-consuming, costly, and prone to human error. To conduct this, an innovative deep learning-based approach has been proposed for automatic melanoma detection. The proposed method involves preprocessing dermoscopy images to remove artifacts, enhance contrast, and cancel noise, followed by feeding them into an optimized Convolutional Neural Network (CNN). The CNN is trained using an innovative metaheuristic called the Improved Chameleon Swarm Algorithm (CSA) to optimize its performance. The approach has been validated using the SIIM-ISIC Melanoma dataset and the results have been confirmed through rigorous evaluation metrics. Simulation results demonstrate the efficacy of the proposed method in accurately diagnosing melanoma from dermoscopy images by highlighting its potential as a valuable tool for clinicians in early cancer detection.",
        "conclusions": "Melanoma is one of the most universal diseases of skin cancer. Quick detection of melanoma can greatly decrease the risk of death from this fatal skin cancer. It is extremely beneficial and valuable to provide a strategy that aids in the early detection of melanoma. Within the current research, an algorithm was selected that aided in the diagnosis of melanoma by extracting and classifying relevant information from dermoscopic images. The accurate demarcation between the lesion and the field was accomplished before extracting the required features. At present, the size of the cancer in dermoscopy is determined manually by the physicians, which is wasteful when the size of the data is large. Cancer segmentation or uneven areas of dermoscopy image may be valuable within clinical cure and cancer study. It requires a very long time for radiologists to correctly identify tumors, although it is ideal. An automatic approach was suggested and tested for ascertaining abnormal region of the skin in a dermoscopy image. The current system used a deep learning-based optimization pipeline approach to diagnose cancers in dermoscopy images. Following preprocessing of the input raw images by hair removal for eliminating the artifacts, noise deletion, and contrast enhancement, the images were fed into an optimal CNN for the ultimate recognition. To obtain the best efficiency, a new upgraded metaheuristic, called Improved chameleon swarm algorithm, was designed and used. The designed diagnosis system was then verified by applying it to the SIIM-ISIC Melanoma dataset, and the outcomes were contrasted with some other published procedures, including Blob Detection (BD), Combined Convolutional Neural Networks (CCNN), miRNAs, hybrid Neural Network–World Cup Optimizer (NN/WCO), and Support Vector Machine and a new optimization algorithm (OSVM). Final outcomes displayed the prominence of the suggested technique in optimal melanoma diagnosis from the dermoscopic images against the other advanced methods.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automated real-world data integration improves cancer outcome prediction",
        "link": "https://www.nature.com/articles/s41586-024-08167-5",
        "publication_date": "06 Nov 2024",
        "abstract": "Error fetching abstract: 'NoneType' object has no attribute 'lower'",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sources of variation in the serum metabolome of female participants of the HUNT2 study",
        "link": "https://www.nature.com/articles/s42003-024-07137-x",
        "publication_date": "06 Nov 2024",
        "abstract": "The aim of this study was to explore the intricate relationship between serum metabolomics and lifestyle factors, shedding light on their impact on health in the context of breast cancer risk. Detailed metabolic profiles of 2283 female participants in the Trøndelag Health Study (HUNT study) were obtained through nuclear magnetic resonance (NMR) spectroscopy and mass spectrometry (MS).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Completely non-invasive prediction of IDH mutation status based on preoperative native CT images",
        "link": "https://www.nature.com/articles/s41598-024-77789-6",
        "publication_date": "05 Nov 2024",
        "abstract": "The isocitrate dehydrogenase (IDH) mutation status is one of the most important markers according to the 2021 WHO classification of CNS tumors. Preoperatively, this information is usually obtained based on invasive biopsies, contrast-enhanced MR images or PET images generated using radioactive tracers. However, the completely non-invasive determination of IDH mutation status using routinely acquired preoperative native CT images has hardly been investigated to date. In our study, we show that radiomics-based machine learning allows to determine IDH mutation status based on preoperative native CT images both with very high accuracy and completely non-invasively. Based on independent test data, we are able to correctly identify 91.1% of cases with an IDH mutation. Our final model, containing only six features, exhibits a high area under the curve of 0.847 and an excellent area under the precision-recall curve of 0.945. In the future, such models may be used for a completely non-invasive prediction of important genetic markers, potentially allowing treating physicians to reduce the number of biopsies and speed up further treatment planning.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multi-modal representation learning in retinal imaging using self-supervised learning for enhanced clinical predictions",
        "link": "https://www.nature.com/articles/s41598-024-78515-y",
        "publication_date": "05 Nov 2024",
        "abstract": "Self-supervised learning has become the cornerstone of building generalizable and transferable artificial intelligence systems in medical imaging. In particular, contrastive representation learning techniques trained on large multi-modal datasets have demonstrated impressive capabilities of producing highly transferable representations for different downstream tasks. In ophthalmology, large multi-modal datasets are abundantly available and conveniently accessible as modern retinal imaging scanners acquire both 2D fundus images and 3D optical coherence tomography (OCT) scans to assess the eye. In this context, we introduce a novel multi-modal contrastive learning-based pipeline to facilitate learning joint representations for the two retinal imaging modalities. After self-supervised pre-training on 153,306 scan pairs, we show that such a pre-training framework can provide both a retrieval system and encoders that produce comprehensive OCT and fundus image representations that generalize well for various downstream tasks on three independent external datasets, explicitly focusing on clinically pertinent prediction tasks. In addition, we show that interchanging OCT with lower-cost fundus imaging can preserve the predictive power of the trained models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A digital pathology model for predicting radioiodine-avid metastases on initial post-therapeutic 131I scan in patients with papillary thyroid cancer",
        "link": "https://www.nature.com/articles/s41598-024-78459-3",
        "publication_date": "05 Nov 2024",
        "abstract": "Accurate postoperative assessment is critical for optimizing 131I therapy in patients with papillary thyroid cancer (PTC). This study aimed to develop a pathology model utilizing postoperative digital pathology slides to predict lymph node and/or distant metastases on post-therapeutic 131I scan after initial 131I treatment in PTC patients. A retrospective analysis was conducted on 229 PTC patients who underwent total or near-total thyroidectomy and subsequent 131I treatment after levothyroxine (LT4) withdrawal between January 2022 and August 2023. The pathology model was developed through two stages: patch-level prediction and WSI-level prediction. The clinical model was constructed using statistically significant variables identified from univariate and multivariate logistic regression analysis. Of the 229 patients, 19.6% (45/229) exhibited 131I-avid metastatic foci in post-therapeutic 131I scan. Multifactorial analysis identified stimulated thyroglobulin (sTg) as the sole independent risk factor. The AUC of the pathology model in the training and test cohorts were 0.976 (95% CI 0.948–1.000) and 0.805 (95% CI 0.660–0.951), respectively, which were significantly higher than the clinical model (AUC 0.652 and 0.548, Pall < 0.05). This model has the potential to serve as a valuable tool for clinicians in tailoring treatment strategies, thereby optimizing therapeutic outcomes for PTC patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Convolutional neural network-based classification of craniosynostosis and suture lines from multi-view cranial X-rays",
        "link": "https://www.nature.com/articles/s41598-024-77550-z",
        "publication_date": "05 Nov 2024",
        "abstract": "Early and precise diagnosis of craniosynostosis (CSO), which involves premature fusion of cranial sutures in infants, is crucial for effective treatment. Although computed topography offers detailed imaging, its high radiation poses risks, especially to children. Therefore, we propose a deep-learning model for CSO and suture-line classification using 2D cranial X-rays that minimises radiation-exposure risks and offers reliable diagnoses. We used data comprising 1,047 normal and 277 CSO cases from 2006 to 2023. Our approach integrates X-ray-marker removal, head-pose standardisation, skull-cropping, and fine-tuning modules for CSO and suture-line classification using convolution neural networks (CNNs). It enhances the diagnostic accuracy and efficiency of identifying CSO from X-ray images, offering a promising alternative to traditional methods. Four CNN backbones exhibited robust performance, with F1-scores exceeding 0.96 and sensitivity and specificity exceeding 0.9, proving the potential for clinical applications. Additionally, preprocessing strategies further enhanced the accuracy, demonstrating the highest F1-scores, precision, and specificity. A qualitative analysis using gradient-weighted class activation mapping illustrated the focal points of the models. Furthermore, the suture-line classification model distinguishes five suture lines with an accuracy of > 0.9. Thus, the proposed approach can significantly reduce the time and labour required for CSO diagnosis, streamlining its management in clinical settings.",
        "conclusions": "This study introduced a deep-learning model designed for CSO and suture-line classification using 2D cranial X-ray imaging. Although the experiments involving Towne-view images showed suboptimal results, we believe that the poor performance was due to the limited number of samples. By incorporating various views, including sagittal, anteroposterior, and Towne, the proposed model is expected to achieve more robust performance. This highlights the potential of artificial intelligence-assisted methodologies for enhancing the diagnostic accuracy and efficiency for CSO. Owing to the demonstrated efficacy of our CNN model for processing 2D skull X-ray images for CSO classification, it is reasonable to anticipate that it can potentially enhance access to CSO treatments. Deployment of this model as a screening tool in clinical settings is expected to increase early treatment rates by enabling faster and more accurate diagnoses. Moreover, this approach offers the potential to incidentally detect CSO during X-ray assessments of unrelated cranial anomalies, thereby broadening the scope of classification and ensuring that early interventions can be performed for a higher number of affected infants. Such advancements in diagnostic technology signify a pivotal step in the comprehensive management of CSO, promising not only to improve patient outcomes, but also to facilitate more efficient allocation of healthcare resources. Our analysis of the CNN backbones suggests that skull X-ray-based diagnostic models can be potentially extended to various diseases.Despite these advancements, it is imperative to acknowledge that the gold standard for CSO diagnosis is CT modelling because of its unparalleled precision for detailing cranial structures. Therefore, in a future work, we will explore the feasibility of 2D to 3D CT reconstruction using skull X-ray data to bridge the gap between the practical applications of X-ray imaging and the diagnostic superiority of CT models45,46. In conclusion, this study underscores the impact of integrating artificial intelligence with medical imaging, while further evidence is required to confirm that this is sufficient for clinical diagnosis. These results highlight the possibility but should not be taken as definitive proof, and additional methods may need to be explored to enhance early diagnosis. Our findings not only reinforce the potential of artificial intelligence in medical diagnostics but also open avenues for further exploration of 3D imaging and reconstruction techniques, promising considerable advancements in the screening procedures of cranial disorders.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Muscle structure assessment using synchrotron radiation X-ray micro-computed tomography in murine with cerebral ischemia",
        "link": "https://www.nature.com/articles/s41598-024-78324-3",
        "publication_date": "05 Nov 2024",
        "abstract": "Muscles are crucial for balance and walking, activities which depend specifically on the lower extremity muscles. Therefore, the evaluation of stroke induced atrophy and paralysis is essential; however, determining the extent of damage in the days after its occurrence remains challenging. In this study, we evaluated ischemic stroke-induced soleus muscle damage in gerbils using synchrotron radiation X-ray micro-computed tomography (SR-µCT), comparing a control group (n = 3), animals 7 days after stroke (7 d, n = 3), and animals 14 days after stroke (14 d, n = 3). The left muscle was paralyzed, whereas the right muscle was not. Subsequently, we quantified the assessment by segmenting the soleus muscle based on the extracellular space/matrix and fiber region to determine the degree of damage. The muscle fiber-to-extracellular space/matrix ratio were significantly damaged due to paralysis on the left side (control vs. 14 d, P = 0.040). Muscle area was significantly different at 14 d between the left and right sides (P = 0.010). Additionally, the left local fascicle surface area, thickness, global pennation angle, and local fascicle angle were significantly different between the control and 14 d groups (P = 0.002, P = 0.007, P = 0.005, and P = 0.014 respectively). These findings underscore the potential of post-stroke animal studies in improving rehabilitation treatment for the central nervous system by assessing the degree of muscle recovery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence applied to coronary artery calcium scans (AI-CAC) significantly improves cardiovascular events prediction",
        "link": "https://www.nature.com/articles/s41746-024-01308-0",
        "publication_date": "05 Nov 2024",
        "abstract": "Coronary artery calcium (CAC) scans contain valuable information beyond the Agatston Score which is currently reported for predicting coronary heart disease (CHD) only. We examined whether new artificial intelligence (AI) applied to CAC scans can predict non-CHD events, including heart failure, atrial fibrillation, and stroke. We applied AI-enabled automated cardiac chambers volumetry and calcified plaque characterization to CAC scans (AI-CAC) of 5830 asymptomatic individuals (52.2% women, age 61.7 ± 10.2 years) in the multi-ethnic study of atherosclerosis during 15 years of follow-up, 1773 CVD events accrued. The AUC at 1-, 5-, 10-, and 15-year follow-up for AI-CAC vs. Agatston score was (0.784 vs. 0.701), (0.771 vs. 0.709), (0.789 vs. 0.712) and (0.816 vs. 0.729) (p < 0.0001 for all), respectively. AI-CAC plaque characteristics, including number, location, density, plus number of vessels, significantly improved CHD prediction in the CAC 1–100 cohort vs. Agatston Score. AI-CAC significantly improved the Agatston score for predicting all CVD events.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Triangulation for causal loop diagrams: constructing biopsychosocial models using group model building, literature review, and causal discovery",
        "link": "https://www.nature.com/articles/s44260-024-00017-9",
        "publication_date": "05 Nov 2024",
        "abstract": "The complex nature of many health problems necessitates the use of systems thinking tools like causal loop diagrams (CLDs) to visualize the underlying causal network and facilitate computational simulations of potential interventions. However, the construction of CLDs is limited by the constraints and biases of specific sources of evidence. To address this, we propose a triangulation approach that integrates expert and theory-driven group model building, literature review, and data-driven causal discovery. We demonstrate the utility of this triangulation approach using a case example focused on the trajectory of depressive symptoms in response to a stressor in healthy adults. After triangulation with causal discovery, the CLD exhibited (1) greater comprehensiveness, encompassing multiple research fields; (2) a modified feedback structure; and (3) increased transparency regarding the uncertainty of evidence in the model structure. These findings suggest that triangulation can produce higher-quality CLDs, potentially advancing our understanding of complex diseases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploration of common pathogenesis and candidate hub genes between HIV and monkeypox co-infection using bioinformatics and machine learning",
        "link": "https://www.nature.com/articles/s41598-024-78540-x",
        "publication_date": "04 Nov 2024",
        "abstract": "This study explored the pathogenesis of human immunodeficiency virus (HIV) and monkeypox co-infection, identifying candidate hub genes and potential drugs using bioinformatics and machine learning. Datasets for HIV (GSE 37250) and monkeypox (GSE 24125) were obtained from the GEO database. Common differentially expressed genes (DEGs) in co-infection were identified by intersecting DEGs from monkeypox datasets with genes from key HIV modules screened using Weighted Gene Co-Expression Network Analysis (WGCNA). After gene ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) enrichment analysis and construction of protein-protein interaction (PPI) network, candidate hub genes were further screened based on machine learning algorithms. Transcriptional factors (TFs) and miRNA-candidate hub gene networks were constructed to understand regulatory mechanisms and protein-drug interactions to identify potential therapeutic drugs. Seven candidate hub genes—MX2, ADAR, POLR2H, RPL5, IFI16, IFIT2, and RPS5—were identified. TFs and miRNAs associated with these hub genes, playing a key role in regulating viral infection and inflammation due to the activation of antiviral innate immunity, were also identified through network analysis. Potential therapeutic drugs were screened based on these hub genes: AZT, a nucleotide reverse transcriptase inhibitor, suppressed viral replication in HIV and monkeypox co-infection, while mefloquine inhibited inflammation due to the activation of antiviral innate immunity. In conclusion, the study identified candidate hub genes, their transcriptional regulation, signaling pathways, and small-molecule drugs in HIV and monkeypox co-infection, contributing to understanding the pathogenesis of HIV and monkeypox co-infection and informing precise therapeutic strategies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Leveraging convolutional neural networks and hashing techniques for the secure classification of monkeypox disease",
        "link": "https://www.nature.com/articles/s41598-024-75030-y",
        "publication_date": "04 Nov 2024",
        "abstract": "The World Health Organization declared a state of emergency in 2022 because of monkeypox. This disease has raised international concern as it has spread beyond Africa, where it is endemic. The global community has shown attention and solidarity in combating this disease as its daily increase becomes evident. Various skin symptoms appear in people infected with this disease, which can spread easily, especially in a polluted environment. It is difficult to diagnose monkeypox in its early stages because of its similarity with the symptoms of other diseases such as chicken pox and measles. Recently, computer-aided classification methods such as deep learning and machine learning within artificial intelligence have been employed to detect various diseases, including COVID-19, tumor cells, and Monkeypox, in a short period and with high accuracy. In this study, we propose the CanDark model, an end-to-end deep-learning model that incorporates cancelable biometrics for diagnosing Monkeypox. CanDark stands for cancelable DarkNet-53, which means that DarkNet-53 CNN is utilized for extracting deep features from Monkeypox skin images. Then a cancelable method is applied to these features to protect patient information. Various cancelable techniques have been evaluated, such as bio-hashing, multilayer perceptron (MLP) hashing, index-of-maximum Gaussian random projection-based hashing (IoM-GRP), and index-of-maximum uniformly random permutation-based hashing (IoM-URP). The proposed approach’s performance is evaluated using various assessment issues such as accuracy, specificity, precision, recall, and fscore. Using the IoM-URP, the CanDark model is superior to other state-of-the-art Monkeypox diagnostic techniques. The proposed framework achieved an accuracy of 98.81%, a specificity of 98.73%, a precision of 98.9%, a recall of 97.02%, and fscore of 97.95%.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Accuracy of recent intraocular lens power calculation methods in post-myopic LASIK eyes",
        "link": "https://www.nature.com/articles/s41598-024-78266-w",
        "publication_date": "04 Nov 2024",
        "abstract": "This retrospective study compared postoperative prediction errors of recent formulas using standard- or total keratometry (K or TK) for intraocular lens (IOL) power calculation in post-myopic LASIK patients. It included 56 eyes of 56 patients who underwent uncomplicated cataract surgery, with at least 1-month follow-up at Keio University Hospital in Tokyo or Hayashi Eye Hospital in Yokohama, Japan. Prediction errors, absolute errors, and percentage of eyes with prediction errors within ± 0.25 D, ± 0.50 D, and ± 1.00 D were calculated using nine formulas: Barrett True-K, Barrett True-K TK, Haigis-L, Haigis TK, Pearl-DGS, Hoffer QST, Hoffer QST PK, EVO K, and EVO PK. Statistical comparisons utilized Friedman test, Conover’s all-pairs post-hoc, Cochran’s Q, and McNemar post-hoc testing. Root-Mean-Square Error (RMSE) was compared with heteroscedastic testing. Barrett True-K TK had the lowest median predicted refractive error (-0.01). EVO PK had the smallest median absolute error (0.20). EVO PK had the highest percentage of eyes within ± 0.25 D of the predicted value (58.9%), significantly better than Haigis-L (p = 0.047). EVO PK had the lowest mean RMSE value (0.499). The EVO PK formula yielded the most accurate IOL power calculation in post-myopic LASIK eyes, with TK/PK values enhancing accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Point-of-care lung ultrasound for continuous positive airway pressure discontinuation in preterm infants",
        "link": "https://www.nature.com/articles/s41372-024-02157-1",
        "publication_date": "04 Nov 2024",
        "abstract": "To determine if the lung ultrasound score (LUS) is predictive of successful continuous positive airway pressure (CPAP) discontinuation in preterm neonates born <32 weeks’ gestation with history of respiratory distress syndrome.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The R.O.A.D. to precision medicine",
        "link": "https://www.nature.com/articles/s41746-024-01291-6",
        "publication_date": "03 Nov 2024",
        "abstract": "We propose a novel framework that addresses the deficiencies of Randomized clinical trial data subgroup analysis while it transforms ObservAtional Data to be used as if they were randomized, thus paving the road for precision medicine. Our approach counters the effects of unobserved confounding in observational data through a two-step process that adjusts predicted outcomes under treatment. These adjusted predictions train decision trees, optimizing treatment assignments for patient subgroups based on their characteristics, enabling intuitive treatment recommendations. Implementing this framework on gastrointestinal stromal tumors (GIST) data, including genetic sub-cohorts, showed that our tree recommendations outperformed current guidelines in an external cohort. Furthermore, we extended the application of this framework to RCT data from patients with extremity sarcomas. Despite initial trial indications of universal treatment necessity, our framework identified a subset of patients who may not require treatment. Once again, we successfully validated our recommendations in an external cohort.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep learning approach for ovarian cancer detection and classification based on fuzzy deep learning",
        "link": "https://www.nature.com/articles/s41598-024-75830-2",
        "publication_date": "02 Nov 2024",
        "abstract": "Error fetching abstract: 'NoneType' object has no attribute 'lower'",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "An enhanced machine learning algorithm for type 2 diabetes prognosis with a detailed examination of Key correlates",
        "link": "https://www.nature.com/articles/s41598-024-75898-w",
        "publication_date": "01 Nov 2024",
        "abstract": "This study aimed to construct a high-performance prediction and diagnosis model for type 2 diabetic retinopathy (DR) and identify key correlates of DR. This study utilized a cross-sectional dataset of 3,000 patients from the People’s Liberation Army General Hospital in 2021. Logistic regression was used as the baseline model to compare the prediction performance of the machine learning model and the related factors. The recursive feature elimination cross-validation (RFECV) algorithm was used to select features. Four machine learning models, support vector machine (SVM), decision tree (DT), random forest (RF), and gradient boost decision tree (GBDT), were developed to predict DR. The models were optimized using grid search to determine hyperparameters, and the model with superior performance was selected. Shapley-additive explanations (SHAP) were used to analyze the important correlation factors of DR. Among the four machine learning models, the optimal model was GBDT, with predicted accuracy, precision, recall, F1-measure, and AUC values of 0.7883, 0.8299, 0.7539, 0.7901, and 0.8672, respectively. Six key correlates of DR were identified, including rapid micronutrient protein/creatinine measurement, 24-h micronutrient protein, fasting C-peptide, glycosylated hemoglobin, blood urea, and creatinine. The logistic model had 27 risk factors, with an AUC value of 0.8341. A superior prediction model was constructed that identified easily explainable key factors. The number of correlation factors was significantly lower compared to traditional statistical methods, leading to a more accurate prediction performance than the latter.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "FlexSleepTransformer: a transformer-based sleep staging model with flexible input channel configurations",
        "link": "https://www.nature.com/articles/s41598-024-76197-0",
        "publication_date": "01 Nov 2024",
        "abstract": "Clinical sleep diagnosis traditionally relies on polysomnography (PSG) and expert manual classification of sleep stages. Recent advancements in deep learning have shown promise in automating sleep stage classification using a single PSG channel. However, variations in PSG acquisition devices and environments mean that the number of PSG channels can differ across sleep centers. To integrate a sleep staging method into clinical practice effectively, it must accommodate a flexible number of PSG channels. In this paper, we proposed FlexSleepTransformer, a transformer-based model designed to handle varying number of input channels, making it adaptable to diverse sleep staging datasets. We evaluated FlexSleepTransformer using two distinct datasets: the public SleepEDF-78 dataset and the local SleepUHS dataset. Notably, FlexSleepTransformer is the first model capable of simultaneously training on datasets with differing number of PSG channels. Our experiments showed that FlexSleepTransformer trained on both datasets together achieved 98% of the accuracy compared to models trained on each dataset individually. Furthermore, it outperformed models trained exclusively on one dataset when tested on the other dataset. Additionally, FlexSleepTransformer surpassed state-of-the-art CNN and RNN-based models on both datasets. Due to its adaptability with varying channels numbers, FlexSleepTransformer holds significant potential for clinical adoption, especially when trained with data from a wide range of sleep centers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Boosting the accuracy of existing models by updating and extending: using a multicenter COVID-19 ICU cohort as a proxy",
        "link": "https://www.nature.com/articles/s41598-024-70333-6",
        "publication_date": "01 Nov 2024",
        "abstract": "Most published prediction models for Coronavirus Disease 2019 (COVID-19) were poorly reported, at high risk of bias, and heterogeneous in model performance. To tackle methodological challenges faced in previous prediction studies, we investigated whether model updating and extending improves mortality prediction, using the Intensive Care Unit (ICU) as a proxy. All COVID-19 patients admitted to seven ICUs in the Euregio-Meuse Rhine during the first pandemic wave were included. The 4C Mortality and SEIMC scores were selected as promising prognostic models from an external validation study. Five predictors could be estimated based on cohort size. TRIPOD guidelines were followed and logistic regression analyses with the linear predictor, APACHE II score, and country were performed. Bootstrapping with backward selection was applied to select variables for the final model. Additionally, shrinkage was performed. Model discrimination was displayed as optimism-corrected areas under the ROC curve and calibration by calibration slopes and plots. The mortality rate of the 551 included patients was 36%. Discrimination of the 4C Mortality and SEIMC scores increased from 0.70 to 0.74 and 0.70 to 0.73 and calibration plots improved compared to the original models after updating and extending. Mortality prediction can be improved after updating and extending of promising models.",
        "conclusions": "This study demonstrated a stepwise approach to prediction model updating and extending and showed that updating and extending of two promising prognostic COVID-19 prediction models lead to improved mortality prediction in the ICU. Instead of developing new models on separate datasets done during the pandemic, this study makes a case towards clinical implementation of prediction models that requires various steps, from literature reviewing of developed models, extensive data collection, and external validation, to updating and extending the most promising models.",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluating neonatal pain via fusing vision transformer and concept-cognitive computing",
        "link": "https://www.nature.com/articles/s41598-024-77521-4",
        "publication_date": "31 Oct 2024",
        "abstract": "In clinical nursing, neonatal pain assessment is a challenging task for preventing and controlling the impact of pain on neonatal development. To reduce the adverse effects of repetitive painful treatments during hospitalization on newborns, we propose a novel method (namely pain concept-cognitive computing model, PainC3M) for evaluating facial pain in newborns. In the fusion system, we first improve the attention mechanism of vision transformer by revising the node encoding way, considering the spatial structure, edge and centrality of nodes, and then use its corresponding encoder as a feature extractor to comprehensively extract image features. Second, we introduce a concept-cognitive computing model as a classifier to evaluate the level of pain. Finally, we evaluate our PainC3M on various open pain data sets and a real clinical pain data stream, and the experimental results demonstrate that our PainC3M is very effective for dynamic classification and superior to other comparative models. It also provides a good approach for pain assessment of individuals with aphasia (or dementia).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Decoding marker genes and immune landscape of unstable carotid plaques from cellular senescence",
        "link": "https://www.nature.com/articles/s41598-024-78251-3",
        "publication_date": "31 Oct 2024",
        "abstract": "Recently, cellular senescence-induced unstable carotid plaques have gained increasing attention. In this study, we utilized bioinformatics and machine learning methods to investigate the correlation between cellular senescence and the pathological mechanisms of unstable carotid plaques. Our aim was to elucidate the causes of unstable carotid plaque progression and identify new therapeutic strategies. First, differential expression analysis was performed on the test set GSE43292 to identify differentially expressed genes (DEGs) between the unstable plaque group and the control group. These DEGs were intersected with cellular senescence-associated genes to obtain 40 cellular senescence-associated DEGs. Subsequently, key genes were then identified through weighted gene co-expression network analysis, random forest, Recursive Feature Elimination for Support Vector Machines algorithm and cytoHubba plugin. The intersection yielded 3 CSA-signature genes, which were validated in the external validation set GSE163154. Additionally, we assessed the relationship between these CSA-signature genes and the immune landscape of the unstable plaque group. This study suggests that cellular senescence may play an important role in the progression mechanism of unstable plaques and is closely related to the influence of the immune microenvironment. Our research lays the foundation for studying the progression mechanism of unstable carotid plaques and provides some reference for targeted therapy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Oscillometric blood pressure measurements on smartphones using vibrometric force estimation",
        "link": "https://www.nature.com/articles/s41598-024-75025-9",
        "publication_date": "31 Oct 2024",
        "abstract": "This paper proposes a smartphone-based method for measuring Blood Pressure (BP) using the oscillometric method. For oscillometry, it is necessary to measure (1) the pressure applied to the artery and (2) the local blood volume change. This is accomplished by performing an oscillometric measurement at the finger’s digital artery, whereby a user presses down on the phone’s camera with steadily increasing force. The camera is used to capture the blood volume change using photoplethysmography. We devised a novel method for measuring the force applied of the finger without the use of specialized smartphone hardware with a technique called Vibrometric Force Estimation (VFE). The fundamental concept of VFE relies on a phenomenon where a vibrating object is dampened when an external force is applied on to it. This phenomenon can be recreated using the phone’s own vibration motor and measured using the phone’s Inertial Measurement Unit (IMU). A cross device reliability study with three smartphones of different manufacturers, shape, and prices results in similar force estimation performance across all smartphone models. In an N = 24 proof of concept study of the BP measurement, the smartphone technique achieves a mean absolute error of 9.21 mmHg and 7.77 mmHg of systolic and diastolic BP, respectively, compared to an FDA approved BP cuff. The vision for this technology is not necessarily to replace existing BP monitoring solutions, but rather to introduce a downloadable smartphone software application that could serve as a low-barrier hypertension screening measurement fit for widespread adoption.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Assessment of sleep patterns in dementia and general population cohorts using passive in-home monitoring technologies",
        "link": "https://www.nature.com/articles/s43856-024-00646-0",
        "publication_date": "31 Oct 2024",
        "abstract": "Nocturnal disturbances are a common symptom experienced by People Living with Dementia (PLWD), and these often present prior to diagnosis. Whilst sleep anomalies have been frequently reported, most studies have been conducted in lab environments, which are expensive, invasive and not natural sleeping environments. In this study, we investigate the use of in-home nocturnal monitoring technologies, which enable passive data collection, at low cost, in real-world environments, and without requiring a change in routine.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]