[
    {
        "title": "Enhanced IoMT security framework using group teaching optimized auto-encoder for intrusion detection",
        "link": "https://www.nature.com/articles/s41598-024-80581-1",
        "publication_date": "05 Dec 2024",
        "abstract": "Providing security to Internet of Medical Things (IoMT) is significant worldwide problem for future generations its implementation to be successful. The traditional security methodologies developed for IoMT struggles with the specific issues of high false positives and lower detection rate. Therefore, the proposed work aims to develop a ground-breaking intrusion detection model, named as, Group Teaching Optimized Probabilistic Deep Auto-Encoder (GTPDA) for increasing the security of IoMT networks. Here, the data transformation and normalization processes are applied to balance the dataset’s properties. Then, an Intriguing Group Teaching Optimization (IGTO) algorithm is applied to choose the most correlated and essential traits from the normalized dataset for effective intrusion detection. Consequently, a Conditional Probabilistic Deep Auto-Encoder (CPDAE) model is used to more accurately classify the type of intrusion with system complexity. This study uses the BoT-IoT, Kaggle invasion dataset, and ToN-IoT open benchmarking datasets for evaluation and performance assessments. Among all, the proposed GTPDA with its various performance metrics presented, achieves an impressive 98.8% precision, 99% recall, 98.8% F1-score, and 99% accuracy, showing its significant performance in ensuring IoMT network security.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "backdoor"
            ],
            "Attacker Identity": [
                "patient",
                "cybercriminals"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Slovak database of speech affected by neurodegenerative diseases",
        "link": "https://www.nature.com/articles/s41597-024-04171-6",
        "publication_date": "04 Dec 2024",
        "abstract": "A new Slovak speech database EWA-DB was created for research purposes aimed at early detection of neurodegenerative diseases from speech. It contains 1649 speakers performing various speech and language tasks, such as sustained vowel phonation, diadochokinesis, naming and picture description. The sample of speakers consists of individuals with Alzheimer’s disease, mild cognitive impairment, Parkinson’s disease, and healthy controls. In this article we describe the EWA-DB development process, the language and speech task selection, patient and healthy control recruitment, as well as the testing and recording protocol. The structure and content of the database and file formats are described in detail. We assume that the presented database could be suitable for the development of automatic systems predicting the diagnoses of Alzheimer’s disease, mild cognitive impairment, and Parkinson’s disease from language and speech features.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Developing a nearly automated open-source pipeline for conducting computational fluid dynamics simulations in anterior brain vasculature: a feasibility study",
        "link": "https://www.nature.com/articles/s41598-024-80891-4",
        "publication_date": "04 Dec 2024",
        "abstract": "Intracranial aneurysms (IA) pose significant health risks and are often challenging to manage. Computational fluid dynamics (CFD) simulation has emerged as a powerful tool for understanding lesion-specific hemodynamics in and around IAs, aiding in the clinical management of patients with an IA. However, the current workflow of CFD simulations is time-consuming, complex, and labor-intensive and, thus, does not fit the clinical environment. To address these challenges, we have developed a semi-automated pipeline integrating multiple open-source software packages to streamline the CFD simulation process. Specifically, the study utilized medical angiography data from 18 patients. An in-house open-source DL image segmentation model (ARU-Net) was employed to generate 3D computer models of the anterior circulation. The segmented intracranial vasculature models, including IAs, were further refined using the Vascular Modeling Toolkit (VMTK), an open-source Python package. This step involved smoothing the surface of the models and extending the inlet and outlet regions to ensure a realistic representation of the vascular geometry. The refined vascular models were then converted into computational meshes using an open-source mesh generator known as TetGen. This process was nearly automated and required minimal user interaction(s). Blood flow simulations of the cerebral vascular models were performed using established SimVascular solvers (an open-source finite element platform for vascular applications) through an application programming interface (API). The CFD simulation process was also conducted using the manual workflow for comparative purposes. The initial assessment compared the geometries derived from manual and DL-based segmentation. The DL-based segmentation demonstrated reliable performance, closely aligning with manually segmented results, evidenced by excellent Pearson correlation coefficient (PCC) values and low relative difference (RD) values ranging from 3% to 10% between the computed geometrical variables derived from both methods. The statistical analysis of the computed hemodynamic variables, including velocity informatics and WSS-related variables, indicated good to excellent reliability for most parameters (e.g., ICC of 0.85–0.95). Given the data investigated, the proposed automated workflow streamlines the process of conducting CFD simulations. It generates results consistent with the current standard manual CFD protocol while minimizing dependence on user input.",
        "conclusions": "Overall, the proposed nearly automated platform OpenHemoSim can streamline the execution of CFD simulations for IAs, i.e., eliminating a lot of time-consuming and labor-intensive tasks in the pre- and post-processing steps during hemodynamic analysis of IAs. Our work is a step forward in the right direction for translating computational hemodynamics into the clinical setting. Our preliminary results demonstrate a high degree of concordance between most hemodynamic variables computed using the proposed OpenHemoSim platform (see Fig. 2) and those obtained through manual workflows (see Fig. 1). Overall, we found good agreement exists, suggesting that OpenHemoSim offers acceptable accuracy. Discrepancies in certain hemodynamic metrics exist; we attribute these differences to the variable’s sensitivity to surface quality or the different numerical approaches employed by the software to solve differential equations.It is also important to note that our findings must be further validated using a large cohort of IA data. Also, our ongoing work is expanding to using results from the proposed workflow to demonstrate its clinical utility (e.g., predicting the rupture risk of an unruptured IA or outcomes of IA’s treatment outcomes).",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Optimized dual-tree complex wavelet transform aided multimodal image fusion with adaptive weighted average fusion strategy",
        "link": "https://www.nature.com/articles/s41598-024-81594-6",
        "publication_date": "04 Dec 2024",
        "abstract": "Image fusion is generally utilized for retrieving significant data from a set of input images to provide useful informative data. Image fusion enhances the applicability and quality of data. Hence, the analysis of multimodal image fusion is a new to the research topic, which is designed by combining the images of multimodal into single image in order to preserveexact details. On the other hand, the existing approaches face challenges in the precise interpretation of source images, and also it have only captured local information without considering the wide range of information. To consider these weaknesses, a multimodal image fusion model is planned to develop according to the multi-resolution transform along with the optimization strategy. At first, the images are effectively analyzed from standard public datasets and further, the images given into the Optimized Dual-Tree Complex Wavelet Transform (ODTCWT) to acquire low frequency and high frequency coefficients. Here, certain parameters in DTCWT get tuned with the hybridized heuristic strategy with the Probability of Fitness-based Honey Badger Squirrel Search Optimization (PF-HBSSO) to enhance the decomposition quality. Then, the fusion of high-frequency coefficients is performed using adaptive weighted average fusion technique, whereas the weights are optimized using PF-HBSSOto achieve the optimal fused results. Similarly, the low-frequency coefficients are combined by average fusion. Finally, the fused images undergo image reconstruction using the inverse ODTCWT. The experimental evaluation of the designed multimodal image fusion illustratessuperioritythat distinguishes this work from others.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A novel deep learning algorithm for real-time prediction of clinical deterioration in the emergency department for a multimodal clinical decision support system",
        "link": "https://www.nature.com/articles/s41598-024-80268-7",
        "publication_date": "03 Dec 2024",
        "abstract": "The array of complex and evolving patient data has limited clinical decision making in the emergency department (ED). This study introduces an advanced deep learning algorithm designed to enhance real-time prediction accuracy for integration into a novel Clinical Decision Support System (CDSS). A retrospective study was conducted using data from a level 1 tertiary hospital. The algorithm’s predictive performance was evaluated based on in-hospital cardiac arrest, inotropic circulatory support, advanced airway, and intensive care unit admission. We developed an artificial intelligence (AI) algorithm for CDSS that integrates multiple data modalities, including vitals, laboratory, and imaging results from electronic health records. The AI model was trained and tested on a dataset of 237,059 ED visits. The algorithm’s predictions, based solely on triage information, significantly outperformed traditional logistic regression models, with notable improvements in the area under the precision-recall curve (AUPRC). Additionally, predictive accuracy improved with the inclusion of continuous data input at shorter intervals. This study suggests the feasibility of using AI algorithms in diverse clinical scenarios, particularly for earlier detection of clinical deterioration. Future work should focus on expanding the dataset and enhancing real-time data integration across multiple centers to further optimize its application within the novel CDSS.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Perceived age estimation from facial image and demographic data in young and middle-aged South Korean adults",
        "link": "https://www.nature.com/articles/s41598-024-78695-7",
        "publication_date": "03 Dec 2024",
        "abstract": "Biological age is an indicator of whether an individual is experiencing rapid, slowing, or normal aging. Perceived age is highly correlated with biological age, which reflects health appraisal and is often used as a clinical marker of aging. Perceived age has been reported as an important indicator of biological age and general health status, not only in older adult populations but also in young and middle-aged adults. However, there is a lack of objective methods for quantifying perceived age in these younger age groups. Thus, this study aimed to propose a novel perceived age estimation algorithm to meet the need for an objective method to predict perceived age. This cross-sectional study included 609 healthy men and 1388 healthy women (29.02–57.91 years, average 44.4 years) from 2017 to 2019 using data from the Korean Medicine Daejeon Citizen Cohort Study. The proposed algorithm comprised two steps. First, the initial predicted perceived age was estimated from facial images using a convolutional neural network (CNN) ensemble model. Then, the final perceived age was estimated using regression from the chronological age, sex, BMI, and initial predicted perceived age obtained in the first step. Better performance results were obtained by model averaging and model stacking generated from various basic regression models. The averaging models of Lasso, XGBoost, and CatBoost showed a mean absolute error of 2.2944, indicating that this algorithm can be used as a screening method for general health status in the population.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A universal immunohistochemistry analyzer for generalizing AI-driven assessment of immunohistochemistry across immunostains and cancer types",
        "link": "https://www.nature.com/articles/s41698-024-00770-z",
        "publication_date": "03 Dec 2024",
        "abstract": "Immunohistochemistry (IHC) is the common companion diagnostics in targeted therapies. However, quantifying protein expressions in IHC images present a significant challenge, due to variability in manual scoring and inherent subjective interpretation. Deep learning (DL) offers a promising approach to address these issues, though current models require extensive training for each cancer and IHC type, limiting the practical application. We developed a Universal IHC (UIHC) analyzer, a DL-based tool that quantifies protein expression across different cancers and IHC types. This multi-cohort trained model outperformed conventional single-cohort models in analyzing unseen IHC images (Kappa score 0.578 vs. up to 0.509) and demonstrated consistent performance across varying positive staining cutoff values. In a discovery application, the UIHC model assigned higher tumor proportion scores to MET amplification cases, but not MET exon 14 splicing or other non-small cell lung cancer cases. This UIHC model represents a novel role for DL that further advances quantitative analysis of IHC.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "PPB-Affinity: Protein-Protein Binding Affinity dataset for AI-based protein drug discovery",
        "link": "https://www.nature.com/articles/s41597-024-03997-4",
        "publication_date": "03 Dec 2024",
        "abstract": "Prediction of protein-protein binding (PPB) affinity plays an important role in large-molecular drug discovery. Deep learning (DL) has been adopted to predict the changes of PPB binding affinities upon mutations, but there was a scarcity of studies predicting the PPB affinity itself. The major reason is the paucity of open-source dataset with PPB affinity data. To address this gap, the current study introduced a large comprehensive PPB affinity (PPB-Affinity) dataset. The PPB-Affinity dataset contains key information such as crystal structures of protein-protein complexes (with or without protein mutation patterns), PPB affinity, receptor protein chain, ligand protein chain, etc. To the best of our knowledge, this is the largest publicly available PPB affinity dataset, and we believe it will significantly advance drug discovery by streamlining the screening of potential large-molecule drugs. We also developed a deep-learning benchmark model with this dataset to predict the PPB affinity, providing a foundational comparison for the research community.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "The role of nitric oxide, insulin resistance, and vitamin D in cognitive function of older adults",
        "link": "https://www.nature.com/articles/s41598-024-81551-3",
        "publication_date": "03 Dec 2024",
        "abstract": "Aging is accompanied by possible cognitive impairment, as well as a reduction in nitric oxide (NO) bioavailability, insulin resistance, and vitamin D deficiency. Among these Nitric oxide exhibits a dual role in brain biology, where both low and high levels can have detrimental effects on memory and neurotoxicity. In this study we aimed to investigate the role of nitric oxide, insulin resistance, and vitamin D in cognitive function of elderly individuals. This case-control study involved participants aged ≥ 60 years who were under observation in the Birjand Longitudinal Aging Study. A total of 40 participants were selected as controls, while 64 participants with cognitive impairment were identified as cases. The cases were further subdivided according to their Mini-Mental State Examination (MMSE) scores into two groups: mild and moderate cognitive impairment. Cognitive function in both cases and controls was assessed using the MMSE. The levels of total NOx, vitamin D, insulin, and blood glucose were measured using ELISA and spectrophotometric immunoassays. Insulin resistance indices, such as homeostasis model assessment of insulin resistance (HOMA-IR) and quantitative insulin sensitivity check index (QUICKI) were calculated. Serum NOx levels were significantly lower in participants with cognitive impairment compared to the control group (p < 0.01). However, the mean (SD) levels of serum vitamin D, insulin, and glucose, as well as the insulin resistance markers, showed no significant differences between the groups. A positive correlation was observed between serum NOx levels and MMSE scores. NO may be an essential factor for normal brain function, as serum NOx levels were significantly higher in controls compared to those with cognitive impairment, and there was a positive correlation with MMSE scores. Other metabolic and nutritional markers, including vitamin D and insulin resistance, did not demonstrate a significant effect.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Integrating graph and reinforcement learning for vaccination strategies in complex networks",
        "link": "https://www.nature.com/articles/s41598-024-78626-6",
        "publication_date": "02 Dec 2024",
        "abstract": "Pandemics like COVID-19 have a huge impact on human society and the global economy. Vaccines are effective in the fight against these pandemics but often in limited supplies, particularly in the early stages. Thus, it is imperative to distribute such crucial public goods efficiently. Identifying and vaccinating key spreaders (i.e., influential nodes) is an effective approach to break down the virus transmission network, thereby inhibiting the spread of the virus. Previous methods for identifying influential nodes in networks lack consistency in terms of effectiveness and precision. Their applicability also depends on the unique characteristics of each network. Furthermore, most of them rank nodes by their individual influence in the network without considering mutual effects among them. However, in many practical settings like vaccine distribution, the challenge is how to select a group of influential nodes. This task is more complex due to the interactions and collective influence of these nodes together. This paper introduces a new framework integrating Graph Neural Network (GNN) and Deep Reinforcement Learning (DRL) for vaccination distribution. This approach combines network structural learning with strategic decision-making. It aims to efficiently disrupt the network structure and stop disease spread through targeting and removing influential nodes. This method is particularly effective in complex environments, where traditional strategies might not be efficient or scalable. Its effectiveness is tested across various network types including both synthetic and real-world datasets, demonstrting a potential for real-world applications in fields like epidemiology and cybersecurity. This interdisciplinary approach shows the capabilities of deep learning in understanding and manipulating complex network systems.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Proteomic analysis of plasma and duodenal tissue in celiac disease patients reveals potential noninvasive diagnostic biomarkers",
        "link": "https://www.nature.com/articles/s41598-024-80391-5",
        "publication_date": "02 Dec 2024",
        "abstract": "The pathogenesis of celiac disease (CeD) remains incompletely understood. Traditional diagnostic techniques for CeD include serological testing and endoscopic examination; however, they have limitations. Therefore, there is a need to identify novel noninvasive biomarkers for CeD diagnosis. We analyzed duodenal and plasma samples from CeD patients by four-dimensional data-dependent acquisition (4D-DIA) proteomics. Differentially expressed proteins (DEPs) were identified for functional analysis and to propose blood biomarkers associated with CeD diagnosis. In duodenal and plasma samples, respectively, 897 and 140 DEPs were identified. Combining weighted gene co-expression network analysis(WGCNA) with the DEPs, five key proteins were identified across three machine learning methods. FGL2 and TXNDC5 were significantly elevated in the CeD group, while CHGA expression showed an increasing trend, but without statistical significance. The receiver operating characteristic curve results indicated an area under the curve (AUC) of 0.7711 for FGL2 and 0.6978 for TXNDC5, with a combined AUC of 0.8944. Exploratory analysis using Mfuzz and three machine learning methods identified four plasma proteins potentially associated with CeD pathological grading (Marsh classification): FABP, CPOX, BHMT, and PPP2CB. We conclude that FGL2 and TXNDC5 deserve exploration as potential sensitive, noninvasive diagnostic biomarkers for CeD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Validation and optimization of smart eye camera as teleophthalmology device for the reduction of preventable and treatable blindness in Nigeria",
        "link": "https://www.nature.com/articles/s41433-024-03489-0",
        "publication_date": "02 Dec 2024",
        "abstract": "Limited resources and staffing hinders efforts to reduce preventable blindness, especially in low- to middle-income countries. The slit-lamp examination (SLE), which is essential for ophthalmology practices, is often unavailable in primary and secondary eye care facilities due to the high costs and lengthy training required for operation. We conducted a cross-sectional, multicentre study exploring the potential for a smart eye camera (SEC; a tele-ophthalmology handheld device developed by OUI Inc., Japan) to address the limitations of the SLE.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Hospital-wide access to genomic data advanced pediatric rare disease research and clinical outcomes",
        "link": "https://www.nature.com/articles/s41525-024-00441-9",
        "publication_date": "02 Dec 2024",
        "abstract": "Boston Children’s Hospital has established a genomic sequencing and analysis research initiative to improve clinical care for pediatric rare disease patients. Through the Children’s Rare Disease Collaborative (CRDC), the hospital offers CLIA-grade exome and genome sequencing, along with other sequencing types, to patients enrolled in specialized rare disease research studies. The data, consented for broad research use, are harmonized and analyzed with CRDC-supported variant interpretation tools. Since its launch, 66 investigators representing 26 divisions and 45 phenotype-based cohorts have joined the CRDC. These studies enrolled 4653 families, with 35% of analyzed cases having a finding either confirmed or under further investigation. This accessible and harmonized genomics platform also supports additional institutional data collections, research and clinical, and now encompasses 13,800+ patients and their families. This has fostered new research projects and collaborations, increased genetic diagnoses and accelerated innovative research via integration of genomics research with clinical care.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Personalized progression modelling and prediction in Parkinson’s disease with a novel multi-modal graph approach",
        "link": "https://www.nature.com/articles/s41531-024-00832-w",
        "publication_date": "01 Dec 2024",
        "abstract": "Parkinson’s disease (PD) is a complex neurological disorder characterized by dopaminergic neuron degeneration, leading to diverse motor and non-motor impairments. This variability complicates accurate progression modelling and early-stage prediction. Traditional classification methods based on clinical symptoms are often limited by disease heterogeneity. This study introduces an graph-based interpretable personalized progression method, utilizing data from the Parkinson’s Progression Markers Initiative (PPMI) and Stroke Parkinson’s Disease Biomarker Program (PDBP). Our approach integrates multimodal inter-individual and intra-individual data, including clinical assessments, MRI, and genetic information to make multi-dimension predictions. Validated using the PDBP dataset from 12 to 36 months, our AdaMedGraph method demonstrated strong performance, achieving AUC values of 0.748 and 0.714 for the 12-month Hoehn and Yahr Scale and Movement Disorder Society-Sponsored Revision of the Unified Parkinson’s Disease Rating Scale (MDS-UPDRS) III on the PPMI test set. Ablation analysis reveals the importance of baseline clinical assessment predictors. This novel framework improves personalized care and offers insights into unique disease trajectories in PD patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Phenotyping people with a history of injecting drug use within electronic medical records using an interactive machine learning approach",
        "link": "https://www.nature.com/articles/s41746-024-01318-y",
        "publication_date": "30 Nov 2024",
        "abstract": "People with a history of injecting drug use are a priority for eliminating blood-borne viruses and sexually transmissible infections. Identifying them for disease surveillance in electronic medical records (EMRs) is challenged by sparsity of predictors. This study introduced a novel approach to phenotype people who have injected drugs using structured EMR data and interactive human-in-the-loop methods. We iteratively trained random forest classifiers removing important features and adding new positive labels each time. The initial model achieved 92.7% precision and 93.5% recall. Models maintained >90% precision and recall after nine iterations, revealing combinations of less obvious features influencing predictions. Applied to approximately 1.7 million patients, the final model identified 128,704 (7.7%) patients as potentially having injected drugs, beyond the 50,510 (2.9%) with known indicators of injecting drug use. This process produced explainable models that revealed otherwise hidden combinations of predictors, offering an adaptive approach to addressing the inherent challenge of inconsistently missing data in EMRs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cutting-edge Bioinformatics strategies for synthesizing Cyclotriazadisulfonamide (CADA) analogs in next-Generation HIV therapies",
        "link": "https://www.nature.com/articles/s41598-024-77106-1",
        "publication_date": "30 Nov 2024",
        "abstract": "Cyclotriazadisulfonamide (CADA) is a macrocyclic compound known for its unique mechanism in inhibiting HIV infection by downregulating the CD4 T-cell receptor, a crucial entry point for the virus. Unlike other antiretrovirals, CADA exhibits activity against a wide range of HIV strains, as all HIV variants require CD4 binding for infection. Furthermore, CADA has shown a synergistic effect with clinically approved anti-HIV drugs, offering potential for enhanced therapeutic strategies (Vermeire & Schols, [65]). One proposed mechanism for CADA’s inhibition of the CD4 receptor involves blocking the gates of the Sec61 channel, thereby preventing its translocation. However, CADA suffers from poor solubility and bioavailability. To address this, the study aimed to design CADA analogs with improved binding to the Sec61 channel, enhanced bioavailability, and reduced toxicity. The analogs were designed using SeeSAR, with Avogadro and Meeko used for 3D configuration and pseudoatom placement, respectively. AutoDock Vina version 1.2.4 was employed to predict the binding energies of these analogs. Of the 113 analogs designed, 93 demonstrated a more negative binding energy to the Sec61 channel compared to CADA. Structure-binding energy analyses were done to the top-binding analogs to show favorable structural modifications. Enzyme-ligand interactions were analyzed to elucidate the forces contributing to these binding energies. Additionally, 33 of the 113 analogs were deemed bioavailable using a bioavailability criteria specific for macrocycles. Toxicity predictions using PASS Online and StopTox identified analogs JGL023, JGL024, JGL032, and JGL047 as potential drug candidates. Molecular dynamics simulations using Gromacs-2020.4 revealed that JGL023 and JGL032 exhibited the most favorable binding to the Sec61 channel, as determined by evaluating ligand and residue flexibility, compactness, contact frequency, motion pathways, free energy, and other relevant parameters. Synthetic routes for these four analogs were proposed for future studies. The results of this study offer a new perspective on developing drugs to inhibit HIV entry.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Classification of melanoma skin Cancer based on Image Data Set using different neural networks",
        "link": "https://www.nature.com/articles/s41598-024-75143-4",
        "publication_date": "29 Nov 2024",
        "abstract": "This paper aims to address the pressing issue of melanoma classification by leveraging advanced neural network models, specifically basic Convolutional Neural Networks (CNN), ResNet-18, and EfficientNet-B0. Our objectives encompass presenting and evaluating these models based on established practices in medical image diagnosis. Additionally, we aim to demonstrate their effectiveness in contributing to the critical task of saving lives through early and accurate melanoma diagnosis.Our methodology involves a multi-stage process, which includes image normalization and augmentation, followed by segmentation, feature extraction, and classification. Notably, the neural network models underwent rigorous evaluation, with EfficientNet-B0 exhibiting exceptional performance as the winning model. EfficientNet-B0 achieved a remarkable accuracy of 97%, surpassing ResNet-18 (87%) and basic CNN (80%) in classifying malignant and benign cases. In addition to accuracy, a comprehensive set of evaluation metrics was employed for EfficientNet-B0: sensitivity of 99%, specificity of 93%, F1-score of 97%, precision of 95%, and an error rate of 3%. It also demonstrated a Mathew’s correlation coefficient of 94% and a geometric mean of 1.01. Across these metrics, EfficientNet-B0 consistently outperformed ResNet-18 and basic CNN. The findings from this research suggest that neural network models, particularly EfficientNet-B0, hold significant promise for precise and efficient melanoma skin cancer detection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Natural language processing in mixed-methods evaluation of a digital sleep-alcohol intervention for young adults",
        "link": "https://www.nature.com/articles/s41746-024-01321-3",
        "publication_date": "29 Nov 2024",
        "abstract": "We used natural language processing (NLP) in convergent mixed methods to evaluate young adults’ experiences with Call it a Night (CIAN), a digital personalized feedback and coaching sleep-alcohol intervention. Young adults with heavy drinking (N = 120) were randomized to CIAN or controls (A + SM: web-based advice + self-monitoring or A: advice; clinicaltrials.gov, 8/31/18, #NCT03658954). Most CIAN participants (72.0%) preferred coaching to control interventions. Control participants found advice more helpful than CIAN participants (X2 = 27.34, p < 0.001). Most participants were interested in sleep factors besides alcohol and appreciated increased awareness through monitoring. NLP corroborated generally positive sentiments (M = 15.07(10.54)) and added critical insight that sleep (40%), not alcohol use (12%), was a main participant motivator. All groups had high adherence, satisfaction, and feasibility. CIAN (Δ = 0.48, p = 0.008) and A + SM (Δ = 0.55, p < 0.001) had higher reported effectiveness than A (F(2, 115) = 8.45, p < 0.001). Digital sleep-alcohol interventions are acceptable, and improving sleep and wellness may be important motivations for young adults.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evidentiary basis of the first regulatory qualification of a digital primary efficacy endpoint",
        "link": "https://www.nature.com/articles/s41598-024-80177-9",
        "publication_date": "29 Nov 2024",
        "abstract": "Stride velocity 95th centile (SV95C) is a wearable-derived endpoint representing the 5% fastest strides taken during everyday living. In July 2023, SV95C received European Medicines Agency (EMA) qualification for use as a primary endpoint in trials of patients with Duchenne muscular dystrophy (DMD) aged ≥ 4 years—becoming the first digital endpoint to receive such qualification. We present the data supporting this qualification, providing insights into the evidentiary basis of qualification as a digital clinical outcome assessment. Clinical trials, natural history studies, and patient surveys (ages 5 − 14 years) showed that SV95C is accurate, valid, reliable, sensitive, and clinically meaningful. SV95C significantly correlated with traditional DMD assessments, increased rapidly after steroid initiation (0.090 m/s 3 months post-treatment), and declined steadily in patients on stable steroid regimens. Compared with traditional assessments, SV95C demonstrated earlier sensitivity to disease progression (3 vs 9 months) and greater sensitivity at 12 months. Distribution- and anchor-based approaches revealed a change of − 0.10 to − 0.20 m/s as clinically meaningful. The EMA qualification of SV95C illustrates the willingness of regulators to accept novel digital endpoints for drug approval, setting an important precedent for the evidentiary basis of regulatory digital endpoint qualification that could transform clinical development in disorders affecting movement.",
        "conclusions": "The evidence presented here shows that SV95C is accurate, reliable, sensitive to change, and clinically meaningful for use as a primary endpoint in clinical trials of ambulant patients with DMD. This endpoint has the potential to transform clinical development in DMD and potentially other neuromuscular diseases and neurodevelopmental conditions.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based diagnostic model for stroke in non-neurological intensive care unit patients with acute neurological manifestations",
        "link": "https://www.nature.com/articles/s41598-024-80792-6",
        "publication_date": "28 Nov 2024",
        "abstract": "Stroke is a neurological complication that can occur in patients admitted to the intensive care unit (ICU) for non-neurological conditions, leading to increased mortality and prolonged hospital stays. The incidence of stroke in ICU settings is notably higher compared to the general population, and delays in diagnosis can lead to irreversible neurological damage. Early diagnosis of stroke is critical to protect brain tissue and treat neurological defects. Therefore, we developed a machine learning model to diagnose stroke in patients with acute neurological manifestations in the ICU. We retrospectively collected data on patients’ underlying diseases, blood coagulation tests, procedures, and medications before neurological symptom onset from 206 patients at the Chungbuk National University Hospital ICU (July 2020–July 2022) and 45 patients at Chungnam National University Hospital between (July 2020–March 2023). Using the Categorical Boosting (CatBoost) algorithm with Bayesian optimization for hyperparameter selection and k-fold cross-validation to mitigate overfitting, we analyzed model-feature relationships with SHapley Additive exPlanations (SHAP) values. Internal model validation yielded an average accuracy of 0.7560, sensitivity of 0.8959, specificity of 0.7000, and area under the receiver operating characteristic curve (AUROC) of 0.8201. External validation yielded an accuracy of 0.7778, sensitivity of 0.7500, specificity of 0.7931, and an AUROC of 0.7328. These results demonstrated the model’s effectiveness in diagnosing stroke in non-neurological ICU patients with acute neurological manifestations using their electronic health records, making it valuable for the early detection of stroke in ICU patients.",
        "conclusions": "Our study demonstrates the applicability of machine learning in the field of medical diagnostics, particularly for the early detection of strokes in ICU patients. The model was trained on the vast amount of data stored in EHRs. In the internal validation, the model achieved an average accuracy of 0.7560, sensitivity of 0.8959, specificity of 0.7000, and an AUROC of 0.8201, demonstrating its ability to detect in-hospital stroke cases. In the external validation, the model achieved an average accuracy of 0.7778, sensitivity of 0.7500, specificity of 0.7931, and an AUROC of 0.7328, demonstrating the feasibility of in-hospital stroke diagnosis using machine learning.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A DNA methylation signature identified in the buccal mucosa reflecting active tuberculosis is changing during tuberculosis treatment",
        "link": "https://www.nature.com/articles/s41598-024-80570-4",
        "publication_date": "28 Nov 2024",
        "abstract": "Tuberculosis (TB) poses a significant global health threat, with high mortality rates if left untreated. Current sputum-based TB treatment monitoring methods face numerous challenges, particularly in relation to sample collection and analysis. This pilot study explores the potential of TB status assessment using DNA methylation (DNAm) signatures, which are gaining recognition as diagnostic and predictive tools for various diseases. We collected buccal swab samples from pulmonary TB patients at the commencement of TB treatment (n = 10), and at one, two, and six-month follow-up intervals. We also collected samples from healthy controls (n = 10) and individuals exposed to TB (n = 10). DNAm patterns were mapped using the Illumina Infinium Methylation EPIC 850 K platform. A DNAm profile distinct from controls was discovered in the oral mucosa of TB patients at the start of treatment, and this profile changed throughout the course of TB treatment. These findings were corroborated in a separate validation cohort of TB patients (n = 41), monitored at two and six months into their TB treatment. We developed a machine learning model to predict symptom scores using the identified DNAm TB profile. The model was trained and evaluated on the pilot, validation, and two additional independent cohorts, achieving an R2 of 0.80, Pearson correlation of 0.90, and mean absolute error of 0.13. While validation is needed in larger cohorts, the result opens the possibility of employing DNAm-based diagnostic and prognostic tools for TB in future clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploration and practice of potential association prediction between diseases and drugs based on Swanson framework and bioinformatics",
        "link": "https://www.nature.com/articles/s41598-024-79587-6",
        "publication_date": "28 Nov 2024",
        "abstract": "Compared to traditional intermediate concepts, specific bioinformatics entities are more informative and higher directional. This study is based on the BITOLA system and combines bioinformatics methods to determine the intermediate concept which is key to improve efficiency of Literature-based Knowledge Discovery, proposes the concept of “Swanson framework + Bioinformatics”, and conducts practice of Literature-based Knowledge Discovery to improve the scientificity and efficiency of research and development. Firstly, detected the disease related genes (i.e. differentially expressed genes) according to the results of gene functional analysis as intermediate concepts to carry out Literature-based Knowledge Discovery. Taking the disease “Autism Spectrum Disorder (ASD)” as an example, the potential “disease-drug” association was predicted, and the predicted drugs were verified from the perspective of bioinformatics. Two drugs potentially associated with ASD were found: Fish oil and Forskolin, which were closely related to ASD in bioinformatics analysis results and literature verification. The two “disease-drug” association results showed better scientificity. The BIOINF-ABC+ model improves the accuracy of calculations by 76% compared to using the BITOLA system alone. In addition, it also shows high accuracy and credibility in literature verification. The BIOINF-ABC+ model based on the “Swanson framework + Bioinformatics” has good practicality, applicability, and accuracy in conducting “disease-drug” association prediction in the biomedical field, and can be used for mining “disease-drug” relationships.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Improved clinical pregnancy rates in natural frozen-thawed embryo transfer cycles with machine learning ovulation prediction: insights from a retrospective cohort study",
        "link": "https://www.nature.com/articles/s41598-024-80356-8",
        "publication_date": "27 Nov 2024",
        "abstract": "This study aims to develop physician support software for determining ovulation time and assess its impact on pregnancy outcomes in natural cycle frozen embryo transfers (NC-FET). To develop, assess, and validate an ovulation prediction model, three datasets were used: REI Ovulation Determination dataset (500 cycles) split into training (309), validation (90), and test (101) sets; the Documented Ovulation dataset (101 cycles) with confirmed ovulation (documented follicular rupture and LH surge); and the Clinical Pregnancy Rates dataset (515 NC-FET cycles), categorized into “Matched” and “Mismatched” based on alignment with the model’s ovulation determination. Pregnancy outcomes were compared between the groups. The ovulation prediction model exhibited 93.85% and 92.89% matching rates with the REI Ovulation Determination and Documented Ovulation datasets, respectively. In the Clinical Pregnancy Rates dataset, the Matched group (282 cycles) showed significantly higher clinical pregnancy rates than the Mismatched group (34.6% vs. 25.9%, p = 0.04) and similar results for patients under 37 (41.1% vs. 30.7%, p = 0.04). Logistic regression indicated lower pregnancy rates in Mismatched cases (odds ratio 0.67 for the general population, 0.63 for patients under 37). In conclusion, we introduce a highly accurate AI ovulation prediction model. Treatment cycles aligning with the model’s recommendations had significantly increased clinical pregnancy rates.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "SurfDock is a surface-informed diffusion generative model for reliable and accurate protein–ligand complex prediction",
        "link": "https://www.nature.com/articles/s41592-024-02516-y",
        "publication_date": "27 Nov 2024",
        "abstract": "Accurately predicting protein–ligand interactions is crucial for understanding cellular processes. We introduce SurfDock, a deep-learning method that addresses this challenge by integrating protein sequence, three-dimensional structural graphs and surface-level features into an equivariant architecture. SurfDock employs a generative diffusion model on a non-Euclidean manifold, optimizing molecular translations, rotations and torsions to generate reliable binding poses. Our extensive evaluations across various benchmarks demonstrate SurfDock’s superiority over existing methods in docking success rates and adherence to physical constraints. It also exhibits remarkable generalizability to unseen proteins and predicted apo structures, while achieving state-of-the-art performance in virtual screening tasks. In a real-world application, SurfDock identified seven novel hit molecules in a virtual screening project targeting aldehyde dehydrogenase 1B1, a key enzyme in cellular metabolism. This showcases SurfDock’s ability to elucidate molecular mechanisms underlying cellular processes. These results highlight SurfDock’s potential as a transformative tool in structural biology, offering enhanced accuracy, physical plausibility and practical applicability in understanding protein–ligand interactions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Advanced KPI framework for IVF pregnancy prediction models in IVF protocols",
        "link": "https://www.nature.com/articles/s41598-024-80759-7",
        "publication_date": "27 Nov 2024",
        "abstract": "The utilization of neural networks in assisted reproductive technology is essential due to their ability to process complex and multidimensional data inherent in IVF procedures, offering opportunities for clinical outcome prediction, personalized treatment implementation, and overall advancement in fertility treatment. The aim of this study was to develop a novel approach to IVF laboratory data analysis, employing deep neural networks to predict the likelihood of clinical pregnancy occurrence within an individual treatment cycle, integrating both key performance indicators and clinical data. We conducted a retrospective analysis spanning 11 years, encompassing 8732 treatment cycles, to extract the most relevant features to our goal and train the model. Internal validation was performed on 1600 preimplantation genetic testing for aneuploidy embryo transfers, while external was conducted across two independent clinics (over 10,000 cases). Leveraging recurrent neural networks, our model demonstrates high accuracy in predicting the likelihood of clinical pregnancy within specific IVF treatment cycles (AUC = 0.68–0.86; test accuracy = 0.78, F1 score = 0.71, sensitivity = 0.62; specificity = 0.86) comparable to time-lapse system but with a simpler approach. Our model facilitates both retrospective analysis of outcomes and prospective evaluation of clinical pregnancy chances, thus presenting a promising avenue for quality management programs and promotes their realization in medical centers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Extraction and evaluation of features of preterm patent ductus arteriosus in chest X-ray images using deep learning",
        "link": "https://www.nature.com/articles/s41598-024-79361-8",
        "publication_date": "26 Nov 2024",
        "abstract": "Echocardiography is the gold standard of diagnosis and evaluation of patent ductus arteriosus (PDA), a common condition among preterm infants that can cause hemodynamic abnormalities and increased mortality rates, but this technique requires a skilled specialist and is not always available. Meanwhile, chest X-ray (CXR) imaging is also known to exhibit signs of PDA and is a routine imaging modality in neonatal intensive care units. In this study, we aim to find and objectively define CXR image features that are associated with PDA by training and visually analyzing a deep learning model. We first collected 4617 echocardiograms from neonatal intensive care unit patients and 17,448 CXR images that were taken 4 days before to 3 days after the echocardiograms were obtained. We trained a deep learning model to predict the presence of severe PDA using the CXR images, and then visualized the model using GradCAM++ to identify the regions of the CXR images important for the model’s prediction. The visualization results showed that the model focused on the regions around the upper thorax, lower left heart, and lower right lung. Based on these results, we hypothesized and evaluated three radiographic features of PDA: cardiothoracic ratio, upper heart width to maximum heart width ratio, and upper heart width to thorax width ratio. We then trained an XGBoost model to predict the presence of severe PDA using these radiographic features combined with clinical features. The model achieved an AUC of 0.74, with a high specificity of 0.94. Our study suggests that the proposed radiographic features of CXR images can be used as an auxiliary tool to predict the presence of PDA in preterm infants. This can be useful for the early detection of PDA in neonatal intensive care units in cases where echocardiography is not available.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Discriminating Myalgic Encephalomyelitis/Chronic Fatigue Syndrome and comorbid conditions using metabolomics in UK Biobank",
        "link": "https://www.nature.com/articles/s43856-024-00669-7",
        "publication_date": "26 Nov 2024",
        "abstract": "Diagnosing complex illnesses like Myalgic Encephalomyelitis/Chronic Fatigue Syndrome (ME/CFS) is complicated due to the diverse symptomology and presence of comorbid conditions. ME/CFS patients often present with multiple health issues, therefore, incorporating comorbidities into research can provide a more accurate understanding of the condition’s symptomatology and severity, to better reflect real-life patient experiences.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of a flexible feature selection framework in radiomics-based prediction modeling: Assessment with four real-world datasets",
        "link": "https://www.nature.com/articles/s41598-024-80863-8",
        "publication_date": "26 Nov 2024",
        "abstract": "There are several important challenges in radiomics research; one of them is feature selection. Since many quantitative features are non-informative, feature selection becomes essential. Feature selection methods have been mixed with filter, wrapper, and embedded methods without a rule of thumb. This study aims to develop a framework for optimal feature selection in radiomics research. We developed the framework that the optimal features were selected to quickly through controlling relevance and redundancy among features. A ‘FeatureMap’ was generated containing information for each step and used as a platform. Through this framework, we can explore the optimal combination of radiomics features and evaluate the predictive performance using only selected features. We assessed the framework using four real datasets. The FeatureMap generated 6 combinations, with the number of features selected varying for each combination. The predictive models obtained high performances; the highest test area under the curves (AUCs) were 0.792, 0.820, 0.846 and 0.738 in the cross-validation method, respectively. We developed a flexible framework for feature selection methods in radiomics research and assessed its usefulness using various real-world data. Our framework can assist clinicians in efficiently developing predictive models based on radiomics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The use of artificial intelligence based chat bots in ophthalmology triage",
        "link": "https://www.nature.com/articles/s41433-024-03488-1",
        "publication_date": "26 Nov 2024",
        "abstract": "To evaluate AI-based chat bots ability to accurately answer common patient’s questions in the field of ophthalmology.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive dermoscopic features of cryotherapy treatment response in cutaneous warts",
        "link": "https://www.nature.com/articles/s41598-024-80608-7",
        "publication_date": "26 Nov 2024",
        "abstract": "The utility of dermoscopy for the diagnosis of cutaneous warts is well known. However, its role in predicting the outcome of cryotherapy for cutaneous warts remains unexplored. To identify dermoscopic features predicting treatment responses in cryotherapy for cutaneous warts. We conducted a retrospective analysis of 119 warts in 103 patients. Responses were categorized as complete, partial, or none after three sessions of cryotherapy within 4 months. The evaluated features included vascularity, papillary patterns, and margin characteristics. Marked surface scales and well-defined margins were common in complete responses. Minimal surface scales and smooth patterns were observed in less responsive cases. In the group with a complete response, marked surface scales were observed 6.59 times more frequently, well-defined margins were 4.1 times more common, and dots were 4.07 times more common compared to the group with no response. Common warts responded well when showing vascularity and marked surface scales, whereas plantar warts responded positively when showing background erythema. Dermoscopic features, such as dots, marked surface scales, and well-defined margins, predict a favorable cryotherapy response in cutaneous warts. Plantar warts respond positively in the presence of perilesional erythema, whereas common warts exhibit vascularity and marked surface scales for a better response to cryotherapy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting poor performance on cognitive tests among older adults using wearable device data and machine learning: a feasibility study",
        "link": "https://www.nature.com/articles/s41514-024-00177-x",
        "publication_date": "25 Nov 2024",
        "abstract": "Timely implementation of interventions to slow cognitive decline among older adults requires accurate monitoring to detect changes in cognitive function. Factors known to be associated with cognition that can be gathered from accelerometers, user interfaces, and other sensors within wearable devices could be used to train machine learning models and develop wearable-based cognitive monitoring systems. Using data from over 2400 older adults in the National Health and Nutrition Examination Survey (NHANES) we developed prediction models to differentiate older adults with normal cognition from those with poor cognition based on outcomes from three cognitive tests measuring different domains of cognitive function. During repeated cross-validation CatBoost, XGBoost, and Random Forest models performed best when predicting poor cognition based on tests measuring processing speed, working memory, and attention (median AUCs ≥0.82) compared to immediate and delayed recall (median AUCs ≥0.72) and categorical verbal fluency (median AUC ≥ 0.68). Activity and sleep parameters were also more strongly associated with poor cognition based on tests assessing processing speed, working memory, and attention compared to other cognitive subdomains. Our work provides proof of concept that data collatable through wearable devices such as age, education, sleep parameters, activity summaries, and light exposure metrics could be used to differentiate between older adults with normal versus poor cognition. We further identified metrics that could be targets in future causal studies seeking to better understand how sleep and activity parameters influence cognitive function among older adults.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning evaluation of intensified conditioning on haematopoietic stem cell transplantation in adult acute lymphoblastic leukemia patients",
        "link": "https://www.nature.com/articles/s43856-024-00680-y",
        "publication_date": "25 Nov 2024",
        "abstract": "The advantage of intensified myeloablative conditioning (MAC) over standard MAC has not been determined in haematopoietic stem cell transplantation (HSCT) for adult acute lymphoblastic leukemia (ALL) patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The risk of shortcutting in deep learning algorithms for medical imaging research",
        "link": "https://www.nature.com/articles/s41598-024-79838-6",
        "publication_date": "25 Nov 2024",
        "abstract": "While deep learning (DL) offers the compelling ability to detect details beyond human vision, its black-box nature makes it prone to misinterpretation. A key problem is algorithmic shortcutting, where DL models inform their predictions with patterns in the data that are easy to detect algorithmically but potentially misleading. Shortcutting makes it trivial to create models with surprisingly accurate predictions that lack all face validity. This case study shows how easily shortcut learning happens, its danger, how complex it can be, and how hard it is to counter. We use simple ResNet18 convolutional neural networks (CNN) to train models to do two things they should not be able to do: predict which patients avoid consuming refried beans or beer purely by examining their knee X-rays (AUC of 0.63 for refried beans and 0.73 for beer). We then show how these models’ abilities are tied to several confounding and latent variables in the image. Moreover, the image features the models use to shortcut cannot merely be removed or adjusted through pre-processing. The end result is that we must raise the threshold for evaluating research using CNNs to proclaim new medical attributes that are present in medical images.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Investigating the impact of steroid dependence on gastrointestinal surgical outcomes from UK Biobank",
        "link": "https://www.nature.com/articles/s41598-024-75215-5",
        "publication_date": "25 Nov 2024",
        "abstract": "Although corticosteroids are an important treatment for inflammatory bowel disease (IBD) patients, many subjects develop dependence, leading to serious long-term side effects. We applied causal inference analyses to investigate the length of steroid use on reoperations in IBD patients. We identified subjects in the UK Biobank general practice dataset with at least one major GI surgery and followed them for at least 5 years to evaluate subsequent operations. We defined steroid dependence as at least 12 weeks of use (vs. acute steroid use) prior to baseline surgery. Of the 363 subjects included in our analyses, 163 (45%) were prescribed steroids on or before baseline surgery, and of these (N = 125 of 163, 77%) were dependent. Additional analyses for time-dependent data on prescriptions found a link between prescription length and reoperation. Among UC subjects with acute use, the odds of reoperation were significantly lower (OR: 0.32, 95% CI: 0.0–0.73). Steroid dependence resulted in a delay of reoperation (median 1.2 vs. 2.3 years, P = 0.01). Our findings indicate that long-term steroid use tends to increase the need for reoperation, whereas short-term use may reduce it.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Association between gut microbiota and locomotive syndrome risk in healthy Japanese adults: a cross-sectional study",
        "link": "https://www.nature.com/articles/s41514-024-00184-y",
        "publication_date": "25 Nov 2024",
        "abstract": "This cross-sectional study examined the association between gut microbiota composition and locomotive syndrome in 568 healthy Japanese adults (36.8% male, median age 58.5 years) using data from the Kanagawa “ME-BYO” Prospective Cohort Study. Locomotive syndrome was assessed using the 5-question Geriatric Locomotive Function Scale (GLFS-5). Linear discriminant analysis effect size showed an enrichment of Actinobacteria and depletion of Firmicutes in GLFS-5 positive individuals. Classification tree analysis identified three terminal nodes as GLFS-5 positive, with one node involving Holdemania. Participants aged ≥70.0 and <78.0 years who did not consume probiotic foods and had ≥0.04% relative abundance of Holdemania were classified as at risk for locomotive syndrome. Our findings suggest a potential association between gut microbiota, particularly higher Holdemania abundance, and locomotive syndrome in older adults. This study provides insights into the complex relationship between gut microbiome composition and musculoskeletal health in aging populations. However, the cross-sectional design limits causal inference.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Risk assessment and automatic identification of autistic children based on appearance",
        "link": "https://www.nature.com/articles/s41598-024-80459-2",
        "publication_date": "23 Nov 2024",
        "abstract": "The diagnosis of Autism Spectrum Disorder (ASD) is mainly based on some diagnostic scales and evaluations by professional doctors, which may have limitations such as subjectivity, time, and cost. This research introduces a novel assessment and auto-identification approach for autistic children based on the appearance of children, which is a relatively objective, fast, and cost-effective approach. Initially, a custom social interaction scenario was developed, followed by a facial data set (ACFD) that contained 187 children, including 92 ASD and 95 children typically developing (TD). Using computer vision techniques, some appearance features of children including facial appearing time, eye concentration analysis, response time to name calls, and emotional expression ability were extracted. Subsequently, these features were combined and machine learning methods were used for the classification of children. Notably, the Bayes classifier achieved a remarkable accuracy of 94.1%. The experimental results show that the extracted visual appearance features can reflect the typical symptoms of children, and the automatic recognition method can provide an auxiliary diagnosis or data support for doctors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "EEG features and synek scale indicate severity of neurotoxicity in adult patients treated with CD19 CAR T-cell therapy",
        "link": "https://www.nature.com/articles/s41598-024-80566-0",
        "publication_date": "23 Nov 2024",
        "abstract": "Patients who develop chimeric antigen receptor (CAR) T-cell-related immune effector cell-associated neurotoxicity syndrome (ICANS) frequently undergo evaluation with electroencephalography (EEG). We hypothesize that EEG features and Synek scale score, a measure of degree of EEG abnormality, are associated with ICANS severity. Here, we performed a retrospective review of 125 adult patients at Memorial Sloan Kettering Cancer Center (MSKCC) who received CAR-T cell therapy from 2010 to 2019, including 53 patients with B-acute lymphoblastic leukemia treated with 1928z CAR T cells (NCT01044069) and 72 patients with large B-cell lymphoma (LBCL) treated with the commercial CAR T products axicabtagene ciloleucel or tisagenlecleucel. We collected video EEG monitoring (27 with B-ALL and 20 with LBCL) and recorded daily EEG features, Synek scores, and ICANS grade for 47 eligible patients. Synek scale and ICANS grade were positively correlated (correlation coefficient 0.47, 95% CI: 0.31–0.60). This was further corroborated in the univariable model associating high Synek scale (3 or 4) with high ICANS grade (OR = 15.2; 95%CI:7.8–29.7, p < 0.0001). EEG features such as discontinuity, absence of posterior dominant rhythm, and presence of generalized sharp waves were statistically significantly associated with higher ICANS grade in univariable models. In the multivariable model, discontinuity (OR = 4.2 (95%CI:1.3–13.8, p = 0.02) and absence of posterior dominant rhythm (OR = 10.5 (95%CI:4.6–23.9, p < 0.0001) were statistically associated with higher ICANS grade. Overall, EEG discontinuity and absence of posterior dominant rhythm were independently associated with higher severity of neurotoxicity. Further, our data suggest that Synek Scale, may be a severity marker for neurotoxicity.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A machine learning approach to identify stride characteristics predictive of musculoskeletal injury, enforced rest and retirement in Thoroughbred racehorses",
        "link": "https://www.nature.com/articles/s41598-024-79071-1",
        "publication_date": "22 Nov 2024",
        "abstract": "Decreasing speed and stride length over successive races have been shown to be associated with musculoskeletal injury (MSI) in racehorses, demonstrating the potential for early detection of MSI through longitudinal monitoring of changes in stride characteristics. A machine learning (ML) approach for early detection of MSI, enforced rest, and retirement events using this same horse-level, race-level, and stride characteristic data across all race sectionals was investigated. A CatBoost model using features from the two races prior to an event had the highest classification performance (sensitivity score for MSI, enforced rest and retirement equal to 0.00, 0.58, 0.76, respectively and balanced accuracy score corresponding to 0.44), with scores decreasing for models incorporating windows that included additional races further from the event. Feature importance analysis of ML models demonstrated that retirement was predicted by older age, poor performance, and longer racing career, enforced rest was predicted by younger age and better performance, but was less likely to occur when the stride length is increasing, and MSI predicted by increased number of starters, greater variation in speed and lower percentage of career time at rest. A relatively low classification performance highlights the difficulties in discerning MSI from alternate events using ML. Improved data recording through more thorough assessment and annotation of adverse events is expected to improve the predictability of MSI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Heterogeneous virus classification using a functional deep learning model based on transmission electron microscopy images",
        "link": "https://www.nature.com/articles/s41598-024-80013-0",
        "publication_date": "22 Nov 2024",
        "abstract": "Viruses are submicroscopic agents that can infect other lifeforms and use their hosts’ cells to replicate themselves. Despite having simplistic genetic structures among all living beings, viruses are highly adaptable, resilient, and capable of causing severe complications in their hosts’ bodies. Due to their multiple transmission pathways, high contagion rate, and lethality, viruses pose the biggest biological threat both animal and plant species face. It is often challenging to promptly detect a virus in a host and accurately determine its type using manual examination techniques. However, computer-based automatic diagnosis methods, especially the ones using Transmission Electron Microscopy (TEM) images, have proven effective in instant virus identification. Using TEM images collected from a recent dataset, this article proposes a deep learning-based classification model to identify the virus type within those images. The methodology of this study includes two coherent image processing techniques to reduce the noise present in raw microscopy images and a functional Convolutional Neural Network (CNN) model for classification. Experimental results show that it can differentiate among 14 types of viruses with a maximum of 97.44% classification accuracy and F1-score, which asserts the effectiveness and reliability of the proposed method. Implementing this scheme will impart a fast and dependable virus identification scheme subsidiary to the thorough diagnostic procedures.",
        "conclusions": "In this article, we inscribed a novel heterogeneous virus classification method that differentiates between electron microscopic images of the various viruses. The data preparation stage involves local standard deviation filtering and 2D DCT to prepare TEM images for automatic feature extraction. The deep-learning model used for classification consists of two convolutional branches and a neural network customized and hyper-tuned for virus classification. The model’s performance has been expressed with multiple evaluation matrices, which yield that the method is highly successful in identifying the samples of most virus classes. However, the model’s performance can improve for the three classes’ samples. Overall, the method registered a 97.44% peak classification accuracy and F1-score and a QWK score of 0.9719, which can be labeled as excellent classification outcomes. A comparison with other contemporary studies shows that our method is considerably better and faster at distinguishing between various types of viruses by analyzing their TEM images. Our method has significant potential for improving virus identification, understanding virus diversity, and developing targeted treatments or preventive measures. By combining high-resolution electron microscopy with advanced image processing and deep learning, the method enhances the accuracy and speed of virus classification. This can lead to faster and more precise identification of viruses, which is crucial during outbreaks and in clinical settings. Additionally, accurately classifying and differentiating between diverse virus strains contributes to a deeper understanding of virus diversity, aiding in epidemiological studies and monitoring viral evolution. Overall, this method represents a significant advancement in virology, offering tools that could significantly enhance public health responses to viral threats. We hope that this fast and automatic identification model will be practically implemented, and the virologists and other medical professionals will consider its decisions to reach a more robust verdict while diagnosing a possible patient. In the future, we would like to focus on this model’s limitations and devise ways to mitigate them. Experimenting with different image filtering and noise-removal methods, updating the convolutional models to extract more characteristic features, and changing the neural network to lessen the degree of overfitting might be some of our possible endeavors. We also aim to explore and integrate new TEM image datasets into our future studies.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of key toxicity endpoints of AP-238 a new psychoactive substance for clinical toxicology and forensic purposes using in silico methods",
        "link": "https://www.nature.com/articles/s41598-024-79453-5",
        "publication_date": "22 Nov 2024",
        "abstract": "This study performed advanced toxicological assessments of the new substance AP-238 using nine ‘green’ in silico methods, focusing on acute toxicity, organ-specific effects, skin and eye irritation, genetic toxicity, and cardiotoxicity. A quantitative assessment of AP-238’s acute toxicity (AT) was performed by predicting theoretical LD50 values for both rats and mice across different administration routes using various in silico methods. Results indicated the highest toxicity via intravenous administration in mice, with a t-LD50 of 53 mg/kg, while oral administration in rats exhibited a lower toxicity range, with t-LD50 values between 666.43 and 1838.77 mg/kg, depending on the predictive model used. The identification of toxicophores (the fragment connecting the benzene ring to the piperazine ring, including the α, β, and γ carbon atoms near the nitrogen atom) in AP-238 suggests a high likelihood of lung toxicity (61%), with additional risks to the cardiovascular (58%) and renal systems (56%), emphasizing specific molecular fragments associated with these adverse effects. Genotoxic evaluations presented a mixed view, with low to moderate probabilities of a positive Ames test, suggesting some uncertainty but generally indicating a reduced risk of genetic toxicity. Eye and skin irritation risks were deemed minimal, supported by several models with high confidence. Cardiotoxicity assessments revealed varied information on the potential effects of AP-238 on the hERG channel, with some studies suggesting a nonsignificant impact, while others indicated moderate risk, although with low reliability in the predictions. This highlights the nuanced challenges in assessing the safety of novel substances through ‘green’ in silico methods.",
        "conclusions": "The conducted advanced toxicological studies utilizing nine in silico methods (StopTox, AdmetSAR 3.0, ACD/Labs Percepta, ProTox 3.0, PreADMET, ADMETlab 2.0, OCHEM, TEST and VEGA QSAR) encompassed a comprehensive assessment of the toxicity of the novel substance AP-238 including key toxicity parameters:\n\nAT (qualitative and quantitative as LD50 for different species and route of exposure: AOT, ADT and AIT);\n\n\norgan-specific health effects (gastrointestinal system, kidneys, liver, blood, lungs, and cardiovascular system);\n\n\nskin and eye irritation;\n\n\ngenetic toxicity (Ames test);\n\n\ncardiotoxicity (hERG blocker/inhibitor and IC50).\n\nThe in silico toxicological studies for AP-238 suggest that there are marked differences in toxicity levels depending on the species and method of administration (oral and subcutaneous in mice), as evidenced by variations in t-LD50 values. These findings indicate the complex challenges and restrictions of predictive toxicology, largely due to the lack of direct experimental data. The research also suggests a notable danger of lung toxicity from the chemical AP-238, with a significant probability (61%) of causing shortness of breath, especially in cases of short-term exposure, which makes the respiratory system particularly vulnerable. Further examination suggests that the heart and kidney systems are also hypothetically possible for damage from AP-238 (however with probabilities of toxicity at 58% and 56%, respectively). Additionally, there is a lesser but important risk of normocytic anemia and gastrointestinal problems associated with AP-238, with probabilities of 38% and 21%, respectively. When evaluating the genotoxic threat of AP-238, the predictions of various in silico models present a complex overview. The Percepta model gives a low chance (14%) of a positive Ames test result for AP-238, but with moderate confidence (46%), indicating some predictive uncertainty. However, other models like VEGA, ADMETlab, and OChem consistently deem AP-238 as non-mutagenic, suggesting a reduced risk of genetic toxicity. Regarding the potential for eye and skin irritation from HU-210, the predictions mostly indicate a low risk of irritation. Percepta suggests a 15% chance of eye irritation and a 26% chance of skin irritation, with other models such as VEGA, STopTox, and admetSAR supporting these findings with high confidence, indicating a minimal risk of irritation.Cardiotoxicity assessments of AP-238, focussing on its potential effects on the hERG channel essential for heart safety, show varied information from different in silico studies. PreADMET and ADMETlab suggest a nonsignificant impact on hERG channel blockers, with PreADMET recognising a medium risk of hERG inhibition. On the contrary, Percepta estimates a 32% chance that AP-238 inhibits the hERG channel at relevant doses, but this comes with a low reliability score (0.12), raising questions about the accuracy of the prediction. The hERG IC50 value of 19.2 µM indicates a low inhibitory effect on the hERG channel. Despite some predictions having low reliability, the collective data suggests that, while AP-238’s interaction with the hERG channel is of some concern, the inhibition might not be significant, the need for cautious interpretation and potential further research.The initial toxicological evaluation conducted on AP-238 using nine in silico methods offers an innovative, ‘green’ and thorough understanding of its potential health hazards. This cutting-edge computational research sheds light on the intricate toxic profile of AP-238, addressing key toxic endpoints important for clinical and forensic analysis. It is crucial to note that while this investigation paves new paths for understanding toxicology through toxicity prognosis, empirical research is needed to verify these computational predictions. Moreover, there is a gap for future in silico studies on ADME (Absorption, Distribution, Metabolism, and Excretion).",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "poisoning"
            ],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sex difference in the risk of coronary artery calcification progression related to hyperuricemia among asymptomatic 12,316 Korean adults",
        "link": "https://www.nature.com/articles/s41598-024-80324-2",
        "publication_date": "20 Nov 2024",
        "abstract": "Data on hyperuricemia-related changes in coronary atherosclerosis are limited, especially in sex difference. This study evaluated the association between hyperuricemia and coronary artery calcification (CAC) progression in asymptomatic Korean men and women. We analysed the data of 12,316 asymptomatic adults (51.7 ± 8.5 years; 84.2% men) with a mean follow-up of 3.3 years. Participants were divided into two groups: those with and without hyperuricemia (serum uric acid levels > 7.0 mg/dL for men and > 6.0 mg/dL for women). CAC progression was defined as a difference of ≥ 2.5 between the square roots of the baseline and follow-up coronary artery calcium score (CACS) (Δ√transformed CACS). The incidence of CAC progression was higher in men with hyperuricemia than in those without the condition (37.9% vs. 32.3%, P < 0.001); however, no significant difference in the incidence of CAC progression was observed in women with and without hyperuricemia (20.2% vs. 15.8%, P = 0.243). After adjusting for age, hypertension, diabetes, dyslipidaemia, obesity, current smoking status, serum creatinine, baseline CACS, and inter-scan periods, hyperuricemia was associated with increased risk of CAC progression in men (odds ratio [OR]: 1.20, 95% confidence interval [CI]: 1.06 − 1.36, P = 0.004); however, hyperuricemia was not significantly associated with the risk of CAC progression in women (OR: 0.73, 95% CI: 0.36 − 1.49, P = 0.385). In conclusion, hyperuricemia is more closely associated with CAC progression in men than in women among asymptomatic Korean adults.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive value of triglyceride-glucose index for the occurrence of acute respiratory failure in asthmatic patients of MIMIC-IV database",
        "link": "https://www.nature.com/articles/s41598-024-74294-8",
        "publication_date": "19 Nov 2024",
        "abstract": "This study aims to investigate the association between the triglyceride-glucose (TyG) index and the occurrence of acute respiratory failure in asthma patients. This retrospective observational cohort study utilized data from the Medical Information Mart for Intensive Care IV (MIMIC-IV 2.2) database. The primary outcome was the development of acute respiratory failure in asthma patients. Initially, the Boruta algorithm and SHapley Additive exPansions were applied to preliminarily determine the feature importance of the TyG index, and a risk prediction model was constructed to evaluate its predictive ability. Secondly, Logistic regression proportional hazards models were employed to assess the association between the TyG index and acute respiratory failure in asthma patients. Finally, subgroup analyses were conducted for sensitivity analyses to explore the robustness of the results. A total of 751 asthma patients were included in the study. When considering the TyG index as a continuous variable, logistic regression analysis revealed that in the unadjusted Model 1, the odds ratio (OR) was 2.381 (95% CI: 1.857–3.052; P < 0.001), in Model II, the OR was 2.456 (95% CI: 1.809–3.335; P < 0.001), and in the multivariable-adjusted model, the OR was 1.444 (95% CI: 1.029–2.028; P = 0.034). A consistent association was observed between the TyG index and the risk of acute respiratory failure in asthma patients. No significant interaction was found between the TyG index and various subgroups (P > 0.05). Furthermore, machine learning results indicated that an elevated TyG index was a significant feature predictive of respiratory failure in asthma patients. The baseline risk model achieved an AUC of 0.743 (95% CI: 0.679–0.808; P < 0.05), whereas the combination of the baseline risk model with the TyG index yielded an AUC of 0.757 (95% CI: 0.694–0.821; P < 0.05). The TyG index can serve as a predictive indicator for acute respiratory failure in asthma patients, albeit confirmation of these findings requires larger-scale prospective studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Quantifying spontaneous infant movements using state-space models",
        "link": "https://www.nature.com/articles/s41598-024-80202-x",
        "publication_date": "19 Nov 2024",
        "abstract": "Over the first few months after birth, the typical emergence of spontaneous, fidgety general movements is associated with later developmental outcomes. In contrast, the absence of fidgety movements is a core feature of several neurodevelopmental and cognitive disorders. Currently, manual assessment of early infant movement patterns is time consuming and labour intensive, limiting its wider use. Recent advances in computer vision and deep learning have led to the emergence of pose estimation techniques, computational methods designed to locate and track body points from video without specialised equipment or markers, for movement tracking. In this study, we use automated markerless tracking of infant body parts to build statistical models of early movements. Using a dataset of infant movement videos (n = 486) from 330 infants we demonstrate that infant movement can be modelled as a sequence of eight motor states using autoregressive, state-space models. Each, motor state Is characterised by specific body part movements, the expression of which varies with age and differs in infants at high-risk of poor neurodevelopmental outcome.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Placental T2* as a measure of placental function across field strength from 0.55T to 3T",
        "link": "https://www.nature.com/articles/s41598-024-77406-6",
        "publication_date": "19 Nov 2024",
        "abstract": "Placental MRI is increasingly implemented in clinical obstetrics and research. Functional imaging, especially T2*, has been shown to vary across gestation and in pathology. Translation into the clinical arena has been slow because of time taken to mask the region of interest and owing to differences in T2* results depending on field strength. This paper contributes methodology to remove these barriers by utilising data from 0.55, 1.5 and 3T MRI to provide a fully automated segmentation tool; determining field strength dependency of placental assessment techniques; and deriving normal ranges for T2* by gestational age but independent of field strength. T2* datasets were acquired across field strengths. Automatic quantification including fully automatic masking was achieved and tested in 270 datasets across fields. Normal curves for quantitative placental mean T2*, volume and other derived measurements were obtained in 273 fetal MRI scans and z-scores calculated. The fully automatic segmentation achieved excellent quantification results (Dice scores of 0.807 at 3T, 0.796 at 1.5T and 0.815 at 0.55T.). Similar changes were seen between placental T2* and gestational age across all three field strengths (p < 0.05). Z-scores were generated. This study provides confidence in the translatability of T2* trends across field strengths in fetal imaging.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning insights into scapular stabilization for alleviating shoulder pain in college students",
        "link": "https://www.nature.com/articles/s41598-024-79191-8",
        "publication_date": "18 Nov 2024",
        "abstract": "Non-specific shoulder pain is a common musculoskeletal condition, especially among college students, and it can have a negative impact on the patient’s life. Therapists have used scapular stabilization exercises (SSE) to enhance scapular control and mobility. This study investigates the prediction of the impact of scapular stability exercises in treating non-specific shoulder pain, leveraging advanced machine learning techniques for comprehensive evaluation and analysis. Using a diverse range of regression models, including Gamma Regressor, Tweedie Regressor, Poisson Regressor, and others, the study examines the relationship between the effectiveness of various exercises and their impact on shoulder pain management. Furthermore, the study employs optimization techniques, such as Hyperopt, scikit-optimize, optunity, GPyOpt, and Optuna, to fine-tune the exercise protocols for optimal outcomes. The results reveal that scapular stabilization exercises, when optimized using machine learning algorithms, significantly contribute to reducing shoulder pain in college students. Among the optimization techniques, scikit-optimize demonstrated the best performance, resulting in a mean squared error of 0.0085, a mean absolute error of 0.0712, and an impressive R2 score of 0.8501. This indicates that the scikit-optimize approach yielded the most accurate predictions and effectively captured the relationship between the exercises and shoulder pain management. The findings highlight the critical role of scapular stabilization exercise interventions in ameliorating non-specific shoulder pain and underscore the potential of machine learning techniques in optimizing therapeutic strategies for musculoskeletal health management. The utilization of scikit-optimize, in particular, showcases its effectiveness in fine-tuning the exercise protocols for optimal outcomes. The study’s results serve as a crucial stepping stone in developing personalized rehabilitation programs for non-specific shoulder pain, emphasizing the importance of integrating machine learning methodologies in the assessment and treatment of musculoskeletal disorders among college students.",
        "conclusions": "This study utilized an extensive array of machine learning models and optimization techniques to predict the impact of scapular stabilization exercises on non-specific shoulder pain among college students. The results underscore the critical role of scapular stabilization exercise in improving shoulder function and reducing pain, highlighting the potential of machine learning in optimizing therapeutic strategies for musculoskeletal health management. Among the diverse regression models employed, the Gamma Regressor, Tweedie Regressor, and Poisson Regressor demonstrated the highest adjusted R-squared values, indicating their relatively stronger predictive performance in capturing the relationships between exercise protocols and pain reduction. Furthermore, the scikit-optimize optimization approach exhibited the most promising results, yielding the lowest mean squared error and mean absolute error, alongside the highest R-squared score, signifying its effectiveness in fine-tuning the exercise parameters for optimal outcomes. The findings suggest that a data-driven approach, facilitated by machine learning techniques, can significantly enhance the precision and efficacy of scapular stabilization exercise regimens, ultimately leading to improved shoulder health and functionality among college students. By leveraging advanced optimization methodologies, such as scikit-optimize, the study emphasizes the importance of customizing exercise protocols based on individual biomechanical profiles, thus addressing the diverse needs and concerns associated with non-specific shoulder pain in this specific demographic.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Foot fractures diagnosis using a deep convolutional neural network optimized by extreme learning machine and enhanced snow ablation optimizer",
        "link": "https://www.nature.com/articles/s41598-024-80132-8",
        "publication_date": "18 Nov 2024",
        "abstract": "The current investigation proposes a novel hybrid methodology for the diagnosis of the foot fractures. The method uses a combination of deep learning methods and a metaheuristic to provide an efficient model for the diagnosis of the foot fractures problem. the method has been first based on applying some preprocessing steps before using the model for the features extraction and classification of the problem. the main model is based on a pre-trained ZFNet. The final layers of the network have been substituted using an extreme learning machine (ELM) in its entirety. The ELM part also optimized based on a new developed metaheuristic, called enhanced snow ablation optimizer (ESAO), to achieve better results. for validating the effectiveness of the proposed ZFNet/ELM/ESAO-based model, it has been applied to a standard benchmark from Institutional Review Board (IRB) and the findings have been compared to some different high-tech methods, including Decision Tree / K-Nearest Neighbour (DT/KNN), Linear discriminant analysis (LDA), Inception-ResNet Faster R-CNN architecture (FRCNN), Transfer learning‑based ensemble convolutional neural network (TL-ECNN), and combined model containing a convolutional neural network and long short-term memory (DCNN/LSTM). Final results show that using the proposed ZFNet/ELM/ESAO-based can be utilized as an efficient model for the diagnosis of the foot fractures.",
        "conclusions": "A foot fracture refers to the act of breaking or shattering one or more bones within the leg. This can occur due to various factors such as a forceful impact on the foot, falling from a significant height, excessive pressure exerted on the foot, improper usage of the foot (commonly seen in club sports), wearing inappropriate footwear, structural abnormalities in the bones, or underlying conditions like osteoporosis (a condition characterized by reduced bone density) or bone cancer. These fractures typically occur in the leg region. Following such an incident, individuals often experience intense pain in the affected area, swelling, redness, bruising, limited mobility, significant deformity in the leg, and a sensation of either heat or coldness in the fractured region. The root cause of foot pain in these cases is the misalignment or displacement of the bones. The accurate and timely judgement of these fractures is crucial for effective recovery and treatment. In this research paper, a novel hybrid methodology was proposed for diagnosing foot fractures by combining deep learning and metaheuristic techniques. The proposed approach included of three primary steps: preprocessing, feature extraction, and classification. Throughout the preprocessing step, some techniques were employed to enhance the quality of input images. This ensures better accuracy in subsequent stages. In the feature extraction step, a pre-trained deep convolutional neural network (ZFNet) was utilized to extract high-level properties from the images. This enables us to capture important features and patterns related to foot fractures. For the classification step, an extreme learning machine (ELM) was employed to categorize the images as either normal or fractured. To optimize the ELM, a new metaheuristic algorithm called enhanced snow ablation optimizer (ESAO) was introduced, which mimics the natural process of snow ablation. This algorithm enhances the performance of the ELM in accurately classifying foot fractures. To evaluate the efficiency of the offered method, experiments were conducted utilizing a standard benchmark dataset from the Institutional Review Board (IRB). The results were compared with those obtained from state-of-the-art methods, including Decision Tree / K-Nearest Neighbour (DT/KNN), Linear discriminant analysis (LDA), Inception-ResNet Faster R-CNN architecture (FRCNN), Transfer learning‑based ensemble convolutional neural network (TL-ECNN), and combined model containing a convolutional neural network and long short-term memory (DCNN/LSTM). Findings demonstrated that the proposed method achieves high levels in different terms. In the future work, our objective will be to enhance our approach by integrating more sophisticated models in deep learning and metaheuristics. These techniques include attention mechanisms, adversarial learning, multi-objective optimization, and swarm intelligence. Subsequently, we will aspire to expand the scope of our approach to encompass other types of fractures and medical images, such as ankle, wrist, spine, and chest.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Reinforcement learning model for optimizing dexmedetomidine dosing to prevent delirium in critically ill patients",
        "link": "https://www.nature.com/articles/s41746-024-01335-x",
        "publication_date": "18 Nov 2024",
        "abstract": "Delirium can result in undesirable outcomes including increased length of stays and mortality in patients admitted to the intensive care unit (ICU). Dexmedetomidine has emerged for delirium prevention in these patients; however, optimal dosing is challenging. A reinforcement learning-based Artificial Intelligence model for Delirium prevention (AID) is proposed to optimize dexmedetomidine dosing. The model was developed and internally validated using 2416 patients (2531 ICU admissions) and externally validated on 270 patients (274 ICU admissions). The estimated performance return of the AID policy was higher than that of the clinicians’ policy in both derivation (0.390 95% confidence interval [CI] 0.361 to 0.420 vs. −0.051 95% CI −0.077 to −0.025) and external validation (0.186 95% CI 0.139 to 0.236 vs. −0.436 95% CI −0.474 to −0.402) cohorts. Our finding indicates that AID might support clinicians’ decision-making regarding dexmedetomidine dosing to prevent delirium in ICU patients, but further off-policy evaluation is required.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Transformer based 3D tooth segmentation via point cloud region partition",
        "link": "https://www.nature.com/articles/s41598-024-79485-x",
        "publication_date": "18 Nov 2024",
        "abstract": "Automatic and accurate tooth segmentation on 3D dental point clouds plays a pivotal role in computer-aided dentistry. Existing Transformer-based methods focus on aggregating local features, but fail to directly model global contexts due to memory limitations and high computational cost. In this paper, we propose a novel Transformer-based 3D tooth segmentation network, called PointRegion, which can process the entire point cloud at a low cost. Following a novel modeling of semantic segmentation that interprets the point cloud as a tessellation of learnable regions, we first design a RegionPartition module to partition the 3D point cloud into a certain number of regions and project these regions as embeddings in an effective way. Then, an offset-attention based RegionEncoder module is applied on all region embeddings to model global context among regions and predict the class logits for each region. Considering the irregularity and disorder of 3D point cloud data, a novel mechanism is proposed to build the point-to-region association to replace traditional convolutional operations. The mechanism, as a medium between points and regions, automatically learns the probabilities that each point belongs to its neighboring regions from the similarity between point and region features, achieving the goal of point-level segmentation. Since the number of regions is far less than the number of points, our proposed PointRegion model can leverage the capability of the global-based Transformer on large-scale point clouds with low computational cost and memory consumption. Finally, extensive experiments demonstrate the effectiveness and superiority of our method on our dental dataset.",
        "conclusions": "In this paper, we present PointRegion, a novel and efficient Transformer based 3D tooth segmentation model. In order to extend advanced method from 2D image segmentation to 3D point cloud segmentation, we design a RegionPartition module for region embedding and a RegionEncoder module for region prediction, as well as an innovative mechanism for establishing point-to-region association. By interpreting a point cloud as a set of learnable regions, we can apply global-based Transformer to large-scale point cloud dataset at a lower cost. Despite our method exhibits outstanding performance both qualitatively and quantitatively on our dental dataset, segmentation of boundary details remains a challenge. Unsmooth segmentation boundaries and segmentation errors tends to be more common in cases involving extremely crowded teeth, dental calculus and swollen ginigiva. The main reason could be that these case are quite rare, leading to insufficient learning opportunities for the model. The intricate dental arrangements, overlapping structures and noisy data present significant difficulties for accurate segmentation. Although the graph-cut post-processing algorithm can effectively improve the segmentation details at the edges of teeth, the introduction of additional complexity means that more computational resources and time costs are required, which to some extent affects the practicality of the method. Addressing these limitations would help improve the accuracy and efficiency of the dental treatment process. Next, we hope to further explore in terms of the boundary segmentation, and design dental software suitable for professional medical services based on our current work.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparing the performance of ChatGPT-3.5-Turbo, ChatGPT-4, and Google Bard with Iranian students in pre-internship comprehensive exams",
        "link": "https://www.nature.com/articles/s41598-024-79335-w",
        "publication_date": "18 Nov 2024",
        "abstract": "This study aims to measure the performance of different AI-language models in three sets of pre-internship medical exams and to compare their performance with Iranian medical students. Three sets of Persian pre-internship exams were used, along with their English translation (six sets in total). In late September 2023, we sent requests to ChatGPT-3.5-Turbo-0613, GPT-4-0613, and Google Bard in both Persian and English languages (excluding questions with any visual content) with each query in a new session and reviewed their responses. GPT models produced responses at varying levels of randomness. In both Persian and English tests, GPT-4 ranked first and obtained the highest score in all exams and different levels of randomness. While Google Bard scored below average on the Persian exams (still in an acceptable range), ChatGPT-3.5 failed all exams. There was a significant difference between the Large Language Models (LLMs) in Persian exams. While GPT-4 yielded the best scores on the English exams, the distinction between all LLMs and students was not statistically significant. The GPT-4 model outperformed students and other LLMs in medical exams, highlighting its potential application in the medical field. However, more research is needed to fully understand and address the limitations of using these models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Coffee consumption is associated with intestinal Lawsonibacter asaccharolyticus abundance and prevalence across multiple cohorts",
        "link": "https://www.nature.com/articles/s41564-024-01858-9",
        "publication_date": "18 Nov 2024",
        "abstract": "Although diet is a substantial determinant of the human gut microbiome, the interplay between specific foods and microbial community structure remains poorly understood. Coffee is a habitually consumed beverage with established metabolic and health benefits. We previously found that coffee is, among >150 items, the food showing the highest correlation with microbiome components. Here we conducted a multi-cohort, multi-omic analysis of US and UK populations with detailed dietary information from a total of 22,867 participants, which we then integrated with public data from 211 cohorts (N = 54,198). The link between coffee consumption and microbiome was highly reproducible across different populations (area under the curve of 0.89), largely driven by the presence and abundance of the species Lawsonibacter asaccharolyticus. Using in vitro experiments, we show that coffee can stimulate growth of L. asaccharolyticus. Plasma metabolomics on 438 samples identified several metabolites enriched among coffee consumers, with quinic acid and its potential derivatives associated with coffee and L. asaccharolyticus. This study reveals a metabolic link between a specific gut microorganism and a specific food item, providing a framework for the understanding of microbial dietary responses at the biochemical level.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]