[
    {
        "title": "Understanding the effectiveness of government interventions against the resurgence of COVID-19 in Europe",
        "link": "https://www.nature.com/articles/s41467-021-26013-4",
        "publication_date": "05 Oct 2021",
        "abstract": "European governments use non-pharmaceutical interventions (NPIs) to control resurging waves of COVID-19. However, they only have outdated estimates for how effective individual NPIs were in the first wave. We estimate the effectiveness of 17 NPIs in Europe’s second wave from subnational case and death data by introducing a flexible hierarchical Bayesian transmission model and collecting the largest dataset of NPI implementation dates across Europe. Business closures, educational institution closures, and gathering bans reduced transmission, but reduced it less than they did in the first wave. This difference is likely due to organisational safety measures and individual protective behaviours—such as distancing—which made various areas of public life safer and thereby reduced the effect of closing them. Specifically, we find smaller effects for closing educational institutions, suggesting that stringent safety measures made schools safer compared to the first wave. Second-wave estimates outperform previous estimates at predicting transmission in Europe’s third wave.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clusters of science and health related Twitter users become more isolated during the COVID-19 pandemic",
        "link": "https://www.nature.com/articles/s41598-021-99301-0",
        "publication_date": "04 Oct 2021",
        "abstract": "COVID-19 represents the most severe global crisis to date whose public conversation can be studied in real time. To do so, we use a data set of over 350 million tweets and retweets posted by over 26 million English speaking Twitter users from January 13 to June 7, 2020. We characterize the retweet network to identify spontaneous clustering of users and the evolution of their interaction over time in relation to the pandemic’s emergence. We identify several stable clusters (super-communities), and are able to link them to international groups mainly involved in science and health topics, national elites, and political actors. The science- and health-related super-community received disproportionate attention early on during the pandemic, and was leading the discussion at the time. However, as the pandemic unfolded, the attention shifted towards both national elites and political actors, paralleled by the introduction of country-specific containment measures and the growing politicization of the debate. Scientific super-community remained present in the discussion, but experienced less reach and became more isolated within the network. Overall, the emerging network communities are characterized by an increased self-amplification and polarization. This makes it generally harder for information from international health organizations or scientific authorities to directly reach a broad audience through Twitter for prolonged time. These results may have implications for information dissemination along the unfolding of long-term events like epidemic diseases on a world-wide scale.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "VNIR–NIR hyperspectral imaging fusion targeting intraoperative brain cancer detection",
        "link": "https://www.nature.com/articles/s41598-021-99220-0",
        "publication_date": "04 Oct 2021",
        "abstract": "Currently, intraoperative guidance tools used for brain tumor resection assistance during surgery have several limitations. Hyperspectral (HS) imaging is arising as a novel imaging technique that could offer new capabilities to delineate brain tumor tissue in surgical-time. However, the HS acquisition systems have some limitations regarding spatial and spectral resolution depending on the spectral range to be captured. Image fusion techniques combine information from different sensors to obtain an HS cube with improved spatial and spectral resolution. This paper describes the contributions to HS image fusion using two push-broom HS cameras, covering the visual and near-infrared (VNIR) [400–1000 nm] and near-infrared (NIR) [900–1700 nm] spectral ranges, which are integrated into an intraoperative HS acquisition system developed to delineate brain tumor tissue during neurosurgical procedures. Both HS images were registered using intensity-based and feature-based techniques with different geometric transformations to perform the HS image fusion, obtaining an HS cube with wide spectral range [435–1638 nm]. Four HS datasets were captured to verify the image registration and the fusion process. Moreover, segmentation and classification methods were evaluated to compare the performance results between the use of the VNIR and NIR data, independently, with respect to the fused data. The results reveal that the proposed methodology for fusing VNIR–NIR data improves the classification results up to 21% of accuracy with respect to the use of each data modality independently, depending on the targeted classification problem.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Budget constrained machine learning for early prediction of adverse outcomes for COVID-19 patients",
        "link": "https://www.nature.com/articles/s41598-021-98071-z",
        "publication_date": "01 Oct 2021",
        "abstract": "The combination of machine learning (ML) and electronic health records (EHR) data may be able to improve outcomes of hospitalized COVID-19 patients through improved risk stratification and patient outcome prediction. However, in resource constrained environments the clinical utility of such data-driven predictive tools may be limited by the cost or unavailability of certain laboratory tests. We leveraged EHR data to develop an ML-based tool for predicting adverse outcomes that optimizes clinical utility under a given cost structure. We further gained insights into the decision-making process of the ML models through an explainable AI tool. This cohort study was performed using deidentified EHR data from COVID-19 patients from ProMedica Health System in northwest Ohio and southeastern Michigan. We tested the performance of various ML approaches for predicting either increasing ventilatory support or mortality. We performed post hoc analysis to obtain optimal feature sets under various budget constraints. We demonstrate that it is possible to achieve a significant reduction in cost at the expense of a small reduction in predictive performance. For example, when predicting ventilation, it is possible to achieve a 43% reduction in cost with only a 3% reduction in performance. Similarly, when predicting mortality, it is possible to achieve a 50% reduction in cost with only a 1% reduction in performance. This study presents a quick, accurate, and cost-effective method to evaluate risk of deterioration for patients with SARS-CoV-2 infection at the time of clinical evaluation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Statistical uncertainty quantification to augment clinical decision support: a first implementation in sleep medicine",
        "link": "https://www.nature.com/articles/s41746-021-00515-3",
        "publication_date": "30 Sept 2021",
        "abstract": "Machine learning has the potential to change the practice of medicine, particularly in areas that require pattern recognition (e.g. radiology). Although automated classification is unlikely to be perfect, few modern machine learning tools have the ability to assess their own classification confidence to recognize uncertainty that might need human review. Using automated single-channel sleep staging as a first implementation, we demonstrated that uncertainty information (as quantified using Shannon entropy) can be utilized in a “human in the loop” methodology to promote targeted review of uncertain sleep stage classifications on an epoch-by-epoch basis. Across 20 sleep studies, this feedback methodology proved capable of improving scoring agreement with the gold standard over automated scoring alone (average improvement in Cohen’s Kappa of 0.28), in a fraction of the scoring time compared to full manual review (60% reduction). In summary, our uncertainty-based clinician-in-the-loop framework promotes the improvement of medical classification accuracy/confidence in a cost-effective and economically resourceful manner.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluation of JATSdecoder as an automated text extraction tool for statistical results in scientific reports",
        "link": "https://www.nature.com/articles/s41598-021-98782-3",
        "publication_date": "30 Sept 2021",
        "abstract": "The extraction of statistical results in scientific reports is beneficial for checking studies on plausibility and reliability. The R package JATSdecoder supports the application of text mining approaches to scientific reports. Its function get.stats() extracts all reported statistical results from text and recomputes p values for most standard test results. The output can be reduced to results with checkable or computable p values only. In this article, get.stats()’s ability to extract, recompute and check statistical results is compared to that of statcheck, which is an already established tool. A manually coded data set, containing the number of statistically significant results in 49 articles, serves as an initial indicator for get.stats()’s and statcheck’s differing detection rates for statistical results. Further 13,531 PDF files by 10 mayor psychological journals, 18,744 XML documents by Frontiers of Psychology and 23,730 articles related to psychological research and published by PLoS One are scanned for statistical results with both algorithms. get.stats() almost replicates the manually extracted number of significant results in 49 PDF articles. get.stats() outperforms the statcheck functions in identifying statistical results in every included journal and input format. Furthermore, the raw results extracted by get.stats() increase statcheck’s detection rate. JATSdecoder’s function get.stats() is a highly general and reliable tool to extract statistical results from text. It copes with a wide range of textual representations of statistical standard results and recomputes p values for two- and one-sided tests. It facilitates manual and automated checks on consistency and completeness of the reported results within a manuscript.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying individuals with recent COVID-19 through voice classification using deep learning",
        "link": "https://www.nature.com/articles/s41598-021-98742-x",
        "publication_date": "27 Sept 2021",
        "abstract": "Recently deep learning has attained a breakthrough in model accuracy for the classification of images due mainly to convolutional neural networks. In the present study, we attempted to investigate the presence of subclinical voice feature alteration in COVID-19 patients after the recent resolution of disease using deep learning. The study was a prospective study of 76 post COVID-19 patients and 40 healthy individuals. The diagnoses of post COVID-19 patients were based on more than the eighth week after onset of symptoms. Voice samples of an ‘ah’ sound, coughing sound and a polysyllabic sentence were collected and preprocessed to log-mel spectrogram. Transfer learning using the VGG19 pre-trained convolutional neural network was performed with all voice samples. The performance of the model using the polysyllabic sentence yielded the highest classification performance of all models. The coughing sound produced the lowest classification performance while the ability of the monosyllabic ‘ah’ sound to predict the recent COVID-19 fell between the other two vocalizations. The model using the polysyllabic sentence achieved 85% accuracy, 89% sensitivity, and 77% specificity. In conclusion, deep learning is able to detect the subtle change in voice features of COVID-19 patients after recent resolution of the disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence-based image analysis can predict outcome in high-grade serous carcinoma via histology alone",
        "link": "https://www.nature.com/articles/s41598-021-98480-0",
        "publication_date": "27 Sept 2021",
        "abstract": "High-grade extrauterine serous carcinoma (HGSC) is an aggressive tumor with high rates of recurrence, frequent chemotherapy resistance, and overall 5-year survival of less than 50%. Beyond determining and confirming the diagnosis itself, pathologist review of histologic slides provides no prognostic or predictive information, which is in sharp contrast to almost all other carcinoma types. Deep-learning based image analysis has recently been able to predict outcome and/or identify morphology-based representations of underlying molecular alterations in other tumor types, such as colorectal carcinoma, lung carcinoma, breast carcinoma, and melanoma. Using a carefully stratified HGSC patient cohort consisting of women (n = 30) with similar presentations who experienced very different treatment responses (platinum free intervals of either ≤ 6 months or ≥ 18 months), we used whole slide images (WSI, n = 205) to train a convolutional neural network. The neural network was trained, in three steps, to identify morphologic regions (digital biomarkers) that are highly associating with one or the other treatment response group. We tested the classifier using a separate 22 slide test set, and 18/22 slides were correctly classified. We show that a neural network based approach can discriminate extremes in patient response to primary platinum-based chemotherapy with high sensitivity (73%) and specificity (91%). These proof-of-concept results are novel, because for the first time, prospective prognostic information is identified specifically within HGSC tumor morphology.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Robust whole slide image analysis for cervical cancer screening using deep learning",
        "link": "https://www.nature.com/articles/s41467-021-25296-x",
        "publication_date": "24 Sept 2021",
        "abstract": "Computer-assisted diagnosis is key for scaling up cervical cancer screening. However, current recognition algorithms perform poorly on whole slide image (WSI) analysis, fail to generalize for diverse staining and imaging, and show sub-optimal clinical-level verification. Here, we develop a progressive lesion cell recognition method combining low- and high-resolution WSIs to recommend lesion cells and a recurrent neural network-based WSI classification model to evaluate the lesion degree of WSIs. We train and validate our WSI analysis system on 3,545 patient-wise WSIs with 79,911 annotations from multiple hospitals and several imaging instruments. On multi-center independent test sets of 1,170 patient-wise WSIs, we achieve 93.5% Specificity and 95.1% Sensitivity for classifying slides, comparing favourably to the average performance of three independent cytopathologists, and obtain 88.5% true positive rate for highlighting the top 10 lesion cells on 447 positive slides. After deployment, our system recognizes a one giga-pixel WSI in about 1.5 min.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence system reduces false-positive findings in the interpretation of breast ultrasound exams",
        "link": "https://www.nature.com/articles/s41467-021-26023-2",
        "publication_date": "24 Sept 2021",
        "abstract": "Though consistently shown to detect mammographically occult cancers, breast ultrasound has been noted to have high false-positive rates. In this work, we present an AI system that achieves radiologist-level accuracy in identifying breast cancer in ultrasound images. Developed on 288,767 exams, consisting of 5,442,907 B-mode and Color Doppler images, the AI achieves an area under the receiver operating characteristic curve (AUROC) of 0.976 on a test set consisting of 44,755 exams. In a retrospective reader study, the AI achieves a higher AUROC than the average of ten board-certified breast radiologists (AUROC: 0.962 AI, 0.924 ± 0.02 radiologists). With the help of the AI, radiologists decrease their false positive rates by 37.3% and reduce requested biopsies by 27.8%, while maintaining the same level of sensitivity. This highlights the potential of AI in improving the accuracy, consistency, and efficiency of breast ultrasound diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Overcoming barriers to data sharing with medical image generation: a comprehensive evaluation",
        "link": "https://www.nature.com/articles/s41746-021-00507-3",
        "publication_date": "24 Sept 2021",
        "abstract": "Privacy concerns around sharing personally identifiable information are a major barrier to data sharing in medical research. In many cases, researchers have no interest in a particular individual’s information but rather aim to derive insights at the level of cohorts. Here, we utilise generative adversarial networks (GANs) to create medical imaging datasets consisting entirely of synthetic patient data. The synthetic images ideally have, in aggregate, similar statistical properties to those of a source dataset but do not contain sensitive personal information. We assess the quality of synthetic data generated by two GAN models for chest radiographs with 14 radiology findings and brain computed tomography (CT) scans with six types of intracranial haemorrhages. We measure the synthetic image quality by the performance difference of predictive models trained on either the synthetic or the real dataset. We find that synthetic data performance disproportionately benefits from a reduced number of classes. Our benchmark also indicates that at low numbers of samples per class, label overfitting effects start to dominate GAN training. We conducted a reader study in which trained radiologists discriminate between synthetic and real images. In accordance with our benchmark results, the classification accuracy of radiologists improves with an increasing resolution. Our study offers valuable guidelines and outlines practical conditions under which insights derived from synthetic images are similar to those that would have been derived from real data. Our results indicate that synthetic data sharing may be an attractive alternative to sharing real patient-level data in the right setting.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "TSC2-mutant uterine sarcomas with JAZF1-SUZ12 fusions demonstrate hybrid features of endometrial stromal sarcoma and PEComa and are responsive to mTOR inhibition",
        "link": "https://www.nature.com/articles/s41379-021-00922-7",
        "publication_date": "24 Sept 2021",
        "abstract": "Uterine perivascular epithelioid cell tumor (PEComa) is a rare mesenchymal neoplasm that occasionally shares morphologic and immunohistochemical overlap with low- and high-grade endometrial stromal sarcoma (LGESS and HGESS). In this study, we sought to characterize the clinical, morphologic, genetic, and epigenetic features of five uterine sarcomas that display histologic features of LGESS, HGESS, and PEComa. All tumors demonstrated epithelioid cells often associated with a low-grade spindled component resembling LGESS, with both regions expressing CD10, ER, PR, variable HMB45, and Melan-A immunoreactivity, and strong cathepsin K and pS6 expression. Targeted massively parallel sequencing analysis revealed the presence of somatic TSC2 mutations in all five cases, of which four harbored concurrent or consecutive JAZF1-SUZ12 gene fusions. Unsupervised hierarchical clustering analysis of methylation profiles of TSC2-mutant uterine sarcomas (n = 4), LGESS (n = 10), and HGESS (n = 12) demonstrated two clusters consisting of (1) all LGESS and TSC2-mutant uterine sarcomas and (2) all HGESS. KEGG pathway analysis detected methylation differences in genes involved in PI3K/AKT, calcium, and Rap1 signaling. TSC2-mutant uterine sarcomas were responsive to hormone suppression, and mTOR inhibition demonstrated clinical benefit in four patients with these neoplasms. Our results suggest that these tumors represent histologically distinctive LGESS with TSC2 mutations. TSC2 mutations and JAZF1-SUZ12 fusion may help diagnose these tumors and possibly direct effective treatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Combining multi-site magnetic resonance imaging with machine learning predicts survival in pediatric brain tumors",
        "link": "https://www.nature.com/articles/s41598-021-96189-8",
        "publication_date": "23 Sept 2021",
        "abstract": "Brain tumors represent the highest cause of mortality in the pediatric oncological population. Diagnosis is commonly performed with magnetic resonance imaging. Survival biomarkers are challenging to identify due to the relatively low numbers of individual tumor types. 69 children with biopsy-confirmed brain tumors were recruited into this study. All participants had perfusion and diffusion weighted imaging performed at diagnosis. Imaging data were processed using conventional methods, and a Bayesian survival analysis performed. Unsupervised and supervised machine learning were performed with the survival features, to determine novel sub-groups related to survival. Sub-group analysis was undertaken to understand differences in imaging features. Survival analysis showed that a combination of diffusion and perfusion imaging were able to determine two novel sub-groups of brain tumors with different survival characteristics (p < 0.01), which were subsequently classified with high accuracy (98%) by a neural network. Analysis of high-grade tumors showed a marked difference in survival (p = 0.029) between the two clusters with high risk and low risk imaging features. This study has developed a novel model of survival for pediatric brain tumors. Tumor perfusion plays a key role in determining survival and should be considered as a high priority for future imaging protocols.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Risk prediction of clinical adverse outcomes with machine learning in a cohort of critically ill patients with atrial fibrillation",
        "link": "https://www.nature.com/articles/s41598-021-97218-2",
        "publication_date": "23 Sept 2021",
        "abstract": "Critically ill patients affected by atrial fibrillation are at high risk of adverse events: however, the actual risk stratification models for haemorrhagic and thrombotic events are not validated in a critical care setting. With this paper we aimed to identify, adopting topological data analysis, the risk factors for therapeutic failure (in-hospital death or intensive care unit transfer), the in-hospital occurrence of stroke/TIA and major bleeding in a cohort of critically ill patients with pre-existing atrial fibrillation admitted to a stepdown unit; to engineer newer prediction models based on machine learning in the same cohort. We selected all medical patients admitted for critical illness and a history of pre-existing atrial fibrillation in the timeframe 01/01/2002–03/08/2007. All data regarding patients’ medical history, comorbidities, drugs adopted, vital parameters and outcomes (therapeutic failure, stroke/TIA and major bleeding) were acquired from electronic medical records. Risk factors for each outcome were analyzed adopting topological data analysis. Machine learning was used to generate three different predictive models. We were able to identify specific risk factors and to engineer dedicated clinical prediction models for therapeutic failure (AUC: 0.974, 95%CI: 0.934–0.975), stroke/TIA (AUC: 0.931, 95%CI: 0.896–0.940; Brier score: 0.13) and major bleeding (AUC: 0.930:0.911–0.939; Brier score: 0.09) in critically-ill patients, which were able to predict accurately their respective clinical outcomes. Topological data analysis and machine learning techniques represent a concrete viewpoint for the physician to predict the risk at the patients’ level, aiding the selection of the best therapeutic strategy in critically ill patients affected by pre-existing atrial fibrillation.",
        "conclusions": "In critically ill patients with pre-existing AF, the classical risk scores adopted to predict stroke/TIA and MB are not effective and should not be used to guide the therapeutic approach during a hospitalization into such a high level of clinical complexity. Big data analysis with TDA allowed us to identify specific risk factors associated with stroke/TIA and MB in this clinical setting. ML techniques were able to outperform classical risk scores. Moreover, in this paper we have also challenged tools to debug the ML models and understand the classification outputs. We believe this is a seminal step toward the instrumentation of a ML framework compliant with the GDPR-22nd article “right to be informed”.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Analyses of child cardiometabolic phenotype following assisted reproductive technologies using a pragmatic trial emulation approach",
        "link": "https://www.nature.com/articles/s41467-021-25899-4",
        "publication_date": "23 Sept 2021",
        "abstract": "Assisted reproductive technologies (ART) are increasingly used, however little is known about the long-term health of ART-conceived offspring. Weak selection of comparison groups and poorly characterized mechanisms impede current understanding. In a prospective cohort (Growing Up in Singapore Towards healthy Outcomes; GUSTO; Clinical Trials ID: NCT01174875) including 83 ART-conceived and 1095 spontaneously-conceived singletons, we estimate effects of ART on anthropometry, blood pressure, serum metabolic biomarkers, and cord tissue DNA methylation by emulating a pragmatic trial supported by machine learning-based estimators. We find ART-conceived children to be shorter (−0.5 SD [95% CI: −0.7, −0.2]), lighter (−0.6 SD [−0.9, −0.3]) and have lower skinfold thicknesses (e.g. −14% [−24%, −3%] suprailiac), and blood pressure (−3 mmHg [−6, −0.5] systolic) at 6-6.5 years, with no strong differences in metabolic biomarkers. Differences are not explained by parental anthropometry or comorbidities, polygenic risk score, breastfeeding, or illnesses. Our simulations demonstrate ART is strongly associated with lower NECAB3 DNA methylation, with negative control analyses suggesting these estimates are unbiased. However, methylation changes do not appear to mediate observed differences in child phenotype.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Vaginal microbiome as a tool for prediction of chorioamnionitis in preterm labor: a pilot study",
        "link": "https://www.nature.com/articles/s41598-021-98587-4",
        "publication_date": "23 Sept 2021",
        "abstract": "Intra-amniotic infection (IAI) is a major cause of preterm birth with a poor perinatal prognosis. We aimed to determine whether analyzing vaginal microbiota can evaluate the risk of chorioamnionitis (CAM) in preterm labor cases. Vaginal discharge samples were collected from 83 pregnant women admitted for preterm labor. Based on Blanc’s classification, the participants were divided into CAM (stage ≥ II; n = 46) and non-CAM (stage ≤ I; n = 37) groups. The 16S rDNA amplicons (V1–V2) from vaginal samples were sequenced and analyzed. Using a random forest algorithm, the bacterial species associated with CAM were identified, and a predictive CAM (PCAM) scoring method was developed. The α diversity was significantly higher in the CAM than in the non-CAM group (P < 0.001). The area under the curve was 0.849 (95% confidence interval 0.765–0.934) using the PCAM score. Among patients at < 35 weeks of gestation, the PCAM group (n = 22) had a significantly shorter extended gestational period than the non-PCAM group (n = 25; P = 0.022). Multivariate analysis revealed a significant difference in the frequency of developmental disorders in 3-year-old infants (PCAM, 28%, non-PCAM, 4%; P = 0.022). Analyzing vaginal microbiota can evaluate the risk of IAI. Future studies should establish appropriate interventions for IAI high-risk patients to improve perinatal prognosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning-based prediction of early cerebrovascular events after transcatheter aortic valve replacement",
        "link": "https://www.nature.com/articles/s41598-021-98265-5",
        "publication_date": "21 Sept 2021",
        "abstract": "Cerebrovascular events (CVE) are among the most feared complications of transcatheter aortic valve replacement (TAVR). CVE appear difficult to predict due to their multifactorial origin incompletely explained by clinical predictors. We aimed to build a deep learning-based predictive tool for TAVR-related CVE. Integrated clinical and imaging characteristics from consecutive patients enrolled into a prospective TAVR registry were analysed. CVE comprised any strokes and transient ischemic attacks. Predictive variables were selected by recursive feature reduction to train an autoencoder predictive model. Area under the curve (AUC) represented the model’s performance to predict 30-day CVE. Among 2279 patients included between 2007 and 2019, both clinical and imaging data were available in 1492 patients. Median age was 83 years and STS score was 4.6%. Acute (< 24 h) and subacute (day 2–30) CVE occurred in 19 (1.3%) and 36 (2.4%) patients, respectively. The occurrence of CVE was associated with an increased risk of death (HR [95% CI] 2.62 [1.82–3.78]). The constructed predictive model uses less than 107 clinical and imaging variables and has an AUC of 0.79 (0.65–0.93). TAVR-related CVE can be predicted using a deep learning-based predictive algorithm. The model is implemented online for broad usage.",
        "conclusions": "Despite their complex pathophysiology and rarity, TAVR-related CVE can be predicted by using artificial neural networks. The model is implemented online for broad usage (https://www.welcome.alviss.ai/#/cvecalculator). The proposed approach illustrates the potential of artificial intelligence in developing prediction models for multifactorial adverse events such as CVE.",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Patient apprehensions about the use of artificial intelligence in healthcare",
        "link": "https://www.nature.com/articles/s41746-021-00509-1",
        "publication_date": "21 Sept 2021",
        "abstract": "While there is significant enthusiasm in the medical community about the use of artificial intelligence (AI) technologies in healthcare, few research studies have sought to assess patient perspectives on these technologies. We conducted 15 focus groups examining patient views of diverse applications of AI in healthcare. Our results indicate that patients have multiple concerns, including concerns related to the safety of AI, threats to patient choice, potential increases in healthcare costs, data-source bias, and data security. We also found that patient acceptance of AI is contingent on mitigating these possible harms. Our results highlight an array of patient concerns that may limit enthusiasm for applications of AI in healthcare. Proactively addressing these concerns is critical for the flourishing of ethical innovation and ensuring the long-term success of AI applications in healthcare.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Heart failure clinical care analysis uncovers risk reduction opportunities for preserved ejection fraction subtype",
        "link": "https://www.nature.com/articles/s41598-021-97831-1",
        "publication_date": "20 Sept 2021",
        "abstract": "Heart failure (HF) has no cure and, for HF with preserved ejection fraction (HFpEF), no life-extending treatments. Defining the clinical epidemiology of HF could facilitate earlier identification of high-risk individuals. We define the clinical epidemiology of HF subtypes (HFpEF and HF with reduced ejection fraction [HFrEF]), identified among 2.7 million individuals receiving routine clinical care. Differences in patterns and rates of accumulation of comorbidities, frequency of hospitalization, use of specialty care, were defined for each HF subtype. Among 28,156 HF cases, 8322 (30%) were HFpEF and 11,677 (42%) were HFrEF. HFpEF was the more prevalent subtype among older women. 177 Phenotypes differentially associated with HFpEF versus HFrEF. HFrEF was more frequently associated with diagnoses related to ischemic cardiac injury while HFpEF was associated more with non-cardiac comorbidities and HF symptoms. These comorbidity patterns were frequently present 3 years prior to a HFpEF diagnosis. HF subtypes demonstrated distinct patterns of clinical co-morbidities and disease progression. For HFpEF, these comorbidities were often non-cardiac and manifested prior to the onset of a HF diagnosis. Recognizing these comorbidity patterns, along the care continuum, may present a window of opportunity to identify individuals at risk for developing incident HFpEF.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multimetric feature selection for analyzing multicategory outcomes of colorectal cancer: random forest and multinomial logistic regression models",
        "link": "https://www.nature.com/articles/s41374-021-00662-x",
        "publication_date": "18 Sept 2021",
        "abstract": "Colorectal cancer (CRC) is one of the most common cancers worldwide, and a leading cause of cancer deaths. Better classifying multicategory outcomes of CRC with clinical and omic data may help adjust treatment regimens based on individual’s risk. Here, we selected the features that were useful for classifying four-category survival outcome of CRC using the clinical and transcriptomic data, or clinical, transcriptomic, microsatellite instability and selected oncogenic-driver data (all data) of TCGA. We also optimized multimetric feature selection to develop the best multinomial logistic regression (MLR) and random forest (RF) models that had the highest accuracy, precision, recall and F1 score, respectively. We identified 2073 differentially expressed genes of the TCGA RNASeq dataset. MLR overall outperformed RF in the multimetric feature selection. In both RF and MLR models, precision, recall and F1 score increased as the feature number increased and peaked at the feature number of 600–1000, while the models’ accuracy remained stable. The best model was the MLR one with 825 features based on sum of squared coefficients using all data, and attained the best accuracy of 0.855, F1 of 0.738 and precision of 0.832, which were higher than those using clinical and transcriptomic data. The top-ranked features in the MLR model of the best performance using clinical and transcriptomic data were different from those using all data. However, pathologic staging, HBS1L, TSPYL4, and TP53TG3B were the overlapping top-20 ranked features in the best models using clinical and transcriptomic, or all data. Thus, we developed a multimetric feature-selection based MLR model that outperformed RF models in classifying four-category outcome of CRC patients. Interestingly, adding microsatellite instability and oncogenic-driver data to clinical and transcriptomic data improved models’ performances. Precision and recall of tuned algorithms may change significantly as the feature number changes, but accuracy appears not sensitive to these changes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep learning approach for successful big-bubble formation prediction in deep anterior lamellar keratoplasty",
        "link": "https://www.nature.com/articles/s41598-021-98157-8",
        "publication_date": "17 Sept 2021",
        "abstract": "The efficacy of deep learning in predicting successful big-bubble (SBB) formation during deep anterior lamellar keratoplasty (DALK) was evaluated. Medical records of patients undergoing DALK at the University of Cologne, Germany between March 2013 and July 2019 were retrospectively analyzed. Patients were divided into two groups: (1) SBB or (2) failed big-bubble (FBB). Preoperative images of anterior segment optical coherence tomography and corneal biometric values (corneal thickness, corneal curvature, and densitometry) were evaluated. A deep neural network model, Visual Geometry Group-16, was selected to test the validation data, evaluate the model, create a heat map image, and calculate the area under the curve (AUC). This pilot study included 46 patients overall (11 women, 35 men). SBBs were more common in keratoconus eyes (KC eyes) than in corneal opacifications of other etiologies (non KC eyes) (p = 0.006). The AUC was 0.746 (95% confidence interval [CI] 0.603–0.889). The determination success rate was 78.3% (18/23 eyes) (95% CI 56.3–92.5%) for SBB and 69.6% (16/23 eyes) (95% CI 47.1–86.8%) for FBB. This automated system demonstrates the potential of SBB prediction in DALK. Although KC eyes had a higher SBB rate, no other specific findings were found in the corneal biometric data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The antibody response to SARS-CoV-2 infection persists over at least 8 months in symptomatic patients",
        "link": "https://www.nature.com/articles/s43856-021-00032-0",
        "publication_date": "17 Sept 2021",
        "abstract": "Persistence of antibodies to SARS-CoV-2 viral infection may depend on several factors and may be related to the severity of disease or to the different symptoms.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Early outcome detection for COVID-19 patients",
        "link": "https://www.nature.com/articles/s41598-021-97990-1",
        "publication_date": "16 Sept 2021",
        "abstract": "With the outbreak of COVID-19 exerting a strong pressure on hospitals and health facilities, clinical decision support systems based on predictive models can help to effectively improve the management of the pandemic. We present a method for predicting mortality for COVID-19 patients. Starting from a large number of clinical variables, we select six of them with largest predictive power, using a feature selection method based on genetic algorithms and starting from a set of COVID-19 patients from the first wave. The algorithm is designed to reduce the impact of missing values in the set of variables measured, and consider only variables that show good accuracy on validation data. The final predictive model provides accuracy larger than 85% on test data, including a new patient cohort from the second COVID-19 wave, and on patients with imputed missing values. The selected clinical variables are confirmed to be relevant by recent literature on COVID-19.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Optimization of psoriasis assessment system based on patch images",
        "link": "https://www.nature.com/articles/s41598-021-97211-9",
        "publication_date": "13 Sept 2021",
        "abstract": "Psoriasis is a chronic inflammatory skin disease that occurs in various forms throughout the body and is associated with certain conditions such as heart disease, diabetes, and depression. The psoriasis area severity index (PASI) score, a tool used to evaluate the severity of psoriasis, is currently used in clinical trials and clinical research. The determination of severity is based on the subjective judgment of the clinician. Thus, the disease evaluation deviations are induced. Therefore, we propose optimal algorithms that can effectively segment the lesion area and classify the severity. In addition, a new dataset on psoriasis was built, including patch images of erythema and scaling. We performed psoriasis lesion segmentation and classified the disease severity. In addition, we evaluated the best-performing segmentation method and classifier and analyzed features that are highly related to the severity of psoriasis. In conclusion, we presented the optimal techniques for evaluating the severity of psoriasis. Our newly constructed dataset improved the generalization performance of psoriasis diagnosis and evaluation. It proposed an optimal system for specific evaluation indicators of the disease and a quantitative PASI scoring method. The proposed system can help to evaluate the severity of localized psoriasis more accurately.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Utilizing machine learning to improve clinical trial design for acute respiratory distress syndrome",
        "link": "https://www.nature.com/articles/s41746-021-00505-5",
        "publication_date": "09 Sept 2021",
        "abstract": "Heterogeneous patient populations, complex pharmacology and low recruitment rates in the Intensive Care Unit (ICU) have led to the failure of many clinical trials. Recently, machine learning (ML) emerged as a new technology to process and identify big data relationships, enabling a new era in clinical trial design. In this study, we designed a ML model for predictively stratifying acute respiratory distress syndrome (ARDS) patients, ultimately reducing the required number of patients by increasing statistical power through cohort homogeneity. From the Philips eICU Research Institute (eRI) database, no less than 51,555 ARDS patients were extracted. We defined three subpopulations by outcome: (1) rapid death, (2) spontaneous recovery, and (3) long-stay patients. A retrospective univariate analysis identified highly predictive variables for each outcome. All 220 variables were used to determine the most accurate and generalizable model to predict long-stay patients. Multiclass gradient boosting was identified as the best-performing ML model. Whereas alterations in pH, bicarbonate or lactate proved to be strong predictors for rapid death in the univariate analysis, only the multivariate ML model was able to reliably differentiate the disease course of the long-stay outcome population (AUC of 0.77). We demonstrate the feasibility of prospective patient stratification using ML algorithms in the by far largest ARDS cohort reported to date. Our algorithm can identify patients with sufficiently long ARDS episodes to allow time for patients to respond to therapy, increasing statistical power. Further, early enrollment alerts may increase recruitment rate.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automatic detection and monitoring of abnormal skull shape in children with deformational plagiocephaly using deep learning",
        "link": "https://www.nature.com/articles/s41598-021-96821-7",
        "publication_date": "09 Sept 2021",
        "abstract": "Craniofacial anomaly including deformational plagiocephaly as a result of deformities in head and facial bones evolution is a serious health problem in newbies. The impact of such condition on the affected infants is profound from both medical and social viewpoint. Indeed, timely diagnosing through different medical examinations like anthropometric measurements of the skull or even Computer Tomography (CT) image modality followed by a periodical screening and monitoring plays a vital role in treatment phase. In this paper, a classification model for detecting and monitoring deformational plagiocephaly in affected infants is presented. The presented model is based on a deep learning network architecture. The given model achieves high accuracy of 99.01% with other classification parameters. The input to the model are the images captured by commonly used smartphone cameras which waives the requirement to sophisticated medical imaging modalities. The method is deployed into a mobile application which enables the parents/caregivers and non-clinical experts to monitor and report the treatment progress at home.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Assessing outcomes of ear molding therapy by health care providers and convolutional neural network",
        "link": "https://www.nature.com/articles/s41598-021-97310-7",
        "publication_date": "09 Sept 2021",
        "abstract": "Ear molding therapy is a nonsurgical technique to correct certain congenital auricular deformities. While the advantages of nonsurgical treatments over otoplasty are well-described, few studies have assessed aesthetic outcomes. In this study, we compared assessments of outcomes of ear molding therapy for 283 ears by experienced healthcare providers and a previously developed deep learning CNN model. 2D photographs of ears were obtained as a standard of care in our onsite photography studio. Physician assistants (PAs) rated the photographs using a 5-point Likert scale ranging from 1(poor) to 5(excellent) and the CNN assessment was categorical, classifying each photo as either “normal” or “deformed”. On average, the PAs classified 75.6% of photographs as good to excellent outcomes (scores 4 and 5). Similarly, the CNN classified 75.3% of the photographs as normal. The inter-rater agreement between the PAs ranged between 72 and 81%, while there was a 69.6% agreement between the machine model and the inter-rater majority agreement between at least two PAs (i.e., when at least two PAs gave a simultaneous score < 4 or ≥ 4). This study shows that noninvasive ear molding therapy has excellent outcomes in general. In addition, it indicates that with further training and validation, machine learning techniques, like CNN, have the capability to accurately mimic provider assessment while removing the subjectivity of human evaluation making it a robust tool for ear deformity identification and outcome evaluation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence sepsis prediction algorithm learns to say “I don’t know”",
        "link": "https://www.nature.com/articles/s41746-021-00504-6",
        "publication_date": "09 Sept 2021",
        "abstract": "Sepsis is a leading cause of morbidity and mortality worldwide. Early identification of sepsis is important as it allows timely administration of potentially life-saving resuscitation and antimicrobial therapy. We present COMPOSER (COnformal Multidimensional Prediction Of SEpsis Risk), a deep learning model for the early prediction of sepsis, specifically designed to reduce false alarms by detecting unfamiliar patients/situations arising from erroneous data, missingness, distributional shift and data drifts. COMPOSER flags these unfamiliar cases as indeterminate rather than making spurious predictions. Six patient cohorts (515,720 patients) curated from two healthcare systems in the United States across intensive care units (ICU) and emergency departments (ED) were used to train and externally and temporally validate this model. In a sequential prediction setting, COMPOSER achieved a consistently high area under the curve (AUC) (ICU: 0.925–0.953; ED: 0.938–0.945). Out of over 6 million prediction windows roughly 20% and 8% were identified as indeterminate amongst non-septic and septic patients, respectively. COMPOSER provided early warning within a clinically actionable timeframe (ICU: 12.2 [3.2 22.8] and ED: 2.1 [0.8 4.5] hours prior to first antibiotics order) across all six cohorts, thus allowing for identification and prioritization of patients at high risk for sepsis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Utilizing patient-specific 3D printed guides for graft reconstruction in thoracoabdominal aortic repair",
        "link": "https://www.nature.com/articles/s41598-021-97541-8",
        "publication_date": "09 Sept 2021",
        "abstract": "In thoracoabdominal aortic aneurysm repair, repairing the visceral and segmental arteries is challenging. Although there is a pre-hand-sewn and multi-branched graft based on the conventional image-based technique, it has shortcomings in precisely positioning and directing the visceral and segmental arteries. Here, we introduce two new reconstruction techniques using patient-specific 3D-printed graft reconstruction guides: (1) model-based technique that presents the projected aortic graft, visualizing the main aortic body and its major branches and (2) guide-based technique in which the branching vessels in the visualization model are replaced by marking points identifiable by tactile sense. We demonstrate the effectiveness by evaluating conventional and new techniques based on accuracy, marking time requirement, reproducibility, and results of survey to surgeons on the perceived efficiency and efficacy. The graft reconstruction guides cover the segmentation, design, fabrication, post-processing, and clinical application of open surgical repair of thoracoabdominal aneurysm, and proved to be efficient for accurately reconstructing customized grafts.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning detects acute myeloid leukemia and predicts NPM1 mutation status from bone marrow smears",
        "link": "https://www.nature.com/articles/s41375-021-01408-w",
        "publication_date": "08 Sept 2021",
        "abstract": "The evaluation of bone marrow morphology by experienced hematopathologists is essential in the diagnosis of acute myeloid leukemia (AML); however, it suffers from a lack of standardization and inter-observer variability. Deep learning (DL) can process medical image data and provides data-driven class predictions. Here, we apply a multi-step DL approach to automatically segment cells from bone marrow images, distinguish between AML samples and healthy controls with an area under the receiver operating characteristic (AUROC) of 0.9699, and predict the mutation status of Nucleophosmin 1 (NPM1)—one of the most common mutations in AML—with an AUROC of 0.92 using only image data from bone marrow smears. Utilizing occlusion sensitivity maps, we observed so far unreported morphologic cell features such as a pattern of condensed chromatin and perinuclear lightening zones in myeloblasts of NPM1-mutated AML and prominent nucleoli in wild-type NPM1 AML enabling the DL model to provide accurate class predictions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Privacy-first health research with federated learning",
        "link": "https://www.nature.com/articles/s41746-021-00489-2",
        "publication_date": "07 Sept 2021",
        "abstract": "Privacy protection is paramount in conducting health research. However, studies often rely on data stored in a centralized repository, where analysis is done with full access to the sensitive underlying content. Recent advances in federated learning enable building complex machine-learned models that are trained in a distributed fashion. These techniques facilitate the calculation of research study endpoints such that private data never leaves a given device or healthcare system. We show—on a diverse set of single and multi-site health studies—that federated models can achieve similar accuracy, precision, and generalizability, and lead to the same interpretation as standard centralized statistical models while achieving considerably stronger privacy protections and without significantly raising computational costs. This work is the first to apply modern and general federated learning methods that explicitly incorporate differential privacy to clinical and epidemiological research—across a spectrum of units of federation, model architectures, complexity of learning tasks and diseases. As a result, it enables health research participants to remain in control of their data and still contribute to advancing science—aspects that used to be at odds with each other.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of an exosomal gene signature to detect residual disease in dogs with osteosarcoma using a novel xenograft platform and machine learning",
        "link": "https://www.nature.com/articles/s41374-021-00655-w",
        "publication_date": "06 Sept 2021",
        "abstract": "Osteosarcoma has a guarded prognosis. A major hurdle in developing more effective osteosarcoma therapies is the lack of disease-specific biomarkers to predict risk, prognosis, or therapeutic response. Exosomes are secreted extracellular microvesicles emerging as powerful diagnostic tools. However, their clinical application is precluded by challenges in identifying disease-associated cargo from the vastly larger background of normal exosome cargo. We developed a method using canine osteosarcoma in mouse xenografts to distinguish tumor-derived from host-response exosomal messenger RNAs (mRNAs). The model allows for the identification of canine osteosarcoma-specific gene signatures by RNA sequencing and a species-differentiating bioinformatics pipeline. An osteosarcoma-associated signature consisting of five gene transcripts (SKA2, NEU1, PAF1, PSMG2, and NOB1) was validated in dogs with spontaneous osteosarcoma by real-time quantitative reverse transcription PCR (qRT-PCR), while a machine learning model assigned dogs into healthy or disease groups. Serum/plasma exosomes were isolated from 53 dogs in distinct clinical groups (“healthy”, “osteosarcoma”, “other bone tumor”, or “non-neoplastic disease”). Pre-treatment samples from osteosarcoma cases were used as the training set, and a validation set from post-treatment samples was used for testing, classifying as “osteosarcoma detected” or “osteosarcoma-NOT detected”. Dogs in a validation set whose post-treatment samples were classified as “osteosarcoma-NOT detected” had longer remissions, up to 15 months after treatment. In conclusion, we identified a gene signature predictive of molecular remissions with potential applications in the early detection and minimal residual disease settings. These results provide proof of concept for our discovery platform and its utilization in future studies to inform cancer risk, diagnosis, prognosis, and therapeutic response.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Gutenberg Gait Database, a ground reaction force database of level overground walking in healthy individuals",
        "link": "https://www.nature.com/articles/s41597-021-01014-6",
        "publication_date": "02 Sept 2021",
        "abstract": "The Gutenberg Gait Database comprises data of 350 healthy individuals recorded in our laboratory over the past seven years. The database contains ground reaction force (GRF) and center of pressure (COP) data of two consecutive steps measured - by two force plates embedded in the ground - during level overground walking at self-selected walking speed. The database includes participants of varying ages, from 11 to 64 years. For each participant, up to eight gait analysis sessions were recorded, with each session comprising at least eight gait trials. The database provides unprocessed (raw) and processed (ready-to-use) data, including three-dimensional GRF and two-dimensional COP signals during the stance phase. These data records offer new possibilities for future studies on human gait, e.g., the application as a reference set for the analysis of pathological gait patterns, or for automatic classification using machine learning. In the future, the database will be expanded continuously to obtain an even larger and well-balanced database with respect to age, sex, and other gait-specific factors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Delivery mode and perinatal antibiotics influence the predicted metabolic pathways of the gut microbiome",
        "link": "https://www.nature.com/articles/s41598-021-97007-x",
        "publication_date": "01 Sept 2021",
        "abstract": "Delivery mode and perinatal antibiotics influence gut microbiome composition in children. Most microbiome studies have used the sequencing of the bacterial 16S marker gene but have not reported the metabolic function of the gut microbiome, which may mediate biological effects on the host. Here, we used the PICRUSt2 bioinformatics tool to predict the functional profiles of the gut microbiome based on 16S sequencing in two child cohorts. Both Caesarean section and perinatal antibiotics markedly influenced the functional profiles of the gut microbiome at the age of 1 year. In machine learning analysis, bacterial fatty acid, phospholipid, and biotin biosynthesis were the most important pathways that differed according to delivery mode. Proteinogenic amino acid biosynthesis, carbohydrate degradation, pyrimidine deoxyribonucleotide and biotin biosynthesis were the most important pathways differing according to antibiotic exposure. Our study shows that both Caesarean section and perinatal antibiotics markedly influence the predicted metabolic profiles of the gut microbiome at the age of 1 year.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Biocompatibility and patency of a novel titanium vascular anastomotic device in a pig jugular vein",
        "link": "https://www.nature.com/articles/s41598-021-97157-y",
        "publication_date": "01 Sept 2021",
        "abstract": "This study aimed to evaluate the biocompatibility and patency of our newly developed titanium vascular anastomotic device (TVAD) in a pig jugular vein. TVAD was made of commercially pure grade 2 titanium. The patency and anastomotic time were simultaneously confirmed in an ex-vivo system developed by the authors and in vivo using pig jugular veins. Five 8-month-old pigs, with body weights of 50–60 kg, underwent anastomosis of both jugular veins using the device. Graft patency was evaluated for 12 weeks by biplane angiography and sonography. All tissue biopsy samples were analysed by histology. In all 10 cases, the anastomosis was completed in < 5 min. The vessel lumen was not damaged, and the inner vessel wall was completely endothelialised at the anastomotic site. No foreign body reactions were observed at the vessel lumen, vessels, and outer vessel walls by histopathologic analysis. Patency and absence of leakage at the anastomotic site of the follow-up period were confirmed clearly by angiography and sonography. This preliminary animal study proved that our newly developed device is a very promising tool for intima-to-intima contact anastomosis. TVAD can be used as a feasible and safe medical tool for vessel anastomosis.",
        "conclusions": "Through this preliminary animal study, we proved that our newly developed device is a promising tool for intima-to-intima contact anastomosis. The TVAD can be used as a feasible and safe medical tool for vessel anastomosis in the field of vascular surgery and organ transplantation. To support the evidence for the advantages of applying TVAD in vascular anastomosis, further research and clinical investigations should be conducted.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparison of the antiremodeling effects of losartan and mirabegron in a rat model of uremic cardiomyopathy",
        "link": "https://www.nature.com/articles/s41598-021-96815-5",
        "publication_date": "01 Sept 2021",
        "abstract": "Uremic cardiomyopathy is characterized by diastolic dysfunction (DD), left ventricular hypertrophy (LVH), and fibrosis. Angiotensin-II plays a major role in the development of uremic cardiomyopathy via nitro-oxidative and inflammatory mechanisms. In heart failure, the beta-3 adrenergic receptor (β3-AR) is up-regulated and coupled to endothelial nitric oxide synthase (eNOS)-mediated pathways, exerting antiremodeling effects. We aimed to compare the antiremodeling effects of the angiotensin-II receptor blocker losartan and the β3-AR agonist mirabegron in uremic cardiomyopathy. Chronic kidney disease (CKD) was induced by 5/6th nephrectomy in male Wistar rats. Five weeks later, rats were randomized into four groups: (1) sham-operated, (2) CKD, (3) losartan-treated (10 mg/kg/day) CKD, and (4) mirabegron-treated (10 mg/kg/day) CKD groups. At week 13, echocardiographic, histologic, laboratory, qRT-PCR, and Western blot measurements proved the development of uremic cardiomyopathy with DD, LVH, fibrosis, inflammation, and reduced eNOS levels, which were significantly ameliorated by losartan. However, mirabegron showed a tendency to decrease DD and fibrosis; but eNOS expression remained reduced. In uremic cardiomyopathy, β3-AR, sarcoplasmic reticulum ATPase (SERCA), and phospholamban levels did not change irrespective of treatments. Mirabegron reduced the angiotensin-II receptor 1 expression in uremic cardiomyopathy that might explain its mild antiremodeling effects despite the unchanged expression of the β3-AR.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting postoperative pain following root canal treatment by using artificial neural network evaluation",
        "link": "https://www.nature.com/articles/s41598-021-96777-8",
        "publication_date": "26 Aug 2021",
        "abstract": "This study aimed to evaluate the accuracy of back propagation (BP) artificial neural network model for predicting postoperative pain following root canal treatment (RCT). The BP neural network model was developed using MATLAB 7.0 neural network toolbox, and the functional projective relationship was established between the 13 parameters (including the personal, inflammatory reaction, operative procedure factors) and postoperative pain of the patient after RCT. This neural network model was trained and tested based on data from 300 patients who underwent RCT. Among these cases, 210, 45 and 45 were allocated as the training, data validation and test samples, respectively, to assess the accuracy of prediction. In this present study, the accuracy of this BP neural network model was 95.60% for the prediction of postoperative pain following RCT. To conclude, the BP network model could be used to predict postoperative pain following RCT and showed clinical feasibility and application value.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying subtypes of bipolar disorder based on clinical and neurobiological characteristics",
        "link": "https://www.nature.com/articles/s41598-021-96645-5",
        "publication_date": "24 Aug 2021",
        "abstract": "The ability to classify patients with bipolar disorder (BD) is restricted by their heterogeneity, which limits the understanding of their neuropathology. Therefore, we aimed to investigate clinically discernible and neurobiologically distinguishable BD subtypes. T1-weighted and resting-state functional magnetic resonance images of 112 patients with BD were obtained, and patients were segregated according to diagnostic subtype (i.e., types I and II) and clinical patterns, including the number of episodes and hospitalizations and history of suicide and psychosis. For each clinical pattern, fewer and more occurrences subgroups and types I and II were classified through nested cross-validation for robust performance, with minimum redundancy and maximum relevance, in feature selection. To assess the proportion of variance in cognitive performance explained by the neurobiological markers, multiple linear regression between verbal memory and the selected features was conducted. Satisfactory performance (mean accuracy, 73.60%) in classifying patients with a high or low number of episodes was attained through functional connectivity, mostly from default-mode and motor networks. Moreover, these neurobiological markers explained 62% of the variance in verbal memory. The number of episodes is a potentially critical aspect of the neuropathology of BD. Neurobiological markers can help identify BD neuroprogression.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of markers that distinguish adipose tissue and glucose and insulin metabolism using a multi-modal machine learning approach",
        "link": "https://www.nature.com/articles/s41598-021-95688-y",
        "publication_date": "23 Aug 2021",
        "abstract": "The study of metabolomics has improved our knowledge of the biology behind type 2 diabetes and its related metabolic physiology. We aimed to investigate markers of adipose tissue morphology, as well as insulin and glucose metabolism in 53 non-obese male individuals. The participants underwent extensive clinical, biochemical and magnetic resonance imaging phenotyping, and we also investigated non-targeted serum metabolites. We used a multi-modal machine learning approach to evaluate which serum metabolomic compounds predicted markers of glucose and insulin metabolism, adipose tissue morphology and distribution. Fasting glucose was associated with metabolites of intracellular insulin action and beta-cell dysfunction, namely cysteine-s-sulphate and n-acetylgarginine, whereas fasting insulin was predicted by myristoleoylcarnitine, propionylcarnitine and other metabolites of beta-oxidation of fatty acids. OGTT-glucose levels at 30 min were predicted by 7-Hoca, a microbiota derived metabolite, as well as eugenol, a fatty acid. Both insulin clamp and HOMA-IR were predicted by metabolites involved in beta-oxidation of fatty acids and biodegradation of triacylglycerol, namely tartrate and 3-phosphoglycerate, as well as pyruvate, xanthine and liver fat. OGTT glucose area under curve (AUC) and OGTT insulin AUC, was associated with bile acid metabolites, subcutaneous adipocyte cell size, liver fat and fatty chain acids and derivates, such as isovalerylcarnitine. Finally, subcutaneous adipocyte size was associated with long chain fatty acids, markers of sphingolipid metabolism, increasing liver fat and dopamine-sulfate 1. Ectopic liver fat was predicted by methylmalonate, adipocyte cell size, glutathione derived metabolites and fatty chain acids. Ectopic heart fat was predicted visceral fat, gamma-glutamyl tyrosine and 2-acetamidophenol sulfate. Adipocyte cell size, age, alpha-tocopherol and blood pressure were associated with visceral fat. We identified several biomarkers associated with adipose tissue pathophysiology and insulin and glucose metabolism using a multi-modal machine learning approach. Our approach demonstrated the relative importance of serum metabolites and they outperformed traditional clinical and biochemical variables for most endpoints.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Personalized lab test models to quantify disease potentials in healthy individuals",
        "link": "https://www.nature.com/articles/s41591-021-01468-6",
        "publication_date": "23 Aug 2021",
        "abstract": "Standardized lab tests are central for patient evaluation, differential diagnosis and treatment. Interpretation of these data is nevertheless lacking quantitative and personalized metrics. Here we report on the modeling of 2.1 billion lab measurements of 92 different lab tests from 2.8 million adults over a span of 18 years. Following unsupervised filtering of 131 chronic conditions and 5,223 drug–test pairs we performed a virtual survey of lab tests distributions in healthy individuals. Age and sex alone explain less than 10% of the within-normal test variance in 89 out of 92 tests. Personalized models based on patients’ history explain 60% of the variance for 17 tests and over 36% for half of the tests. This allows for systematic stratification of the risk for future abnormal test levels and subsequent emerging disease. Multivariate modeling of within-normal lab tests can be readily implemented as a basis for quantitative patient evaluation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Distribution of diabetic retinopathy in diabetes mellitus patients and its association rules with other eye diseases",
        "link": "https://www.nature.com/articles/s41598-021-96438-w",
        "publication_date": "20 Aug 2021",
        "abstract": "The study aims to explore the distribution characteristics and influencing factors of diabetic retinopathy (DR) in diabetes mellitus (DM) patients and association rules of eye diseases in these patients. Data were obtained from 1284 DM patients at Henan Provincial People’s Hospital. Association rules were employed to calculate the probability of the common occurrence of eye-related diseases in DM patients. A web visualization network diagram was used to display the association rules of the eye-related diseases in DM patients. DR prevalence in people aged < 40 years (≥ 58.5%) was higher than that in those aged 50–60 years (≤ 43.7%). Patients with DM in rural areas were more likely to have DR than those in urban areas (56.2% vs. 35.6%, P < 0.001). DR prevalence in Pingdingshan City (68.4%) was significantly higher than in other cities. The prevalence of DR in patients who had DM for ≥ 5 years was higher than in other groups (P < 0.001). About 33.07% of DM patients had both diabetic maculopathy and DR, and 36.02% had both diabetic maculopathy and cataracts. The number of strong rules in patients ≥ 60 years old was more than those in people under 60 in age, and those in rural areas had more strong rules than those in urban areas. DM patients with one or more eye diseases are at higher risks of other eye diseases than general DM patients. These association rules are affected by factors such as age, region, disease duration, and DR severity.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning approach to dynamic risk modeling of mortality in COVID-19: a UK Biobank study",
        "link": "https://www.nature.com/articles/s41598-021-95136-x",
        "publication_date": "19 Aug 2021",
        "abstract": "The COVID-19 pandemic has created an urgent need for robust, scalable monitoring tools supporting stratification of high-risk patients. This research aims to develop and validate prediction models, using the UK Biobank, to estimate COVID-19 mortality risk in confirmed cases. From the 11,245 participants testing positive for COVID-19, we develop a data-driven random forest classification model with excellent performance (AUC: 0.91), using baseline characteristics, pre-existing conditions, symptoms, and vital signs, such that the score could dynamically assess mortality risk with disease deterioration. We also identify several significant novel predictors of COVID-19 mortality with equivalent or greater predictive value than established high-risk comorbidities, such as detailed anthropometrics and prior acute kidney failure, urinary tract infection, and pneumonias. The model design and feature selection enables utility in outpatient settings. Possible applications include supporting individual-level risk profiling and monitoring disease progression across patients with COVID-19 at-scale, especially in hospital-at-home settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A national assessment of elective cesarean sections in Bangladesh and the need for health literacy and accessibility",
        "link": "https://www.nature.com/articles/s41598-021-96337-0",
        "publication_date": "19 Aug 2021",
        "abstract": "There has been a gradual rise in the number of cesarean sections (CSs) in Bangladesh. The present study identified the cohort of women, who were more likely to opt for an elective CS based on their sociodemographic characteristics, pre-delivery care history, and media exposure, using the Bangladesh Multiple Indicator Cluster Survey-2019. The survey stratification adjusted logistic regression model and interpretable machine learning method of building classification trees were utilized to analyze a sample of 9202 women, alongside district-wise heat maps. One-in-five births (20%) were elective CSs in the 2 years prior to the survey. Women residing in affluent households with educated house-heads, who accessed antenatal care prior to delivery (AOR 4.12; 95% CI 3.06, 5.54) with regular access to media (AOR 1.31; 95% CI 1.10, 1.56) and who owned a mobile phone (AOR 1.25; 95% CI 1.04, 1.50) were more likely to opt for elective CSs, which suggests that health access and health literacy were crucial factors in women’s mode of delivery. Spatial analyses revealed that women living in larger cities had more elective CS deliveries, pointing towards the availability of better health and access to multiple safe delivery options in peripheral areas.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Effects of a large-scale social media advertising campaign on holiday travel and COVID-19 infections: a cluster randomized controlled trial",
        "link": "https://www.nature.com/articles/s41591-021-01487-3",
        "publication_date": "19 Aug 2021",
        "abstract": "During the Coronavirus Disease 2019 (COVID-19) epidemic, many health professionals used social media to promote preventative health behaviors. We conducted a randomized controlled trial of the effect of a Facebook advertising campaign consisting of short videos recorded by doctors and nurses to encourage users to stay at home for the Thanksgiving and Christmas holidays (NCT04644328 and AEARCTR-0006821). We randomly assigned counties to high intensity (n = 410 (386) at Thanksgiving (Christmas)) or low intensity (n = 410 (381)). The intervention was delivered to a large fraction of Facebook subscribers in 75% and 25% of randomly assigned zip codes in high- and low-intensity counties, respectively. In total, 6,998 (6,716) zip codes were included, and 11,954,109 (23,302,290) users were reached at Thanksgiving (Christmas). The first two primary outcomes were holiday travel and fraction leaving home, both measured using mobile phone location data of Facebook users. Average distance traveled in high-intensity counties decreased by −0.993 percentage points (95% confidence interval (CI): –1.616, −0.371; P = 0.002) for the 3 days before each holiday compared to low-intensity counties. The fraction of people who left home on the holiday was not significantly affected (adjusted difference: 0.030; 95% CI: −0.361, 0.420; P = 0.881). The third primary outcome was COVID-19 infections recorded at the zip code level in the 2-week period starting 5 days after the holiday. Infections declined by 3.5% (adjusted 95% CI: −6.2%, −0.7%; P = 0.013) in intervention compared to control zip codes. Social media messages recorded by health professionals before the winter holidays in the United States led to a significant reduction in holiday travel and subsequent COVID-19 infections.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cancer-associated fibroblasts are associated with poor prognosis in solid type of lung adenocarcinoma in a machine learning analysis",
        "link": "https://www.nature.com/articles/s41598-021-96344-1",
        "publication_date": "18 Aug 2021",
        "abstract": "Cancer-associated fibroblasts (CAFs) participate in critical processes in the tumor microenvironment, such as extracellular matrix remodeling, reciprocal signaling interactions with cancer cells and crosstalk with infiltrating inflammatory cells. However, the relationships between CAFs and survival are not well known in lung cancer. The aim of this study was to reveal the correlations of CAFs with survival rates, genetic alterations and immune activities. This study reviewed the histological features of 517 patients with lung adenocarcinoma from The Cancer Genome Atlas (TCGA) database. We performed gene set enrichment analysis (GSEA), network-based analysis and survival analysis based on CAFs in four histological types of lung adenocarcinoma: acinar, papillary, micropapillary and solid. We found four hallmark gene sets, the epithelial-mesenchymal transition, angiogenesis, hypoxia, and inflammatory response gene sets, that were associated with the presence of CAFs. CAFs were associated with tumor proliferation, elevated memory CD4+T cells and high CD274 (encoding PD-L1) expression. In the pathway analyses, CAFs were related to blood vessel remodeling, matrix organization, negative regulation of apoptosis and transforming growth factor-β signaling. In the survival analysis of each histological type, CAFs were associated with poor prognosis in the solid type. These results may contribute to the development of therapeutic strategies against lung adenocarcinoma cases in which CAFs are present.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A simple and fast spectroscopy-based technique for Covid-19 diagnosis",
        "link": "https://www.nature.com/articles/s41598-021-95568-5",
        "publication_date": "18 Aug 2021",
        "abstract": "The coronavirus pandemic, which appeared in Wuhan, China, in December 2019, rapidly spread all over the world in only a few weeks. Faster testing techniques requiring less resources are key in managing the pandemic, either to enable larger scale testing or even just provide developing countries with limited resources, particularly in Africa, means to perform tests to manage the crisis. Here, we report an unprecedented, rapid, reagent-free and easy-to-use screening spectroscopic method for the detection of SARS-CoV-2 on RNA extracts. This method, validated on clinical samples collected from 280 patients with quantitative predictive scores on both positive and negative samples, is based on a multivariate analysis of FTIR spectra of RNA extracts. This technique, in agreement with RT-PCR, achieves 97.8% accuracy, 97% sensitivity and 98.3% specificity while reducing the testing time post RNA extraction from hours to minutes. Furthermore, this technique can be used in several laboratories with limited resources.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluation of focus and deep learning methods for automated image grading and factors influencing image quality in adaptive optics ophthalmoscopy",
        "link": "https://www.nature.com/articles/s41598-021-96068-2",
        "publication_date": "17 Aug 2021",
        "abstract": "Adaptive optics flood illumination ophthalmoscopy (AO-FIO) is an established imaging tool in the investigation of retinal diseases. However, the clinical interpretation of AO-FIO images can be challenging due to varied image quality. Therefore, image quality assessment is essential before interpretation. An image assessment tool will also assist further work on improving the image quality, either during acquisition or post processing. In this paper, we describe, validate and compare two automated image quality assessment methods; the energy of Laplacian focus operator (LAPE; not commonly used but easily implemented) and convolutional neural network (CNN; effective but more complex approach). We also evaluate the effects of subject age, axial length, refractive error, fixation stability, disease status and retinal location on AO-FIO image quality. Based on analysis of 10,250 images of 50 × 50 μm size, at 41 retinal locations, from 50 subjects we demonstrate that CNN slightly outperforms LAPE in image quality assessment. CNN achieves accuracy of 89%, whereas LAPE metric achieves 73% and 80% (for a linear regression and random forest multiclass classifier methods, respectively) compared to ground truth. Furthermore, the retinal location, age and disease are factors that can influence the likelihood of poor image quality.",
        "conclusions": "The development of automated grading systems for AO-FIO image quality are needed to facilitate accurate large volume image-grading of AO-FIO images. The result in this report is based on a robust ground truth grading method as demonstrated by the substantial inter-grader agreement in our simple 3-category manual grading system.CNN performed well when compared with manual grading results, achieving an overall classification accuracy of 89% when tested on a dataset of 5,535 images. Previously published reports on using CNN for classification of normal or mild vs moderate or severe diabetic retinopathy have achieved accuracies in the range of 90%, using large data sets of 80,000 to 120,000 images26, 27. Lam et al. introduced an automatic diabetic retinopathy grading system capable of classifying images based on disease pathologies from four severity levels. Their algorithm achieved 95% evaluation accuracy using 35,000 images with 5 class labels (normal, mild, moderate, severe, end stage)9. The performance of deep learning methods, like the one used in this study, is known to improve with increasing number of images. Therefore, the performance of the proposed CNN can be improved further with increasing the size of AO-FIO datasets.We could not find any report that describes the use of the focus operator (LAPE) as an automated method for image grading. Our results showed that the focus operator applied to 5,535 images obtained a classification performance of 73% (linear regression classification model) and 80% (random forest classifier), which indicates that precision of performance can be improved with the choice of a more complex algorithm to solve the classification problem. However, in both cases obtained results are less accurate than the CNN.The cause of poor image quality in AO-FIO images is mostly associated with the presence of retinal disease, retinal location and age. The quality of AO-FIO images can be degraded by defocus. Further degradation of image quality can occur in diseased eye when defocused light is reflected back from cellular debris or other cells types (e.g. retinal pigment epithelial cells) in the outer retinal layers, thus reducing signal to noise ratio. It is also the case that although photoreceptor cells may appear structurally intact, a loss of function of these cells may impair its wave-guiding properties and this can have a deleterious impact on image sharpness28. Other factors thought to influence the reflectivity of the photoreceptor outer segments include time of day, natural physiological variation within cells, photocurrent dynamics inducing refractive index changes, and the coherence properties of the projected light29,30,31. Additionally, rapid eye movement and wavefront aberrations that have been unaccounted for in the device may also contribute to reductions in image quality, hence presenting significant challenges to the clinical interpretation of AO-FIO images32, 33. For example, Chew et al. have reported exclusion of approximately 40% of images due to image quality in their analyzed data set16. Debellemaniere et al. had to exclude at least one eye from 46.9% of subjects due to poor AO image quality in their study of patients taking hydroxychloroquine without any evidence of maculopathy34. Furthermore, Feng et al. reported that in their study of AO-FIO images of healthy subjects aged 14 to 69, the images from 52.7% were excluded due to image quality35. We showed a similar frequency of images belonging to categories 2 (unacceptable for evaluation), being 50–60% at retinal loci spanning 2° to 6° from the foveal center. Image rejection rate was even higher for retinal loci at 7° and 8° (75%), 9° (95%) from the foveal center (Fig. 3). Further investigation will be required into the robustness of the methods with regard to the number of valid images required in order to make a valid classification.There are a number of limitations in our study. Images taken for the analysis had only a narrow range of retinal disease diagnoses and the imaging was performed by clinicians with varying levels of experience in operating the AO-FIO instrument. Therefore, further evaluation is required in a larger and more diverse cohort of patients. We didn’t measure the intra-individual variation of our manual grading and we didn’t investigate its impact on the quantitative AO-FIO measurements and their repeatability.The proposed AO-FIO image automated grading system could be incorporated into AO-FIO image acquisition software to determine image quality and inform users when acquisition should be repeated or the image interpreted with caution. Similar solutions have already been applied in commercial optical coherence tomography/angiography devices and have been well received.The current limitation of the proposed grading system is its inability to categorize causes of impaired cone visualization; it is unknown whether the poor image quality is due to retinal disease, imaging artifact, or perhaps a combination of both. Retinal pathology is an unlikely explanation in our cohort since patients in both DSM and HCQ groups had only mild structural damage and complete loss of cone photoreceptor cells was not expected. However, further studies are required to distinguish between cone loss due to retinal pathology and inability to resolve cones due to poor image quality. This might increase the applicability of the modality to the evaluation of a range of retinal pathologies. Nevertheless, our proposed methodology at least allows us to reduce the number of images that should be revised by a clinician or researcher to decide if one should proceed with qualitative or quantitative analysis. Following Gale et al.’s recommendation we also suggest correlation between AO-FIO images and other retinal imaging modalities, including optical coherence tomography and fundus autofluorescence, to increase confidence in the AO-FIO results.3,4 AO-FIO is a powerful imaging modality, which also presents its own challenges in data interpretation. Further improvement in automatic image grading methods has the potential to increase the utility of this imaging modality in clinical practice.In summary, we have demonstrated that our CNN classifier outperforms a defocus measurement classifier using the LAPE values (random forest multiclass classifier method and a linear regression) in AO-FIO image quality assessment (accuracy: 89% vs 84% vs 73%). However, further improvement of the algorithm and/or increase in size of the training dataset should be undertaken to achieve a better performance to match results obtained by expert level grader (accuracy: 97%). Retinal location and age are the only parameters that impact on the frequency of poor-quality images. We recommend limiting the collection of AO-FIO images to retinal loci between 2° and 6° from the foveal center to maximize the frequency of obtaining analyzable images.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A particle swarm optimization approach for predicting the number of COVID-19 deaths",
        "link": "https://www.nature.com/articles/s41598-021-96057-5",
        "publication_date": "16 Aug 2021",
        "abstract": "The rapid spread of the COVID-19 pandemic has raised huge concerns about the prospect of a major health disaster that would result in a huge number of deaths. This anxiety was largely fueled by the fact that the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), responsible for the disease, was so far unknown, and therefore an accurate prediction of the number of deaths was particularly difficult. However, this prediction is of the utmost importance for public health authorities to make the most reliable decisions and establish the necessary precautions to protect people’s lives. In this paper, we present an approach for predicting the number of deaths from COVID-19. This approach requires modeling the number of infected cases using a generalized logistic function and using this function for inferring the number of deaths. An estimate of the parameters of the proposed model is obtained using a Particle Swarm Optimization algorithm (PSO) that requires iteratively solving a quadratic programming problem. In addition to the total number of deaths and number of infected cases, the model enables the estimation of the infection fatality rate (IFR). Furthermore, using some mild assumptions, we derive estimates of the number of active cases. The proposed approach was empirically assessed on official data provided by the State of Qatar. The results of our computational study show a good accuracy of the predicted number of deaths.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of radiation pneumonitis after definitive radiotherapy for locally advanced non-small cell lung cancer using multi-region radiomics analysis",
        "link": "https://www.nature.com/articles/s41598-021-95643-x",
        "publication_date": "10 Aug 2021",
        "abstract": "To predict grade ≥ 2 radiation pneumonitis (RP) in patients with locally advanced non-small cell lung cancer (NSCLC) using multi-region radiomics analysis. Data from 77 patients with NSCLC who underwent definitive radiotherapy between 2008 and 2018 were analyzed. Radiomic feature extraction from the whole lung (whole-lung radiomics analysis) and imaging- and dosimetric-based segmentation (multi-region radiomics analysis) were performed. Patients with RP grade ≥ 2 or < 2 were classified. Predictors were selected with least absolute shrinkage and selection operator logistic regression and the model was built with neural network classifiers. A total of 49,383 radiomics features per patient image were extracted from the radiotherapy planning computed tomography. We identified 4 features and 13 radiomics features in the whole-lung and multi-region radiomics analysis for classification, respectively. The accuracy and area under the curve (AUC) without the synthetic minority over-sampling technique (SMOTE) were 60.8%, and 0.62 for whole-lung and 80.1%, and 0.84 for multi-region radiomics analysis. These were improved 1.7% for whole-lung and 2.1% for multi-region radiomics analysis with the SMOTE. The developed multi-region radiomics analysis can help predict grade ≥ 2 RP. The radiomics features in the median- and high-dose regions, and the local intensity roughness and variation were important factors in predicting grade ≥ 2 RP.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Remote smartphone monitoring of Parkinson’s disease and individual response to therapy",
        "link": "https://www.nature.com/articles/s41587-021-00974-9",
        "publication_date": "09 Aug 2021",
        "abstract": "Remote health assessments that gather real-world data (RWD) outside clinic settings require a clear understanding of appropriate methods for data collection, quality assessment, analysis and interpretation. Here we examine the performance and limitations of smartphones in collecting RWD in the remote mPower observational study of Parkinson’s disease (PD). Within the first 6 months of study commencement, 960 participants had enrolled and performed at least five self-administered active PD symptom assessments (speeded tapping, gait/balance, phonation or memory). Task performance, especially speeded tapping, was predictive of self-reported PD status (area under the receiver operating characteristic curve (AUC) = 0.8) and correlated with in-clinic evaluation of disease severity (r = 0.71; P < 1.8 × 10−6) when compared with motor Movement Disorder Society-Unified Parkinson’s Disease Rating Scale (MDS-UPDRS). Although remote assessment requires careful consideration for accurate interpretation of RWD, our results support the use of smartphones and wearables in objective and personalized disease assessments.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]