[
    {
        "title": "Nasopharyngeal microbiota in hospitalized children with Bordetella pertussis and Rhinovirus infection",
        "link": "https://www.nature.com/articles/s41598-021-02322-y",
        "publication_date": "24 Nov 2021",
        "abstract": "Despite great advances in describing Bordetella pertussis infection, the role of the host microbiota in pertussis pathogenesis remains unexplored. Indeed, the microbiota plays important role in defending against bacterial and viral respiratory infections. We investigated the nasopharyngeal microbiota in infants infected by B. pertussis (Bp), Rhinovirus (Rv) and simultaneously by both infectious agents (Bp + Rv). We demonstrated a specific nasopharyngeal microbiome profiles for Bp group, compared to Rv and Bp + Rv groups, and a reduction of microbial richness during coinfection compared to the single infections. The comparison amongst the three groups showed the increase of Alcaligenaceae and Achromobacter in Bp and Moraxellaceae and Moraxella in Rv group. Furthermore, correlation analysis between patients’ features and nasopharyngeal microbiota profile highlighted a link between delivery and feeding modality, antibiotic administration and B. pertussis infection. A model classification demonstrated a microbiota fingerprinting specific of Bp and Rv infections. In conclusion, external factors since the first moments of life contribute to the alteration of nasopharyngeal microbiota, indeed increasing the susceptibility of the host to the pathogens' infections. When the infection is triggered, the presence of infectious agents modifies the microbiota favoring the overgrowth of commensal bacteria that turn in pathobionts, hence contributing to the disease severity.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Feasibility study of portable multi-energy computed tomography with photon-counting detector for preclinical and clinical applications",
        "link": "https://www.nature.com/articles/s41598-021-02210-5",
        "publication_date": "23 Nov 2021",
        "abstract": "In this study, preclinical experiments were performed with an in-house developed prototypal photon-counting detector computed tomography (PCD CT) system. The performance of the system was compared with the conventional energy-integrating detector (EID)-based CT, concerning the basic image quality biomarkers and the respective capacities for material separation. The pre- and the post-contrast axial images of a canine brain captured by the PCD CT and EID CT systems were found to be visually similar. Multi-energy images were acquired using the PCD CT system, and machine learning-based material decomposition was performed to segment the white and gray matters for the first time in soft tissue segmentation. Furthermore, to accommodate clinical applications that require high resolution acquisitions, a small, native, high-resolution (HR) detector was implemented on the PCD CT system, and its performance was evaluated based on animal experiments. The HR acquisition mode improved the spatial resolution and delineation of the fine structures in the canine’s nasal turbinates compared to the standard mode. Clinical applications that rely on high-spatial resolution expectedly will also benefit from this resolution-enhancing function. The results demonstrate the potential impact on the brain tissue segmentation, improved detection of the liver tumors, and capacity to reconstruct high-resolution images both preclinically and clinically.",
        "conclusions": "In this study, preclinical experiments were performed using a prototypal PCD CT system developed in-house to compare its image quality and assess its material separation capability and high-resolution characteristics. The results demonstrated the potential impact of the HR images, the potential of the PCD CT system to enable improved detection of liver tumors, the increase of the utility of CT segmentation for brain imaging studies, and the capacity to acquire preclinical and clinical images.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning approach for the prediction of postpartum hemorrhage in vaginal birth",
        "link": "https://www.nature.com/articles/s41598-021-02198-y",
        "publication_date": "19 Nov 2021",
        "abstract": "Postpartum hemorrhage is the leading cause of maternal morbidity. Clinical prediction of postpartum hemorrhage remains challenging, particularly in the case of a vaginal birth. We studied machine learning models to predict postpartum hemorrhage. Women who underwent vaginal birth at the Tokyo Women Medical University East Center between 1995 and 2020 were included. We used 11 clinical variables to predict a postpartum hemorrhage defined as a blood loss of > 1000 mL. We constructed five machine learning models and a deep learning model consisting of neural networks with two layers after applying the ensemble learning of five machine learning classifiers, namely, logistic regression, a support vector machine, random forest, boosting trees, and decision tree. For an evaluation of the performance, we applied the area under the curve of the receiver operating characteristic (AUC), the accuracy, false positive rate (FPR) and false negative rate (FNR). The importance of each variable was evaluated through a comparison of the feature importance calculated using a Boosted tree. A total of 9,894 patients who underwent vaginal birth were enrolled in the study, including 188 cases (1.9%) with blood loss of > 1000 mL. The best learning model predicted postpartum hemorrhage with an AUC of 0.708, an accuracy of 0.686, FPR of 0.312, and FNR of 0.398. The analysis of the importance of the variables showed that pregnant gestation of labor, the maternal weight upon admission of labor, and the maternal weight before pregnancy were considered to be weighted factors. Machine learning model can predict postpartum hemorrhage during vaginal delivery. Further research should be conducted to analyze appropriate variables and prepare big data, such as hundreds of thousands of cases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A weighted patient network-based framework for predicting chronic diseases using graph neural networks",
        "link": "https://www.nature.com/articles/s41598-021-01964-2",
        "publication_date": "19 Nov 2021",
        "abstract": "Chronic disease prediction is a critical task in healthcare. Existing studies fulfil this requirement by employing machine learning techniques based on patient features, but they suffer from high dimensional data problems and a high level of bias. We propose a framework for predicting chronic disease based on Graph Neural Networks (GNNs) to address these issues. We begin by projecting a patient-disease bipartite graph to create a weighted patient network (WPN) that extracts the latent relationship among patients. We then use GNN-based techniques to build prediction models. These models use features extracted from WPN to create robust patient representations for chronic disease prediction. We compare the output of GNN-based models to machine learning methods by using cardiovascular disease and chronic pulmonary disease. The results show that our framework enhances the accuracy of chronic disease prediction. The model with attention mechanisms achieves an accuracy of 93.49% for cardiovascular disease prediction and 89.15% for chronic pulmonary disease prediction. Furthermore, the visualisation of the last hidden layers of GNN-based models shows the pattern for the two cohorts, demonstrating the discriminative strength of the framework. The proposed framework can help stakeholders improve health management systems for patients at risk of developing chronic diseases and conditions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Remote diagnosis of surgical-site infection using a mobile digital intervention: a randomised controlled trial in emergency surgery patients",
        "link": "https://www.nature.com/articles/s41746-021-00526-0",
        "publication_date": "18 Nov 2021",
        "abstract": "Surgical site infections (SSI) cause substantial morbidity and pose a burden to acute healthcare services after surgery. We aimed to investigate whether a smartphone-delivered wound assessment tool can expedite diagnosis and treatment of SSI after emergency abdominal surgery. This single-blinded randomised control trial (NCT02704897) enroled adult emergency abdominal surgery patients in two tertiary care hospitals. Patients were randomised (1:1) to routine postoperative care or additional access to a smartphone-delivered wound assessment tool for 30-days postoperatively. Patient-reported SSI symptoms and wound photographs were requested on postoperative days 3, 7, and 15. The primary outcome was time-to-diagnosis of SSI (Centers for Disease Control definition). 492 patients were randomised (smartphone intervention: 223; routine care: 269). There was no significant difference in the 30-day SSI rate between trial arms: 21 (9.4%) in smartphone vs 20 (7.4%, p = 0.513) in routine care. Among the smartphone group, 32.3% (n = 72) did not utilise the tool. There was no significant difference in time-to-diagnosis of SSI for patients receiving the intervention (−2.5 days, 95% CI: −6.6−1.6, p = 0.225). However, patients in the smartphone group had 3.7-times higher odds of diagnosis within 7 postoperative days (95% CI: 1.02−13.51, p = 0.043). The smartphone group had significantly reduced community care attendance (OR: 0.57, 95% CI: 0.34−0.94, p = 0.030), similar hospital attendance (OR: 0.76, 95% CI: 0.28−1.96, p = 0.577), and significantly better experiences in accessing care (OR: 2.02, 95% CI: 1.17−3.53, p = 0.013). Smartphone-delivered wound follow-up is feasible following emergency abdominal surgery. This can facilitate triage to the appropriate level of assessment required, allowing earlier postoperative diagnosis of SSI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying subtypes of depression in clinician-annotated text: a retrospective cohort study",
        "link": "https://www.nature.com/articles/s41598-021-01954-4",
        "publication_date": "17 Nov 2021",
        "abstract": "Current criteria for depression are imprecise and do not accurately characterize its distinct clinical presentations. As a result, its diagnosis lacks clinical utility in both treatment and research settings. Data-driven efforts to refine criteria have typically focused on a limited set of symptoms that do not reflect the disorder’s heterogeneity. By contrast, clinicians often write about patients in depth, creating descriptions that may better characterize depression. However, clinical text is not commonly used to this end. Here we show that clinically relevant depressive subtypes can be derived from unstructured electronic health records. Five subtypes were identified amongst 18,314 patients with depression treated at a large mental healthcare provider by using unsupervised machine learning: severe-typical, psychotic, mild-typical, agitated, and anergic-apathetic. Subtypes were used to place patients in groups for validation; groups were found to be associated with future outcomes and characteristics that were consistent with the subtypes. These associations suggest that these categorizations are actionable due to their validity with respect to disease prognosis. Moreover, they were derived with automated techniques that might theoretically be widely implemented, allowing for future analyses in more varied populations and settings. Additional research, especially with respect to treatment response, may prove useful in further evaluation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cancer classification using machine learning and HRV analysis: preliminary evidence from a pilot study",
        "link": "https://www.nature.com/articles/s41598-021-01779-1",
        "publication_date": "16 Nov 2021",
        "abstract": "Most cancer patients exhibit autonomic dysfunction with attenuated heart rate variability (HRV) levels compared to healthy controls. This research aimed to create and evaluate a machine learning (ML) model enabling discrimination between cancer patients and healthy controls based on 5-min-ECG recordings. We selected 12 HRV features based on previous research and compared the results between cancer patients and healthy individuals using Wilcoxon sum-rank test. Recursive Feature Elimination (RFE) identified the top five features, averaged over 5 min and employed them as input to three different ML. Next, we created an ensemble model based on a stacking method that aggregated the predictions from all three base classifiers. All HRV features were significantly different between the two groups. SDNN, RMSSD, pNN50%, HRV triangular index, and SD1 were selected by RFE and used as an input to three different ML. All three base-classifiers performed above chance level, RF being the most efficient with a testing accuracy of 83%. The ensemble model showed a classification accuracy of 86% and an AUC of 0.95. The results obtained by ML algorithms suggest HRV parameters could be a reliable input for differentiating between cancer patients and healthy controls. Results should be interpreted in light of some limitations that call for replication studies with larger sample sizes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence model comparison for risk factor analysis of patent ductus arteriosus in nationwide very low birth weight infants cohort",
        "link": "https://www.nature.com/articles/s41598-021-01640-5",
        "publication_date": "16 Nov 2021",
        "abstract": "Despite the many comorbidities and high mortality rate in preterm infants with patent ductus arteriosus (PDA), therapeutic strategies vary depending on the clinical setting, and most studies of the related risk factors are based on small sample populations. We aimed to compare the performance of artificial intelligence (AI) analysis with that of conventional analysis to identify risk factors associated with symptomatic PDA (sPDA) in very low birth weight infants. This nationwide cohort study included 8369 very low birth weight (VLBW) infants. The participants were divided into an sPDA group and an asymptomatic PDA or spontaneously close PDA (nPDA) group. The sPDA group was further divided into treated and untreated subgroups. A total of 47 perinatal risk factors were collected and analyzed. Multiple logistic regression was used as a standard analytic tool, and five AI algorithms were used to identify the factors associated with sPDA. Combining a large database of risk factors from nationwide registries and AI techniques achieved higher accuracy and better performance of the PDA prediction tasks, and the ensemble methods showed the best performances.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The Framing of machine learning risk prediction models illustrated by evaluation of sepsis in general wards",
        "link": "https://www.nature.com/articles/s41746-021-00529-x",
        "publication_date": "15 Nov 2021",
        "abstract": "Problem framing is critical to developing risk prediction models because all subsequent development work and evaluation takes place within the context of how a problem has been framed and explicit documentation of framing choices makes it easier to compare evaluation metrics between published studies. In this work, we introduce the basic concepts of framing, including prediction windows, observation windows, window shifts and event-triggers for a prediction that strongly affects the risk of clinician fatigue caused by false positives. Building on this, we apply four different framing structures to the same generic dataset, using a sepsis risk prediction model as an example, and evaluate how framing affects model performance and learning. Our results show that an apparently good model with strong evaluation results in both discrimination and calibration is not necessarily clinically usable. Therefore, it is important to assess the results of objective evaluations within the context of more subjective evaluations of how a model is framed.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting 1p/19q co-deletion status from magnetic resonance imaging using deep learning in adult-type diffuse lower-grade gliomas: a discovery and validation study",
        "link": "https://www.nature.com/articles/s41374-021-00692-5",
        "publication_date": "15 Nov 2021",
        "abstract": "Determination of 1p/19q co-deletion status is important for the classification, prognostication, and personalized therapy in diffuse lower-grade gliomas (LGG). We developed and validated a deep learning imaging signature (DLIS) from preoperative magnetic resonance imaging (MRI) for predicting the 1p/19q status in patients with LGG. The DLIS was constructed on a training dataset (n = 330) and validated on both an internal validation dataset (n = 123) and a public TCIA dataset (n = 102). The receiver operating characteristic (ROC) analysis and precision recall curves (PRC) were used to measure the classification performance. The area under ROC curves (AUC) of the DLIS was 0.999 for training dataset, 0.986 for validation dataset, and 0.983 for testing dataset. The F1-score of the prediction model was 0.992 for training dataset, 0.940 for validation dataset, and 0.925 for testing dataset. Our data suggests that DLIS could be used to predict the 1p/19q status from preoperative imaging in patients with LGG. The imaging-based deep learning has the potential to be a noninvasive tool predictive of molecular markers in adult diffuse gliomas.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Quantitative imaging of apoptosis following oncolytic virotherapy by magnetic resonance fingerprinting aided by deep learning",
        "link": "https://www.nature.com/articles/s41551-021-00809-7",
        "publication_date": "11 Nov 2021",
        "abstract": "Non-invasive imaging methods for detecting intratumoural viral spread and host responses to oncolytic virotherapy are either slow, lack specificity or require the use of radioactive or metal-based contrast agents. Here we show that in mice with glioblastoma multiforme, the early apoptotic responses to oncolytic virotherapy (characterized by decreased cytosolic pH and reduced protein synthesis) can be rapidly detected via chemical-exchange-saturation-transfer magnetic resonance fingerprinting (CEST-MRF) aided by deep learning. By leveraging a deep neural network trained with simulated magnetic resonance fingerprints, CEST-MRF can generate quantitative maps of intratumoural pH and of protein and lipid concentrations by selectively labelling the exchangeable amide protons of endogenous proteins and the exchangeable macromolecule protons of lipids, without requiring exogenous contrast agents. We also show that in a healthy volunteer, CEST-MRF yielded molecular parameters that are in good agreement with values from the literature. Deep-learning-aided CEST-MRF may also be amenable to the characterization of host responses to other cancer therapies and to the detection of cardiac and neurological pathologies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Detecting fine and elaborate movements with piezo sensors provides non-invasive access to overlooked behavioral components",
        "link": "https://www.nature.com/articles/s41386-021-01217-w",
        "publication_date": "11 Nov 2021",
        "abstract": "Behavioral phenotyping devices have been successfully used to build ethograms, but many aspects of behavior remain out of reach of available phenotyping systems. We now report on a novel device, which consists in an open-field platform resting on highly sensitive piezoelectric (electromechanical) pressure-sensors, with which we could detect the slightest movements (up to individual heart beats during rest) from freely moving rats and mice. The combination with video recordings and signal analysis based on time-frequency decomposition, clustering, and machine learning algorithms provided non-invasive access to previously overlooked behavioral components. The detection of shaking/shivering provided an original readout of fear, distinct from but complementary to behavioral freezing. Analyzing the dynamics of momentum in locomotion and grooming allowed to identify the signature of gait and neurodevelopmental pathological phenotypes. We believe that this device represents a significant progress and offers new opportunities for the awaited advance of behavioral phenotyping.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Network analysis reveals rare disease signatures across multiple levels of biological organization",
        "link": "https://www.nature.com/articles/s41467-021-26674-1",
        "publication_date": "09 Nov 2021",
        "abstract": "Rare genetic diseases are typically caused by a single gene defect. Despite this clear causal relationship between genotype and phenotype, identifying the pathobiological mechanisms at various levels of biological organization remains a practical and conceptual challenge. Here, we introduce a network approach for evaluating the impact of rare gene defects across biological scales. We construct a multiplex network consisting of over 20 million gene relationships that are organized into 46 network layers spanning six major biological scales between genotype and phenotype. A comprehensive analysis of 3,771 rare diseases reveals distinct phenotypic modules within individual layers. These modules can be exploited to mechanistically dissect the impact of gene defects and accurately predict rare disease gene candidates. Our results show that the disease module formalism can be applied to rare diseases and generalized beyond physical interaction networks. These findings open up new venues to apply network-based tools for cross-scale data integration.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Developing diagnostic assessment of breast lumpectomy tissues using radiomic and optical signatures",
        "link": "https://www.nature.com/articles/s41598-021-01414-z",
        "publication_date": "08 Nov 2021",
        "abstract": "High positive margin rates in oncologic breast-conserving surgery are a pressing clinical problem. Volumetric X-ray scanning is emerging as a powerful ex vivo specimen imaging technique for analyzing resection margins, but X-rays lack contrast between non-malignant and malignant fibrous tissues. In this study, combined micro-CT and wide-field optical image radiomics were developed to classify malignancy of breast cancer tissues, demonstrating that X-ray/optical radiomics improve malignancy classification. Ninety-two standardized features were extracted from co-registered micro-CT and optical spatial frequency domain imaging samples extracted from 54 breast tumors exhibiting seven tissue subtypes confirmed by microscopic histological analysis. Multimodal feature sets improved classification performance versus micro-CT alone when adipose samples were included (AUC = 0.88 vs. 0.90; p-value = 3.65e−11) and excluded, focusing the classification task on exclusively non-malignant fibrous versus malignant tissues (AUC = 0.78 vs. 0.85; p-value = 9.33e−14). Extending the radiomics approach to high-dimensional optical data—termed “optomics” in this study—offers a promising optical image analysis technique for cancer detection. Radiomic feature data and classification source code are publicly available.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A method to estimate probability of disease and vaccine efficacy from clinical trial immunogenicity data",
        "link": "https://www.nature.com/articles/s41541-021-00377-6",
        "publication_date": "04 Nov 2021",
        "abstract": "Vaccine efficacy is often assessed by counting disease cases in a clinical trial. A new quantitative framework proposed here (“PoDBAY,” Probability of Disease Bayesian Analysis), estimates vaccine efficacy (and confidence interval) using immune response biomarker data collected shortly after vaccination. Given a biomarker associated with protection, PoDBAY describes the relationship between biomarker and probability of disease as a sigmoid probability of disease (“PoD”) curve. The PoDBAY framework is illustrated using clinical trial simulations and with data for influenza, zoster, and dengue virus vaccines. The simulations demonstrate that PoDBAY efficacy estimation (which integrates the PoD and biomarker data), can be accurate and more precise than the standard (case-count) estimation, contributing to more sensitive and specific decisions than threshold-based correlate of protection or case-count-based methods. For all three vaccine examples, the PoD fit indicates a substantial association between the biomarkers and protection, and efficacy estimated by PoDBAY from relatively little immunogenicity data is predictive of the standard estimate of efficacy, demonstrating how PoDBAY can provide early assessments of vaccine efficacy. Methods like PoDBAY can help accelerate and economize vaccine development using an immunological predictor of protection. For example, in the current effort against the COVID-19 pandemic it might provide information to help prioritize (rank) candidates both earlier in a trial and earlier in development.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Imaging intact human organs with local resolution of cellular structures using hierarchical phase-contrast tomography",
        "link": "https://www.nature.com/articles/s41592-021-01317-x",
        "publication_date": "04 Nov 2021",
        "abstract": "Imaging intact human organs from the organ to the cellular scale in three dimensions is a goal of biomedical imaging. To meet this challenge, we developed hierarchical phase-contrast tomography (HiP-CT), an X-ray phase propagation technique using the European Synchrotron Radiation Facility (ESRF)’s Extremely Brilliant Source (EBS). The spatial coherence of the ESRF-EBS combined with our beamline equipment, sample preparation and scanning developments enabled us to perform non-destructive, three-dimensional (3D) scans with hierarchically increasing resolution at any location in whole human organs. We applied HiP-CT to image five intact human organ types: brain, lung, heart, kidney and spleen. HiP-CT provided a structural overview of each whole organ followed by multiple higher-resolution volumes of interest, capturing organotypic functional units and certain individual specialized cells within intact human organs. We demonstrate the potential applications of HiP-CT through quantification and morphometry of glomeruli in an intact human kidney and identification of regional changes in the tissue architecture in a lung from a deceased donor with coronavirus disease 2019 (COVID-19).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "data reconstruction"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multiplexed immunofluorescence identifies high stromal CD68+PD-L1+ macrophages as a predictor of improved survival in triple negative breast cancer",
        "link": "https://www.nature.com/articles/s41598-021-01116-6",
        "publication_date": "03 Nov 2021",
        "abstract": "Triple negative breast cancer (TNBC) comprises 10–15% of all breast cancers and has a poor prognosis with a high risk of recurrence within 5 years. PD-L1 is an important biomarker for patient selection for immunotherapy but its cellular expression and co-localization within the tumour immune microenvironment and associated prognostic value is not well defined. We aimed to characterise the phenotypes of immune cells expressing PD-L1 and determine their association with overall survival (OS) and breast cancer-specific survival (BCSS). Using tissue microarrays from a retrospective cohort of TNBC patients from St George Hospital, Sydney (n = 244), multiplexed immunofluorescence (mIF) was used to assess staining for CD3, CD8, CD20, CD68, PD-1, PD-L1, FOXP3 and pan-cytokeratin on the Vectra Polaris™ platform and analysed using QuPath. Cox multivariate analyses showed high CD68+PD-L1+ stromal cell counts were associated with improved prognosis for OS (HR 0.56, 95% CI 0.33–0.95, p = 0.030) and BCSS (HR 0.47, 95% CI 0.25–0.88, p = 0.018) in the whole cohort and in patients receiving chemotherapy, improving incrementally upon the predictive value of PD-L1+ alone for BCSS. These data suggest that CD68+PD-L1+ status can provide clinically useful prognostic information to identify sub-groups of patients with good or poor prognosis and guide treatment decisions in TNBC.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Impact of GAN-based lesion-focused medical image super-resolution on the robustness of radiomic features",
        "link": "https://www.nature.com/articles/s41598-021-00898-z",
        "publication_date": "01 Nov 2021",
        "abstract": "Robust machine learning models based on radiomic features might allow for accurate diagnosis, prognosis, and medical decision-making. Unfortunately, the lack of standardized radiomic feature extraction has hampered their clinical use. Since the radiomic features tend to be affected by low voxel statistics in regions of interest, increasing the sample size would improve their robustness in clinical studies. Therefore, we propose a Generative Adversarial Network (GAN)-based lesion-focused framework for Computed Tomography (CT) image Super-Resolution (SR); for the lesion (i.e., cancer) patch-focused training, we incorporate Spatial Pyramid Pooling (SPP) into GAN-Constrained by the Identical, Residual, and Cycle Learning Ensemble (GAN-CIRCLE). At \\(2\\times \\) SR, the proposed model achieved better perceptual quality with less blurring than the other considered state-of-the-art SR methods, while producing comparable results at \\(4\\times \\) SR. We also evaluated the robustness of our model’s radiomic feature in terms of quantization on a different lung cancer CT dataset using Principal Component Analysis (PCA). Intriguingly, the most important radiomic features in our PCA-based analysis were the most robust features extracted on the GAN-super-resolved images. These achievements pave the way for the application of GAN-based image Super-Resolution techniques for studies of radiomics for robust biomarker discovery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "3D printed biomimetic cochleae and machine learning co-modelling provides clinical informatics for cochlear implant patients",
        "link": "https://www.nature.com/articles/s41467-021-26491-6",
        "publication_date": "29 Oct 2021",
        "abstract": "Cochlear implants restore hearing in patients with severe to profound deafness by delivering electrical stimuli inside the cochlea. Understanding stimulus current spread, and how it correlates to patient-dependent factors, is hampered by the poor accessibility of the inner ear and by the lack of clinically-relevant in vitro, in vivo or in silico models. Here, we present 3D printing-neural network co-modelling for interpreting electric field imaging profiles of cochlear implant patients. With tuneable electro-anatomy, the 3D printed cochleae can replicate clinical scenarios of electric field imaging profiles at the off-stimuli positions. The co-modelling framework demonstrated autonomous and robust predictions of patient profiles or cochlear geometry, unfolded the electro-anatomical factors causing current spread, assisted on-demand printing for implant testing, and inferred patients’ in vivo cochlear tissue resistivity (estimated mean = 6.6 kΩcm). We anticipate our framework will facilitate physical modelling and digital twin innovations for neuromodulation implants.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning-based thin-section MRI reconstruction improves tumour detection and delineation in pre- and post-treatment pituitary adenoma",
        "link": "https://www.nature.com/articles/s41598-021-00558-2",
        "publication_date": "29 Oct 2021",
        "abstract": "Even a tiny functioning pituitary adenoma could cause symptoms; hence, accurate diagnosis and treatment are crucial for management. However, it is difficult to diagnose a small pituitary adenoma using conventional MR sequence. Deep learning-based reconstruction (DLR) using magnetic resonance imaging (MRI) enables high-resolution thin-section imaging with noise reduction. In the present single-institution retrospective study of 201 patients, conducted between August 2019 and October 2020, we compared the performance of 1 mm DLR MRI with that of 3 mm routine MRI, using a combined imaging protocol to detect and delineate pituitary adenoma. Four readers assessed the adenomas in a pairwise fashion, and diagnostic performance and image preferences were compared between inexperienced and experienced readers. The signal-to-noise ratio (SNR) was quantitatively assessed. New detection of adenoma, achieved using 1 mm DLR MRI, was not visualised using 3 mm routine MRI (overall: 6.5% [13/201]). There was no significant difference depending on the experience of the readers in new detections. Readers preferred 1 mm DLR MRI over 3 mm routine MRI (overall superiority 56%) to delineate normal pituitary stalk and gland, with inexperienced readers more preferred 1 mm DLR MRI than experienced readers. The SNR of 1 mm DLR MRI was 1.25-fold higher than that of the 3 mm routine MRI. In conclusion, the 1 mm DLR MRI achieved higher sensitivity in the detection of pituitary adenoma and provided better delineation of normal pituitary gland than 3 mm routine MRI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A computed tomography vertebral segmentation dataset with anatomical variations and multi-vendor scanner data",
        "link": "https://www.nature.com/articles/s41597-021-01060-0",
        "publication_date": "28 Oct 2021",
        "abstract": "With the advent of deep learning algorithms, fully automated radiological image analysis is within reach. In spine imaging, several atlas- and shape-based as well as deep learning segmentation algorithms have been proposed, allowing for subsequent automated analysis of morphology and pathology. The first “Large Scale Vertebrae Segmentation Challenge” (VerSe 2019) showed that these perform well on normal anatomy, but fail in variants not frequently present in the training dataset. Building on that experience, we report on the largely increased VerSe 2020 dataset and results from the second iteration of the VerSe challenge (MICCAI 2020, Lima, Peru). VerSe 2020 comprises annotated spine computed tomography (CT) images from 300 subjects with 4142 fully visualized and annotated vertebrae, collected across multiple centres from four different scanner manufacturers, enriched with cases that exhibit anatomical variants such as enumeration abnormalities (n = 77) and transitional vertebrae (n = 161). Metadata includes vertebral labelling information, voxel-level segmentation masks obtained with a human-machine hybrid algorithm and anatomical ratings, to enable the development and benchmarking of robust and accurate segmentation algorithms.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Disease variant prediction with deep generative models of evolutionary data",
        "link": "https://www.nature.com/articles/s41586-021-04043-8",
        "publication_date": "27 Oct 2021",
        "abstract": "Quantifying the pathogenicity of protein variants in human disease-related genes would have a marked effect on clinical decisions, yet the overwhelming majority (over 98%) of these variants still have unknown consequences1,2,3. In principle, computational methods could support the large-scale interpretation of genetic variants. However, state-of-the-art methods4,5,6,7,8,9,10 have relied on training machine learning models on known disease labels. As these labels are sparse, biased and of variable quality, the resulting models have been considered insufficiently reliable11. Here we propose an approach that leverages deep generative models to predict variant pathogenicity without relying on labels. By modelling the distribution of sequence variation across organisms, we implicitly capture constraints on the protein sequences that maintain fitness. Our model EVE (evolutionary model of variant effect) not only outperforms computational approaches that rely on labelled data but also performs on par with, if not better than, predictions from high-throughput experiments, which are increasingly used as evidence for variant classification12,13,14,15,16. We predict the pathogenicity of more than 36 million variants across 3,219 disease genes and provide evidence for the classification of more than 256,000 variants of unknown significance. Our work suggests that models of evolutionary information can provide valuable independent evidence for variant interpretation that will be widely useful in research and clinical settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical knowledge extraction via sparse embedding regression (KESER) with multi-center large scale electronic health record data",
        "link": "https://www.nature.com/articles/s41746-021-00519-z",
        "publication_date": "27 Oct 2021",
        "abstract": "The increasing availability of electronic health record (EHR) systems has created enormous potential for translational research. However, it is difficult to know all the relevant codes related to a phenotype due to the large number of codes available. Traditional data mining approaches often require the use of patient-level data, which hinders the ability to share data across institutions. In this project, we demonstrate that multi-center large-scale code embeddings can be used to efficiently identify relevant features related to a disease of interest. We constructed large-scale code embeddings for a wide range of codified concepts from EHRs from two large medical centers. We developed knowledge extraction via sparse embedding regression (KESER) for feature selection and integrative network analysis. We evaluated the quality of the code embeddings and assessed the performance of KESER in feature selection for eight diseases. Besides, we developed an integrated clinical knowledge map combining embedding data from both institutions. The features selected by KESER were comprehensive compared to lists of codified data generated by domain experts. Features identified via KESER resulted in comparable performance to those built upon features selected manually or with patient-level data. The knowledge map created using an integrative analysis identified disease-disease and disease-drug pairs more accurately compared to those identified using single institution data. Analysis of code embeddings via KESER can effectively reveal clinical knowledge and infer relatedness among codified concepts. KESER bypasses the need for patient-level data in individual analyses providing a significant advance in enabling multi-center studies using EHR data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Host methylation predicts SARS-CoV-2 infection and clinical outcome",
        "link": "https://www.nature.com/articles/s43856-021-00042-y",
        "publication_date": "26 Oct 2021",
        "abstract": "Since the onset of the SARS-CoV-2 pandemic, most clinical testing has focused on RT-PCR1. Host epigenome manipulation post coronavirus infection2,3,4 suggests that DNA methylation signatures may differentiate patients with SARS-CoV-2 infection from uninfected individuals, and help predict COVID-19 disease severity, even at initial presentation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Risk factors for neonatal encephalopathy in late preterm and term singleton births in a large California birth cohort",
        "link": "https://www.nature.com/articles/s41372-021-01242-z",
        "publication_date": "26 Oct 2021",
        "abstract": "The objective was to investigate maternal and pregnancy characteristics associated with neonatal encephalopathy (NE).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "The impact of recency and adequacy of historical information on sepsis predictions using machine learning",
        "link": "https://www.nature.com/articles/s41598-021-00220-x",
        "publication_date": "21 Oct 2021",
        "abstract": "Sepsis is a major public and global health concern. Every hour of delay in detecting sepsis significantly increases the risk of death, highlighting the importance of accurately predicting sepsis in a timely manner. A growing body of literature has examined developing new or improving the existing machine learning (ML) approaches for timely and accurate predictions of sepsis. This study contributes to this literature by providing clear insights regarding the role of the recency and adequacy of historical information in predicting sepsis using ML. To this end, we implemented a deep learning model using a bidirectional long short-term memory (BiLSTM) algorithm and compared it with six other ML algorithms based on numerous combinations of the prediction horizons (to capture information recency) and observation windows (to capture information adequacy) using different measures of predictive performance. Our results indicated that the BiLSTM algorithm outperforms all other ML algorithms and provides a great separability of the predicted risk of sepsis among septic versus non-septic patients. Moreover, decreasing the prediction horizon (in favor of information recency) always boosts the predictive performance; however, the impact of expanding the observation window (in favor of information adequacy) depends on the prediction horizon and the purpose of prediction. More specifically, when the prediction is responsive to the positive label (i.e., Sepsis), increasing historical data improves the predictive performance when the prediction horizon is short-moderate.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A Poisson binomial-based statistical testing framework for comorbidity discovery across electronic health record datasets",
        "link": "https://www.nature.com/articles/s43588-021-00141-9",
        "publication_date": "21 Oct 2021",
        "abstract": "Discovering the concomitant occurrence of distinct medical conditions in a patient, also known as comorbidities, is a prerequisite for creating patient outcome prediction tools. Current comorbidity discovery applications are designed for small datasets and use stratification to control for confounding variables such as age, sex or ancestry. Stratification lowers false positive rates, but reduces power, as the size of the study cohort is decreased. Here we describe a Poisson binomial-based approach to comorbidity discovery (PBC) designed for big-data applications that circumvents the need for stratification. PBC adjusts for confounding demographic variables on a per-patient basis and models temporal relationships. We benchmark PBC using two datasets to compute comorbidity statistics on 4,623,841 pairs of potentially comorbid medical terms. The results of this computation are provided as a searchable web resource. Compared with current methods, the PBC approach reduces false positive associations while retaining statistical power to discover true comorbidities.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Uncovering of intraspecies macular heterogeneity in cynomolgus monkeys using hybrid machine learning optical coherence tomography image segmentation",
        "link": "https://www.nature.com/articles/s41598-021-99704-z",
        "publication_date": "19 Oct 2021",
        "abstract": "The fovea is a depression in the center of the macula and is the site of the highest visual acuity. Optical coherence tomography (OCT) has contributed considerably in elucidating the pathologic changes in the fovea and is now being considered as an accompanying imaging method in drug development, such as antivascular endothelial growth factor and its safety profiling. Because animal numbers are limited in preclinical studies and automatized image evaluation tools have not yet been routinely employed, essential reference data describing the morphologic variations in macular thickness in laboratory cynomolgus monkeys are sparse to nonexistent. A hybrid machine learning algorithm was applied for automated OCT image processing and measurements of central retina thickness and surface area values. Morphological variations and the effects of sex and geographical origin were determined. Based on our findings, the fovea parameters are specific to the geographic origin. Despite morphological similarities among cynomolgus monkeys, considerable variations in the foveolar contour, even within the same species but from different geographic origins, were found. The results of the reference database show that not only the entire retinal thickness, but also the macular subfields, should be considered when designing preclinical studies and in the interpretation of foveal data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "H3K23/H3K36 hypoacetylation and HDAC1 up-regulation are associated with adverse consequences in obstructive sleep apnea patients",
        "link": "https://www.nature.com/articles/s41598-021-00052-9",
        "publication_date": "19 Oct 2021",
        "abstract": "The aim of this study is to determine the roles of global histone acetylation (Ac)/methylation (me), their modifying enzymes, and gene-specific histone enrichment in obstructive sleep apnea (OSA). Global histone modifications, and their modifying enzyme expressions were assessed in peripheral blood mononuclear cells from 56 patients with OSA and 16 matched subjects with primary snoring (PS). HIF-1α gene promoter-specific H3K36Ac enrichment was assessed in another cohort (28 OSA, 8 PS). Both global histone H3K23Ac and H3K36Ac expressions were decreased in OSA patients versus PS subjects. H3K23Ac expressions were further decreased in OSA patients with prevalent hypertension. HDAC1 expressions were higher in OSA patients, especially in those with excessive daytime sleepiness, and reduced after more than 6 months of continuous positive airway pressure treatment. H3K79me3 expression was increased in those with high C-reactive protein levels. Decreased KDM6B protein expressions were noted in those with a high hypoxic load, and associated with a higher risk for incident cardiovascular events or hypertension. HIF-1α gene promoter-specific H3K36Ac enrichment was decreased in OSA patients versus PS subjects. In vitro intermittent hypoxia with re-oxygenation stimuli resulted in HDAC1 over-expression and HIF-1α gene promoter-specific H3K36Ac under-expression, while HDAC1 inhibitor, SAHA, reversed oxidative stress through inhibiting NOX1. In conclusions, H3K23/H3K36 hypoacetylation is associated with the development of hypertension and disease severity in sleep-disordered breathing patients, probably through up-regulation of HDAC1, while H3K79 hypermethylation is associated with higher risk of cardiovascular diseases, probably through down-regulation of KDM6B.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exome sequencing and analysis of 454,787 UK Biobank participants",
        "link": "https://www.nature.com/articles/s41586-021-04103-z",
        "publication_date": "18 Oct 2021",
        "abstract": "A major goal in human genetics is to use natural variation to understand the phenotypic consequences of altering each protein-coding gene in the genome. Here we used exome sequencing1 to explore protein-altering variants and their consequences in 454,787 participants in the UK Biobank study2. We identified 12 million coding variants, including around 1 million loss-of-function and around 1.8 million deleterious missense variants. When these were tested for association with 3,994 health-related traits, we found 564 genes with trait associations at P ≤ 2.18 × 10−11. Rare variant associations were enriched in loci from genome-wide association studies (GWAS), but most (91%) were independent of common variant signals. We discovered several risk-increasing associations with traits related to liver disease, eye disease and cancer, among others, as well as risk-lowering associations for hypertension (SLC9A3R2), diabetes (MAP3K15, FAM234A) and asthma (SLC27A3). Six genes were associated with brain imaging phenotypes, including two involved in neural development (GBE1, PLD1). Of the signals available and powered for replication in an independent cohort, 81% were confirmed; furthermore, association signals were generally consistent across individuals of European, Asian and African ancestry. We illustrate the ability of exome sequencing to identify gene–trait associations, elucidate gene function and pinpoint effector genes that underlie GWAS signals at scale.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A prehospital diagnostic algorithm for strokes using machine learning: a prospective observational study",
        "link": "https://www.nature.com/articles/s41598-021-99828-2",
        "publication_date": "15 Oct 2021",
        "abstract": "High precision is optimal in prehospital diagnostic algorithms for strokes and large vessel occlusions. We hypothesized that prehospital diagnostic algorithms for strokes and their subcategories using machine learning could have high predictive value. Consecutive adult patients with suspected stroke as per emergency medical service personnel were enrolled in a prospective multicenter observational study in 12 hospitals in Japan. Five diagnostic algorithms using machine learning, including logistic regression, random forest, support vector machine, and eXtreme Gradient Boosting, were evaluated for stroke and subcategories including acute ischemic stroke with/without large vessel occlusions, intracranial hemorrhage, and subarachnoid hemorrhage. Of the 1446 patients in the analysis, 1156 (80%) were randomly included in the training (derivation) cohort and cohorts, and 290 (20%) were included in the test (validation) cohort. In the diagnostic algorithms for strokes using eXtreme Gradient Boosting had the highest diagnostic value (test data, area under the receiver operating curve 0.980). In the diagnostic algorithms for the subcategories using eXtreme Gradient Boosting had a high predictive value (test data, area under the receiver operating curve, acute ischemic stroke with/without large vessel occlusions 0.898/0.882, intracranial hemorrhage 0.866, subarachnoid hemorrhage 0.926). Prehospital diagnostic algorithms using machine learning had high predictive value for strokes and their subcategories.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Estimation of current and post-treatment retinal function in chronic central serous chorioretinopathy using artificial intelligence",
        "link": "https://www.nature.com/articles/s41598-021-99977-4",
        "publication_date": "14 Oct 2021",
        "abstract": "Refined understanding of the association of retinal microstructure with current and future (post-treatment) function in chronic central serous chorioretinopathy (cCSC) may help to identify patients that would benefit most from treatment. In this post-hoc analysis of data from the prospective, randomized PLACE trial (NCT01797861), we aimed to determine the accuracy of AI-based inference of retinal function from retinal morphology in cCSC. Longitudinal spectral-domain optical coherence tomography (SD-OCT) data from 57 eyes of 57 patients from baseline, week 6–8 and month 7–8 post-treatment were segmented using deep-learning software. Fundus-controlled perimetry data were aligned to the SD-OCT data to extract layer thickness and reflectivity values for each test point. Point-wise retinal sensitivity could be inferred with a (leave-one-out) cross-validated mean absolute error (MAE) [95% CI] of 2.93 dB [2.40–3.46] (scenario 1) using random forest regression. With addition of patient-specific baseline data (scenario 2), retinal sensitivity at remaining follow-up visits was estimated even more accurately with a MAE of 1.07 dB [1.06–1.08]. In scenario 3, month 7–8 post-treatment retinal sensitivity was predicted from baseline SD-OCT data with a MAE of 3.38 dB [2.82–3.94]. Our study shows that localized retinal sensitivity can be inferred from retinal structure in cCSC using machine-learning. Especially, prediction of month 7–8 post-treatment sensitivity with consideration of the treatment as explanatory variable constitutes an important step toward personalized treatment decisions in cCSC.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automatic identification of triple negative breast cancer in ultrasonography using a deep convolutional neural network",
        "link": "https://www.nature.com/articles/s41598-021-00018-x",
        "publication_date": "14 Oct 2021",
        "abstract": "Triple negative (TN) breast cancer is a subtype of breast cancer which is difficult for early detection and the prognosis is poor. In this paper, 910 benign and 934 malignant (110 TN and 824 NTN) B-mode breast ultrasound images were collected. A Resnet50 deep convolutional neural network was fine-tuned. The results showed that the averaged area under the receiver operating characteristic curve (AUC) of discriminating malignant from benign ones were 0.9789 (benign vs. TN), 0.9689 (benign vs. NTN). To discriminate TN from NTN breast cancer, the AUC was 0.9000, the accuracy was 88.89%, the sensitivity was 87.5%, and the specificity was 90.00%. It showed that the computer-aided system based on DCNN is expected to be a promising noninvasive clinical tool for ultrasound diagnosis of TN breast cancer.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Effects of government policies on the spread of COVID-19 worldwide",
        "link": "https://www.nature.com/articles/s41598-021-99368-9",
        "publication_date": "14 Oct 2021",
        "abstract": "The outbreak of novel COVID-19 disease elicited a wide range of anti-contagion and economic policies like school closure, income support, contact tracing, and so forth, in the mitigation and suppression of the spread of the SARS-CoV-2 virus. However, a systematic evaluation of these policies has not been made. Here, 17 implemented policies from the Oxford COVID-19 Government Response Tracker dataset employed in 90 countries from December 31, 2019, to August 31, 2020, were analyzed. A Poisson regression model was applied to analyze the relationship between policies and daily confirmed cases using a generalized estimating equations approach. A lag is a fixed time displacement in time series data. With that, lagging (0, 3, 7, 10, and 14 days) was also considered during the analysis since the effects of policies implemented on a given day may affect the number of confirmed cases several days after implementation. The countries were divided into three groups depending on the number of waves of the pandemic observed in each country. Through subgroup analysis, we showed that with and without lagging, contact tracing and containment policies were significant for countries with two waves, while closing, economic, and health policies were significant for countries with three waves. Wave-specific analysis for each wave showed that significant health, economic, and containment policies varied across waves of the pandemic. Emergency investment in healthcare was consistently significant among the three groups of countries, while the Stringency index was significant among all waves of the pandemic. These findings may help in making informed decisions regarding whether, which, or when these policies should be intensified or lifted.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Opposite response of blood vessels in the retina to 6° head-down tilt and long-duration microgravity",
        "link": "https://www.nature.com/articles/s41526-021-00165-5",
        "publication_date": "14 Oct 2021",
        "abstract": "The Spaceflight Associated Neuro-ocular Syndrome (SANS), associated with the headward fluid shifts incurred in microgravity during long-duration missions, remains a high-priority health and performance risk for human space exploration. To help characterize the pathophysiology of SANS, NASA’s VESsel GENeration Analysis (VESGEN) software was used to map and quantify vascular adaptations in the retina before and after 70 days of bed rest at 6-degree Head-Down Tilt (HDT), a well-studied microgravity analog. Results were compared to the retinal vascular response of astronauts following 6-month missions to the International Space Station (ISS). By mixed effects modeling, the trends of vascular response were opposite. Vascular density decreased significantly in the 16 retinas of eight astronauts and in contrast, increased slightly in the ten retinas of five subjects after HDT (although with limited significance). The one astronaut retina diagnosed with SANS displayed the greatest vascular loss. Results suggest that microgravity is a major variable in the retinal mediation of fluid shifts that is not reproduced in this HDT bed rest model.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning identification of specific changes in myeloid cell phenotype during bloodstream infections",
        "link": "https://www.nature.com/articles/s41598-021-99628-8",
        "publication_date": "13 Oct 2021",
        "abstract": "The early identification of bacteremia is critical for ensuring appropriate treatment of nosocomial infections in intensive care unit (ICU) patients. The aim of this study was to use flow cytometric data of myeloid cells as a biomarker of bloodstream infection (BSI). An eight-color antibody panel was used to identify seven monocyte and two dendritic cell subsets. In the learning cohort, immunophenotyping was applied to (1) control subjects, (2) postoperative heart surgery patients, as a model of noninfectious inflammatory responses, and (3) blood culture-positive patients. Of the complex changes in the myeloid cell phenotype, a decrease in myeloid and plasmacytoid dendritic cell numbers, increase in CD14+CD16+ inflammatory monocyte numbers, and upregulation of neutrophils CD64 and CD123 expression were prominent in BSI patients. An extreme gradient boosting (XGBoost) algorithm called the “infection detection and ranging score” (iDAR), ranging from 0 to 100, was developed to identify infection-specific changes in 101 phenotypic variables related to neutrophils, monocytes and dendritic cells. The tenfold cross-validation achieved an area under the receiver operating characteristic (AUROC) of 0.988 (95% CI 0.985–1) for the detection of bacteremic patients. In an out-of-sample, in-house validation, iDAR achieved an AUROC of 0.85 (95% CI 0.71–0.98) in differentiating localized from bloodstream infection and 0.95 (95% CI 0.89–1) in discriminating infected from noninfected ICU patients. In conclusion, a machine learning approach was used to translate the changes in myeloid cell phenotype in response to infection into a score that could identify bacteremia with high specificity in ICU patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning for early discrimination between transient and persistent acute kidney injury in critically ill patients with sepsis",
        "link": "https://www.nature.com/articles/s41598-021-99840-6",
        "publication_date": "12 Oct 2021",
        "abstract": "Acute kidney injury (AKI) is commonly present in critically ill patients with sepsis. Early prediction of short-term reversibility of AKI is beneficial to risk stratification and clinical treatment decision. The study sought to use machine learning methods to discriminate between transient and persistent sepsis-associated AKI. Septic patients who developed AKI within the first 48 h after ICU admission were identified from the Medical Information Mart for Intensive Care III database. AKI was classified as transient or persistent according to the Acute Disease Quality Initiative workgroup consensus. Five prediction models using logistic regression, random forest, support vector machine, artificial neural network and extreme gradient boosting were constructed, and their performance was evaluated by out-of-sample testing. A simplified risk prediction model was also derived based on logistic regression and features selected by machine learning algorithms. A total of 5984 septic patients with AKI were included, 3805 (63.6%) of whom developed persistent AKI. The artificial neural network and logistic regression models achieved the highest area under the receiver operating characteristic curve (AUC) among the five machine learning models (0.76, 95% confidence interval [CI] 0.74–0.78). The simplified 14-variable model showed adequate discrimination, with the AUC being 0.76 (95% CI 0.73–0.78). At the optimal cutoff of 0.63, the sensitivity and specificity of the simplified model were 63% and 76% respectively. In conclusion, a machine learning-based simplified prediction model including routine clinical variables could be used to differentiate between transient and persistent AKI in critically ill septic patients. An easy-to-use risk calculator can promote its widespread application in daily clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Selfie fundus imaging for diabetic retinopathy screening",
        "link": "https://www.nature.com/articles/s41433-021-01804-7",
        "publication_date": "12 Oct 2021",
        "abstract": "Regular screening for retinopathy and timely intervention reduces blindness from diabetes by 90%. Screening is currently dependent on the interpretation of images captured by trained technicians. Inherent barriers of accessibility and affordability with this approach impede widespread success of retinopathy screening programs. Herein, we report our observations on the potential of a novel approach, Selfie Fundus Imaging (SFI), to enhance diabetic retinopathy screening.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Rapid diagnosis of COVID-19 using FT-IR ATR spectroscopy and machine learning",
        "link": "https://www.nature.com/articles/s41598-021-93511-2",
        "publication_date": "11 Oct 2021",
        "abstract": "Early diagnosis of COVID-19 in suspected patients is essential for contagion control and damage reduction strategies. We investigated the applicability of attenuated total reflection (ATR) Fourier transform infrared (FTIR) spectroscopy associated with machine learning in oropharyngeal swab suspension fluid to predict COVID-19 positive samples. The study included samples of 243 patients from two Brazilian States. Samples were transported by using different viral transport mediums (liquid 1 or 2). Clinical COVID-19 diagnosis was performed by the RT-PCR. We built a classification model based on partial least squares (PLS) associated with cosine k-nearest neighbours (KNN). Our analysis led to 84% and 87% sensitivity, 66% and 64% specificity, and 76.9% and 78.4% accuracy for samples of liquids 1 and 2, respectively. Based on this proof-of-concept study, we believe this method could offer a simple, label-free, cost-effective solution for high-throughput screening of suspect patients for COVID-19 in health care centres and emergency departments.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting bloodstream infection outcome using machine learning",
        "link": "https://www.nature.com/articles/s41598-021-99105-2",
        "publication_date": "11 Oct 2021",
        "abstract": "Bloodstream infections (BSI) are a main cause of infectious disease morbidity and mortality worldwide. Early prediction of BSI patients at high risk of poor outcomes is important for earlier decision making and effective patient stratification. We developed electronic medical record-based machine learning models that predict patient outcomes of BSI. The area under the receiver-operating characteristics curve was 0.82 for a full featured inclusive model, and 0.81 for a compact model using only 25 features. Our models were trained using electronic medical records that include demographics, blood tests, and the medical and diagnosis history of 7889 hospitalized patients diagnosed with BSI. Among the implications of this work is implementation of the models as a basis for selective rapid microbiological identification, toward earlier administration of appropriate antibiotic therapy. Additionally, our models may help reduce the development of BSI and its associated adverse health outcomes and complications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Truly privacy-preserving federated analytics for precision medicine with multiparty homomorphic encryption",
        "link": "https://www.nature.com/articles/s41467-021-25972-y",
        "publication_date": "11 Oct 2021",
        "abstract": "Using real-world evidence in biomedical research, an indispensable complement to clinical trials, requires access to large quantities of patient data that are typically held separately by multiple healthcare institutions. We propose FAMHE, a novel federated analytics system that, based on multiparty homomorphic encryption (MHE), enables privacy-preserving analyses of distributed datasets by yielding highly accurate results without revealing any intermediate data. We demonstrate the applicability of FAMHE to essential biomedical analysis tasks, including Kaplan-Meier survival analysis in oncology and genome-wide association studies in medical genetics. Using our system, we accurately and efficiently reproduce two published centralized studies in a federated setting, enabling biomedical insights that are not possible from individual institutions alone. Our work represents a necessary key step towards overcoming the privacy hurdle in enabling multi-centric scientific collaborations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "membership inference"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Nationwide rollout reveals efficacy of epidemic control through digital contact tracing",
        "link": "https://www.nature.com/articles/s41467-021-26144-8",
        "publication_date": "11 Oct 2021",
        "abstract": "Fuelled by epidemiological studies of SARS-CoV-2, contact tracing by mobile phones has been put to use in many countries. Over a year into the pandemic, we lack conclusive evidence on its effectiveness. To address this gap, we used a unique real world contact data set, collected during the rollout of the first Norwegian contact tracing app in the Spring of 2020. Our dataset involves millions of contacts between 12.5% of the adult population, which enabled us to measure the real-world app performance. The technological tracing efficacy was measured at 80%, and we estimated that at least 11.0% of the discovered close contacts could not have been identified by manual contact tracing. Our results also indicated that digital contact tracing can flag individuals with excessive contacts, which can help contain superspreading related outbreaks. The overall effectiveness of digital tracing depends strongly on app uptake, but significant impact can be achieved for moderate uptake numbers. Used as a supplement to manual tracing and other measures, digital tracing can be instrumental in controlling the pandemic. Our findings can thus help informing public health policies in the coming months.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Powered hip exoskeleton improves walking economy in individuals with above-knee amputation",
        "link": "https://www.nature.com/articles/s41591-021-01515-2",
        "publication_date": "11 Oct 2021",
        "abstract": "Above-knee amputation severely reduces the mobility and quality of life of millions of individuals. Walking with available leg prostheses is highly inefficient, and poor walking economy is a major problem limiting mobility. Here we show that an autonomous powered hip exoskeleton assisting the residual limb significantly improves metabolic walking economy by 15.6 ± 2.9% (mean ± s.e.m.; two-tailed paired t-test, P = 0.002) in six individuals with above-knee amputation walking on a treadmill. The observed metabolic cost improvement is equivalent to removing a 12-kg backpack from a nonamputee individual. All participants were able to walk overground with the exoskeleton, including starting and stopping, without notable changes in gait balance or stability. This study shows that assistance of the user’s residual limb with a powered hip exoskeleton is a viable solution for improving amputee walking economy. By significantly reducing the metabolic cost of walking, the proposed hip exoskeleton may have a considerable positive impact on mobility, improving the quality of life of individuals with above-knee amputations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A prospective evaluation of AI-augmented epidemiology to forecast COVID-19 in the USA and Japan",
        "link": "https://www.nature.com/articles/s41746-021-00511-7",
        "publication_date": "08 Oct 2021",
        "abstract": "The COVID-19 pandemic has highlighted the global need for reliable models of disease spread. We propose an AI-augmented forecast modeling framework that provides daily predictions of the expected number of confirmed COVID-19 deaths, cases, and hospitalizations during the following 4 weeks. We present an international, prospective evaluation of our models’ performance across all states and counties in the USA and prefectures in Japan. Nationally, incident mean absolute percentage error (MAPE) for predicting COVID-19 associated deaths during prospective deployment remained consistently <8% (US) and <29% (Japan), while cumulative MAPE remained <2% (US) and <10% (Japan). We show that our models perform well even during periods of considerable change in population behavior, and are robust to demographic differences across different geographic locations. We further demonstrate that our framework provides meaningful explanatory insights with the models accurately adapting to local and national policy interventions. Our framework enables counterfactual simulations, which indicate continuing Non-Pharmaceutical Interventions alongside vaccinations is essential for faster recovery from the pandemic, delaying the application of interventions has a detrimental effect, and allow exploration of the consequences of different vaccination strategies. The COVID-19 pandemic remains a global emergency. In the face of substantial challenges ahead, the approach presented here has the potential to inform critical decisions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of osteoporosis from simple hip radiography using deep learning algorithm",
        "link": "https://www.nature.com/articles/s41598-021-99549-6",
        "publication_date": "07 Oct 2021",
        "abstract": "Despite being the gold standard for diagnosis of osteoporosis, dual-energy X-ray absorptiometry (DXA) could not be widely used as a screening tool for osteoporosis. This study aimed to predict osteoporosis via simple hip radiography using deep learning algorithm. A total of 1001 datasets of proximal femur DXA with matched same-side cropped simple hip bone radiographic images of female patients aged ≥ 55 years were collected. Of these, 504 patients had osteoporosis (T-score ≤ − 2.5), and 497 patients did not have osteoporosis. The 1001 images were randomly divided into three sets: 800 images for the training, 100 images for the validation, and 101 images for the test. Based on VGG16 equipped with nonlocal neural network, we developed a deep neural network (DNN) model. We calculated the confusion matrix and evaluated the accuracy, sensitivity, specificity, positive predictive value (PPV), and negative predictive value (NPV). We drew the receiver operating characteristic (ROC) curve. A gradient-based class activation map (Grad-CAM) overlapping the original image was also used to visualize the model performance. Additionally, we performed external validation using 117 datasets. Our final DNN model showed an overall accuracy of 81.2%, sensitivity of 91.1%, and specificity of 68.9%. The PPV was 78.5%, and the NPV was 86.1%. The area under the ROC curve value was 0.867, indicating a reasonable performance for screening osteoporosis by simple hip radiography. The external validation set confirmed a model performance with an overall accuracy of 71.8% and an AUC value of 0.700. All Grad-CAM results from both internal and external validation sets appropriately matched the proximal femur cortex and trabecular patterns of the radiographs. The DNN model could be considered as one of the useful screening tools for easy prediction of osteoporosis in the real-world clinical setting.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Effect of an anti-adhesion agent on vision-based assessment of cervical adhesions after thyroid surgery: randomized, placebo-controlled trial",
        "link": "https://www.nature.com/articles/s41598-021-97919-8",
        "publication_date": "07 Oct 2021",
        "abstract": "Many patients experience cervical adhesions after thyroid surgery. To date, however, no studies have objectively measured the effects of anti-adhesion agents on cervical adhesion symptoms. This study evaluated the effects of an anti-adhesion agent on cervical adhesions after thyroid surgery, as determined using a system that measures the extent of marker movement objectively. One hundred patients were randomized in a 1:1 ratio to undergo thyroid surgery with or without the anti-adhesion agent Collabarrier. Using specially manufactured recording equipment, the position of the marker on neck skin was measured before surgery, and 2 weeks, 3 months, and 9 months after surgery. Relative change in marker distance, calculated by subtracting the marker position before surgery from the marker positions 2 weeks, 3 months, and 9 months after surgery, differed significantly in the groups of patients who underwent thyroid surgery with and without the anti-adhesion agent (P < 0.05). A novel measuring system can objectively evaluate the effectiveness of a thyroid anti-adhesion agent. The anti-adhesion agent used significantly reduced adhesions compared with the control group. The trial is registered at www.cris.nih.go.kr (KCT0005745; date of registration, 08/01/2021).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "ATR-FTIR spectrum analysis of saliva samples from COVID-19 positive patients",
        "link": "https://www.nature.com/articles/s41598-021-99529-w",
        "publication_date": "07 Oct 2021",
        "abstract": "The coronavirus disease 2019 (COVID-19) is the latest biological hazard for the novel severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). Even though numerous diagnostic tests for SARS-CoV-2 have been proposed, new diagnosis strategies are being developed, looking for less expensive methods to be used as screening. This study aimed to establish salivary vibrational modes analyzed by attenuated total reflection-Fourier transform infrared (ATR-FTIR) spectroscopy to detect COVID-19 biological fingerprints that allow the discrimination between COVID-19 and healthy patients. Clinical dates, laboratories, and saliva samples of COVID-19 patients (N = 255) and healthy persons (N = 1209) were obtained and analyzed through ATR-FTIR spectroscopy. Then, a multivariate linear regression model (MLRM) was developed. The COVID-19 patients showed low SaO2, cough, dyspnea, headache, and fever principally. C-reactive protein, lactate dehydrogenase, fibrinogen, d-dimer, and ferritin were the most important altered laboratory blood tests, which were increased. In addition, changes in amide I and immunoglobulin regions were evidenced in the FTIR spectra analysis, and the MLRM showed clear discrimination between both groups. Specific salivary vibrational modes employing ATR-FTIR spectroscopy were established; moreover, the COVID-19 biological fingerprint in saliva was characterized, allowing the COVID-19 detection using an MLRM, which could be helpful for the development of new diagnostic devices.",
        "conclusions": "The present research established specific salivary vibrational modes employing ATR-FTIR spectroscopy and characterizing the COVID-19 biological fingerprint. These specific spectra can be used to detect possible carriers of the virus or patients who have presented the disease and retain some immunological respect. In any case, it is necessary to analyze and continue investigating the spectra in their different regions to determine their meaning with greater precision.In addition, these spectra have allowed us to identify a suitable region for COVID-19 detection. By performing the MLRM, the number of variables decreased considerably, which would help us think about viable techniques or devices for diagnosing diseases faster and cheaper.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning identifies the independent role of dysplasia in the prediction of response to chemotherapy in AML",
        "link": "https://www.nature.com/articles/s41375-021-01435-7",
        "publication_date": "06 Oct 2021",
        "abstract": "The independent prognostic impact of specific dysplastic features in acute myeloid leukemia (AML) remains controversial and may vary between genomic subtypes. We apply a machine learning framework to dissect the relative contribution of centrally reviewed dysplastic features and oncogenetics in 190 patients with de novo AML treated in ALFA clinical trials. One hundred and thirty-five (71%) patients achieved complete response after the first induction course (CR). Dysgranulopoiesis, dyserythropoiesis and dysmegakaryopoiesis were assessable in 84%, 83% and 63% patients, respectively. Multi-lineage dysplasia was present in 27% of assessable patients. Micromegakaryocytes (q = 0.01), hypolobulated megakaryocytes (q = 0.08) and hyposegmented granulocytes (q = 0.08) were associated with higher ELN-2017 risk. Using a supervised learning algorithm, the relative importance of morphological variables (34%) for the prediction of CR was higher than demographic (5%), clinical (2%), cytogenetic (25%), molecular (29%), and treatment (5%) variables. Though dysplasias had limited predictive impact on survival, a multivariate logistic regression identified the presence of hypolobulated megakaryocytes (p = 0.014) and micromegakaryocytes (p = 0.035) as predicting lower CR rates, independently of monosomy 7 (p = 0.013), TP53 (p = 0.004), and NPM1 mutations (p = 0.025). Assessment of these specific dysmegakarypoiesis traits, for which we identify a transcriptomic signature, may thus guide treatment allocation in AML.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Risk factor assessments of temporomandibular disorders via machine learning",
        "link": "https://www.nature.com/articles/s41598-021-98837-5",
        "publication_date": "05 Oct 2021",
        "abstract": "This study aimed to use artificial intelligence to determine whether biological and psychosocial factors, such as stress, socioeconomic status, and working conditions, were major risk factors for temporomandibular disorders (TMDs). Data were retrieved from the fourth Korea National Health and Nutritional Examination Survey (2009), with information concerning 4744 participants’ TMDs, demographic factors, socioeconomic status, working conditions, and health-related determinants. Based on variable importance observed from the random forest, the top 20 determinants of self-reported TMDs were body mass index (BMI), household income (monthly), sleep (daily), obesity (subjective), health (subjective), working conditions (control, hygiene, respect, risks, and workload), occupation, education, region (metropolitan), residence type (apartment), stress, smoking status, marital status, and sex. The top 20 determinants of temporomandibular disorders determined via a doctor’s diagnosis were BMI, age, household income (monthly), sleep (daily), obesity (subjective), working conditions (control, hygiene, risks, and workload), household income (subjective), subjective health, education, smoking status, residence type (apartment), region (metropolitan), sex, marital status, and allergic rhinitis. This study supports the hypothesis, highlighting the importance of obesity, general health, stress, socioeconomic status, and working conditions in the management of TMDs.",
        "conclusions": "Artificial intelligence provides a decision-support system to predict TMDs and to analyze their determinants. Interventions regarding stress, socioeconomic status, and working conditions are needed for effective management of TMDs.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Right frontal anxiolytic-sensitive EEG ‘theta’ rhythm in the stop-signal task is a theory-based anxiety disorder biomarker",
        "link": "https://www.nature.com/articles/s41598-021-99374-x",
        "publication_date": "05 Oct 2021",
        "abstract": "Psychiatric diagnoses currently rely on a patient’s presenting symptoms or signs, lacking much-needed theory-based biomarkers. Our neuropsychological theory of anxiety, recently supported by human imaging, is founded on a longstanding, reliable, rodent ‘theta’ brain rhythm model of human clinical anxiolytic drug action. We have now developed a human scalp EEG homolog—goal-conflict-specific rhythmicity (GCSR), i.e., EEG rhythmicity specific to a balanced conflict between goals (e.g., approach-avoidance). Critically, GCSR is consistently reduced by different classes of anxiolytic drug and correlates with clinically-relevant trait anxiety scores (STAI-T). Here we show elevated GCSR in student volunteers divided, after testing, on their STAI-T scores into low, medium, and high (typical of clinical anxiety) groups. We then tested anxiety disorder patients (meeting diagnostic criteria) and similar controls recruited separately from the community. The patient group had higher average GCSR than their controls—with a mixture of high and low GCSR that varied with, but cut across, conventional disorder diagnosis. Consequently, GCSR scores should provide the first theoretically-based biomarker that could help diagnose, and so redefine, a psychiatric disorder.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]