[
    {
        "title": "Evaluating generalizability of oncology trial results to real-world patients using machine learning-based trial emulations",
        "link": "https://www.nature.com/articles/s41591-024-03352-5",
        "publication_date": "03 Jan 2025",
        "abstract": "Randomized controlled trials (RCTs) evaluating anti-cancer agents often lack generalizability to real-world oncology patients. Although restrictive eligibility criteria contribute to this issue, the role of selection bias related to prognostic risk remains unclear. In this study, we developed TrialTranslator, a framework designed to systematically evaluate the generalizability of RCTs for oncology therapies. Using a nationwide database of electronic health records from Flatiron Health, this framework emulates RCTs across three prognostic phenotypes identified through machine learning models. We applied this approach to 11 landmark RCTs that investigated anti-cancer regimens considered standard of care for the four most prevalent advanced solid malignancies. Our analyses reveal that patients in low-risk and medium-risk phenotypes exhibit survival times and treatment-associated survival benefits similar to those observed in RCTs. In contrast, high-risk phenotypes show significantly lower survival times and treatment-associated survival benefits compared to RCTs. Our results were corroborated by a comprehensive robustness assessment, including examinations of specific patient subgroups, holdout validation and semi-synthetic data simulation. These findings suggest that the prognostic heterogeneity among real-world oncology patients plays a substantial role in the limited generalizability of RCT results. Machine learning frameworks may facilitate individual patient-level decision support and estimation of real-world treatment benefits to guide trial design.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Analysis and prediction of condylar resorption following orthognathic surgery",
        "link": "https://www.nature.com/articles/s41598-024-81148-w",
        "publication_date": "03 Jan 2025",
        "abstract": "Condylar resorption is a feared complication of orthognathic surgery. This study investigated condylar resorption in a cohort of 200 patients This allowed for a powerful update on incidence and risk factors. 9.5% of patients developed resorption. These patients had on average, 17% volume loss with 3.9 mm ramal height loss and 3.1 mm posterior mandibular displacement. 2% of patients had bilateral resorption. Univariable analysis identified a younger age, a bimaxillary + genioplasty procedure, larger mandibular advancements, upward movements of the distal segment, a higher counterclockwise pitch of the distal segment, smaller preoperative condylar volumes and a higher anterior/posterior lower facial height ratio as risk factors on a patient level. Univariable analysis on a condylar level also identified compressive movements of the ramus and a higher mandibular plane angle as risk factors. Using machine learning for the multivariable analysis, the amount of mandibular advancement was the most important predictor for condylar resorption. There were no differences in preoperative mandibular, ramal or condylar shape between patients with or without resorption. These findings suggest condylar resorption may be more common than thought. Identifying risk factors allows surgical plans to be adjusted to reduce the likelihood of resorption, and patients can be more selectively screened postoperatively.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Employing a low-code machine learning approach to predict in-hospital mortality and length of stay in patients with community-acquired pneumonia",
        "link": "https://www.nature.com/articles/s41598-024-82615-0",
        "publication_date": "02 Jan 2025",
        "abstract": "Community-acquired pneumonia (CAP) is associated with high mortality rates and often results in prolonged hospital stays. The potential of machine learning to enhance prediction accuracy in this context is significant, yet clinicians often lack the programming skills required for effective data mining. This study aimed to assess the effectiveness of a low-code approach for assisting clinicians with data mining for mortality and length of stay (LOS) prediction in patients with CAP. A retrospective study was conducted using a low-code platform and the PyCaret library in Google Colab on data from patients with community-acquired pneumonia (CAP) admitted between January 2013 and December 2021 to two medical facilities. Model performance was assessed using the area under the receiver operating characteristic curve (AUC) for mortality prediction and the R2 score for LOS prediction, with benchmarks set at AUC > 0.9 and R2 > 0.5. The Shapley Additive Explanations (SHAP) method was used for interpreting individual predictions. A total of 669 CAP patients were enrolled in the analysis.Fifteen models were evaluated for mortality prediction, and nineteen models were evaluated for LOS prediction utilizing the PyCaret library. The Light Gradient Boosting Machine model yielded the highest AUC (0.963) for mortality prediction. In predicting LOS, the Extratrees Regressor model achieved the highest R2 score of 0.585. Factors such as the severity of pneumonia and the Charlson Comorbidity Index (CCI) were significant factors influencing mortality. For the LOS, the CCI score, activities of daily living, and social support were significant predictors. The low-code approach enables medical professionals with limited technical expertise to effectively employ data science in their clinical decision-making process. This approach proved to be a valuable tool in the analysis of CAP patient data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Gait-based Parkinson’s disease diagnosis and severity classification using force sensors and machine learning",
        "link": "https://www.nature.com/articles/s41598-024-83357-9",
        "publication_date": "02 Jan 2025",
        "abstract": "A dual-stage model for classifying Parkinson’s disease severity, through a detailed analysis of Gait signals using force sensors and machine learning approaches, is proposed in this study. Parkinson’s disease is the primary neurodegenerative disorder that results in a gradual reduction in motor function. Early detection and monitoring of the disease progression is highly challenging due to the gradual progression of symptoms and the inadequacy of conventional methods in identifying subtle changes in mobility. The proposed dual-stage model utilized a hypertuned Random Forest Tree (RFT) to classify the subjects into PD and non-PD classes at Stage 1 and a hypertuned Ensemble Regressor (ER) to predict the severity of illness at Stage 2. Further, we have implemented the proposed model on the data signals gathered from both feet of 166 participants using Vertical Ground Reaction Force Sensors (VGRF). The dataset comprised 93 persons with Parkinson’s disease and 73 healthy controls. The dataset (imbalance) collected from both feet is passed to the preprocessing phase (for balancing data using the SMOTE method), followed by the feature extraction phase to extract features related to time, frequency, spatial, and temporal features domains that are highly effective for detecting and assigning severity levels of PD. A Recursive Feature Elimination method is also used to select the optimal set of features to improve the model performance. It is acknowledged that the early detection of Parkinson’s disease is contingent upon critical parameters, including stride length, stance duration, swing interval, double limb support, step time, and step length. The crucial evaluation metrics used for evaluating model performance include accuracy, mean absolute error, and root mean square error. The findings indicate that the suggested model significantly surpasses current methodologies. It attained an accuracy of 97.5 ± 2.1%, Sensitivity of 97% ± 2.5%, and average Specificity of 95% ± 2.2% in differentiating between PD and non-PD participants utilizing RFT and evaluated disease severity with an average accuracy of 96.4 ± 2.3%, an average mean absolute error of 0.065 ± 0.024, and a root mean square error of 0.080 ± 0.06. The results indicate that the proposed dual-stage model is exceptionally successful in the early detection and severity assessment of Parkinson’s disease and demonstrates better efficacy than alternative models.",
        "conclusions": "PD is a widespread neurodegenerative disease that causes various movement disorders among subjects. However, the practical and accurate diagnosis of PD requires regular monitoring of PD symptoms. In the past decades, before the introduction of intelligent sensors-based technology, physicians had to examine patient’s neurological and physiological behavior under their supervision in hospitals to diagnose diseases effectively. Such a process of PD diagnosis is very time-consuming and requires regular visits of patients to hospitals. Moreover, introducing smart sensors-based devices offers a new way of monitoring patient’s health symptoms without visiting hospitals. However, sensor-recorded data must be effectively analyzed to get more significant results about patient health. Therefore, effective machine-learning techniques must be applied to these recorded data to get more significant results about patient health.In this direction, this study emphasizes the use of sensor-based technology along with machine learning techniques to monitor PD patients, which reduces regular visits to hospitals and causes the diagnosis of PD at its early stage. Therefore, this study proposes a dual-stage PD diagnosis and severity assessment model using machine learning techniques. Before analysis during the preprocessing stage, the SMOTE technique is used to balance the considered dataset to get the optimized results, followed by future extraction and selection. Highly effective spatiotemporal features have been extracted from the recorded dataset to get more significant results. Further, at Stage 1 of the proposed model classifies the patients into PD and non-PD classes using the hypertuned RFT technique. At Stage 2 of the proposed model, the severity level of PD is assigned using the hypertuned Ensemble Regressor technique. The proposed model has been implemented and evaluated on a sensor-based data set (“Gait in Parkinson’s Disease”) collected from 16 force sensors fitted into the insoles of shoes that capture the subjects walking patterns while wearing them. The computed results prove that the proposed model is significant in classifying subjects into PD and non-PD classes by attaining an average accuracy of 97.5% ± 2.1%, average Sensitivity of 97% ± 2.5%, and average Specificity of 95% ±2.2% at the Stage 1 with the 10-fold CV method. The 95% of Confidence Interval(CI )computed for accuracy is [96.25%, 98.85%], for Sensitivity is [94.5%, 99.5%], and for Specificity is [93.93%, 96.07%]. The results evaluated through statistical analysis demonstrate that the proposed model is highly effective and reliable.Finally, the proposed model assigns severity ratings to the PD patients based on the H&Y rating scale, with an accuracy of 96.4%± 2.3% %, MAE of 065 ± 0.02, and RMSE of 0.080 ± 0.06 at Stage 2. Additionally, the statistical significance of the proposed model at Stage 2 is also evaluated using 95% CI for Accuracy, which is [96.01%, 96.79%]. The results show that the proposed model is highly efficient in classifying and assigning patient severity ratings. Advanced research in this field could improve the reliability and Accuracy of PD diagnosis and its treatment, ultimately improving patient health and quality of life. However, the proposed model is limited only to a specific age group of people due to the unavailability of the dataset, which can be extended to other age groups. Along with that, our model worked with limited features (like stance time, stride length, swing interval double limb support, step time, and step length) that can be further extended with other features such as tremor signal, cognition, and muscle strength that may increase the efficiency and applicability of the model. Additionally, other factors, including Floating Point Operations (FLOPs), number of parameters (Params), latency time, etc., can be considered in the future. Moreover, an advanced data balancing approach could be used to handle data imbalance problems to get more synthetic and generalized results. Further, the proposed model can be extended to deep learning techniques by incorporating additional sensor data, including accelerometers, smartwatches, etc. Additionally, the efficiency of the proposed model can be further improved by incorporating larger and diversified datasets collected in real clinical settings for training and testing the model.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multiparametric MRI along with machine learning predicts prognosis and treatment response in pediatric low-grade glioma",
        "link": "https://www.nature.com/articles/s41467-024-55659-z",
        "publication_date": "02 Jan 2025",
        "abstract": "Pediatric low-grade gliomas (pLGGs) exhibit heterogeneous prognoses and variable responses to treatment, leading to tumor progression and adverse outcomes in cases where complete resection is unachievable. Early prediction of treatment responsiveness and suitability for immunotherapy has the potential to improve clinical management and outcomes. Here, we present a radiogenomic analysis of pLGGs, integrating MRI and RNA sequencing data. We identify three immunologically distinct clusters, with one group characterized by increased immune activity and poorer prognosis, indicating potential benefit from immunotherapies. We develop a radiomic signature that predicts these immune profiles with over 80% accuracy. Furthermore, our clinicoradiomic model predicts progression-free survival and correlates with treatment response. We also identify genetic variants and transcriptomic pathways associated with progression risk, highlighting links to tumor growth and immune response. This radiogenomic study in pLGGs provides a framework for the identification of high-risk patients who may benefit from targeted therapies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning derived retinal pigment score from ophthalmic imaging shows ethnicity is not biology",
        "link": "https://www.nature.com/articles/s41467-024-55198-7",
        "publication_date": "02 Jan 2025",
        "abstract": "Few metrics exist to describe phenotypic diversity within ophthalmic imaging datasets, with researchers often using ethnicity as a surrogate marker for biological variability. We derived a continuous, measured metric, the retinal pigment score (RPS), that quantifies the degree of pigmentation from a colour fundus photograph of the eye. RPS was validated using two large epidemiological studies with demographic and genetic data (UK Biobank and EPIC-Norfolk Study) and reproduced in a Tanzanian, an Australian, and a Chinese dataset. A genome-wide association study (GWAS) of RPS from UK Biobank identified 20 loci with known associations with skin, iris and hair pigmentation, of which eight were replicated in the EPIC-Norfolk cohort. There was a strong association between RPS and ethnicity, however, there was substantial overlap between each ethnicity and the respective distributions of RPS scores. RPS decouples traditional demographic variables from clinical imaging characteristics. RPS may serve as a useful metric to quantify the diversity of the training, validation, and testing datasets used in the development of AI algorithms to ensure adequate inclusion and explainability of the model performance, critical in evaluating all currently deployed AI models. The code to derive RPS is publicly available at: https://github.com/uw-biomedical-ml/retinal-pigmentation-score.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A multitask deep learning model utilizing electrocardiograms for major cardiovascular adverse events prediction",
        "link": "https://www.nature.com/articles/s41746-024-01410-3",
        "publication_date": "02 Jan 2025",
        "abstract": "Deep learning analysis of electrocardiography (ECG) may predict cardiovascular outcomes. We present a novel multi-task deep learning model, the ECG-MACE, which predicts the one-year first-ever major adverse cardiovascular events (MACE) using 2,821,889 standard 12-lead ECGs, including training (n = 984,895), validation (n = 422,061), and test (n = 1,414,933) sets, from Chang Gung Memorial Hospital database in Taiwan. Data from another independent medical center (n = 113,224) was retrieved for external validation. The model’s performance achieves AUROCs of 0.90 for heart failure (HF), 0.85 for myocardial infarction (MI), 0.76 for ischemic stroke (IS), and 0.89 for mortality. Furthermore, it outperforms the Framingham risk score at 5-year MACEs and 10-year mortality prediction. Over 10-year follow-ups, the model-predicted-positive group exhibits significantly higher MACE incidences than the model-predicted-negative group (relative incidence ratio: HF: 15.28; MI: 7.87; IS: 4.74; mortality: 13.18). Using solely ECGs, ECG-MACE effectively predicts one-year events and exhibits long-term anticipation. It provides potential applications in preventive medicine.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Integrative multi-omics analysis reveals the role of toll-like receptor signaling in pancreatic cancer",
        "link": "https://www.nature.com/articles/s41598-024-84062-3",
        "publication_date": "02 Jan 2025",
        "abstract": "As one of the most destructive and invasive cancers, pancreatic cancer exhibits complex tumor heterogeneity, which has been a major challenge for clinicians in terms of patient treatment and prognosis. The toll-like receptor (TLR) pathway is closely related to the immune microenvironment within various cancer tissues. To explore the development pattern of pancreatic cancer and find an ideal biomarker, our research has explored the mechanism of the TLR pathway in pancreatic cancer. We collected single-cell expression data from 57,024 cells and transcriptomic data from 945 pancreatic cancer patients, and conducted a series of analyses at both the single-cell and transcriptomic levels. By calculating the TLR pathway score, we clustered pancreatic cancer patients and conducted a series of analyses including metabolic pathways, immune microenvironment, drug sensitivity and so on. In the process of building prognostic models, we screened 33 core genes related to the prognosis of pancreatic cancer, and combined a series of machine learning algorithms to build the prognosis model of pancreatic cancer. We used single cell sequencing to clarify the complex intrinsic relationship between TLR pathway and pancreatic cancer. The strongest TLR signals were observed in macrophages and endothelial cells. With the occurrence of pancreatic cancer, the TLR signal of various cell types gradually increased, but with the increase of the malignant degree of ductal epithelial cells, the TLR signal gradually weakened. Cluster analysis showed that patients with the most active TLR pathway had severe dysregulation of immune microenvironment and the worst prognosis. Finally, we combined a series of machine learning algorithms to build a pancreatic cancer prognosis model that includes four genes (NT5E, TGFBI, ANLN, and FAM83A). The model showed strong performance in predicting the survival state of pancreatic cancer samples. We explored the important role of TLR pathway in pancreatic cancer and established and validated a new prognosis model for pancreatic cancer based on TLR-related genes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "CHST3, PGBD5, and SLIT2 can be identified as potential genes for the diagnosis and treatment of osteoporosis and sarcopenia",
        "link": "https://www.nature.com/articles/s41598-024-83231-8",
        "publication_date": "02 Jan 2025",
        "abstract": "Osteoporosis and sarcopenia are common diseases in the older. This study aims to use transcriptomics and explore common diagnostic genes of osteoporosis and sarcopenia and predict potentially effective treatment drugs. Three datasets for osteoporosis and sarcopenia were downloaded from the GEO database, and transcriptome sequencing was performed on clinical samples. A total of 23 differentially expressed genes (DEGs) were selected using the LIMMA, WGCNA, and the DEseq2 package. Three machine learning methods were employed to determine the final common diagnostic genes for the diseases. Receiver operating characteristic (ROC) curves were used to evaluate the predictive performance of genes. Single-gene enrichment analysis (GSEA), immune infiltration abundance calculation, and related metabolic analysis were used to study the pathogenesis of the two diseases. Finally, the CMap database was used to predict potential therapeutic drugs for the diseases, and further validation was conducted through RT-PCR and WB. Three genes for the diseases CHST3, PGBD5, and SLIT2 were identified, showing good predictive performance in both internal and external validations. GSEA analysis revealed that genes were enriched primarily in pathways related to cell cycle regulation, fatty acid metabolism, DNA replication, and carbohydrate synthesis. CHST3 and SLIT2 were involved in the immune response, but PGBD5 seemed unrelated to the immune response. Potential therapeutic drugs were predicted, and the RT-PCR, WB results further validated our hypotheses. CHST3, PGBD5, and SLIT2 can serve as potential genes for the diagnosis and treatment of osteoporosis and sarcopenia; furthermore, these results provide new clues for further experimental research and treatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "AI-based visualization of loose connective tissue as a dissectable layer in gastrointestinal surgery",
        "link": "https://www.nature.com/articles/s41598-024-84044-5",
        "publication_date": "02 Jan 2025",
        "abstract": "We aimed to develop an AI model that recognizes and displays loose connective tissue as a dissectable layer in real-time during gastrointestinal surgery and to evaluate its performance, including feasibility for clinical application. Training data were created under the supervision of gastrointestinal surgeons. Test images and videos were randomly sampled and model performance was evaluated visually by 10 external gastrointestinal surgeons. The mean Dice coefficient of the 50 images was 0.46. The AI model could detect at least 75% of the loose connective tissue in 91.8% of the images (459/500 responses). False positives were found for 52.6% of the images, but most were not judged significant enough to affect surgical judgment. When comparing the surgeon’s annotation with the AI prediction image, 5 surgeons judged the AI image was closer to their own recognition. When viewing the AI video and raw video side-by-side, surgeons judged that in 99% of the AI videos, visualization was improved and stress levels were acceptable when viewing the AI prediction display. The AI model developed demonstrated performance at a level approaching that of a gastrointestinal surgeon. Such visualization of a safe dissectable layer may help to reduce intraoperative recognition errors and surgical complications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Patella height ratios diagnose the same healthy knees differently",
        "link": "https://www.nature.com/articles/s41598-024-83663-2",
        "publication_date": "02 Jan 2025",
        "abstract": "Our study aims to investigate if the ratios proposed by Insall-Salvati and Caton-Deschamps follow the theory of normal distribution levels in a healthy population. 434 skeletal mature, healthy knees were obtained from a CT-scan-based modelling system (SOMA). Patellae height ratios were measured using the Insall-Salvati ratio and the Caton-Deschamps index. The patella height ratios of the sample population were plotted on a quantile plot and diagnosed as patella alta, baja or normal using the original ratio definitions. The study population patella height values at the 95th, 98th and 5th centiles were identified and compared to those described as alta or baja by Insall-Salvati and Caton-Deschamps. This meant that if the patient had patella alta, this would be defined as a ratio of ≥ 1.2 and hypothesised that this would align at the 98th centile of the study population, whilst if diagnosed as patella baja (≤ 0.74), this should align at the 5th centile of the population. The inter-rater reliability of both ratios was calculated using kappa statistics. Two authors made all calculations and compared them for consistency using the intraclass correlation coefficient. For the Insall-Salvati ratio, the study population’s value at the 98th centile was equivalent to what Insall-Salvati describes as alta, a ratio of ≥ 1.2. In the study population, patients are overdiagnosed if using the Insall-Salvati ratio as patella baja ≤ 0.74, as the value at the 5th centile in the study population was 0.59. Using the Caton-Deschamps index, the 95th centile was 1.3, higher than the patella alta ratio determined by Caton as a ratio ≥ 1.2. Using Caton-Deschamps, patients are being underdiagnosed if utilising a patella baja ratio of ≤ 0.6. In our population, the 5th centile was 0.75. The two ratios had a kappa coefficient of 0.01, which indicates poor inter-rater reliability. Depending on the ratio used, caton-Deschamps and Insall-Salvati ratios diagnose patients as alta or baja differently. The current patella height ratios have originated from very small, select population samples. The future of patella height discussion should begin with data representing large populations. Then, we can discuss the upper and lower limits of abnormality.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Spatial distribution and determinants of anemia among under-five children in Mozambique",
        "link": "https://www.nature.com/articles/s41598-024-83899-y",
        "publication_date": "02 Jan 2025",
        "abstract": "Worldwide, anemia in under-five children is a serious public health problem that causes significant morbidity and mortality. It also negatively impacts children’s physical growth, focus, memory, and academic performance. Despite this, there is a paucity of up-to-date information on the spatial distribution and determinants of under-five anemia in Mozambique. Therefore, this study aimed to assess the spatial variation and determinates of anemia among under-five children in Mozambique by using the most recent demographic and health survey data. A cross-sectional study was conducted using the most recent demographic and health survey data of Mozambique. A total weighted sample of 3127 under-five children was included in the study. Spatial SaTScan statistics were done using Kuldroff’s SaTScan version 9.6 software. ArcGIS version 10.7 software is used to visualize the spatial distribution of under-five anemia. A multilevel mixed-effects logistic regression analysis was employed to identify the determinants of under-five anemia. The level of statistical significance was declared at a p-value of < 0.05. Overall, the prevalence of anemia among under-five children in Mozambique was 49.46% (95% CI 47.70–51.21). Under-five anemia was not evenly distributed across the country; a higher distribution was observed in Zambezia, Nampula, Safala, and the southern part of Gaza; fewer cold spots were observed in the western and southern parts of Niassa, the eastern part of Tete, the western part of Manica, and Maputo City. In spatial scan statistics, children in the most likely cluster were 1.58 times more likely to be anemic than those living outside the window (RR = 1.58, P-value < 0.001). Children with fathers with no formal education, children from anemic mothers, children whose mothers are underweight, children residing in the Zambzia region, children residing in the Nampula region, and children residing in the Niassa region were significantly associated with under-five anemia in Mozambique. The burden of under-five anemia in Mozambique is higher and distributed non-randomly across regions. Maternal anemia, underweighted mothers, husband education, and regions in Mozambique were found to be significant determinants of anemia in under-five children. Improving the nutritional status of mothers and interventions to address maternal anemia, with special attention to the Nampula and Zambzia regions, are recommended to reduce under-five anemia in Mozambique.",
        "conclusions": "The burden of under-five anemia in Mozambique is a major or severe public health problem. Maternal anemia, underweighted mothers, husband education, and regions in Mozambique were significantly associated with under-five anemia. Improving the nutritional status of mothers and interventions to address maternal anemia, with special attention to the Nampula and Zambzia regions, are recommended to reduce under-five anemia.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Accuracy and operation procedure of robotic computer-aided implant surgery",
        "link": "https://www.nature.com/articles/s41598-024-83997-x",
        "publication_date": "02 Jan 2025",
        "abstract": "This study assessed the accuracy of robotic computer-aided implant surgery (rCAIS) in partially edentulous patients using a standard operation procedure. Patients who underwent implant placement surgeries using the robotic system under a standard operation procedure were recruited. Deviations of dental implants were calculated after superimposition of the preoperative and postoperative cone-beam computed tomography (CBCT) images. The possible effects of the implant regions on these deviations were investigated. A total of 30 participants were enrolled in the study and 44 implants were inserted. The median (25th-75th percentile) global coronal deviation, global apical deviation, and angular deviation were 0.62 mm (0.46–1.00), 0.62 mm (0.49–1.01) and 1.16 (0.69–1.69) °, respectively. The jaw was a factor in the lateral coronal, vertical coronal, and vertical apical deviations (P < 0.05). Both the lateral coronal and apical deviations were greater for immediate implant placements than for delayed implant placements (P < 0.05). The implant dimensions significantly affected the apical deviation (P < 0.05). These results indicate that rCAIS based on a standard operation procedure is safe and accurate in partially edentulous patients. However, there remains a need to optimize robotic systems to simplify the workflow and improve their ability to recognize and respond to complex bone structures. Further clinical studies should also focus on comparing the long-term implant success rate and related complications of rCAIS with traditional approaches.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A machine learning-based clinical predictive tool to identify patients at high risk of medication errors",
        "link": "https://www.nature.com/articles/s41598-024-83631-w",
        "publication_date": "30 Dec 2024",
        "abstract": "A medication error is an inadvertent failure in the drug therapy process that can cause serious harm to patients by increasing morbidity and mortality and are associated with significant economic costs to the healthcare system. Medication reconciliation is the most cost-effective intervention and can result in a 66% reduction in medication errors. To improve patient safety, we developed a machine learning-based tool that prioritizes patients at risk of medication errors upon admission to the hospital to ensure that they undergo medication reconciliation by clinical pharmacists. The data were collected from the electronic health records of patients admitted to Reims University Hospital who underwent medication reconciliation between 2017 and 2023. The data from 7200 patients were used to train four machine learning-based models based on 52 variables in the development dataset. These models were used to prioritize admitted patients according to their likelihood of being exposed to a medication error. Our models, particularly the voting classifier model, demonstrated good performance (a recall of 0.75, precision of 0.65, F1 score of 0.70, AUROC of 0.74 and AUCPR of 0.75). In a retrospective evaluation simulating real-life use, the voting classifier model successfully identified 45% of the total patients selected who were found to have at least one unintended discrepancy compared to 21% when using the existing tool. The positive experimental results of this tool showed a superior improvement of 113% over the existing tool by targeting patients at risk of medication errors upon admission to Reims University Hospital.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Radiomics for differentiating adenocarcinoma and squamous cell carcinoma in non-small cell lung cancer beyond nodule morphology in chest CT",
        "link": "https://www.nature.com/articles/s41598-024-83786-6",
        "publication_date": "30 Dec 2024",
        "abstract": "Distinguishing between primary adenocarcinoma (AC) and squamous cell carcinoma (SCC) within non-small cell lung cancer (NSCLC) tumours holds significant management implications. We assessed the performance of radiomics-based models in distinguishing primary there is from SCC presenting as lung nodules on Computed Tomography (CT) scans. We studied individuals with histopathologically proven adenocarcinoma or SCC type NSCLC tumours, detected as lung nodules on Chest CT. The workflow comprised manual nodule segmentation, regions of interest creation, preprocessing data, feature extraction, and nodule classification using machine learning algorithms. The dataset comprised 46 adenocarcinoma and 28 SCC cases. For feature extraction, 101 radiomic features were extracted from the tumour regions using the ‘pyradiomics’ module in Python. After extensive experimentation with various feature importance techniques, the top 10 most significant radiomic features for differentiating between adenocarcinoma and squamous cell carcinoma (SCC) were identified. The Synthetic Minority Over-Sampling Technique was used to achieve a balanced distribution. Lung nodules were classified using 13 machine-learning algorithms, including Linear Discriminant Analysis, Random Forest, AdaBoost, and eXtreme Gradient Boosting. The Multilayer Perceptron (MLP) Classifier with Rectified Linear Unit (ReLu) activation was the most accurate (83% accuracy) with 83% precision and 86% sensitivity in distinguishing SCC from adenocarcinoma. It achieved a balanced F1 score of 83%, indicating well-rounded performance in both precision and sensitivity. The average Area Under the Curve score was 88%, representing good discrimination between the two classes of lung nodules. Radiomics is a powerful non-invasive tool that could potentially add to visual information obtained on CT. The MLP Classifier with ReLu activation showed good accuracy in distinguishing primary lung adenocarcinoma from SCC nodules. However, widespread multicentre trials are required to realize the full potential of radiomics in lung nodules.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The Theranostic Genome",
        "link": "https://www.nature.com/articles/s41467-024-55291-x",
        "publication_date": "30 Dec 2024",
        "abstract": "Theranostic drugs represent an emerging path to deliver on the promise of precision medicine. However, bottlenecks remain in characterizing theranostic targets, identifying theranostic lead compounds, and tailoring theranostic drugs. To overcome these bottlenecks, we present the Theranostic Genome, the part of the human genome whose expression can be utilized to combine therapeutic and diagnostic applications. Using a deep learning-based hybrid human-AI pipeline that cross-references PubMed, the Gene Expression Omnibus, DisGeNET, The Cancer Genome Atlas and the NIH Molecular Imaging and Contrast Agent Database, we bridge individual genes in human cancers with respective theranostic compounds. Cross-referencing the Theranostic Genome with RNAseq data from over 17’000 human tissues identifies theranostic targets and lead compounds for various human cancers, and allows tailoring targeted theranostics to relevant cancer subpopulations. We expect the Theranostic Genome to facilitate the development of new targeted theranostics to better diagnose, understand, treat, and monitor a variety of human cancers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Kisspeptin is elevated in the brain after intracerebral haemorrhagic stroke",
        "link": "https://www.nature.com/articles/s41598-024-83514-0",
        "publication_date": "30 Dec 2024",
        "abstract": "Intracerebral haemorrhage (ICH) is the most severe subtype of stroke, with a 2-year mortality of nearly 50% and the greatest rate of disability amongst stroke survivors. Whilst treatment options for ICH remain limited, the condition requires prompt identification and rapid intervention to reduce permanent brain damage, with diagnosis traditionally confirmed by CT imaging. Although imaging is excellent at determining the presence of an intracranial bleed, biomarkers may help to identify the type of stroke or when the stroke began. Kisspeptin is a neuropeptide best known for its functions in reproductive biology, but recent preclinical studies have demonstrated that kisspeptins are upregulated in rodent models of haemorrhagic stroke. Here we report for the first time that kisspeptin immunoreactivity is significantly higher in post-mortem human brain tissue after both ICH and ICH associated with cerebral amyloid angiopathy. Machine learning and artificial intelligence-enabled image analysis of multiplexed immunolabeled brain tissues demonstrated that kisspeptin immunoreactivity was higher in cells of the microvasculature (CD105+), but not in neurons or astrocytes when compared to controls. Further spatial analysis indicated that kisspeptin immunoreactivity was concentrated to the region of haemorrhage. These results indicate that following ICH, kisspeptin is significantly higher in the human brain, suggesting expression from local vasculature or recruitment to the haematoma. Further work is required to determine the biological mechanisms underlying kisspeptin elevation within the ICH microenvironment and its potential utility as a novel biomarker or therapeutic target for ICH.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Augmented prediction of vertebral collapse after osteoporotic vertebral compression fractures through parameter-efficient fine-tuning of biomedical foundation models",
        "link": "https://www.nature.com/articles/s41598-024-82902-w",
        "publication_date": "30 Dec 2024",
        "abstract": "Vertebral collapse (VC) following osteoporotic vertebral compression fracture (OVCF) often requires aggressive treatment, necessitating an accurate prediction for early intervention. This study aimed to develop a predictive model leveraging deep neural networks to predict VC progression after OVCF using magnetic resonance imaging (MRI) and clinical data. Among 245 enrolled patients with acute OVCF, data from 200 patients were used for the development dataset, and data from 45 patients were used for the test dataset. To construct an accurate prediction model, we explored two backbone architectures: convolutional neural networks and vision transformers (ViTs), along with various pre-trained weights and fine-tuning methods. Through extensive experiments, we built our model by performing parameter-efficient fine-tuning of a ViT model pre-trained on a large-scale biomedical dataset. Attention rollouts indicated that the contours and internal features of the compressed vertebral body were critical in predicting VC with this model. To further improve the prediction performance of our model, we applied the augmented prediction strategy, which uses multiple MRI frames and achieves a significantly higher area under the curve (AUC). Our findings suggest that employing a biomedical foundation model fine-tuned using a parameter-efficient method, along with augmented prediction, can significantly enhance medical decisions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sivan classification system for diagnosis of jaw lesions based on visual volumetric analysis of 3-dimensional cone-beam computed tomographic images",
        "link": "https://www.nature.com/articles/s41598-024-83974-4",
        "publication_date": "30 Dec 2024",
        "abstract": "A novel classification system, termed the Sivan classification, was developed to enhance the diagnosis of jaw lesions by utilizing visual volumetric analysis of three-dimensional Cone Beam Computed Tomography (CBCT) images. This classification groups lesions into ten categories, primarily divided into hypovolumetric, hypervolumetric, and normovolumetric groups. To validate this system, 10 raters—comprising 5 general dentists and 5 oral radiology specialists—assessed the CBCT images and diagnosed the lesions using the Sivan classification. Eight raters repeated the process after one month to assess consistency. The overall agreement between raters, quantified using kappa statistics, was 0.82, indicating excellent consistency. Hypervolumetric and normovolumetric lesions demonstrated the highest agreement (kappa 0.84 and 0.82, respectively), while hypovolumetric lesions showed substantial agreement (kappa 0.77). Pairwise interrater agreement ranged from 76 to 93%, with kappa values between 0.75 and 0.87. Intrarater reliability was equally strong, with kappa values between 0.79 and 0.89.These results suggest that the Sivan classification provides a robust and reliable framework for diagnosing jaw lesions using CBCT volumetric analysis, surpassing traditional diagnostic methods in accuracy and consistency.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Rapid optical determination of salivary cortisol responses in individuals undergoing physiological and psychological stress",
        "link": "https://www.nature.com/articles/s41598-024-69466-5",
        "publication_date": "30 Dec 2024",
        "abstract": "Traditional methods for management of mental illnesses in the post-pandemic setting can be inaccessible for many individuals due to a multitude of reasons, including financial stresses and anxieties surrounding face-to-face interventions. The use of a point-of-care tool for self-management of stress levels and mental health status is the natural trajectory towards creating solutions for one of the primary contributors to the global burden of disease. Notably, cortisol is the main stress hormone and a key logical indicator of hypothalamic-pituitary adrenal (HPA) axis activity that governs the activation of the human stress system. Therefore, the measurement of cortisol is imperative to lead the discussion of the relationship between psychological stress and mental health deterioration. The aim of the current study was to determine salivary cortisol concentrations of healthy individuals undergoing the MAST protocol for human stress activation, through optical-colorimetric techniques. The study demonstrates the use of the blue tetrazolium (BT) method as successful means of rapid measurement of cortisol in saliva, comparable to the gold-standard technique i.e., enzyme-linked immunoassays (ELISA) with a coefficient of determination (R2) of 0.997. The results support the future development of a point-of-care optical sensor-based device and mobile application for cortisol monitoring and stress profiling in adults.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A machine learning tool for early identification of celiac disease autoimmunity",
        "link": "https://www.nature.com/articles/s41598-024-80817-0",
        "publication_date": "28 Dec 2024",
        "abstract": "Identifying which patients should undergo serologic screening for celiac disease (CD) may help diagnose patients who otherwise often experience diagnostic delays or remain undiagnosed. Using anonymized outpatient data from the electronic medical records of Maccabi Healthcare Services, we developed and evaluated five machine learning models to classify patients as at-risk for CD autoimmunity prior to first documented diagnosis or positive serum tissue transglutaminase (tTG-IgA). A train set of highly seropositive (tTG-IgA > 10X ULN) cases (n = 677) with likely CD and controls (n = 176,293) with no evidence of CD autoimmunity was used for model development. Input features included demographic information and commonly available laboratory results. The models were then evaluated for discriminative ability as measured by AUC on a distinct set of highly seropositive cases (n = 153) and controls (n = 41,087). The highest performing model was XGBoost (AUC = 0.86), followed by logistic regression (AUC = 0.85), random forest (AUC = 0.83), multilayer perceptron (AUC = 0.80) and decision tree (AUC = 0.77). Contributing features for the XGBoost model for classifying a patient as at-risk for undiagnosed CD autoimmunity included signs of anemia, transaminitis and decreased high-density lipoprotein. This model’s ability to distinguish cases of incident CD autoimmunity from controls shows promise as a potential clinical tool to identify patients with increased risk of having undiagnosed celiac disease in the community, for serologic screening.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Limitations of panoramic radiographs in predicting mandibular wisdom tooth extraction and the potential of deep learning models to overcome them",
        "link": "https://www.nature.com/articles/s41598-024-81153-z",
        "publication_date": "28 Dec 2024",
        "abstract": "Surgeons routinely interpret preoperative radiographic images for estimating the shape and position of the tooth prior to performing tooth extraction. In this study, we aimed to predict the difficulty of lower wisdom tooth extraction using only panoramic radiographs. Difficulty was evaluated using the modified Parant score. Two oral surgeons (a specialist and a clinical resident) predicted the difficulty level of the test data. This study also aimed to evaluate the performance of a deep learning model in predicting the necessity for tooth separation or bone removal during wisdom tooth extraction. Two convolutional neural networks (AlexNet and VGG-16) were created and trained using panoramic X-ray images. Both surgeons interpreted the same images and classified them into three groups. The accuracies for humans were 54.4% for both surgeons, 57.7% for AlexNet, and 54.4% for VGG-16. These results indicate that accurately predict the difficulty of wisdom teeth extraction using panoramic radiographs alone is challenging. However, AlexNet and VGG-16 had sensitivities of more than 90% for crown and root separation. The predictive ability of our proposed model is equivalent to that of an oral surgery specialist, and a recall value > 90% makes it suitable for screening in clinical settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning radiomics on grayscale ultrasound images assists in diagnosing benign and malignant of BI-RADS 4 lesions",
        "link": "https://www.nature.com/articles/s41598-024-83347-x",
        "publication_date": "28 Dec 2024",
        "abstract": "This study aimed to explore a deep learning radiomics (DLR) model based on grayscale ultrasound images to assist radiologists in distinguishing between benign breast lesions (BBL) and malignant breast lesions (MBL). A total of 382 patients with breast lesions were included, comprising 183 benign lesions and 199 malignant lesions that were collected and confirmed through clinical pathology or biopsy. The enrolled patients were randomly allocated into two groups: a training cohort and an independent test cohort, maintaining a ratio of 7:3.We created a model called CLDLR that utilizes clinical parameters and DLR to diagnose both BBL and MBL through grayscale ultrasound images. In order to assess the practicality of the CLDLR model, two rounds of evaluations were conducted by radiologists. The CLDLR model demonstrates the highest diagnostic performance in predicting benign and malignant BI-RADS 4 lesions, with areas under the receiver operating characteristic curve (AUC) of 0.988 (95% confidence interval : 0.949, 0.985) in the training cohort and 0.888 (95% confidence interval : 0.829, 0.947) in the testing cohort.The CLDLR model outperformed the diagnoses made by the three radiologists in the initial assessment of the testing cohorts. By utilizing AI scores from the CLDLR model and heatmaps from the DLR model, the diagnostic performance of all radiologists was further enhanced in the testing cohorts. Our study presents a noninvasive imaging biomarker for the prediction of benign and malignant BI-RADS 4 lesions. By comparing the results from two rounds of assessment, our AI-assisted diagnostic tool demonstrates practical value for radiologists with varying levels of experience.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Enhanced human activity recognition in medical emergencies using a hybrid deep CNN and bi-directional LSTM model with wearable sensors",
        "link": "https://www.nature.com/articles/s41598-024-82045-y",
        "publication_date": "28 Dec 2024",
        "abstract": "Human activity recognition (HAR) is one of the most important segments of technology advancement in applications of smart devices, healthcare systems & fitness. HAR uses details from wearable sensors that capture the way human beings move or engage with their surrounding. Several researchers have thus presented different ways of modeling human motion, and some have been as follows: Many researchers have presented different methods of modeling human movements. Therefore, in this paper, we proposed the CNN BiLSTM model with undersampling to improve the recognition of human actions. The model is evaluated using state-of-the-art metrics, including accuracy, precision, recall, and F1-score, on two publicly available datasets: For instance, the MHEALTH and Actitracker. This will enable the team to attain test accuracies of up to 98.5% on the MHEALTH dataset. The proposed CNN-BiLSTM model outperforms the conventional deep learning methods, as reported in the Actitracker dataset, by about 5% improvement. HAR has many applications, one of which is used to keep vigil over elderly people who live alone to alert when one has fallen or when any strange movement is noticed which could be a sign that the individual is experiencing a medical Emergency. It can also be applied in physiotherapy, where the patient’s development throughout rehabilitation exercises can be accessed.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Hand gestures classification of sEMG signals based on BiLSTM-metaheuristic optimization and hybrid U-Net-MobileNetV2 encoder architecture",
        "link": "https://www.nature.com/articles/s41598-024-82676-1",
        "publication_date": "28 Dec 2024",
        "abstract": "Surface electromyography (sEMG) data has been extensively utilized in deep learning algorithms for hand movement classification. This paper aims to introduce a novel method for hand gesture classification using sEMG data, addressing accuracy challenges seen in previous studies. We propose a U-Net architecture incorporating a MobileNetV2 encoder, enhanced by a novel Bidirectional Long Short-Term Memory (BiLSTM) and metaheuristic optimization for spatial feature extraction in hand gesture and motion recognition. Bayesian optimization is employed as the metaheuristic approach to optimize the BiLSTM model’s architecture. To address the non-stationarity of sEMG signals, we employ a windowing strategy for signal augmentation within deep learning architectures. The MobileNetV2 encoder and U-Net architecture extract relevant features from sEMG spectrogram images. Edge computing integration is leveraged to further enhance innovation by enabling real-time processing and decision-making closer to the data source. Six standard databases were utilized, achieving an average accuracy of 90.23% with our proposed model, showcasing a 3–4% average accuracy improvement and a 10% variance reduction. Notably, Mendeley Data, BioPatRec DB3, and BioPatRec DB1 surpassed advanced models in their respective domains with classification accuracies of 88.71%, 90.2%, and 88.6%, respectively. Experimental results underscore the significant enhancement in generalizability and gesture recognition robustness. This approach offers a fresh perspective on prosthetic management and human-machine interaction, emphasizing its efficacy in improving accuracy and reducing variance for enhanced prosthetic control and interaction with machines through edge computing integration.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Risk factors for metabolic syndrome in the premetabolic state assessed using hierarchical clustering study in a health screening group",
        "link": "https://www.nature.com/articles/s41598-024-82513-5",
        "publication_date": "28 Dec 2024",
        "abstract": "Early detection of a premetabolic status that is at risk for metabolic syndrome (MetS) but not meeting the criteria is crucial. This study examined 27,623 participants aged 20–50 (mean: 40.7) years who underwent initial health screening at Kangbuk Samsung Hospital (2011–2019), focusing on individuals with one or two MetS components. Hierarchical agglomerative clustering was used to form MetS risk clusters based on initial and follow-up data, including age, resting heart rate (rHR), serum uric acid (UA), C-reactive protein (CRP), gamma-glutamyl transpeptidase, and ferritin levels, and nonalcoholic fatty liver disease (NAFLD), periodontal disease, and Helicobacter pylori infection duration. Kaplan–Meier and generalized additive models were used to present the restricted mean survival time (RMST) and identify onset contributors. Clusters with NAFLD and elevated UA levels had the highest MetS risk, whereas those with uniformly low biomarker levels revealed the lowest risk. During follow-up, a cluster initially comprising 60.2% moderate-risk patients exhibited high biomarker levels and had the worst MetS prognosis (RMST: 211 days). UA, CRP levels, and rHR contributed to the incidence of MetS in the fitted model. Machine learning can predict the premetabolic state at MetS risk in a population-based cohort.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "EEG-based emotion recognition using multi-scale dynamic CNN and gated transformer",
        "link": "https://www.nature.com/articles/s41598-024-82705-z",
        "publication_date": "28 Dec 2024",
        "abstract": "Emotions play a crucial role in human thoughts, cognitive processes, and decision-making. EEG has become a widely utilized tool in emotion recognition due to its high temporal resolution, real-time monitoring capabilities, portability, and cost-effectiveness. In this paper, we propose a novel end-to-end emotion recognition method from EEG signals, called MSDCGTNet, which is based on the Multi-Scale Dynamic 1D CNN and the Gated Transformer. First, the Multi-Scale Dynamic CNN is used to extract complex spatial and spectral features from raw EEG signals, which not only avoids information loss but also reduces computational costs associated with the time-frequency conversion of signals. Then, the Gated Transformer Encoder is utilized to capture global dependencies of EEG signals. This encoder focuses on specific regions of the input sequence while reducing computational resources through parallel processing with the improved multi-head self-attention mechanisms. Third, the Temporal Convolution Network is used to extract temporal features from the EEG signals. Finally, the extracted abstract features are fed into a classification module for emotion recognition. The proposed method was evaluated on three publicly available datasets: DEAP, SEED, and SEED_IV. Experimental results demonstrate the high accuracy and efficiency of the proposed method for emotion recognition. This approach proves to be robust and suitable for various practical applications. By addressing challenges posed by existing methods, the proposed method provides a valuable and effective solution for the field of Brain-Computer Interface (BCI).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Chuanxiong Rhizoma regulates ferroptosis and the immune microenvironment in ischemic stroke through the JAK-STAT3 pathway",
        "link": "https://www.nature.com/articles/s41598-024-82486-5",
        "publication_date": "28 Dec 2024",
        "abstract": "Ferroptosis is linked to various pathological conditions; however, the specific targets and mechanisms through which traditional Chinese medicine influences ischemic stroke (IS)-induced ferroptosis remain poorly understood. In this study, data from the Gene Expression Omnibus and disease target databases (OMIM, GeneCards, DisGeNet, TTD, and DrugBank) were integrated with ferroptosis-related gene datasets. To identify key molecular targets of Chuanxiong Rhizoma (CX), drug ingredient databases, including PubChem and TCMBank, were employed to map CX-related targets (CX-DEGs-FRG and CX-IS-FRG). Gene targets and relevant signaling pathways were analyzed using weighted gene co-expression network analysis, protein-protein interaction networks, Gene Ontology, and Kyoto Encyclopedia of Genes and Genomes pathway enrichment. The least absolute shrinkage and selection operator regression and support vector machine methods were utilized to identify intersecting genes, and the predictive accuracy of core targets was evaluated through receiver operating characteristic curve analysis. Immune cell infiltration in the IS microenvironment was assessed using CIBERSORT, followed by molecular docking of CX’s active components with key targets. The JAK-STAT3 pathway was identified as a critical regulatory mechanism, and five key targets (ALOX5, PTGS2, STAT3, G6PD, and HIF1A) emerged as central to the IS-induced ferroptosis. Elevated infiltration of CD8 + T cells and neutrophils was significantly correlated with IS. Notably, the active components mandenol and myricanone demonstrated strong binding affinities with these five targets, which validated the results from network-based analysis. In conclusion, the JAK-STAT3 pathway, through its regulation of ALOX5, PTGS2, STAT3, G6PD, and HIF1A, could play a crucial role in modulating ferroptosis and immune responses in IS. These findings suggest that CX could serve as a potential therapeutic approach for IS, targeting the regulation of IS-induced ferroptosis and the immune microenvironment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "CDUNeXt: efficient ossification segmentation with large kernel and dual cross gate attention",
        "link": "https://www.nature.com/articles/s41598-024-82199-9",
        "publication_date": "28 Dec 2024",
        "abstract": "Ossification of the ligamentum flavum (OLF) is the main causative factor of spinal stenosis, but how to accurately and efficiently identify the ossification region is a clinical pain point and an urgent problem to be solved. Currently, we can only rely on the doctor’s subjective experience for identification, with low efficiency and large error. In this study, a deep learning method is introduced for the first time into the diagnosis of ligamentum flavum ossificans, we proposed a lightweight, automatic and efficient method for identifying ossified regions, called CDUNeXt. By designing lightweight module structures, utilizing large-kernel convolutions to extracts the long-distance dependencies of different features of the image, and adopting dual-cross-gate-attention(DCGA) to sequentially capture the channel and spatial dependencies so as to fast and accurate segmentation while maintaining fewer parameters and lower complexity. Experiments show that CDUNeXt achieves the best segmentation performance with an optimal balance of lighter weights and less computational cost compared to existing methods. This work fills the gap in the application of deep learning techniques in the diagnosis of ligamentum flavum ossificans, contributes to the realization of lightweight medical image segmentation networks and lays the foundation for subsequent research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Principal component analysis of the Serological response to Plasmodium Falciparum using a Multiplex bead-based assay in Nigeria",
        "link": "https://www.nature.com/articles/s41598-024-74236-4",
        "publication_date": "28 Dec 2024",
        "abstract": "Characterization of serological responses to Plasmodium falciparum (Pf) is of interest to understand disease burden and transmission dynamics; however, their interpretation is challenging. Dried blood spots from 30,815 participants aged 6 months to 15 years from the 2018 Nigeria HIV/AIDS Indicator and Impact Survey were analyzed by multiplex bead-based assay to measure immunoglobulin G (IgG) to Pf-stage-specific MSP-1, AMA-1, GLURPR0, LSA-1, and CSP. These IgG levels were analyzed by principal component analysis (PCA). PC1 and PC2 scores explained 41% and 17% of the total variance, respectively. PC1 unit vectors represented seropositivity. PC2 unit vectors for blood-stage antigens were in opposite directions to liver-stage and sporozoite antigens. PC2 scores were correlated with MSP-1 positively (R = 0.52, P < 0.001) and CSP negatively (R=-0.65, P < 0.001) and may help identify areas with prior exposure but higher risk for increased infections or epidemics. PCA of Pf serology can provide summary scores to possibly inform future programmatic interventions.",
        "conclusions": "Understanding the burden of malaria in a diverse and heterogenous country like Nigeria is challenging; however, leveraging malaria serology and dimensionality reduction techniques such as PCA can help describe malaria disease burden. Serological responses to multiple Pf antigens can clarify the intensity of prior malaria exposures and risk of possible future epidemics in high-risk areas with waning immunity. Further research is needed to evaluate PCA on multiple serological markers of malaria in other countries. However, this exploratory analysis demonstrates the use of PCA on multiple Pf-specific antigen responses derived from an MBA that could be used in the future to help direct public health interventions to prevent and control malaria.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A novel sweat sensor detects inflammatory differential rhythmicity patterns in inpatients and outpatients with cirrhosis",
        "link": "https://www.nature.com/articles/s41746-024-01404-1",
        "publication_date": "28 Dec 2024",
        "abstract": "Patients with cirrhosis have high systemic inflammation (TNFα, CRP, and IL-6) that is associated with poor outcomes. These biomarkers need continuous non-invasive monitoring, which is difficult with blood. We studied the AWARE sweat-sensor to measure these in passively expressed sweat in healthy people (N = 12) and cirrhosis (N = 32, 10 outpatients/22 inpatients) for 3 days. Blood CRP, TNFα, IL6, levels, and liver function and quality of life were measured. We found that CRP, TNFα, and IL6 were correlated in sweat and serum among both groups and were evaluated in inpatients versus outpatients/controls. IL6 is associated with lower transplant-free survival. Sweat monitoring nocturnal CRP/IL6 elevations in cirrhosis versus controls. Outpatients with cirrhosis had inflammation levels that elevated during the evening and peaked towards the early night periods. The levels start to fall much later at night and early morning. These data suggest that further investigation of continuous measurement of sweat biomarkers in cirrhosis is warranted.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Harnessing Raman spectroscopy and multimodal imaging of cartilage for osteoarthritis diagnosis",
        "link": "https://www.nature.com/articles/s41598-024-83155-3",
        "publication_date": "28 Dec 2024",
        "abstract": "Osteoarthritis (OA) is a complex disease of cartilage characterised by joint pain, functional limitation, and reduced quality of life with affected joint movement leading to pain and limited mobility. Current methods to diagnose OA are predominantly limited to X-ray, MRI and invasive joint fluid analysis, all of which lack chemical or molecular specificity and are limited to detection of the disease at later stages. A rapid minimally invasive and non-destructive approach to disease diagnosis is a critical unmet need. Label-free techniques such as Raman Spectroscopy (RS), Coherent anti-Stokes Raman scattering (CARS), Second Harmonic Generation (SHG) and Two Photon Fluorescence (TPF) are increasingly being used to characterise cartilage tissue. However, current studies are based on whole tissue analysis and do not consider the different and structurally distinct layers in cartilage. In this work, we use Raman spectroscopy to obtain signatures from the superficial (top) and deep (bottom) layer of healthy and osteoarthritic cartilage samples from 64 patients (19 control and 45 OA). Spectra were acquired both in the ‘fingerprint’ region from 700 to 1720 cm− 1 and high-frequency stretching region from 2500 to 3300 cm− 1. Principal component and linear discriminant analysis was used to identify the peaks that contributed significantly to classification accuracy of the different samples. The most pronounced differences were observed at the proline (855 cm− 1 and 921 cm− 1) and hydroxyproline (877 cm− 1 and 938 cm− 1), sulphated glycosaminoglycan (sGAG) (1064 cm− 1 and 1380 cm− 1) frequencies for both control and OA as well as the 1245 cm− 1 and 1272 cm− 1, 1320 cm− 1 and 1345 cm− 1, 1451 cm− 1 collagen modes were altered in OA samples, consistent with expected collagen structural changes. Classification accuracy based on Raman fingerprint spectral analysis of superficial and deep layer cartilage for controls was found to be 97% and 93% on using individual/all spectra and, 100% and 95% on using mean spectra per patient, respectively. OA diseased cartilage was classified with an accuracy of 88% and 84% for individual/all spectra, and 96% and 95% for mean spectra per patient based on analysis of the superficial and the deep layers, respectively. Raman spectra from the C-H stretching region (2500–3300 cm− 1) resulted in high classification accuracy for identification of different layers and OA diseased cartilage but low accuracy for controls. Differential changes in superficial and deep layer cartilage signatures were observed with age (under 60 and over 60 years), in contrast, less significant differences were observed with gender. Prominent chemical changes in the different layers of cartilage were preliminarily imaged using CARS, SHG and TPF. Cell clustering was observed in OA together with differences in pericellular matrix and collagen structure in the superficial and the deep layers correlating with the Raman spectral analysis. The current study demonstrates the potential of Raman Spectroscopy and multimodal imaging to interrogate cartilage tissue and provides insight into the chemical and structural composition of its different layers with significant implications for OA diagnosis for an increasing aging demographic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Understanding the impact of COVID-19 on quality of life using surveys and Mendelian randomization",
        "link": "https://www.nature.com/articles/s41598-024-81579-5",
        "publication_date": "28 Dec 2024",
        "abstract": "The COVID-19 pandemic has significantly impacted the quality of life (QoL) of individuals in China, affecting both their physical and mental well-being. This study aims to comprehensively analyze the factors influencing QoL in China during the pandemic. In 2022, we collected data using a self-developed questionnaire (dataset 2) and obtained dataset 1 from the 2021 China General Social Survey (CGSS). After confirming the scale’s reliability and validity, we employed a random forest algorithm to prioritize the factors. Subsequently, Mendelian randomization analyses were conducted using data from the MRC IEU OpenGWAS data infrastructure. By comparing data from two periods with low and high infection rates, the results showed that among the various influences brought about by the prevalence of COVID-19, sleep disorders have a significant and widespread impact on the quality of life, especially for the elderly. Through the inclusion of Mendelian randomization analysis, we found that COVID-19 have a relative increase in the risk of developing insomnia by approximately 26.7% (OR = 1.267). These findings can inform the development of targeted interventions and strategies to improve overall well-being.",
        "conclusions": "Our study underscores the importance of comprehending the factors influencing quality of life (QoL) during an epidemic. We have successfully demonstrated that the SF-12 Health Survey and the Perceived Stress Scale (PSS) reliably and validly measure the physical and mental health of individuals within the Chinese epidemiological context, meeting established standards. Additionally, our research, through the comprehensive analysis of scale results and Mendelian randomization, has revealed the impact of COVID-19 on individuals’ sleep quality, with this impact increasing with age. These findings provide valuable insights for policymakers and public health professionals to develop targeted interventions and strategies aimed at enhancing overall well-being.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Quantitative electroencephalography predicts postoperative delirium in adult cardiac surgical patients from a prospective observational study",
        "link": "https://www.nature.com/articles/s41598-024-82422-7",
        "publication_date": "28 Dec 2024",
        "abstract": "The diagnostic and prognostic value of quantitative electroencephalogram (qEEG) in the the onset of postoperative delirium (POD) remains an area of inquiry. We aim to determine whether qEEG could assist in the diagnosis of early POD in cardiac surgery patients. We prospectively studied a cohort of cardiac surgery patients undergoing qEEG for evaluation of altered mental status. Delirium was assessed with the Confusion Assessment Method for the intensive care unit (CAM-ICU). The qEEG were interpreted by clinician, and reports were reviewed to identify features such as amplitude-integrated EEG (aEEG), relative band energy in ɑ/β/θ/δ frequencies, α variability and spectral entropy. The raw EEG was also preprocessed offline for nonlinear analysis including Multi-scale Entropy analysis (MSE) and Detrended Fluctuation Analysis (DFA). Linear regression was performed to quantify associations among EEG findings, delirium, and clinical outcomes. Receiver operating characteristic (ROC) analysis was used to assess the accuracy of the qEEG as POD prediction index. Meanwhile, a comprehensive comparison of dynamic complexity across time scales and DFA exponent α was conducted between the non-delirium and delirium groups. Among those recruited initially (n = 64), 60 patients were evaluated and 29 patients (48.3%) met delirium criteria. When comparing delirious and non-delirious participants, significant differences were found in terms of age (p = 0.03), APACHE II scores (p = 0.004), lactate (p = 0.03), and hospital days (p = 0.048). Multivariate regression analysis revealed that the first quartile (Q1) and fourth quartile (Q4) of peak or valley value of F3-P3/F4-P4 derivation (for example, Q1 of peak value for F3-P3 derivation: OR 12.4, 95% CI 1.72–89.76, p = 0.012) showed a higher association with the incidence of POD. ROC analysis demonstrated qEEG could predict POD with high sensitivity and specificity, yielding an overall good accuracy. For instance, the peak value of F3-P3 derivation (the area under the curve of 0.81), as a predictor of POD showed a sensitivity of 90% and specificity pf 72% (p < 0.001). Furthermore, the MSE curves indicated that the non-delirium group exhibited higher complexity values at fine scales, while the delirium group had significantly higher complexity at coarse scales. The DFA comparison results revealed that long-term fractal exponent alpha2 values were higher in delirium patients than in non-delirium patients, with significant differences observed at the F4-P4 electrodes (p = 0.04). The qEEG can reliably predict delirium after heart cardiac surgery. It is helpful for clinicians to early diagnose and manage these patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Fast and accurate prediction of drug induced proarrhythmic risk with sex specific cardiac emulators",
        "link": "https://www.nature.com/articles/s41746-024-01370-8",
        "publication_date": "26 Dec 2024",
        "abstract": "In silico trials for drug safety assessment require many high-fidelity 3D cardiac simulations to predict drug-induced QT interval prolongation, which is often computationally prohibitive. To streamline this process, we developed sex-specific emulators for a fast prediction of QT interval, trained on a dataset of 900 simulations. Our results show significant differences between 3D and 0D single-cell models as risk levels increase, underscoring the ability of 3D modeling to capture more complex cardiac responses. The emulators demonstrated an average error of 4% compared to simulations, allowing for efficient global sensitivity analysis and fast replication of in silico clinical trials. This approach enables rapid, multi-dose drug testing on standard hardware, addressing critical industry challenges around trial design, assay variability, and cost-effective safety evaluations. By integrating these emulators into drug development, we can improve preclinical reliability and advance the practical application of digital twins in biomedicine.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning for predicting acute myocardial infarction in patients with sepsis",
        "link": "https://www.nature.com/articles/s41598-024-80575-z",
        "publication_date": "24 Dec 2024",
        "abstract": "Acute myocardial infarction (AMI) and sepsis are the leading causes of high mortality rates in intensive care units. While sepsis frequently affects the cardiovascular system, distinguishing between sepsis-induced cardiomyopathy and AMI remains challenging due to overlapping biomarkers. Misdiagnosis can hinder timely treatment and increase risk of complications. This study used multidimensional clinical data and machine learning techniques to develop and validate a novel predictive model for identifying AMI in critically ill patients with sepsis. Data from patients with sepsis were extracted from the Medical Information Mart for Intensive Care-IV database. Six machine learning algorithms were employed for model construction. Additionally, the machine learning-based models were compared with traditional scoring systems. Model performance was evaluated in terms of discrimination, calibration, and clinical applicability. In total, 2,103 critically ill patients with sepsis were included, 459 (21.8%) of whom experienced AMI during hospitalization. A total of 26 variables were selected for model construction. Among all models, the Gradient Boosting Classifier model demonstrated the best predictive performance in terms of discrimination, calibration, and clinical applicability. Machine learning models have the potential to serve as tools for predicting AMI in patients with sepsis. The Gradient Boosting Classifier model developed herein demonstrated promising predictive performance, supporting clinicians in identifying patients at high-risk of sepsis and implementing early interventions to reduce mortality rates.",
        "conclusions": "In conclusion, this study provides evidence to support the application of ML in predicting AMI in patients with sepsis. By identifying key clinical predictive factors and integrating them into an ML framework, we developed a GBC predictive model that may assist clinicians in identifying patients with high risk of AMI earlier and more accurately. This could lead to earlier intervention strategies and more personalized treatment plans, thereby improving patient outcomes. Our research also highlights the broader implications of sepsis-related mortality and the potential of attention-based deep learning models to enhance predictive accuracy. In the future, integrating multimodal data, including clinical, hemodynamic, and imaging data, into a unified ML framework may represent the next frontier in improving the prediction and management of sepsis-related complications. Further validation and refinement of these models in different clinical settings are crucial to establishing their practical applications and optimizing patient care outcomes.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Harnessing multimodal approaches for depression detection using large language models and facial expressions",
        "link": "https://www.nature.com/articles/s44184-024-00112-8",
        "publication_date": "23 Dec 2024",
        "abstract": "Detecting depression is a critical component of mental health diagnosis, and accurate assessment is essential for effective treatment. This study introduces a novel, fully automated approach to predicting depression severity using the E-DAIC dataset. We employ Large Language Models (LLMs) to extract depression-related indicators from interview transcripts, utilizing the Patient Health Questionnaire-8 (PHQ-8) score to train the prediction model. Additionally, facial data extracted from video frames is integrated with textual data to create a multimodal model for depression severity prediction. We evaluate three approaches: text-based features, facial features, and a combination of both. Our findings show the best results are achieved by enhancing text data with speech quality assessment, with a mean absolute error of 2.85 and root mean square error of 4.02. This study underscores the potential of automated depression detection, showing text-only models as robust and effective while paving the way for multimodal analysis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Neural networks for predicting etiological diagnosis of uveitis",
        "link": "https://www.nature.com/articles/s41433-024-03530-2",
        "publication_date": "20 Dec 2024",
        "abstract": "The large number and heterogeneity of causes of uveitis make the etiological diagnosis a complex task. The clinician must consider all the information concerning the ophthalmological and extra-ophthalmological features of the patient. Diagnostic machine learning algorithms have been developed and provide a correct diagnosis in one-half to three-quarters of cases. However, they are not integrated into daily clinical practice. The aim is to determine whether machine learning models can predict the etiological diagnosis of uveitis from clinical information.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Human AI collaboration for unsupervised categorization of live surgical feedback",
        "link": "https://www.nature.com/articles/s41746-024-01383-3",
        "publication_date": "20 Dec 2024",
        "abstract": "Formative verbal feedback during live surgery is essential for adjusting trainee behavior and accelerating skill acquisition. Despite its importance, understanding optimal feedback is challenging due to the difficulty of capturing and categorizing feedback at scale. We propose a Human-AI Collaborative Refinement Process that uses unsupervised machine learning (Topic Modeling) with human refinement to discover feedback categories from surgical transcripts. Our discovered categories are rated highly for clinical clarity and are relevant to practice, including topics like “Handling and Positioning of (tissue)” and “(Tissue) Layer Depth Assessment and Correction [during tissue dissection].” These AI-generated topics significantly enhance predictions of trainee behavioral change, providing insights beyond traditional manual categorization. For example, feedback on “Handling Bleeding” is linked to improved behavioral change. This work demonstrates the potential of AI to analyze surgical feedback at scale, informing better training guidelines and paving the way for automated feedback and cueing systems in surgery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence in risk prediction and diagnosis of vertebral fractures",
        "link": "https://www.nature.com/articles/s41598-024-75628-2",
        "publication_date": "19 Dec 2024",
        "abstract": "With the increasing prevalence of vertebral fractures, accurate diagnosis and prognostication are essential. This study assesses the effectiveness of AI in diagnosing and predicting vertebral fractures through a systematic review and meta-analysis. A comprehensive search across major databases selected studies utilizing AI for vertebral fracture diagnosis or prognosis. Out of 14,161 studies initially identified, 79 were included, with 40 undergoing meta-analysis. Diagnostic models were stratified by pathology: non-pathological vertebral fractures, osteoporotic vertebral fractures, and vertebral compression fractures. The primary outcome measure was AUROC. AI showed high accuracy in diagnosing and predicting vertebral fractures: predictive AUROC = 0.82, osteoporotic vertebral fracture diagnosis AUROC = 0.92, non-pathological vertebral fracture diagnosis AUROC = 0.85, and vertebral compression fracture diagnosis AUROC = 0.87, all significant (p < 0.001). Traditional models had the highest median AUROC (0.90) for fracture prediction, while deep learning models excelled in diagnosing all fracture types. High heterogeneity (I² > 99%, p < 0.001) indicated significant variation in model design and performance. AI technologies show considerable promise in improving the diagnosis and prognostication of vertebral fractures, with high accuracy. However, observed heterogeneity and study biases necessitate further research. Future efforts should focus on standardizing AI models and validating them across diverse datasets to ensure clinical utility.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "AI technology to support adaptive functioning in neurodevelopmental conditions in everyday environments: a systematic review",
        "link": "https://www.nature.com/articles/s41746-024-01355-7",
        "publication_date": "19 Dec 2024",
        "abstract": "Supports for adaptive functioning in individuals with neurodevelopmental conditions (NDCs) is of umost importance to long-term outcomes. Artificial intelligence (AI)-assistive technologies has enormous potential to offer efficient, cost-effective, and personalized solutions to address these challenges, particularly in everday environments. This systematic review examines the existing evidence for using AI-assistive technologies to support adaptive functioning in people with NDCs in everyday settings. Searches across six databases yielded 15 studies meeting inclusion criteria, focusing on robotics, phones/computers and virtual reality. Studies most frequently recruited children diagnosed with autism and targeted social skills (47%), daily living skills (26%), and communication (16%). Despite promising results, studies addressing broader transdiagnostic needs across different NDC populations are needed. There is also an urgent need to improve the quality of evidence-based research practices. This review concludes that AI holds enormous potential to support adaptive functioning for people with NDCs and for personalized health support. This review underscores the need for further research studies to advance AI technologies in this field.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The accuracy of fluorine 18-labelled prostate-specific membrane antigen PET/CT and MRI for diagnosis of prostate cancer in PSA grey zone",
        "link": "https://www.nature.com/articles/s41416-024-02934-x",
        "publication_date": "19 Dec 2024",
        "abstract": "The diagnostic utility of prostate biopsy is limited for prostate cancer (PCa) in the prostate-specific antigen (PSA) grey zone. This study aims to evaluate the diagnostic performance of multiparametric magnetic resonance imaging (mpMRI) and prostate-specific membrane antigen positron emission tomography/computed tomography (PSMA PET/CT) for PSA grey zone PCa and clinically significant PCa (csPCa).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "QM40, Realistic Quantum Mechanical Dataset for Machine Learning in Molecular Science",
        "link": "https://www.nature.com/articles/s41597-024-04206-y",
        "publication_date": "18 Dec 2024",
        "abstract": "The growing popularity of machine learning (ML) and deep learning (DL) in scientific fields is hindered by the scarcity of high-quality datasets. While quantum mechanical (QM) predictions using DL techniques such as graph neural networks (GNNs) and generative models are gaining traction, insufficient training data remains a bottleneck. The QM40 dataset addresses this challenge by representing 88% of the FDA-approved drug chemical space. It includes molecules containing 10 to 40 atoms and composed of elements commonly found in drug molecular structures (C, O, N, S, F, Cl). QM40 offers valuable resources for researchers which include the core QM40 main dataset, containing 16 key quantum mechanical parameters for 162,954 molecules calculated using the B3LYP/6-31G(2df,p) level of theory in Gaussian16, ensuring consistency with established datasets like QM9 and Alchemy. This compatibility allows for future concatenation of QM40 with these datasets. In addition to other valuable information, the QM40 dataset offers the initial and optimized Cartesian coordinates, Mulliken charges, and detailed bond information, including local vibrational mode force constants, which serve as indicators of bond strength. QM40 can be used to benchmark both existing and new methods for predicting QM calculations using ML and DL techniques.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Estimation of minimal data sets sizes for machine learning predictions in digital mental health interventions",
        "link": "https://www.nature.com/articles/s41746-024-01360-w",
        "publication_date": "18 Dec 2024",
        "abstract": "Artificial intelligence promises to revolutionize mental health care, but small dataset sizes and lack of robust methods raise concerns about result generalizability. To provide insights on minimal necessary data set sizes, we explore domain-specific learning curves for digital intervention dropout predictions based on 3654 users from a single study (ISRCTN13716228, 26/02/2016). Prediction performance is analyzed based on dataset size (N = 100–3654), feature groups (F = 2–129), and algorithm choice (from Naive Bayes to Neural Networks). The results substantiate the concern that small datasets (N ≤ 300) overestimate predictive power. For uninformative feature groups, in-sample prediction performance was negatively correlated with dataset size. Sophisticated models overfitted in small datasets but maximized holdout test results in larger datasets. While N = 500 mitigated overfitting, performance did not converge until N = 750–1500. Consequently, we propose minimum dataset sizes of N = 500–1000. As such, this study offers an empirical reference for researchers designing or interpreting AI studies on Digital Mental Health Intervention data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Ensemble deep learning and EfficientNet for accurate diagnosis of diabetic retinopathy",
        "link": "https://www.nature.com/articles/s41598-024-81132-4",
        "publication_date": "18 Dec 2024",
        "abstract": "Diabetic Retinopathy (DR) stands as a significant global cause of vision impairment, underscoring the critical importance of early detection in mitigating its impact. Addressing this challenge head-on, this study introduces an innovative deep learning framework tailored for DR diagnosis. The proposed framework utilizes the EfficientNetB0 architecture to classify diabetic retinopathy severity levels from retinal images. By harnessing advanced techniques in computer vision and machine learning, the proposed model aims to deliver precise and dependable DR diagnoses. Continuous testing and experimentation shows to the efficiency of the architecture, showcasing promising outcomes that could help in the transformation of both diagnosing and treatment of DR. This framework takes help from the EfficientNet Machine Learning algorithms and employing advanced CNN layering techniques. The dataset utilized in this study is titled ’Diagnosis of Diabetic Retinopathy’ and is sourced from Kaggle. It consists of 35,108 retinal images, classified into five categories: No Diabetic Retinopathy (DR), Mild DR, Moderate DR, Severe DR, and Proliferative DR. Through rigorous testing, the framework yields impressive results, boasting an average accuracy of 86.53% and a loss rate of 0.5663. A comparison with alternative approaches underscores the effectiveness of EfficientNet in handling classification tasks for diabetic retinopathy, particularly highlighting its high accuracy and generalizability across DR severity levels. These findings highlight the framework’s potential to significantly advance the field of DR diagnosis, given more advanced datasets and more training resources which leads it to be offering clinicians a powerful tool for early intervention and improved patient outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A finer-grained high altitude EEG dataset for hypoxia levels assessment",
        "link": "https://www.nature.com/articles/s41597-024-04102-5",
        "publication_date": "18 Dec 2024",
        "abstract": "The study reports on a high-altitude EEG dataset comprising 64-channel EEG signals from 23 subjects, aiming at achieving a finer-grained assessment of hypoxia levels. Four hypoxia levels were induced by creating a gradient of oxygen partial pressure through changes in altitude and external hypoxia stimulation. The dataset was collected in a hypoxic chamber that simulates altitude changes, allowing for a refined classification of different hypoxia levels based on ranges of oxygen saturation. The total recorded EEG data amounts to approximately 10.25 hours. Validation results indicate that the four hypoxia levels can be effectively recognized using EEG signals. Compared to binary classification, our fine-grained dataset allows for more precise detection of hypoxia levels. This dataset is anticipated to have significant research and practical value in developing accurate methods for identifying hypoxia levels. As a valuable and standardized resource, it will enable extensive analysis and comparison for researchers in the field of high-altitude hypoxia.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Neutralizing GDF-15 can overcome anti-PD-1 and anti-PD-L1 resistance in solid tumours",
        "link": "https://www.nature.com/articles/s41586-024-08305-z",
        "publication_date": "11 Dec 2024",
        "abstract": "Cancer immunotherapies with antibodies blocking immune checkpoint molecules are clinically active across multiple cancer entities and have markedly improved cancer treatment1. Yet, response rates are still limited, and tumour progression commonly occurs2. Soluble and cell-bound factors in the tumour microenvironment negatively affect cancer immunity. Recently, growth differentiation factor 15 (GDF-15), a cytokine that is abundantly produced by many cancer types, was shown to interfere with antitumour immune response. In preclinical cancer models, GDF-15 blockade synergistically enhanced the efficacy of anti-PD-1-mediated checkpoint inhibition3. In a first-in-human phase 1–2a study (GDFATHER-1/2a trial, NCT04725474), patients with advanced cancers refractory to anti-PD-1 or anti-PD-L1 therapy (termed generally as anti-PD-1/PD-L1 refractoriness) were treated with the neutralizing anti-GDF-15 antibody visugromab (CTL-002) in combination with the anti-PD-1 antibody nivolumab. Here we show that durable and deep responses were achieved in some patients with non-squamous non-small cell lung cancer and urothelial cancer, two cancer entities identified as frequently immunosuppressed by GDF-15 in an in silico screening of approximately 10,000 tumour samples in The Cancer Genome Atlas database. Increased levels of tumour infiltration, proliferation, interferon-γ-related signalling and granzyme B expression by cytotoxic T cells were observed in response to treatment. Neutralizing GDF-15 holds promise in overcoming resistance to immune checkpoint inhibition in cancer.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Visual and anatomical failure of anti-VEGF therapy for retinal vascular diseases: a survival analysis of real-world data",
        "link": "https://www.nature.com/articles/s41433-024-03529-9",
        "publication_date": "10 Dec 2024",
        "abstract": "Predicting undesirable outcomes following anti-VEGF initiation in macular oedema is critical for effective clinical decision-making and optimised care.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "What patients and caregivers want to know when consenting to the use of digital behavioral markers",
        "link": "https://www.nature.com/articles/s44277-024-00022-9",
        "publication_date": "06 Dec 2024",
        "abstract": "Artificial intelligence (AI)-based computational tools for deriving digital behavioral markers are increasingly able to automatically detect clinically relevant patterns in mood and behavior through algorithmic analysis of continuously and passively collected data. The integration of these technologies into clinical care is imminent, most notably in clinical psychology and psychiatry but also other disciplines (e.g., cardiology, neurology, neurosurgery, pain management). Meanwhile, ethical guidelines for implementation are lacking, as are insights into what patients and caregivers want and need to know about these technologies to ensure acceptability and informed consent. In this work, we present qualitative findings from interviews with 40 adolescent patients and their caregivers examining ethical and practical considerations for translating these technologies into clinical care. We observed seven key domains (in order of salience) in stakeholders’ informational needs: (1) clinical utility and value; (2) evidence, explainability, evaluation and contestation; (3) accuracy and trustworthiness; (4) data security, privacy, and misuse; (5) patient consent, control, and autonomy; (6) physician-patient relationship; and (7) patient safety, well-being, and dignity. Drawing from these themes, we provide a checklist of questions, as well as suggestions and key challenges, to help researchers and practitioners respond to what stakeholders want to know when integrating these technologies into clinical care and research. Our findings inform participatory approaches to co-designing treatment roadmaps for using these AI-based tools for enhanced patient engagement, acceptability and informed consent.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prognostic value of the platelet, neutrophil, monocyte, basophil, and eosinophil to lymphocyte ratios in patients with severe community-acquired pneumonia (SCAP)",
        "link": "https://www.nature.com/articles/s41598-024-80727-1",
        "publication_date": "06 Dec 2024",
        "abstract": "Severe community-acquired pneumonia (SCAP) is a serious respiratory inflammation disease with high morbidity and mortality. This study aimed to evaluate the prognostic value of the platelet-to-lymphocyte ratio (PLR), neutrophil-to-lymphocyte ratio (NLR), monocyte-to-lymphocyte ratio (MLR), basophil-to-lymphocyte ratio (BLR) and eosinophil-to-lymphocyte ratio (ELR) in patients with SCAP. The study retrospectively included 554 patients with SCAP, and the clinical data were obtained from the electronic patient record (EMR) system. The primary outcome was in-hospital mortality, and the secondary outcomes included hospital length of stay (LOS), overall survival (OS), admission to ICU, ICU LOS, and ICU mortality. The results showed that both NLR and BLR were significant but not independent prognostic factors for in-hospital mortality; NLR was negatively correlated with hospital LOS while ELR was positively correlated with hospital LOS; both increased NLR and increased BLR were associated with reduced OS, while increased ELR was associated with improved OS; increased PLR, NLR, MLR, and BLR were all correlated with elevated ICU admission rates, while increased ELR was correlated with a reduced ICU admission rate; ELR was positively correlated with ICU LOS; both higher NLR and higher BLR were associated with increased ICU mortality. In summary, NLR and BLR were useful prognostic factors for clinical outcomes in patients with SCAP.",
        "conclusions": "In the patients with SCAP, both NLR and BLR were significant but not independent prognostic factors for in-hospital mortality, and were associated with reduced OS, elevated ICU admission rates, and increased ICU mortality. In addition, both NLR and BLR were raised in the patients with SCAP compared to healthy volunteers, and were lowered when the patients were in recovery after treatment. Thus, both higher NLR and higher BLR were related to worse clinical outcomes in the patients with SCAP. In summary, both NLR and BLR had high prognostic value in SCAP.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]