[
    {
        "title": "Discrete-time survival analysis in the critically ill: a deep learning approach using heterogeneous data",
        "link": "https://www.nature.com/articles/s41746-022-00679-6",
        "publication_date": "14 Sept 2022",
        "abstract": "Prediction of survival for patients in intensive care units (ICUs) has been subject to intense research. However, no models exist that embrace the multiverse of data in ICUs. It is an open question whether deep learning methods using automated data integration with minimal pre-processing of mixed data domains such as free text, medical history and high-frequency data can provide discrete-time survival estimates for individual ICU patients. We trained a deep learning model on data from patients admitted to ten ICUs in the Capital Region of Denmark and the Region of Southern Denmark between 2011 and 2018. Inspired by natural language processing we mapped the electronic patient record data to an embedded representation and fed the data to a recurrent neural network with a multi-label output layer representing the chance of survival at different follow-up times. We evaluated the performance using the time-dependent concordance index. In addition, we quantified and visualized the drivers of survival predictions using the SHAP methodology. We included 37,355 admissions of 29,417 patients in our study. Our deep learning models outperformed traditional Cox proportional-hazard models with concordance index in the ranges 0.72–0.73, 0.71–0.72, 0.71, and 0.69–0.70, for models applied at baseline 0, 24, 48, and 72 h, respectively. Deep learning models based on a combination of entity embeddings and survival modelling is a feasible approach to obtain individualized survival estimates in data-rich settings such as the ICU. The interpretable nature of the models enables us to understand the impact of the different data domains.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep neural networks allow expert-level brain meningioma segmentation and present potential for improvement of clinical practice",
        "link": "https://www.nature.com/articles/s41598-022-19356-5",
        "publication_date": "14 Sept 2022",
        "abstract": "Accurate brain meningioma segmentation and volumetric assessment are critical for serial patient follow-up, surgical planning and monitoring response to treatment. Current gold standard of manual labeling is a time-consuming process, subject to inter-user variability. Fully-automated algorithms for meningioma segmentation have the potential to bring volumetric analysis into clinical and research workflows by increasing accuracy and efficiency, reducing inter-user variability and saving time. Previous research has focused solely on segmentation tasks without assessment of impact and usability of deep learning solutions in clinical practice. Herein, we demonstrate a three-dimensional convolutional neural network (3D-CNN) that performs expert-level, automated meningioma segmentation and volume estimation on MRI scans. A 3D-CNN was initially trained by segmenting entire brain volumes using a dataset of 10,099 healthy brain MRIs. Using transfer learning, the network was then specifically trained on meningioma segmentation using 806 expert-labeled MRIs. The final model achieved a median performance of 88.2% reaching the spectrum of current inter-expert variability (82.6–91.6%). We demonstrate in a simulated clinical scenario that a deep learning approach to meningioma segmentation is feasible, highly accurate and has the potential to improve current clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning-based quantitative estimation of lymphedema-induced fibrosis using three-dimensional computed tomography images",
        "link": "https://www.nature.com/articles/s41598-022-19204-6",
        "publication_date": "13 Sept 2022",
        "abstract": "In lymphedema, proinflammatory cytokine-mediated progressive cascades always occur, leading to macroscopic fibrosis. However, no methods are practically available for measuring lymphedema-induced fibrosis before its deterioration. Technically, CT can visualize fibrosis in superficial and deep locations. For standardized measurement, verification of deep learning (DL)-based recognition was performed. A cross-sectional, observational cohort trial was conducted. After narrowing window width of the absorptive values in CT images, SegNet-based semantic segmentation model of every pixel into 5 classes (air, skin, muscle/water, fat, and fibrosis) was trained (65%), validated (15%), and tested (20%). Then, 4 indices were formulated and compared with the standardized circumference difference ratio (SCDR) and bioelectrical impedance (BEI) results. In total, 2138 CT images of 27 chronic unilateral lymphedema patients were analyzed. Regarding fibrosis segmentation, the mean boundary F1 score and accuracy were 0.868 and 0.776, respectively. Among 19 subindices of the 4 indices, 73.7% were correlated with the BEI (partial correlation coefficient: 0.420–0.875), and 13.2% were correlated with the SCDR (0.406–0.460). The mean subindex of Index 2 \\(\\left( {\\frac{{P_{Fibrosis\\, in\\, Affected} - P_{Fibrosis\\, in\\, Unaffected} }}{{P_{Limb\\, in\\, Unaffected} }}} \\right)\\) presented the highest correlation. DL has potential applications in CT image-based lymphedema-induced fibrosis recognition. The subtraction-type formula might be the most promising estimation method.",
        "conclusions": "To show the validity of the DL-based algorithm for identifying lymphedema-induced fibrosis in CT scans, a cross-sectional, observational cohort trial was conducted, and the proposed algorithm was compared with the two gold standard measurements of lymphedema: the BEI and SCDR. In total, 1920 images of 30 lymphedema patients were assigned to a training dataset (65%), validation dataset (15%), and test dataset (20%). The accuracy and MeanBFScore of the SegNet-based fibrosis segmentation were 0.776 and 0.868, respectively. The 4 calculated indices showed a significant strength of correlation (0.420–0.875) with the BEI in patients with chronic moderate-to-severe lymphedema. Among the 4 calculated formulae, the subtraction-type formula is the most promising for this estimation and could act as a foundation for development of automatic recognition systems for fibrotic changes resulting from various inflammation-provoking diseases, such as cellulitis and generalized edema67. Such systems would use cross-sectional CT images, leading to a greater chance of early detection with standardized classification in the future.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Transfontanelle photoacoustic imaging for in-vivo cerebral oxygenation measurement",
        "link": "https://www.nature.com/articles/s41598-022-19350-x",
        "publication_date": "13 Sept 2022",
        "abstract": "The capability of photoacoustic (PA) imaging to measure oxygen saturation through a fontanelle has been demonstrated in large animals in-vivo. We called this method, transfontanelle photoacoustic imaging (TFPAI). A surgically induced 2.5 cm diameter cranial window was created in an adult sheep skull to model the human anterior fontanelle. The performance of the TFPAI has been evaluated by comparing the PA-based predicted results against the gold standard of blood gas analyzer measurements.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evidence from “big data” for the default-mode hypothesis of ADHD: a mega-analysis of multiple large samples",
        "link": "https://www.nature.com/articles/s41386-022-01408-z",
        "publication_date": "13 Sept 2022",
        "abstract": "We sought to identify resting-state characteristics related to attention deficit/hyperactivity disorder, both as a categorical diagnosis and as a trait feature, using large-scale samples which were processed according to a standardized pipeline. In categorical analyses, we considered 1301 subjects with diagnosed ADHD, contrasted against 1301 unaffected controls (total N = 2602; 1710 males (65.72%); mean age = 10.86 years, sd = 2.05). Cases and controls were 1:1 nearest neighbor matched on in-scanner motion and key demographic variables and drawn from multiple large cohorts. Associations between ADHD-traits and resting-state connectivity were also assessed in a large multi-cohort sample (N = 10,113). ADHD diagnosis was associated with less anticorrelation between the default mode and salience/ventral attention (B = 0.009, t = 3.45, p-FDR = 0.004, d = 0.14, 95% CI = 0.004, 0.014), somatomotor (B = 0.008, t = 3.49, p-FDR = 0.004, d = 0.14, 95% CI = 0.004, 0.013), and dorsal attention networks (B = 0.01, t = 4.28, p-FDR < 0.001, d = 0.17, 95% CI = 0.006, 0.015). These results were robust to sensitivity analyses considering comorbid internalizing problems, externalizing problems and psychostimulant medication. Similar findings were observed when examining ADHD traits, with the largest effect size observed for connectivity between the default mode network and the dorsal attention network (B = 0.0006, t = 5.57, p-FDR < 0.001, partial-r = 0.06, 95% CI = 0.0004, 0.0008). We report significant ADHD-related differences in interactions between the default mode network and task-positive networks, in line with default mode interference models of ADHD. Effect sizes (Cohen’s d and partial-r, estimated from the mega-analytic models) were small, indicating subtle group differences. The overlap between the affected brain networks in the clinical and general population samples supports the notion of brain phenotypes operating along an ADHD continuum.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "In vivo tumor immune microenvironment phenotypes correlate with inflammation and vasculature to predict immunotherapy response",
        "link": "https://www.nature.com/articles/s41467-022-32738-7",
        "publication_date": "09 Sept 2022",
        "abstract": "Response to immunotherapies can be variable and unpredictable. Pathology-based phenotyping of tumors into ‘hot’ and ‘cold’ is static, relying solely on T-cell infiltration in single-time single-site biopsies, resulting in suboptimal treatment response prediction. Dynamic vascular events (tumor angiogenesis, leukocyte trafficking) within tumor immune microenvironment (TiME) also influence anti-tumor immunity and treatment response. Here, we report dynamic cellular-level TiME phenotyping in vivo that combines inflammation profiles with vascular features through non-invasive reflectance confocal microscopic imaging. In skin cancer patients, we demonstrate three main TiME phenotypes that correlate with gene and protein expression, and response to toll-like receptor agonist immune-therapy. Notably, phenotypes with high inflammation associate with immunostimulatory signatures and those with high vasculature with angiogenic and endothelial anergy signatures. Moreover, phenotypes with high inflammation and low vasculature demonstrate the best treatment response. This non-invasive in vivo phenotyping approach integrating dynamic vasculature with inflammation serves as a reliable predictor of response to topical immune-therapy in patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying patterns in amyotrophic lateral sclerosis progression from sparse longitudinal data",
        "link": "https://www.nature.com/articles/s43588-022-00299-w",
        "publication_date": "08 Sept 2022",
        "abstract": "The clinical presentation of amyotrophic lateral sclerosis (ALS), a fatal neurodegenerative disease, varies widely across patients, making it challenging to determine if potential therapeutics slow progression. We sought to determine whether there were common patterns of disease progression that could aid in the design and analysis of clinical trials. We developed an approach based on a mixture of Gaussian processes to identify clusters of patients sharing similar disease progression patterns, modeling their average trajectories and the variability in each cluster. We show that ALS progression is frequently nonlinear, with periods of stable disease preceded or followed by rapid decline. We also show that our approach can be extended to Alzheimer’s and Parkinson’s diseases. Our results advance the characterization of disease progression of ALS and provide a flexible modeling approach that can be applied to other progressive diseases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Genome-wide association analyses of physical activity and sedentary behavior provide insights into underlying mechanisms and roles in disease prevention",
        "link": "https://www.nature.com/articles/s41588-022-01165-1",
        "publication_date": "07 Sept 2022",
        "abstract": "Although physical activity and sedentary behavior are moderately heritable, little is known about the mechanisms that influence these traits. Combining data for up to 703,901 individuals from 51 studies in a multi-ancestry meta-analysis of genome-wide association studies yields 99 loci that associate with self-reported moderate-to-vigorous intensity physical activity during leisure time (MVPA), leisure screen time (LST) and/or sedentary behavior at work. Loci associated with LST are enriched for genes whose expression in skeletal muscle is altered by resistance training. A missense variant in ACTN3 makes the alpha-actinin-3 filaments more flexible, resulting in lower maximal force in isolated type IIA muscle fibers, and possibly protection from exercise-induced muscle damage. Finally, Mendelian randomization analyses show that beneficial effects of lower LST and higher MVPA on several risk factors and diseases are mediated or confounded by body mass index (BMI). Our results provide insights into physical activity mechanisms and its role in disease prevention.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Validation of an overnight wireless high-resolution oximeter for the diagnosis of obstructive sleep apnea at home",
        "link": "https://www.nature.com/articles/s41598-022-17698-8",
        "publication_date": "07 Sept 2022",
        "abstract": "Obstructive sleep apnea (OSA) is extremely common and has several consequences. However, most cases remain undiagnosed. One limitation is the lack of simple and validated methods for OSA diagnosis at home. The aim of this study was to validate a wireless high-resolution oximeter with a built-in accelerometer linked to a smartphone with automated cloud analysis (Biologix) that was compared with a home sleep test (HST, Apnea Link Air) performed on the same night. We recruited 670 patients out of a task force of 1013 patients with suspected OSA who were referred to our center for diagnosis. The final sample consisted of 478 patients (mean age: 56.7 ± 13.1 years, mean body mass index: 31.9 ± 6.3 kg/m2). To estimate the night-to-night OSA severity variability, 62 patients underwent HST for two consecutive nights. The HST-apnea–hypopnea index (AHI) and the Biologix-oxygen desaturation index (ODI) was 25.0 ± 25.0 events/h and 24.9 ± 26.5 events/h, respectively. The area under the curve—sensibility/specificity to detect at least mild (HST-AHI > 5), moderate-to-severe (HST-AHI > 15), and severe OSA (HST-AHI > 30) were (0.983)—94.7/92.8, (0.986)—94.8/93.9, and (0.990)—95.8/94.3, respectively. The limits of agreement originating from the Bland–Altman plot and the correlation between HST-AHI and Biologix-ODI were lower than the night-to-night HST-AHI variability (25.5 and 34.5 events/h, respectively, p = 0.001). We conclude that Biologix is a simple and reliable technique for OSA diagnosis at home.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Performance of a novel risk model for deep sternal wound infection after coronary artery bypass grafting",
        "link": "https://www.nature.com/articles/s41598-022-19473-1",
        "publication_date": "07 Sept 2022",
        "abstract": "Clinical prediction models for deep sternal wound infections (DSWI) after coronary artery bypass graft (CABG) surgery exist, although they have a poor impact in external validation studies. We developed and validated a new predictive model for 30-day DSWI after CABG (REPINF) and compared it with the Society of Thoracic Surgeons model (STS). The REPINF model was created through a multicenter cohort of adults undergoing CABG surgery (REPLICCAR II Study) database, using least absolute shrinkage and selection operator (LASSO) logistic regression, internally and externally validated comparing discrimination, calibration in-the-large (CL), net reclassification improvement (NRI) and integrated discrimination improvement (IDI), trained between the new model and the STS PredDeep, a validated model for DSWI after cardiac surgery. In the validation data, c-index = 0.83 (95% CI 0.72–0.95). Compared to the STS PredDeep, predictions improved by 6.5% (IDI). However, both STS and REPINF had limited calibration. Different populations require independent scoring systems to achieve the best predictive effect. The external validation of REPINF across multiple centers is an important quality improvement tool to generalize the model and to guide healthcare professionals in the prevention of DSWI after CABG surgery.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "High-dimensional multinomial multiclass severity scoring of COVID-19 pneumonia using CT radiomics features and machine learning algorithms",
        "link": "https://www.nature.com/articles/s41598-022-18994-z",
        "publication_date": "01 Sept 2022",
        "abstract": "We aimed to construct a prediction model based on computed tomography (CT) radiomics features to classify COVID-19 patients into severe-, moderate-, mild-, and non-pneumonic. A total of 1110 patients were studied from a publicly available dataset with 4-class severity scoring performed by a radiologist (based on CT images and clinical features). The entire lungs were segmented and followed by resizing, bin discretization and radiomic features extraction. We utilized two feature selection algorithms, namely bagging random forest (BRF) and multivariate adaptive regression splines (MARS), each coupled to a classifier, namely multinomial logistic regression (MLR), to construct multiclass classification models. The dataset was divided into 50% (555 samples), 20% (223 samples), and 30% (332 samples) for training, validation, and untouched test datasets, respectively. Subsequently, nested cross-validation was performed on train/validation to select the features and tune the models. All predictive power indices were reported based on the testing set. The performance of multi-class models was assessed using precision, recall, F1-score, and accuracy based on the 4 × 4 confusion matrices. In addition, the areas under the receiver operating characteristic  curves (AUCs) for multi-class classifications were calculated and compared for both models. Using BRF, 23 radiomic features were selected, 11 from first-order, 9 from GLCM, 1 GLRLM, 1 from GLDM, and 1 from shape. Ten features were selected using the MARS algorithm, namely 3 from first-order, 1 from GLDM, 1 from GLRLM, 1 from GLSZM, 1 from shape, and 3 from GLCM features. The mean absolute deviation, skewness, and variance from first-order and flatness from shape, and cluster prominence from GLCM features and Gray Level Non Uniformity Normalize from GLRLM were selected by both BRF and MARS algorithms. All selected features by BRF or MARS were significantly associated with four-class outcomes as assessed within MLR (All p values < 0.05). BRF + MLR and MARS + MLR resulted in pseudo-R2 prediction performances of 0.305 and 0.253, respectively. Meanwhile, there was a significant difference between the feature selection models when using a likelihood ratio test (p value = 0.046). Based on confusion matrices for BRF + MLR and MARS + MLR algorithms, the precision was 0.856 and 0.728, the recall was 0.852 and 0.722, whereas the accuracy was 0.921 and 0.861, respectively. AUCs (95% CI) for multi-class classification were 0.846 (0.805–0.887) and 0.807 (0.752–0.861) for BRF + MLR and MARS + MLR algorithms, respectively. Our models based on the utilization of radiomic features, coupled with machine learning were able to accurately classify patients according to the severity of pneumonia, thus highlighting the potential of this emerging paradigm in the prognostication and management of COVID-19 patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Breast cancer detection by analyzing the volatile organic compound (VOC) signature in human urine",
        "link": "https://www.nature.com/articles/s41598-022-17795-8",
        "publication_date": "01 Sept 2022",
        "abstract": "A rising number of authors are drawing evidence on the diagnostic capacity of specific volatile organic compounds (VOCs) resulting from some body fluids. While cancer incidence in society is on the rise, it becomes clear that the analysis of these VOCs can yield new strategies to mitigate advanced cancer incidence rates. This paper presents the methodology implemented to test whether a device consisting of an electronic nose inspired by a dog’s olfactory system and olfactory neurons is significantly informative to detect breast cancer (BC). To test this device, 90 human urine samples were collected from control subjects and BC patients at a hospital. To test this system, an artificial intelligence-based classification algorithm was developed. The algorithm was firstly trained and tested with data resulting from gas chromatography-mass spectrometry (GC–MS) urine readings, leading to a classification rate of 92.31%, sensitivity of 100.00%, and specificity of 85.71% (N = 90). Secondly, the same algorithm was trained and tested with data obtained with our eNose prototype hardware, and class prediction was achieved with a classification rate of 75%, sensitivity of 100%, and specificity of 50%.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Reproducibility of real-world evidence studies using clinical practice data to inform regulatory and coverage decisions",
        "link": "https://www.nature.com/articles/s41467-022-32310-3",
        "publication_date": "31 Aug 2022",
        "abstract": "Studies that generate real-world evidence on the effects of medical products through analysis of digital data collected in clinical practice provide key insights for regulators, payers, and other healthcare decision-makers. Ensuring reproducibility of such findings is fundamental to effective evidence-based decision-making. We reproduce results for 150 studies published in peer-reviewed journals using the same healthcare databases as original investigators and evaluate the completeness of reporting for 250. Original and reproduction effect sizes were positively correlated (Pearson’s correlation = 0.85), a strong relationship with some room for improvement. The median and interquartile range for the relative magnitude of effect (e.g., hazard ratiooriginal/hazard ratioreproduction) is 1.0 [0.9, 1.1], range [0.3, 2.1]. While the majority of results are closely reproduced, a subset are not. The latter can be explained by incomplete reporting and updated data. Greater methodological transparency aligned with new guidance may further improve reproducibility and validity assessment, thus facilitating evidence-based decision-making. Study registration number: EUPAS19636.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based automatic estimation of cortical atrophy using brain computed tomography images",
        "link": "https://www.nature.com/articles/s41598-022-18696-6",
        "publication_date": "30 Aug 2022",
        "abstract": "Cortical atrophy is measured clinically according to established visual rating scales based on magnetic resonance imaging (MRI). Although brain MRI is the primary imaging marker for neurodegeneration, computed tomography (CT) is also widely used for the early detection and diagnosis of dementia. However, they are seldom investigated. Therefore, we developed a machine learning algorithm for the automatic estimation of cortical atrophy on brain CT. Brain CT images (259 Alzheimer’s dementia and 55 cognitively normal subjects) were visually rated by three neurologists and used for training. We constructed an algorithm by combining the convolutional neural network and regularized logistic regression (RLR). Model performance was then compared with that of neurologists, and feature importance was measured. RLR provided fast and reliable automatic estimations of frontal atrophy (75.2% accuracy, 93.6% sensitivity, 67.2% specificity, and 0.87 area under the curve [AUC]), posterior atrophy (79.6% accuracy, 87.2% sensitivity, 75.9% specificity, and 0.88 AUC), right medial temporal atrophy (81.2% accuracy, 84.7% sensitivity, 79.6% specificity, and 0.88 AUC), and left medial temporal atrophy (77.7% accuracy, 91.1% sensitivity, 72.3% specificity, and 0.90 AUC). We concluded that RLR-based automatic estimation of brain CT provided a comprehensive rating of atrophy that can potentially support physicians in real clinical settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Semi-supervised classifier guided by discriminator",
        "link": "https://www.nature.com/articles/s41598-022-18947-6",
        "publication_date": "29 Aug 2022",
        "abstract": "Some machine learning applications do not allow for data augmentation or are applied to modalities where the augmentation is difficult to define. Our study aimed to develop a new method in semi-supervised learning (SSL) applicable to various modalities of data (images, sound, text), especially when augmentation is hard or impossible to define, i.e., medical images. Assuming that all samples, labeled and unlabeled, come from the same data distribution, we can say that labeled and unlabeled data sets used in the semi-supervised learning tasks are similar. Based on this observation, the data embeddings created by the classifier should also be similar for both sets. In our method, finding these embeddings is achieved based on two models—classifier and an auxiliary discriminator model, inspired by the Generative Adversarial Network (GAN) learning process. The classifier is trained to build embeddings for labeled and unlabeled datasets to cheat discriminator, which recognizes whether the embedding comes from a labeled or unlabeled dataset. The method was named the DGSSC from Discriminator Guided Semi-Supervised Classifier. The experimental research aimed evaluation of the proposed method on the classification task in combination with the teacher-student approach and comparison with other SSL methods. In most experiments, training the networks with the DGSSC method improves accuracy with the teacher-student approach. It does not deteriorate the accuracy of any experiment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prehospital diagnostic algorithm for acute coronary syndrome using machine learning: a prospective observational study",
        "link": "https://www.nature.com/articles/s41598-022-18650-6",
        "publication_date": "26 Aug 2022",
        "abstract": "Rapid and precise prehospital recognition of acute coronary syndrome (ACS) is key to improving clinical outcomes. The aim of this study was to investigate a predictive power for predicting ACS using the machine learning-based prehospital algorithm. We conducted a multicenter observational prospective study that included 10 participating facilities in an urban area of Japan. The data from consecutive adult patients, identified by emergency medical service personnel with suspected ACS, were analyzed. In this study, we used nested cross-validation to evaluate the predictive performance of the model. The primary outcomes were binary classification models for ACS prediction based on the nine machine learning algorithms. The voting classifier model for ACS using 43 features had the highest area under the receiver operating curve (AUC) (0.861 [95% CI 0.775–0.832]) in the test score. After validating the accuracy of the model using the external cohort, we repeated the analysis with a limited number of selected features. The performance of the algorithms using 17 features remained high AUC (voting classifier, 0.864 [95% CI 0.830–0.898], support vector machine (radial basis function), 0.864 [95% CI 0.829–0.887]) in the test score. We found that the machine learning-based prehospital algorithms showed a high predictive power for predicting ACS.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Validity and reliability of accelerations and orientations measured using wearable sensors during functional activities",
        "link": "https://www.nature.com/articles/s41598-022-18845-x",
        "publication_date": "26 Aug 2022",
        "abstract": "Wearable sensors may enable the assessment of movement in a real-world setting, but they are not yet a standard practice in the analysis of movement due to the unknown accuracy and reliability with respect to different functional activities. Here, we established the concurrent validity and test–retest reliability of accelerations and orientations measured using affordable novel sensors during squats, jumps, walking and stair ambulation. In this observational study, participants underwent three data collection sessions during one day. Accelerations and orientations from sacrum, thigh and shank were collected using these sensors and already validated gold-standard sensors as the criterion method. We assessed validity by comparing the similarity of signal waveforms with the Linear Fit Method and by comparing mean differences in range values with the Bland–Altman plots. Reliability was assessed by calculating interclass correlation coefficient and standard error of measurements of the range values. Concurrent validity was from fair to excellent in 91% of the cases for accelerations and in 84.4% for orientations. Test–retest reliability of accelerations was from fair to excellent in 97% of cases when the sensors were attached by a researcher, and in 84.4% of cases when the sensors were attached by participants. Test–retest reliability of orientations was from fair to excellent in 88.9% of cases when the sensors were attached by a researcher, and in 68.9% of cases when the sensors were attached by participants. In conclusion, the new affordable sensors provide accurate measures of accelerations and orientations during multiple functional activities in healthy adults. Reliability of the orientations may depend on the ability to replicate the same position of the sensor under test–retest conditions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "LeMeDISCO is a computational method for large-scale prediction & molecular interpretation of disease comorbidity",
        "link": "https://www.nature.com/articles/s42003-022-03816-9",
        "publication_date": "25 Aug 2022",
        "abstract": "To understand the origin of disease comorbidity and to identify the essential proteins and pathways underlying comorbid diseases, we developed LeMeDISCO (Large-Scale Molecular Interpretation of Disease Comorbidity), an algorithm that predicts disease comorbidities from shared mode of action proteins predicted by the artificial intelligence-based MEDICASCY algorithm. LeMeDISCO was applied to predict the occurrence of comorbid diseases for 3608 distinct diseases. Benchmarking shows that LeMeDISCO has much better comorbidity recall than the two molecular methods XD-score (44.5% vs. 6.4%) and the SAB score (68.6% vs. 8.0%). Its performance is somewhat comparable to the phenotype method-based Symptom Similarity Score, 63.7% vs. 100%, but LeMeDISCO works for far more cases and its large comorbidity recall is attributed to shared proteins that can help provide an understanding of the molecular mechanism(s) underlying disease comorbidity. The LeMeDISCO web server is available for academic users at: http://sites.gatech.edu/cssb/LeMeDISCO.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Network phenotypes and their clinical significance in temporal lobe epilepsy using machine learning applications to morphological and functional graph theory metrics",
        "link": "https://www.nature.com/articles/s41598-022-18495-z",
        "publication_date": "24 Aug 2022",
        "abstract": "Machine learning analyses were performed on graph theory (GT) metrics extracted from brain functional and morphological data from temporal lobe epilepsy (TLE) patients in order to identify intrinsic network phenotypes and characterize their clinical significance. Participants were 97 TLE and 36 healthy controls from the Epilepsy Connectome Project. Each imaging modality (i.e., Resting-state functional Magnetic Resonance Imaging (RS-fMRI), and structural MRI) rendered 2 clusters: one comparable to controls and one deviating from controls. Participants were minimally overlapping across the identified clusters, suggesting that an abnormal functional GT phenotype did not necessarily mean an abnormal morphological GT phenotype for the same subject. Morphological clusters were associated with a significant difference in the estimated lifetime number of generalized tonic–clonic seizures and functional cluster membership was associated with age. Furthermore, controls exhibited significant correlations between functional GT metrics and cognition, while for TLE participants morphological GT metrics were linked to cognition, suggesting a dissociation between higher cognitive abilities and GT-derived network measures. Overall, these findings demonstrate the existence of clinically meaningful minimally overlapping phenotypes of morphological and functional GT networks. Functional network properties may underlie variance in cognition in healthy brains, but in the pathological state of epilepsy the cognitive limits might be primarily related to structural cerebral network properties.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Brain–phenotype models fail for individuals who defy sample stereotypes",
        "link": "https://www.nature.com/articles/s41586-022-05118-w",
        "publication_date": "24 Aug 2022",
        "abstract": "Individual differences in brain functional organization track a range of traits, symptoms and behaviours1,2,3,4,5,6,7,8,9,10,11,12. So far, work modelling linear brain–phenotype relationships has assumed that a single such relationship generalizes across all individuals, but models do not work equally well in all participants13,14. A better understanding of in whom models fail and why is crucial to revealing robust, useful and unbiased brain–phenotype relationships. To this end, here we related brain activity to phenotype using predictive models—trained and tested on independent data to ensure generalizability15—and examined model failure. We applied this data-driven approach to a range of neurocognitive measures in a new, clinically and demographically heterogeneous dataset, with the results replicated in two independent, publicly available datasets16,17. Across all three datasets, we find that models reflect not unitary cognitive constructs, but rather neurocognitive scores intertwined with sociodemographic and clinical covariates; that is, models reflect stereotypical profiles, and fail when applied to individuals who defy them. Model failure is reliable, phenotype specific and generalizable across datasets. Together, these results highlight the pitfalls of a one-size-fits-all modelling approach and the effect of biased phenotypic measures18,19,20 on the interpretation and utility of resulting brain–phenotype models. We present a framework to address these issues so that such models may reveal the neural circuits that underlie specific phenotypes and ultimately identify individualized neural targets for clinical intervention.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluating the performance of Bayesian and frequentist approaches for longitudinal modeling: application to Alzheimer’s disease",
        "link": "https://www.nature.com/articles/s41598-022-18129-4",
        "publication_date": "24 Aug 2022",
        "abstract": "Linear mixed effects (LME) modelling under both frequentist and Bayesian frameworks can be used to study longitudinal trajectories. We studied the performance of both frameworks on different dataset configurations using hippocampal volumes from longitudinal MRI data across groups—healthy controls (HC), mild cognitive impairment (MCI) and Alzheimer’s disease (AD) patients, including subjects that converted from MCI to AD. We started from a big database of 1250 subjects from the Alzheimer’s disease neuroimaging initiative (ADNI), and we created different reduced datasets simulating real-life situations using a random-removal permutation-based approach. The number of subjects needed to differentiate groups and to detect conversion to AD was 147 and 115 respectively. The Bayesian approach allowed estimating the LME model even with very sparse databases, with high number of missing points, which was not possible with the frequentist approach. Our results indicate that the frequentist approach is computationally simpler, but it fails in modelling data with high number of missing values.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of key microRNAs as predictive biomarkers of Nilotinib response in chronic myeloid leukemia: a sub-analysis of the ENESTxtnd clinical trial",
        "link": "https://www.nature.com/articles/s41375-022-01680-4",
        "publication_date": "23 Aug 2022",
        "abstract": "Despite the effectiveness of tyrosine kinase inhibitors (TKIs) against chronic myeloid leukemia (CML), they are not usually curative as some patients develop drug-resistance or are at risk of disease relapse when treatment is discontinued. Studies have demonstrated that primitive CML cells display unique miRNA profiles in response to TKI treatment. However, the utility of miRNAs in predicting treatment response is not yet conclusive. Here, we analyzed differentially expressed miRNAs in CD34+ CML cells pre- and post-nilotinib (NL) therapy from 58 patients enrolled in the Canadian sub-analysis of the ENESTxtnd phase IIIb clinical trial which correlated with sensitivity of CD34+ cells to NL treatment in in vitro colony-forming cell (CFC) assays. We performed Cox Proportional Hazard (CoxPH) analysis and applied machine learning algorithms to generate multivariate miRNA panels which can predict NL response at treatment-naïve or post-treatment time points. We demonstrated that a combination of miR-145 and miR-708 are effective predictors of NL response in treatment-naïve patients whereas miR-150 and miR-185 were significant classifiers at 1-month and 3-month post-NL therapy. Interestingly, incorporation of NL-CFC output in these panels enhanced predictive performance. Thus, this novel predictive model may be developed into a prognostic tool for use in the clinic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Feasibility of anomaly score detected with deep learning in irradiated breast cancer patients with reconstruction",
        "link": "https://www.nature.com/articles/s41746-022-00671-0",
        "publication_date": "23 Aug 2022",
        "abstract": "The aim of this study is to evaluate cosmetic outcomes of the reconstructed breast in breast cancer patients, using anomaly score (AS) detected by generative adversarial network (GAN) deep learning algorithm. A total of 251 normal breast images from patients who underwent breast-conserving surgery were used for training anomaly GAN network. GAN-based anomaly detection was used to calculate abnormalities as an AS, followed by standardization by using z-score. Then, we reviewed 61 breast cancer patients who underwent mastectomy followed by reconstruction with autologous tissue or tissue expander. All patients were treated with adjuvant radiation therapy (RT) after reconstruction and computed tomography (CT) was performed at three-time points with a regular follow-up; before RT (Pre-RT), one year after RT (Post-1Y), and two years after RT (Post-2Y). Compared to Pre-RT, Post-1Y and Post-2Y demonstrated higher AS, indicating more abnormal cosmetic outcomes (Pre-RT vs. Post-1Y, P = 0.015 and Pre-RT vs. Post-2Y, P = 0.011). Pre-RT AS was higher in patients having major breast complications (P = 0.016). Patients with autologous reconstruction showed lower AS than those with tissue expander both at Pre-RT (2.00 vs. 4.19, P = 0.008) and Post-2Y (2.89 vs. 5.00, P = 0.010). Linear mixed effect model revealed that days after baseline were associated with increased AS (P = 0.007). Also, tissue expander was associated with steeper rise of AS, compared to autologous tissue (P = 0.015). Fractionation regimen was not associated with the change of AS (P = 0.389). AS detected by deep learning might be feasible in predicting cosmetic outcomes of RT-treated patients with breast reconstruction. AS should be validated in prospective studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Impact of individual and treatment characteristics on wearable sensor-based digital biomarkers of opioid use",
        "link": "https://www.nature.com/articles/s41746-022-00664-z",
        "publication_date": "22 Aug 2022",
        "abstract": "Opioid use disorder is one of the most pressing public health problems of our time. Mobile health tools, including wearable sensors, have great potential in this space, but have been underutilized. Of specific interest are digital biomarkers, or end-user generated physiologic or behavioral measurements that correlate with health or pathology. The current manuscript describes a longitudinal, observational study of adult patients receiving opioid analgesics for acute painful conditions. Participants in the study are monitored with a wrist-worn E4 sensor, during which time physiologic parameters (heart rate/variability, electrodermal activity, skin temperature, and accelerometry) are collected continuously. Opioid use events are recorded via electronic medical record and self-report. Three-hundred thirty-nine discreet dose opioid events from 36 participant are analyzed among 2070 h of sensor data. Fifty-one features are extracted from the data and initially compared pre- and post-opioid administration, and subsequently are used to generate machine learning models. Model performance is compared based on individual and treatment characteristics. The best performing machine learning model to detect opioid administration is a Channel-Temporal Attention-Temporal Convolutional Network (CTA-TCN) model using raw data from the wearable sensor. History of intravenous drug use is associated with better model performance, while middle age, and co-administration of non-narcotic analgesia or sedative drugs are associated with worse model performance. These characteristics may be candidate input features for future opioid detection model iterations. Once mature, this technology could provide clinicians with actionable data on opioid use patterns in real-world settings, and predictive analytics for early identification of opioid use disorder risk.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparison of the modified Singapore myocardial infarction registry risk score with GRACE 2.0 in predicting 1-year acute myocardial infarction outcomes",
        "link": "https://www.nature.com/articles/s41598-022-16523-6",
        "publication_date": "22 Aug 2022",
        "abstract": "Risk stratification plays a key role in identifying acute myocardial infarction (AMI) patients at higher risk of mortality. However, current AMI risk scores such as the Global Registry of Acute Coronary Events (GRACE) score were derived from predominantly Caucasian populations and may not be applicable to Asian populations. We previously developed an AMI risk score from the national-level Singapore Myocardial Infarction Registry (SMIR) confined to ST-segment elevation myocardial infarction (STEMI) patients and did not include non-STEMI (NSTEMI) patients. Here, we derived a modified SMIR risk score for both STEMI and NSTEMI patients and compared its performance to the GRACE 2.0 score for predicting 1-year all-cause mortality in our multi-ethnic population. The most significant predictor of 1-year all-cause mortality in our population using the GRACE 2.0 score was cardiopulmonary resuscitation on admission (adjusted hazards ratio [HR] 6.50), while the most significant predictor using the SMIR score was age 80–89 years (adjusted HR 7.78). Although the variables used in the GRACE 2.0 score and SMIR score were not exactly the same, the c-statistics for 1-year all-cause mortality were similar between the two scores (GRACE 2.0 0.841 and SMIR 0.865). In conclusion, we have shown that in a multi-ethnic Asian AMI population undergoing PCI, the SMIR score performed as well as the GRACE 2.0 score.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Generation of realistic synthetic data using Multimodal Neural Ordinary Differential Equations",
        "link": "https://www.nature.com/articles/s41746-022-00666-x",
        "publication_date": "20 Aug 2022",
        "abstract": "Individual organizations, such as hospitals, pharmaceutical companies, and health insurance providers, are currently limited in their ability to collect data that are fully representative of a disease population. This can, in turn, negatively impact the generalization ability of statistical models and scientific insights. However, sharing data across different organizations is highly restricted by legal regulations. While federated data access concepts exist, they are technically and organizationally difficult to realize. An alternative approach would be to exchange synthetic patient data instead. In this work, we introduce the Multimodal Neural Ordinary Differential Equations (MultiNODEs), a hybrid, multimodal AI approach, which allows for generating highly realistic synthetic patient trajectories on a continuous time scale, hence enabling smooth interpolation and extrapolation of clinical studies. Our proposed method can integrate both static and longitudinal data, and implicitly handles missing values. We demonstrate the capabilities of MultiNODEs by applying them to real patient-level data from two independent clinical studies and simulated epidemiological data of an infectious disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction of mortality risk of health checkup participants using machine learning-based models: the J-SHC study",
        "link": "https://www.nature.com/articles/s41598-022-18276-8",
        "publication_date": "19 Aug 2022",
        "abstract": "Early detection and treatment of diseases through health checkups are effective in improving life expectancy. In this study, we compared the predictive ability for 5-year mortality between two machine learning-based models (gradient boosting decision tree [XGBoost] and neural network) and a conventional logistic regression model in 116,749 health checkup participants. We built prediction models using a training dataset consisting of 85,361 participants in 2008 and evaluated the models using a test dataset consisting of 31,388 participants from 2009 to 2014. The predictive ability was evaluated by the values of the area under the receiver operating characteristic curve (AUC) in the test dataset. The AUC values were 0.811 for XGBoost, 0.774 for neural network, and 0.772 for logistic regression models, indicating that the predictive ability of XGBoost was the highest. The importance rating of each explanatory variable was evaluated using the SHapley Additive exPlanations (SHAP) values, which were similar among these models. This study showed that the machine learning-based model has a higher predictive ability than the conventional logistic regression model and may be useful for risk assessment and health guidance for health checkup participants.",
        "conclusions": "This study showed that the machine learning method XGBoost has a higher predictive ability for mortality than conventional logistic regression, using the same standardized checkup items. This indicates that machine learning may be helpful for the risk assessment of health checkup participants and the improvement of health checkup programs. Further machine learning analysis focusing on various diseases, such as cardiovascular diseases, cancer, dementia, and frailty, may enable the development of more detailed and useful prediction models tailored to individual conditions.",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting response to immunotherapy in gastric cancer via multi-dimensional analyses of the tumour immune microenvironment",
        "link": "https://www.nature.com/articles/s41467-022-32570-z",
        "publication_date": "18 Aug 2022",
        "abstract": "A single biomarker is not adequate to identify patients with gastric cancer (GC) who have the potential to benefit from anti-PD-1/PD-L1 therapy, presumably owing to the complexity of the tumour microenvironment. The predictive value of tumour-infiltrating immune cells (TIICs) has not been definitively established with regard to their density and spatial organisation. Here, multiplex immunohistochemistry is used to quantify in situ biomarkers at sub-cellular resolution in 80 patients with GC. To predict the response to immunotherapy, we establish a multi-dimensional TIIC signature by considering the density of CD4+FoxP3−PD-L1+, CD8+PD-1−LAG3−, and CD68+STING+ cells and the spatial organisation of CD8+PD-1+LAG3− T cells. The TIIC signature enables prediction of the response of patients with GC to anti-PD-1/PD-L1 immunotherapy and patient survival. Our findings demonstrate that a multi-dimensional TIIC signature may be relevant for the selection of patients who could benefit the most from anti-PD-1/PD-L1 immunotherapy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "DenseUNets with feedback non-local attention for the segmentation of specular microscopy images of the corneal endothelium with guttae",
        "link": "https://www.nature.com/articles/s41598-022-18180-1",
        "publication_date": "18 Aug 2022",
        "abstract": "Corneal guttae, which are the abnormal growth of extracellular matrix in the corneal endothelium, are observed in specular images as black droplets that occlude the endothelial cells. To estimate the corneal parameters (endothelial cell density [ECD], coefficient of variation [CV], and hexagonality [HEX]), we propose a new deep learning method that includes a novel attention mechanism (named fNLA), which helps to infer the cell edges in the occluded areas. The approach first derives the cell edges, then infers the well-detected cells, and finally employs a postprocessing method to fix mistakes. This results in a binary segmentation from which the corneal parameters are estimated. We analyzed 1203 images (500 contained guttae) obtained with a Topcon SP-1P microscope. To generate the ground truth, we performed manual segmentation in all images. Several networks were evaluated (UNet, ResUNeXt, DenseUNets, UNet++, etc.) and we found that DenseUNets with fNLA provided the lowest error: a mean absolute error of 23.16 [cells/mm\\(^{2}\\)] in ECD, 1.28 [%] in CV, and 3.13 [%] in HEX. Compared with Topcon’s built-in software, our error was 3–6 times smaller. Overall, our approach handled notably well the cells affected by guttae, detecting cell edges partially occluded by small guttae and discarding large areas covered by extensive guttae.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Characteristics of major and macular branch retinal vein occlusion",
        "link": "https://www.nature.com/articles/s41598-022-18414-2",
        "publication_date": "18 Aug 2022",
        "abstract": "We compared the aqueous profiles, baseline characteristics, and clinical outcomes of 54 eyes with macular edema secondary to major branch retinal vein occlusion (BRVO) and macular BRVO. We also identified the characteristics of poor responders to anti-vascular endothelial growth factor (VEGF) injections. Aqueous inflammatory cytokine and VEGF concentrations were significantly higher in major BRVO. In optical coherence tomography, major BRVO had a higher proportion with subretinal fluid, disorganization of retinal inner layers, and ellipsoid zone disruption. Comparing the clinical outcomes, major BRVO required more intravitreal anti-VEGF injections and had a poorer visual prognosis in the first 12 months. A significantly higher proportion of patients with major BRVO required additional treatments after 6 months compared to macular BRVO. Patients who responded poorly to anti-VEGF had higher aqueous VEGF levels and central subfield thickness (CST) at baseline. In conclusion, major BRVO patients required more and longer treatments, and had worse visual prognoses. BRVO that responds poorly to anti-VEGF had greater CST and higher aqueous VEGF levels at baseline.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Binary dose level classification of tumour microvascular response to radiotherapy using artificial intelligence analysis of optical coherence tomography images",
        "link": "https://www.nature.com/articles/s41598-022-18393-4",
        "publication_date": "17 Aug 2022",
        "abstract": "The dominant consequence of irradiating biological systems is cellular damage, yet microvascular damage begins to assume an increasingly important role as the radiation dose levels increase. This is currently becoming more relevant in radiation medicine with its pivot towards higher-dose-per-fraction/fewer fractions treatment paradigm (e.g., stereotactic body radiotherapy (SBRT)). We have thus developed a 3D preclinical imaging platform based on speckle-variance optical coherence tomography (svOCT) for longitudinal monitoring of tumour microvascular radiation responses in vivo. Here we present an artificial intelligence (AI) approach to analyze the resultant microvascular data. In this initial study, we show that AI can successfully classify SBRT-relevant clinical radiation dose levels at multiple timepoints (t = 2–4 weeks) following irradiation (10 Gy and 30 Gy cohorts) based on induced changes in the detected microvascular networks. Practicality of the obtained results, challenges associated with modest number of animals, their successful mitigation via augmented data approaches, and advantages of using 3D deep learning methodologies, are discussed. Extension of this encouraging initial study to longitudinal AI-based time-series analysis for treatment outcome predictions at finer dose level gradations is envisioned.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Heart failure-type symptom scores in chronic kidney disease: The importance of body mass index",
        "link": "https://www.nature.com/articles/s41366-022-01208-x",
        "publication_date": "17 Aug 2022",
        "abstract": "This analysis sought to determine factors (including adiposity-related factors) most associated with HF-type symptoms (fatigue, shortness of breath, and edema) in adults with chronic kidney disease (CKD).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Lightweight Distributed Provenance Model for Complex Real–world Environments",
        "link": "https://www.nature.com/articles/s41597-022-01537-6",
        "publication_date": "17 Aug 2022",
        "abstract": "Provenance is information describing the lineage of an object, such as a dataset or biological material. Since these objects can be passed between organizations, each organization can document only parts of the objects life cycle. As a result, interconnection of distributed provenance parts forms distributed provenance chains. Dependant on the actual provenance content, complete provenance chains can provide traceability and contribute to reproducibility and FAIRness of research objects. In this paper, we define a lightweight provenance model based on W3C PROV that enables generation of distributed provenance chains in complex, multi-organizational environments. The application of the model is demonstrated with a use case spanning several steps of a real-world research pipeline — starting with the acquisition of a specimen, its processing and storage, histological examination, and the generation/collection of associated data (images, annotations, clinical data), ending with training an AI model for the detection of tumor in the images. The proposed model has become an open conceptual foundation of the currently developed ISO 23494 standard on provenance for biotechnology domain.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Lower pass threshold (≥93%) for critical congenital heart disease screening at high altitude prevents repeat screening and reduces false positives",
        "link": "https://www.nature.com/articles/s41372-022-01491-6",
        "publication_date": "17 Aug 2022",
        "abstract": "We evaluated first screen pass rate for two pass thresholds for critical congenital heart disease (CCHD) oxygen saturation (SpO2) screening at higher altitude.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A machine-vision-based frailty index for mice",
        "link": "https://www.nature.com/articles/s43587-022-00266-0",
        "publication_date": "16 Aug 2022",
        "abstract": "Heterogeneity in biological aging manifests itself in health status and mortality. Frailty indices (FIs) capture health status in humans and model organisms. To accelerate our understanding of biological aging and carry out scalable interventional studies, high-throughput approaches are necessary. Here we introduce a machine-learning-based visual FI for mice that operates on video data from an open-field assay. We use machine vision to extract morphometric, gait and other behavioral features that correlate with FI score and age. We use these features to train a regression model that accurately predicts the normalized FI score within 0.04 ± 0.002 (mean absolute error). Unnormalized, this error is 1.08 ± 0.05, which is comparable to one FI item being mis-scored by 1 point or two FI items mis-scored by 0.5 points. This visual FI provides increased reproducibility and scalability that will enable large-scale mechanistic and interventional studies of aging in mice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "A systems approach towards remote health-monitoring in older adults: Introducing a zero-interaction digital exhaust",
        "link": "https://www.nature.com/articles/s41746-022-00657-y",
        "publication_date": "16 Aug 2022",
        "abstract": "Using connected sensing devices to remotely monitor health is a promising way to help transition healthcare from a rather reactive to a more precision medicine oriented proactive approach, which could be particularly relevant in the face of rapid population ageing and the challenges it poses to healthcare systems. Sensor derived digital measures of health, such as digital biomarkers or digital clinical outcome assessments, may be used to monitor health status or the risk of adverse events like falls. Current research around such digital measures has largely focused on exploring the use of few individual measures obtained through mobile devices. However, especially for long-term applications in older adults, this choice of technology may not be ideal and could further add to the digital divide. Moreover, large-scale systems biology approaches, like genomics, have already proven beneficial in precision medicine, making it plausible that the same could also hold for remote-health monitoring. In this context, we introduce and describe a zero-interaction digital exhaust: a set of 1268 digital measures that cover large parts of a person’s activity, behavior and physiology. Making this approach more inclusive of older adults, we base this set entirely on contactless, zero-interaction sensing technologies. Applying the resulting digital exhaust to real-world data, we then demonstrate the possibility to create multiple ageing relevant digital clinical outcome assessments. Paired with modern machine learning, we find these assessments to be surprisingly powerful and often on-par with mobile approaches. Lastly, we highlight the possibility to discover novel digital biomarkers based on this large-scale approach.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Non-invasive monitoring of blood oxygenation in human placentas via concurrent diffuse optical spectroscopy and ultrasound imaging",
        "link": "https://www.nature.com/articles/s41551-022-00913-2",
        "publication_date": "15 Aug 2022",
        "abstract": "Direct assessment of blood oxygenation in the human placenta can provide information about placental function. However, the monitoring of placental oxygenation involves invasive sampling or imaging techniques that are poorly suited for bedside use. Here we show that placental oxygen haemodynamics can be non-invasively probed in real time and up to 4.2 cm below the body surface via concurrent frequency-domain diffuse optical spectroscopy and ultrasound imaging. We developed a multimodal instrument to facilitate the assessment of the properties of the anterior placenta by leveraging image-reconstruction algorithms that integrate ultrasound information about the morphology of tissue layers with optical information on haemodynamics. In a pilot investigation involving placentas with normal function (15 women) or abnormal function (9 women) from pregnancies in the third trimester, we found no significant differences in baseline haemoglobin properties, but statistically significant differences in the haemodynamic responses to maternal hyperoxia. Our findings suggest that the non-invasive monitoring of placental oxygenation may aid the early detection of placenta-related adverse pregnancy outcomes and maternal vascular malperfusion.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "KBG syndrome: videoconferencing and use of artificial intelligence driven facial phenotyping in 25 new patients",
        "link": "https://www.nature.com/articles/s41431-022-01171-1",
        "publication_date": "15 Aug 2022",
        "abstract": "Genetic variants in Ankyrin Repeat Domain 11 (ANKRD11) and deletions in 16q24.3 are known to cause KBG syndrome, a rare syndrome associated with craniofacial, intellectual, and neurobehavioral anomalies. We report 25 unpublished individuals from 22 families with molecularly confirmed diagnoses. Twelve individuals have de novo variants, three have inherited variants, and one is inherited from a parent with low-level mosaicism. The mode of inheritance was unknown for nine individuals. Twenty are truncating variants, and the remaining five are missense (three of which are found in one family). We present a protocol emphasizing the use of videoconference and artificial intelligence (AI) in collecting and analyzing data for this rare syndrome. A single clinician interviewed 25 individuals throughout eight countries. Participants’ medical records were reviewed, and data was uploaded to the Human Disease Gene website using Human Phenotype Ontology (HPO) terms. Photos of the participants were analyzed by the GestaltMatcher and DeepGestalt, Face2Gene platform (FDNA Inc, USA) algorithms. Within our cohort, common traits included short stature, macrodontia, anteverted nares, wide nasal bridge, wide nasal base, thick eyebrows, synophrys and hypertelorism. Behavioral issues and global developmental delays were widely present. Neurologic abnormalities including seizures and/or EEG abnormalities were common (44%), suggesting that early detection and seizure prophylaxis could be an important point of intervention. Almost a quarter (24%) were diagnosed with attention deficit hyperactivity disorder and 28% were diagnosed with autism spectrum disorder. Based on the data, we provide a set of recommendations regarding diagnostic and treatment approaches for KBG syndrome.",
        "conclusions": "Early intervention with physical, occupational, and speech therapies is recommended. Anecdotal reports from families indicate that a frequency of at least once weekly is likely ideal. Children with ANKRD11 variants should undergo baseline auditory screening to rule out hearing defects that might impede speech development.\n\n\nThere is evidence for the utility of growth hormone treatment for those with short stature (under their target range). Systematic study is required for formal guidelines and recommendations.\n\n\n\n\nHigh rates of seizures point at the possible utility of EEG screening upon diagnosis with regular monitoring by a neurologist. Further research is warranted to justify EEG screening, though other rare diseases with a high prevalence of seizures do have formal recommendations for baseline EEG screening, such as Tuberous Sclerosis [32].\n\n\nPatients may benefit from cardiac screening (including echocardiography) upon diagnosis.\n\n\nChronic otitis media with hearing loss is a frequent finding. More research is needed to investigate whether aggressive antibiotic treatment could prevent hearing loss.\n\n\nFuture research and clinical efforts should include more study of GI symptoms (e.g. abdominal migraines) due to their increased prevalence.\n\n\nArtificial intelligence-assisted facial applications can play a role in reducing missed diagnoses, given the often mild cognitive deficits and subtle dysmorphic features of KBG syndrome. Combining data from AI and patient registries can optimize diagnosis and help develop guidelines and treatment recommendations.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning for quality assessment of optical coherence tomography angiography images",
        "link": "https://www.nature.com/articles/s41598-022-17709-8",
        "publication_date": "12 Aug 2022",
        "abstract": "Optical coherence tomography angiography (OCTA) is an emerging non-invasive technique for imaging the retinal vasculature. While there are many promising clinical applications for OCTA, determination of image quality remains a challenge. We developed a deep learning-based system using a ResNet152 neural network classifier, pretrained using ImageNet, to classify images of the superficial capillary plexus in 347 scans from 134 patients. Images were also manually graded by two independent graders as a ground truth for the supervised learning models. Because requirements for image quality may vary depending on the clinical or research setting, two models were trained—one to identify high-quality images and one to identify low-quality images. Our neural network models demonstrated outstanding area under the curve (AUC) metrics for both low quality image identification (AUC = 0.99, 95%CI 0.98–1.00, \\(\\kappa \\) = 0.90) and high quality image identification (AUC =  0.97, 95%CI 0.96–0.99, \\(\\kappa \\) = 0.81), significantly outperforming machine-reported signal strength (AUC = 0.82, 95%CI 0.77–0.86, \\(\\kappa \\)= 0.52 and AUC = 0.78, 95%CI 0.73–0.83, \\(\\kappa \\) = 0.27 respectively). Our study demonstrates that techniques from machine learning may be used to develop flexible and robust methods for quality control of OCTA images.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A retrospective study of mortality for perioperative cardiac arrests toward a personalized treatment",
        "link": "https://www.nature.com/articles/s41598-022-17916-3",
        "publication_date": "12 Aug 2022",
        "abstract": "Perioperative cardiac arrest (POCA) is associated with a high mortality rate. This work aimed to study its prognostic factors for risk mitigation by means of care management and planning. A database of 380,919 surgeries was reviewed, and 150 POCAs were curated. The main outcome was mortality prior to hospital discharge. Patient demographic, medical history, and clinical characteristics (anesthesia and surgery) were the main features. Six machine learning (ML) algorithms, including LR, SVC, RF, GBM, AdaBoost, and VotingClassifier, were explored. The last algorithm was an ensemble of the first five algorithms. k-fold cross-validation and bootstrapping minimized the prediction bias and variance, respectively. Explainers (SHAP and LIME) were used to interpret the predictions. The ensemble provided the most accurate and robust predictions (AUC = 0.90 [95% CI, 0.78–0.98]) across various age groups. The risk factors were identified by order of importance. Surprisingly, the comorbidity of hypertension was found to have a protective effect on survival, which was reported by a recent study for the first time to our knowledge. The validated ensemble classifier in aid of the explainers improved the predictive differentiation, thereby deepening our understanding of POCA prognostication. It offers a holistic model-based approach for personalized anesthesia and surgical treatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Testing the applicability and performance of Auto ML for potential applications in diagnostic neuroradiology",
        "link": "https://www.nature.com/articles/s41598-022-18028-8",
        "publication_date": "11 Aug 2022",
        "abstract": "To investigate the applicability and performance of automated machine learning (AutoML) for potential applications in diagnostic neuroradiology. In the medical sector, there is a rapidly growing demand for machine learning methods, but only a limited number of corresponding experts. The comparatively simple handling of AutoML should enable even non-experts to develop adequate machine learning models with manageable effort. We aim to investigate the feasibility as well as the advantages and disadvantages of developing AutoML models compared to developing conventional machine learning models. We discuss the results in relation to a concrete example of a medical prediction application. In this retrospective IRB-approved study, a cohort of 107 patients who underwent gross total meningioma resection and a second cohort of 31 patients who underwent subtotal resection were included. Image segmentation of the contrast enhancing parts of the tumor was performed semi-automatically using the open-source software platform 3D Slicer. A total of 107 radiomic features were extracted by hand-delineated regions of interest from the pre-treatment MRI images of each patient. Within the AutoML approach, 20 different machine learning algorithms were trained and tested simultaneously. For comparison, a neural network and different conventional machine learning algorithms were trained and tested. With respect to the exemplary medical prediction application used in this study to evaluate the performance of Auto ML, namely the pre-treatment prediction of the achievable resection status of meningioma, AutoML achieved remarkable performance nearly equivalent to that of a feed-forward neural network with a single hidden layer. However, in the clinical case study considered here, logistic regression outperformed the AutoML algorithm. Using independent test data, we observed the following classification results (AutoML/neural network/logistic regression): mean area under the curve = 0.849/0.879/0.900, mean accuracy = 0.821/0.839/0.881, mean kappa = 0.465/0.491/0.644, mean sensitivity = 0.578/0.577/0.692 and mean specificity = 0.891/0.914/0.936. The results obtained with AutoML are therefore very promising. However, the AutoML models in our study did not yet show the corresponding performance of the best models obtained with conventional machine learning methods. While AutoML may facilitate and simplify the task of training and testing machine learning algorithms as applied in the field of neuroradiology and medical imaging, a considerable amount of expert knowledge may still be needed to develop models with the highest possible discriminatory power for diagnostic neuroradiology.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Interactive exploration of a global clinical network from a large breast cancer cohort",
        "link": "https://www.nature.com/articles/s41746-022-00647-0",
        "publication_date": "10 Aug 2022",
        "abstract": "Despite unprecedented amount of information now available in medical records, health data remain underexploited due to their heterogeneity and complexity. Simple charts and hypothesis-driven statistics can no longer apprehend the content of information-rich clinical data. There is, therefore, a clear need for powerful interactive visualization tools enabling medical practitioners to perceive the patterns and insights gained by state-of-the-art machine learning algorithms. Here, we report an interactive graphical interface for use as the front end of a machine learning causal inference server (MIIC), to facilitate the visualization and comprehension by clinicians of relationships between clinically relevant variables. The widespread use of such tools, facilitating the interactive exploration of datasets, is crucial both for data visualization and for the generation of research hypotheses. We demonstrate the utility of the MIIC interactive interface, by exploring the clinical network of a large cohort of breast cancer patients treated with neoadjuvant chemotherapy (NAC). This example highlights, in particular, the direct and indirect links between post-NAC clinical responses and patient survival. The MIIC interactive graphical interface has the potential to help clinicians identify actionable nodes and edges in clinical networks, thereby ultimately improving the patient care pathway.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting liver regeneration following major resection",
        "link": "https://www.nature.com/articles/s41598-022-16968-9",
        "publication_date": "04 Aug 2022",
        "abstract": "Breakdown of synthesis, excretion and detoxification defines liver failure. Post-hepatectomy liver failure (PHLF) is specific for liver resection and a rightfully feared complication due to high lethality and limited therapeutic success. Individual cytokine and growth factor profiles may represent potent predictive markers for recovery of liver function. We aimed to investigate these profiles in post-hepatectomy regeneration. This study combined a time-dependent cytokine and growth factor profiling dataset of a training (30 patients) and a validation (14 patients) cohorts undergoing major liver resection with statistical and predictive models identifying individual pathway signatures. 2319 associations were tested. Primary hepatocytes isolated from patient tissue samples were stimulated and their proliferation was analysed through DNA content assay. Common expression trajectories of cytokines and growth factors with strong correlation to PHLF, morbidity and mortality were identified despite highly individual perioperative dynamics. Especially, dynamics of EGF, HGF, and PLGF were associated with mortality. PLGF was additionally associated with PHLF and complications. A global association-network was calculated and validated to investigate interdependence of cytokines and growth factors with clinical attributes. Preoperative cytokine and growth factor signatures were identified allowing prediction of mortality following major liver resection by regression modelling. Proliferation analysis of corresponding primary human hepatocytes showed associations of individual regenerative potential with clinical outcome. Prediction of PHLF was possible on as early as first postoperative day (POD1) with AUC above 0.75. Prediction of PHLF and mortality is possible on POD1 with liquid-biopsy based risk profiling. Further utilization of these models would allow tailoring of interventional strategies according to individual profiles.",
        "conclusions": "In conclusion, we found changes in circulating cytokines and growth factors of patients undergoing major liver resection that are clearly linked to the postoperative morbidity and mortality. With the demonstrated liquid biopsy-based approach we are able to predict potentially fatal postoperative clinical outcomes and the individual regenerative potential. This approach may allow a risk-adapted selection of patients. To strengthen the data-base of the model before incorporation in the clinical routine we aspire to include larger and more refined multi-center cohorts.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Molecular map of chronic lymphocytic leukemia and its impact on outcome",
        "link": "https://www.nature.com/articles/s41588-022-01140-w",
        "publication_date": "04 Aug 2022",
        "abstract": "Recent advances in cancer characterization have consistently revealed marked heterogeneity, impeding the completion of integrated molecular and clinical maps for each malignancy. Here, we focus on chronic lymphocytic leukemia (CLL), a B cell neoplasm with variable natural history that is conventionally categorized into two subtypes distinguished by extent of somatic mutations in the heavy-chain variable region of immunoglobulin genes (IGHV). To build the ‘CLL map,’ we integrated genomic, transcriptomic and epigenomic data from 1,148 patients. We identified 202 candidate genetic drivers of CLL (109 new) and refined the characterization of IGHV subtypes, which revealed distinct genomic landscapes and leukemogenic trajectories. Discovery of new gene expression subtypes further subcategorized this neoplasm and proved to be independent prognostic factors. Clinical outcomes were associated with a combination of genetic, epigenetic and gene expression features, further advancing our prognostic paradigm. Overall, this work reveals fresh insights into CLL oncogenesis and prognostication.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying neurocognitive disorder using vector representation of free conversation",
        "link": "https://www.nature.com/articles/s41598-022-16204-4",
        "publication_date": "03 Aug 2022",
        "abstract": "In recent years, studies on the use of natural language processing (NLP) approaches to identify dementia have been reported. Most of these studies used picture description tasks or other similar tasks to encourage spontaneous speech, but the use of free conversation without requiring a task might be easier to perform in a clinical setting. Moreover, free conversation is unlikely to induce a learning effect. Therefore, the purpose of this study was to develop a machine learning model to discriminate subjects with and without dementia by extracting features from unstructured free conversation data using NLP. We recruited patients who visited a specialized outpatient clinic for dementia and healthy volunteers. Participants’ conversation was transcribed and the text data was decomposed from natural sentences into morphemes by performing a morphological analysis using NLP, and then converted into real-valued vectors that were used as features for machine learning. A total of 432 datasets were used, and the resulting machine learning model classified the data for dementia and non-dementia subjects with an accuracy of 0.900, sensitivity of 0.881, and a specificity of 0.916. Using sentence vector information, it was possible to develop a machine-learning algorithm capable of discriminating dementia from non-dementia subjects with a high accuracy based on free conversation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automatic vocalisation-based detection of fragile X syndrome and Rett syndrome",
        "link": "https://www.nature.com/articles/s41598-022-17203-1",
        "publication_date": "03 Aug 2022",
        "abstract": "Fragile X syndrome (FXS) and Rett syndrome (RTT) are developmental disorders currently not diagnosed before toddlerhood. Even though speech-language deficits are among the key symptoms of both conditions, little is known about infant vocalisation acoustics for an automatic earlier identification of affected individuals. To bridge this gap, we applied intelligent audio analysis methodology to a compact dataset of 4454 home-recorded vocalisations of 3 individuals with FXS and 3 individuals with RTT aged 6 to 11 months, as well as 6 age- and gender-matched typically developing controls (TD). On the basis of a standardised set of 88 acoustic features, we trained linear kernel support vector machines to evaluate the feasibility of automatic classification of (a) FXS vs TD, (b) RTT vs TD, (c) atypical development (FXS+RTT) vs TD, and (d) FXS vs RTT vs TD. In paradigms (a)–(c), all infants were correctly classified; in paradigm (d), 9 of 12 were so. Spectral/cepstral and energy-related features were most relevant for classification across all paradigms. Despite the small sample size, this study reveals new insights into early vocalisation characteristics in FXS and RTT, and provides technical underpinnings for a future earlier identification of affected individuals, enabling earlier intervention and family counselling.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Diagnostic accuracy of telemedicine for detection of surgical site infection: a systematic review and meta-analysis",
        "link": "https://www.nature.com/articles/s41746-022-00655-0",
        "publication_date": "03 Aug 2022",
        "abstract": "The Sars-CoV-2 pandemic catalysed integration of telemedicine worldwide. This systematic review assesses it’s accuracy for diagnosis of Surgical Site Infection (SSI). Databases were searched for telemedicine and wound infection studies. All types of studies were included, only paired designs were taken to meta-analysis. QUADAS-2 assessed methodological quality. 1400 titles and abstracts were screened, 61 full text reports were assessed for eligibility and 17 studies were included in meta-analysis, mean age was 47.1 ± 13.3 years. Summary sensitivity and specificity was 87.8% (95% CI, 68.4–96.1) and 96.8% (95% CI 93.5–98.4) respectively. The overall SSI rate was 5.6%. Photograph methods had lower sensitivity and specificity at 63.9% (95% CI 30.4–87.8) and 92.6% (95% CI, 89.9–94.5). Telemedicine is highly specific for SSI diagnosis is highly specific, giving rise to great potential for utilisation excluding SSI. Further work is needed to investigate feasibility telemedicine in the elderly population group.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Daily 1 km terrain resolving maps of surface fine particulate matter for the western United States 2003–2021",
        "link": "https://www.nature.com/articles/s41597-022-01488-y",
        "publication_date": "02 Aug 2022",
        "abstract": "We developed daily maps of surface fine particulate matter (PM2.5) for the western United States. We used geographically weighted regression fit to air quality station observations with Moderate Resolution Imaging Spectroradiometer (MODIS) aerosol optical depth (AOD) data, and meteorological data to produce daily 1-kilometer resolution PM2.5 concentration estimates from 2003–2020. To account for impacts of stagnant air and inversions, we included estimates of inversion strength based on meteorological conditions, and inversion potential based on human activities and local topography. Model accuracy based on cross-validation was R2 = 0.66. AOD data improve the model in summer and fall during periods of high wildfire activity while the stagnation terms capture the spatial and temporal dynamics of PM2.5 in mountain valleys, particularly during winter. These data can be used to explore exposure and health outcome impacts of PM2.5 across spatiotemporal domains particularly in the intermountain western United States where measurements from monitoring station data are sparse. Furthermore, these data may facilitate analyses of inversion impacts and local topography on exposure and health outcome studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Real-time fMRI neurofeedback: the promising potential of brain-training technology to advance clinical neuroscience",
        "link": "https://www.nature.com/articles/s41386-022-01397-z",
        "publication_date": "01 Aug 2022",
        "abstract": "Although functional magnetic resonance imaging (fMRI) has advanced our understanding of the organization of the brain with the discovery of large-scale networks, the impact of this knowledge on the diagnosis and treatment of psychiatric conditions has yet to be fully realized. The development of real-time fMRI neurofeedback (rtfMRI-NF) provides a promising avenue by which fMRI might enter the clinic. First described two decades ago, the field has matured substantially, with specialized conferences, randomized clinical trials, and multisite consortia. A recent consensus statement outlines methodological approaches and important challenges [1]. A substantial evidence base describes applications in psychiatric [2] and substance use disorders [3]. The first meta-analysis of rtfMRI-NF for psychiatric disorders [2] in 17 studies meeting criteria for inclusion in the analysis recently reported a strong effect size for ‘transfer,’ which is to say—the demonstration that NF-trained subjects can maintain the ability to regulate neural signal in the absence of feedback—in comparison to subjects trained with sham/control feedback, (Hedges g = 0.84, p = 0.005). This analysis demonstrates the feasibility of rtfMRI-NF training for psychiatric patients, 52.9% of whom were taking medications. However, the effect on behavioral outcomes in this heterogeneous group was modest (overall symptoms: g = 0.37, p = 0.002; cognition: g = 0.23, p = 0.288). It should be noted that the studies conducted training for an average of only 2.3 sessions (range = 1–4), and this line of investigation opens some promising avenues where the techniques could be refined and improved to generate more robust clinical outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "ISARIC-COVID-19 dataset: A Prospective, Standardized, Global Dataset of Patients Hospitalized with COVID-19",
        "link": "https://www.nature.com/articles/s41597-022-01534-9",
        "publication_date": "30 Jul 2022",
        "abstract": "The International Severe Acute Respiratory and Emerging Infection Consortium (ISARIC) COVID-19 dataset is one of the largest international databases of prospectively collected clinical data on people hospitalized with COVID-19. This dataset was compiled during the COVID-19 pandemic by a network of hospitals that collect data using the ISARIC-World Health Organization Clinical Characterization Protocol and data tools. The database includes data from more than 705,000 patients, collected in more than 60 countries and 1,500 centres worldwide. Patient data are available from acute hospital admissions with COVID-19 and outpatient follow-ups. The data include signs and symptoms, pre-existing comorbidities, vital signs, chronic and acute treatments, complications, dates of hospitalization and discharge, mortality, viral strains, vaccination status, and other data. Here, we present the dataset characteristics, explain its architecture and how to gain access, and provide tools to facilitate its use.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]