[
    {
        "title": "A 3D printed esophageal atresia–tracheoesophageal fistula thorascopy simulator for young surgeons",
        "link": "https://www.nature.com/articles/s41598-024-62154-4",
        "publication_date": "20 May 2024",
        "abstract": "We developed a 3D-printed thoracoscopic surgery simulator for esophageal atresia with tracheoesophageal fistula (EA-TEF) and assessed its effectiveness in educating young pediatric surgeons. Prototype production and modifications were repeated five times before producing the 3-D printed final product based on a patient’s preoperative chest computed tomography. A 24-item survey was used to rate the simulator, adapted from a previous report, with 16 young surgeons with an average of 6.2 years of experience in pediatric surgery for validation. Reusable parts of the thoracic cage were printed to combine with replaceable parts. Each structure was fabricated using diverse printing materials, and subsequently affixed to a frame. In evaluating the simulator, the scores for each factor were 4.33, 4.33, 4.27, 4.31, 4.63, and 4.75 out of 5, respectively, with the highest ratings in value and relevance. The global rating was 3.38 out of 4, with ten stating that it could be used with slight improvements. The most common comment from participants was that the esophageal anastomosis was close to the actual EA-TEF surgery. The 3D-printed thoracoscopic EA-TEF surgery simulator was developed and reflected the actual surgical environment. It could become an effective method of training young pediatric surgeons.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Three-dimensional magnetic resonance imaging-based statistical shape analysis and machine learning-based prediction of patellofemoral instability",
        "link": "https://www.nature.com/articles/s41598-024-62143-7",
        "publication_date": "18 May 2024",
        "abstract": "This study performed three-dimensional (3D) magnetic resonance imaging (MRI)-based statistical shape analysis (SSA) by comparing patellofemoral instability (PFI) and normal femur models, and developed a machine learning (ML)-based prediction model. Twenty (19 patients) and 31 MRI scans (30 patients) of femurs with PFI and normal femurs, respectively, were used. Bone and cartilage segmentation of the distal femurs was performed and subsequently converted into 3D reconstructed models. The pointwise distance map showed anterior elevation of the trochlea, particularly at the central floor of the proximal trochlea, in the PFI models compared with the normal models. Principal component analysis examined shape variations in the PFI group, and several principal components exhibited shape variations in the trochlear floor and intercondylar width. Multivariate analysis showed that these shape components were significantly correlated with the PFI/non-PFI distinction after adjusting for age and sex. Our ML-based prediction model for PFI achieved a strong predictive performance with an accuracy of 0.909 ± 0.015, and an area under the curve of 0.939 ± 0.009 when using a support vector machine with a linear kernel. This study demonstrated that 3D MRI-based SSA can realistically visualize statistical results on surface models and may facilitate the understanding of complex shape features.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "AI-enhanced integration of genetic and medical imaging data for risk assessment of Type 2 diabetes",
        "link": "https://www.nature.com/articles/s41467-024-48618-1",
        "publication_date": "18 May 2024",
        "abstract": "Type 2 diabetes (T2D) presents a formidable global health challenge, highlighted by its escalating prevalence, underscoring the critical need for precision health strategies and early detection initiatives. Leveraging artificial intelligence, particularly eXtreme Gradient Boosting (XGBoost), we devise robust risk assessment models for T2D. Drawing upon comprehensive genetic and medical imaging datasets from 68,911 individuals in the Taiwan Biobank, our models integrate Polygenic Risk Scores (PRS), Multi-image Risk Scores (MRS), and demographic variables, such as age, sex, and T2D family history. Here, we show that our model achieves an Area Under the Receiver Operating Curve (AUC) of 0.94, effectively identifying high-risk T2D subgroups. A streamlined model featuring eight key variables also maintains a high AUC of 0.939. This high accuracy for T2D risk assessment promises to catalyze early detection and preventive strategies. Moreover, we introduce an accessible online risk assessment tool for T2D, facilitating broader applicability and dissemination of our findings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A ResNet mini architecture for brain age prediction",
        "link": "https://www.nature.com/articles/s41598-024-61915-5",
        "publication_date": "16 May 2024",
        "abstract": "The brain presents age-related structural and functional changes in the human life, with different extends between subjects and groups. Brain age prediction can be used to evaluate the development and aging of human brain, as well as providing valuable information for neurodevelopment and disease diagnosis. Many contributions have been made for this purpose, resorting to different machine learning methods. To solve this task and reduce memory resource consumption, we develop a mini architecture of only 10 layers by modifying the deep residual neural network (ResNet), named ResNet mini architecture. To support the ResNet mini architecture in brain age prediction, the brain age dataset (OpenNeuro #ds000228) that consists of 155 study participants (three classes) and the Alzheimer MRI preprocessed dataset that consists of 6400 images (four classes) are employed. We compared the performance of the ResNet mini architecture with other popular networks using the two considered datasets. Experimental results show that the proposed architecture exhibits generality and robustness with high accuracy and less parameter number.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting severe intraventricular hemorrhage or early death using machine learning algorithms in VLBWI of the Korean Neonatal Network Database",
        "link": "https://www.nature.com/articles/s41598-024-62033-y",
        "publication_date": "15 May 2024",
        "abstract": "Severe intraventricular hemorrhage (IVH) in premature infants can lead to serious neurological complications. This retrospective cohort study used the Korean Neonatal Network (KNN) dataset to develop prediction models for severe IVH or early death in very-low-birth-weight infants (VLBWIs) using machine-learning algorithms. The study included VLBWIs registered in the KNN database. The outcome was the diagnosis of IVH Grades 3–4 or death within one week of birth. Predictors were categorized into three groups based on their observed stage during the perinatal period. The dataset was divided into derivation and validation sets at an 8:2 ratio. Models were built using Logistic Regression with Ridge Regulation (LR), Random Forest, and eXtreme Gradient Boosting (XGB). Stage 1 models, based on predictors observed before birth, exhibited similar performance. Stage 2 models, based on predictors observed up to one hour after birth, showed improved performance in all models compared to Stage 1 models. Stage 3 models, based on predictors observed up to one week after birth, showed the best performance, particularly in the XGB model. Its integration into treatment and management protocols can potentially reduce the incidence of permanent brain injury caused by IVH during the early stages of birth.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Diagnostic utility of clinicodemographic, biochemical and metabolite variables to identify viable pregnancies in a symptomatic cohort during early gestation",
        "link": "https://www.nature.com/articles/s41598-024-61690-3",
        "publication_date": "15 May 2024",
        "abstract": "A significant number of pregnancies are lost in the first trimester and 1–2% are ectopic pregnancies (EPs). Early pregnancy loss in general can cause significant morbidity with bleeding or infection, while EPs are the leading cause of maternal mortality in the first trimester. Symptoms of pregnancy loss and EP are very similar (including pain and bleeding); however, these symptoms are also common in live normally sited pregnancies (LNSP). To date, no biomarkers have been identified to differentiate LNSP from pregnancies that will not progress beyond early gestation (non-viable or EPs), defined together as combined adverse outcomes (CAO). In this study, we present a novel machine learning pipeline to create prediction models that identify a composite biomarker to differentiate LNSP from CAO in symptomatic women. This prospective cohort study included 370 participants. A single blood sample was prospectively collected from participants on first emergency presentation prior to final clinical diagnosis of pregnancy outcome: LNSP, miscarriage, pregnancy of unknown location (PUL) or tubal EP (tEP). Miscarriage, PUL and tEP were grouped together into a CAO group. Human chorionic gonadotrophin β (β-hCG) and progesterone concentrations were measured in plasma. Serum samples were subjected to untargeted metabolomic profiling. The cohort was randomly split into train and validation data sets, with the train data set subjected to variable selection. Nine metabolite signals were identified as key discriminators of LNSP versus CAO. Random forest models were constructed using stable metabolite signals alone, or in combination with plasma hormone concentrations and demographic data. When comparing LNSP with CAO, a model with stable metabolite signals only demonstrated a modest predictive accuracy (0.68), which was comparable to a model of β-hCG and progesterone (0.71). The best model for LNSP prediction comprised stable metabolite signals and hormone concentrations (accuracy = 0.79). In conclusion, serum metabolite levels and biochemical markers from a single blood sample possess modest predictive utility in differentiating LNSP from CAO pregnancies upon first presentation, which is improved by variable selection and combination using machine learning. A diagnostic test to confirm LNSP and thus exclude pregnancies affecting maternal morbidity and potentially life-threatening outcomes would be invaluable in emergency situations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Jnk1 and downstream signalling hubs regulate anxiety-like behaviours in a zebrafish larvae phenotypic screen",
        "link": "https://www.nature.com/articles/s41598-024-61337-3",
        "publication_date": "15 May 2024",
        "abstract": "Current treatments for anxiety and depression show limited efficacy in many patients, indicating the need for further research into the underlying mechanisms. JNK1 has been shown to regulate anxiety- and depressive-like behaviours in mice, however the effectors downstream of JNK1 are not known. Here we compare the phosphoproteomes from wild-type and Jnk1-/- mouse brains and identify JNK1-regulated signalling hubs. We next employ a zebrafish (Danio rerio) larvae behavioural assay to identify an antidepressant- and anxiolytic-like (AA) phenotype based on 2759 measured stereotypic responses to clinically proven antidepressant and anxiolytic (AA) drugs. Employing machine learning, we classify an AA phenotype from extracted features measured during and after a startle battery in fish exposed to AA drugs. Using this classifier, we demonstrate that structurally independent JNK inhibitors replicate the AA phenotype with high accuracy, consistent with findings in mice. Furthermore, pharmacological targeting of JNK1-regulated signalling hubs identifies AKT, GSK-3, 14–3-3 ζ/ε and PKCε as downstream hubs that phenocopy clinically proven AA drugs. This study identifies AKT and related signalling molecules as mediators of JNK1-regulated antidepressant- and anxiolytic-like behaviours. Moreover, the assay shows promise for early phase screening of compounds with anti-stress-axis properties and for mode of action analysis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Nutraceutical blends predict enhanced health via microbiota reshaping improving cytokines and life quality: a Brazilian double-blind randomized trial",
        "link": "https://www.nature.com/articles/s41598-024-61909-3",
        "publication_date": "15 May 2024",
        "abstract": "Nutraceutical interventions supporting microbiota and eliciting clinical improvements in metabolic diseases have grown significantly. Chronic stress, gut dysbiosis, and metainflammation have emerged as key factors intertwined with sleep disorders, consequently exacerbating the decline in quality of life. This study aimed to assess the effects of two nutraceutical formulations containing prebiotics (fructooligosaccharides (FOS), galactooligosaccharides (GOS), yeast β-glucans), minerals (Mg, Se, Zn), and the herbal medicine Silybum marianum L. Gaertn., Asteraceae (Milk thistle or Silymarin). These formulations, namely NSupple (without silymarin) and NSupple_Silybum (with silymarin) were tested over 180 days in overweight/obese volunteers from Brazil's southeastern region. We accessed fecal gut microbiota by partial 16S rRNA sequences; cytokines expression by CBA; anthropometrics, quality of life and sleep, as well as metabolic and hormonal parameters, at baseline (T0) and 180 days (T180) post-supplementation. Results demonstrated gut microbiota reshaping at phyla, genera, and species level post-supplementation. The Bacteroidetes phylum, Bacteroides, and Prevotella genera were positively modulated especially in the NSupple_Silybum group. Gut microbiota modulation was associated with improved sleep patterns, quality-of-life perception, cytokines expression, and anthropometric parameters post-supplementation. Our findings suggest that the nutraceutical blends positively enhance cardiometabolic and inflammatory markers. Particularly, NSupple_Silybum modulated microbiota composition, underscoring its potential significance in ameliorating metabolic dysregulation. Clinical trial registry number: NCT04810572. 23/03/2021.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Distinct cytokine profiles in late pregnancy in Ugandan people with HIV",
        "link": "https://www.nature.com/articles/s41598-024-61764-2",
        "publication_date": "14 May 2024",
        "abstract": "During pregnancy, multiple immune regulatory mechanisms establish an immune-tolerant environment for the allogeneic fetus, including cellular signals called cytokines that modify immune responses. However, the impact of maternal HIV infection on these responses is incompletely characterized. We analyzed paired maternal and umbilical cord plasma collected during labor from 147 people with HIV taking antiretroviral therapy and 142 HIV-uninfected comparators. Though cytokine concentrations were overall similar between groups, using Partial Least Squares Discriminant Analysis we identified distinct cytokine profiles in each group, driven by higher IL-5 and lower IL-8 and MIP-1α levels in pregnant people with HIV and higher RANTES and E-selectin in HIV-unexposed umbilical cord plasma (P-value < 0.01). Furthermore, maternal RANTES, SDF-α, gro \\(\\mathrm{\\alpha }\\)-KC, IL-6, and IP-10 levels differed significantly by HIV serostatus (P < 0.01). Although global maternal and umbilical cord cytokine profiles differed significantly (P < 0.01), umbilical cord plasma profiles were similar by maternal HIV serostatus. We demonstrate that HIV infection is associated with a distinct maternal plasma cytokine profile which is not transferred across the placenta, indicating a placental role in coordinating local inflammatory response. Furthermore, maternal cytokine profiles in people with HIV suggest an incomplete shift from Th2 to Th1 immune phenotype at the end of pregnancy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "ReMIND: The Brain Resection Multimodal Imaging Database",
        "link": "https://www.nature.com/articles/s41597-024-03295-z",
        "publication_date": "14 May 2024",
        "abstract": "The standard of care for brain tumors is maximal safe surgical resection. Neuronavigation augments the surgeon’s ability to achieve this but loses validity as surgery progresses due to brain shift. Moreover, gliomas are often indistinguishable from surrounding healthy brain tissue. Intraoperative magnetic resonance imaging (iMRI) and ultrasound (iUS) help visualize the tumor and brain shift. iUS is faster and easier to incorporate into surgical workflows but offers a lower contrast between tumorous and healthy tissues than iMRI. With the success of data-hungry Artificial Intelligence algorithms in medical image analysis, the benefits of sharing well-curated data cannot be overstated. To this end, we provide the largest publicly available MRI and iUS database of surgically treated brain tumors, including gliomas (n = 92), metastases (n = 11), and others (n = 11). This collection contains 369 preoperative MRI series, 320 3D iUS series, 301 iMRI series, and 356 segmentations collected from 114 consecutive patients at a single institution. This database is expected to help brain shift and image analysis research and neurosurgical training in interpreting iUS and iMRI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Screening and diagnosis of cardiovascular disease using artificial intelligence-enabled cardiac magnetic resonance imaging",
        "link": "https://www.nature.com/articles/s41591-024-02971-2",
        "publication_date": "13 May 2024",
        "abstract": "Cardiac magnetic resonance imaging (CMR) is the gold standard for cardiac function assessment and plays a crucial role in diagnosing cardiovascular disease (CVD). However, its widespread application has been limited by the heavy resource burden of CMR interpretation. Here, to address this challenge, we developed and validated computerized CMR interpretation for screening and diagnosis of 11 types of CVD in 9,719 patients. We propose a two-stage paradigm consisting of noninvasive cine-based CVD screening followed by cine and late gadolinium enhancement-based diagnosis. The screening and diagnostic models achieved high performance (area under the curve of 0.988 ± 0.3% and 0.991 ± 0.0%, respectively) in both internal and external datasets. Furthermore, the diagnostic model outperformed cardiologists in diagnosing pulmonary arterial hypertension, demonstrating the ability of artificial intelligence-enabled CMR to detect previously unidentified CMR features. This proof-of-concept study holds the potential to substantially advance the efficiency and scalability of CMR interpretation, thereby improving CVD screening and diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Relationship between HLA genetic variations, COVID-19 vaccine antibody response, and risk of breakthrough outcomes",
        "link": "https://www.nature.com/articles/s41467-024-48339-5",
        "publication_date": "13 May 2024",
        "abstract": "The rapid global distribution of COVID-19 vaccines, with over a billion doses administered, has been unprecedented. However, in comparison to most identified clinical determinants, the implications of individual genetic factors on antibody responses post-COVID-19 vaccination for breakthrough outcomes remain elusive. Here, we conducted a population-based study including 357,806 vaccinated participants with high-resolution HLA genotyping data, and a subset of 175,000 with antibody serology test results. We confirmed prior findings that single nucleotide polymorphisms associated with antibody response are predominantly located in the Major Histocompatibility Complex region, with the expansive HLA-DQB1*06 gene alleles linked to improved antibody responses. However, our results did not support the claim that this mutation alone can significantly reduce COVID-19 risk in the general population. In addition, we discovered and validated six HLA alleles (A*03:01, C*16:01, DQA1*01:02, DQA1*01:01, DRB3*01:01, and DPB1*10:01) that independently influence antibody responses and demonstrated a combined effect across HLA genes on the risk of breakthrough COVID-19 outcomes. Lastly, we estimated that COVID-19 vaccine-induced antibody positivity provides approximately 20% protection against infection and 50% protection against severity. These findings have immediate implications for functional studies on HLA molecules and can inform future personalised vaccination strategies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting early mortality and severe intraventricular hemorrhage in very-low birth weight preterm infants: a nationwide, multicenter study using machine learning",
        "link": "https://www.nature.com/articles/s41598-024-61749-1",
        "publication_date": "12 May 2024",
        "abstract": "Our aim was to develop a machine learning-based predictor for early mortality and severe intraventricular hemorrhage (IVH) in very-low birth weight (VLBW) preterm infants in Taiwan. We collected retrospective data from VLBW infants, dividing them into two cohorts: one for model development and internal validation (Cohort 1, 2016–2021), and another for external validation (Cohort 2, 2022). Primary outcomes included early mortality, severe IVH, and early poor outcomes (a combination of both). Data preprocessing involved 23 variables, with the top four predictors identified as gestational age, birth body weight, 5-min Apgar score, and endotracheal tube ventilation. Six machine learning algorithms were employed. Among 7471 infants analyzed, the selected predictors consistently performed well across all outcomes. Logistic regression and neural network models showed the highest predictive performance (AUC 0.81–0.90 in both internal and external validation) and were well-calibrated, confirmed by calibration plots and the lowest two mean Brier scores (0.0685 and 0.0691). We developed a robust machine learning-based outcome predictor using only four accessible variables, offering valuable prognostic information for parents and aiding healthcare providers in decision-making.",
        "conclusions": "In this study, we developed an outcome predictor designed to predict early mortality, severe IVH, and early poor outcomes in preterm VLBW infants. This predictive model relied on the assessment of four readily available factors immediately after birth: GA, BBW, 5-min Apgar score, and endotracheal tube ventilation during initial resuscitation. Our analysis has yielded a formula that demonstrates exceptional performance, as evidenced by the high AUC values in both the internal validation cohort and the independent external validation population. Furthermore, it is well-calibrated, as evaluated by calibration plots and mean Brier scores. This prediction formula may prove to be a valuable tool and provide essential prognostic information for parents, aiding them in making informed decisions regarding the care and future of VLBW preterm infants. Furthermore, it may offer healthcare providers valuable guidance and facilitates the formulation of effective decision-making strategies for the clinical management of vulnerable infants. However, further validation across diverse populations is required to ensure broader applicability. Moreover, the inclusion of clinical parameters may further improve model accuracy.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Shifting to machine supervision: annotation-efficient semi and self-supervised learning for automatic medical image segmentation and classification",
        "link": "https://www.nature.com/articles/s41598-024-61822-9",
        "publication_date": "11 May 2024",
        "abstract": "Advancements in clinical treatment are increasingly constrained by the limitations of supervised learning techniques, which depend heavily on large volumes of annotated data. The annotation process is not only costly but also demands substantial time from clinical specialists. Addressing this issue, we introduce the S4MI (Self-Supervision and Semi-Supervision for Medical Imaging) pipeline, a novel approach that leverages advancements in self-supervised and semi-supervised learning. These techniques engage in auxiliary tasks that do not require labeling, thus simplifying the scaling of machine supervision compared to fully-supervised methods. Our study benchmarks these techniques on three distinct medical imaging datasets to evaluate their effectiveness in classification and segmentation tasks. Notably, we observed that self-supervised learning significantly surpassed the performance of supervised methods in the classification of all evaluated datasets. Remarkably, the semi-supervised approach demonstrated superior outcomes in segmentation, outperforming fully-supervised methods while using 50% fewer labels across all datasets. In line with our commitment to contributing to the scientific community, we have made the S4MI code openly accessible, allowing for broader application and further development of these methods. The code can be accessed at https://github.com/pranavsinghps1/S4MI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Enhancing cervical cancer detection and robust classification through a fusion of deep learning models",
        "link": "https://www.nature.com/articles/s41598-024-61063-w",
        "publication_date": "11 May 2024",
        "abstract": "Cervical cancer, the second most prevalent cancer affecting women, arises from abnormal cell growth in the cervix, a crucial anatomical structure within the uterus. The significance of early detection cannot be overstated, prompting the use of various screening methods such as Pap smears, colposcopy, and Human Papillomavirus (HPV) testing to identify potential risks and initiate timely intervention. These screening procedures encompass visual inspections, Pap smears, colposcopies, biopsies, and HPV-DNA testing, each demanding the specialized knowledge and skills of experienced physicians and pathologists due to the inherently subjective nature of cancer diagnosis. In response to the imperative for efficient and intelligent screening, this article introduces a groundbreaking methodology that leverages pre-trained deep neural network models, including Alexnet, Resnet-101, Resnet-152, and InceptionV3, for feature extraction. The fine-tuning of these models is accompanied by the integration of diverse machine learning algorithms, with ResNet152 showcasing exceptional performance, achieving an impressive accuracy rate of 98.08%. It is noteworthy that the SIPaKMeD dataset, publicly accessible and utilized in this study, contributes to the transparency and reproducibility of our findings. The proposed hybrid methodology combines aspects of DL and ML for cervical cancer classification. Most intricate and complicated features from images can be extracted through DL. Further various ML algorithms can be implemented on extracted features. This innovative approach not only holds promise for significantly improving cervical cancer detection but also underscores the transformative potential of intelligent automation within the realm of medical diagnostics, paving the way for more accurate and timely interventions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Ocular biomarkers: useful incidental findings by deep learning algorithms in fundus photographs",
        "link": "https://www.nature.com/articles/s41433-024-03085-2",
        "publication_date": "11 May 2024",
        "abstract": "Artificial intelligence can assist with ocular image analysis for screening and diagnosis, but it is not yet capable of autonomous full-spectrum screening. Hypothetically, false-positive results may have unrealized screening potential arising from signals persisting despite training and/or ambiguous signals such as from biomarker overlap or high comorbidity. The study aimed to explore the potential to detect clinically useful incidental ocular biomarkers by screening fundus photographs of hypertensive adults using diabetic deep learning algorithms.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Ambient floor vibration sensing advances the accessibility of functional gait assessments for children with muscular dystrophies",
        "link": "https://www.nature.com/articles/s41598-024-60034-5",
        "publication_date": "11 May 2024",
        "abstract": "Muscular dystrophies (MD) are a group of genetic neuromuscular disorders that cause progressive weakness and loss of muscles over time, influencing 1 in 3500–5000 children worldwide. New and exciting treatment options have led to a critical need for a clinical post-marketing surveillance tool to confirm the efficacy and safety of these treatments after individuals receive them in a commercial setting. For MDs, functional gait assessment is a common approach to evaluate the efficacy of the treatments because muscle weakness is reflected in individuals’ walking patterns. However, there is little incentive for the family to continue to travel for such assessments due to the lack of access to specialty centers. While various existing sensing devices, such as cameras, force plates, and wearables can assess gait at home, they are limited by privacy concerns, area of coverage, and discomfort in carrying devices, which is not practical for long-term, continuous monitoring in daily settings. In this study, we introduce a novel functional gait assessment system using ambient floor vibrations, which is non-invasive and scalable, requiring only low-cost and sparsely deployed geophone sensors attached to the floor surface, suitable for in-home usage. Our system captures floor vibrations generated by footsteps from patients while they walk around and analyzes such vibrations to extract essential gait health information. To enhance interpretability and reliability under various sensing scenarios, we translate the signal patterns of floor vibration to pathological gait patterns related to MD, and develop a hierarchical learning algorithm that aggregates insights from individual footsteps to estimate a person’s overall gait performance. When evaluated through real-world experiments with 36 subjects (including 15 patients with MD), our floor vibration sensing system achieves a 94.8% accuracy in predicting functional gait stages for patients with MD. Our approach enables accurate, accessible, and scalable functional gait assessment, bringing MD progressive tracking into real life.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Modeling COVID-19 data with a novel neutrosophic Burr-III distribution",
        "link": "https://www.nature.com/articles/s41598-024-61659-2",
        "publication_date": "11 May 2024",
        "abstract": "In this study, we have presented a novel probabilistic model called the neutrosophic Burr-III distribution, designed for applications in neutrosophic surface analysis. Neutrosophic analysis allows for the incorporation of vague and imprecise information, reflecting the reality that many real-world problems involve ambiguous data. This ability to handle vagueness can lead to more robust and realistic models especially in situation where classical models fall short. We have also explored the neutrosophic Burr-III distribution in order to deal with the ambiguity and vagueness in the data where the classical Burr-III distribution falls short. This distribution offers valuable insights into various reliability properties, moment expressions, order statistics, and entropy measures, making it a versatile tool for analyzing complex data. To assess the practical relevance of our proposed distribution, we applied it to real-world data sets and compared its performance against the classical Burr-III distribution. The findings revealed that the neutrosophic Burr-III distribution outperformed than the classical Burr-III distribution in capturing the underlying data characteristics, highlighting its potential as a superior modeling toolin various fields.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Country-report pattern corrections of new cases allow accurate 2-week predictions of COVID-19 evolution with the Gompertz model",
        "link": "https://www.nature.com/articles/s41598-024-61233-w",
        "publication_date": "11 May 2024",
        "abstract": "Accurate short-term predictions of COVID-19 cases with empirical models allow Health Officials to prepare for hospital contingencies in a two–three week window given the delay between case reporting and the admission of patients in a hospital. We investigate the ability of Gompertz-type empiric models to provide accurate prediction up to two and three weeks to give a large window of preparation in case of a surge in virus transmission. We investigate the stability of the prediction and its accuracy using bi-weekly predictions during the last trimester of 2020 and 2021. Using data from 2020, we show that understanding and correcting for the daily reporting structure of cases in the different countries is key to accomplish accurate predictions. Furthermore, we found that filtering out predictions that are highly unstable to changes in the parameters of the model, which are roughly 20%, reduces strongly the number of predictions that are way-off. The method is then tested for robustness with data from 2021. We found that, for this data, only 1–2% of the one-week predictions were off by more than 50%. This increased to 3% for two-week predictions, and only for three-week predictions it reached 10%.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Gait classification for growing children with Duchenne muscular dystrophy",
        "link": "https://www.nature.com/articles/s41598-024-61231-y",
        "publication_date": "11 May 2024",
        "abstract": "Classifying gait patterns into homogeneous groups could enhance communication among healthcare providers, clinical decision making and clinical trial designs in boys with Duchenne muscular dystrophy (DMD). Sutherland’s classification has been developed 40 years ago. Ever since, the state-of-the-art medical care has improved and boys with DMD are now longer ambulatory. Therefore, the gait classification requires an update. The overall aim was to develop an up-to-date, valid DMD gait classification. A total of 137 three-dimensional gait analysis sessions were collected in 30 boys with DMD, aged 4.6–17 years. Three classes were distinguished, which only partly aligned with increasing severity of gait deviations. Apart from the mildly affected pattern, two more severely affected gait patterns were found, namely the tiptoeing pattern and the flexion pattern with distinct anterior pelvic tilt and posterior trunk leaning, which showed most severe deviations at the ankle or at the proximal segments/joints, respectively. The agreement between Sutherland’s and the current classification was low, suggesting that gait pathology with the current state-of-the-art medical care has changed. However, overlap between classes, especially between the two more affected classes, highlights the complexity of the continuous gait changes. Therefore, caution is required when classifying individual boys with DMD into classes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Analysis of healthcare data security with DWT-HD-SVD based-algorithm invisible watermarking against multi-size watermarks",
        "link": "https://www.nature.com/articles/s41598-024-61479-4",
        "publication_date": "10 May 2024",
        "abstract": "In the modern day, multimedia and digital resources play a crucial role in demystifying complex topics and improving communication. Additionally, images, videos, and documents speed data administration, fostering both individual and organizational efficiency. Healthcare providers use tools like X-rays, MRIs, and CT scans to improve diagnostic and therapeutic capacities, highlighting the importance of these tools in contemporary communication, data processing, and healthcare. Protecting medical data becomes essential for maintaining patient confidentiality and service dependability in a time when digital assets are crucial to the healthcare industry. In order to overcome this issue, this study analyses the DWT-HD-SVD algorithm-based invisible watermarking in medical data. The main goal is to verify medical data by looking at a DWT-based hybrid technique used on X-ray images with various watermark sizes (256*256, 128*128, 64*64). The algorithm’s imperceptibility and robustness are examined using metrics like Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index (SSIM) and are analyzed using Normalized Connection (NC), Bit Error Rate (BER), and Bit Error Rate (BCR) in order to evaluate its resistance to various attacks. The results show that the method works better with smaller watermark sizes than it does with larger ones.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A novel multi-task machine learning classifier for rare disease patterning using cardiac strain imaging data",
        "link": "https://www.nature.com/articles/s41598-024-61201-4",
        "publication_date": "09 May 2024",
        "abstract": "To provide accurate predictions, current machine learning-based solutions require large, manually labeled training datasets. We implement persistent homology (PH), a topological tool for studying the pattern of data, to analyze echocardiography-based strain data and differentiate between rare diseases like constrictive pericarditis (CP) and restrictive cardiomyopathy (RCM). Patient population (retrospectively registered) included those presenting with heart failure due to CP (n = 51), RCM (n = 47), and patients without heart failure symptoms (n = 53). Longitudinal, radial, and circumferential strains/strain rates for left ventricular segments were processed into topological feature vectors using Machine learning PH workflow. In differentiating CP and RCM, the PH workflow model had a ROC AUC of 0.94 (Sensitivity = 92%, Specificity = 81%), compared with the GLS model AUC of 0.69 (Sensitivity = 65%, Specificity = 66%). In differentiating between all three conditions, the PH workflow model had an AUC of 0.83 (Sensitivity = 68%, Specificity = 84%), compared with the GLS model AUC of 0.68 (Sensitivity = 52% and Specificity = 76%). By employing persistent homology to differentiate the “pattern” of cardiac deformations, our machine-learning approach provides reasonable accuracy when evaluating small datasets and aids in understanding and visualizing patterns of cardiac imaging data in clinically challenging disease states.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and multinational validation of an algorithmic strategy for high Lp(a) screening",
        "link": "https://www.nature.com/articles/s44161-024-00469-1",
        "publication_date": "09 May 2024",
        "abstract": "Elevated lipoprotein (a) (Lp(a)) is associated with premature atherosclerotic cardiovascular disease. However, fewer than 0.5% of individuals undergo Lp(a) testing, limiting the evaluation and use of novel targeted therapeutics currently under development. Here we describe the development of a machine learning model for targeted screening for elevated Lp(a) (≥150 nmol l−1) in the UK Biobank (N = 456,815), the largest cohort with protocolized Lp(a) testing. We externally validated the model in 3 large cohort studies, ARIC (N = 14,484), CARDIA (N = 4,124) and MESA (N = 4,672). The model, Algorithmic Risk Inspection for Screening Elevated Lp(a) (ARISE), reduced the number needed to test to find one individual with elevated Lp(a) by up to 67.3%, based on the probability threshold, with consistent performance across external validation cohorts. ARISE could be used to optimize screening for elevated Lp(a) using commonly available clinical features, with the potential for its deployment in electronic health records to enhance the yield of Lp(a) testing in real-world settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting suicidality with small sets of interpretable reward behavior and survey variables",
        "link": "https://www.nature.com/articles/s44220-024-00229-x",
        "publication_date": "09 May 2024",
        "abstract": "The prediction of suicidal thought and behavior has met with mixed results. This study of 3,476 de-identified participants (4,019 before data exclusion) quantified the prediction of four suicidal thought and behavior (STB) variables using a short reward/aversion judgment task and a limited set of demographic and mental health surveys. The focus was to produce a simple, quick and objective framework for assessing STB that might be automatable, without the use of big data. A balanced random forest classifier performed better than a Gaussian mixture model and four standard machine learning classifiers for predicting passive suicide ideation, active suicide ideation, suicide planning and planning for safety. Accuracies ranged from 78% to 92% (optimal area under the curve between 0.80 and 0.95) without overfitting, and peak performance was observed for predicting suicide planning. The relative importance of features for prediction showed distinct weighting across judgment variables, contributing between 40% and 64% to prediction per Gini scores. Mediation/moderation analyses showed that depression, anxiety, loneliness and age variables moderated the judgment variables, indicating that the interaction of judgment with mental health and demographic indices is fundamental for the high-accuracy prediction of STB. These findings suggest the feasibility of an efficient and highly scalable system for suicide assessment, without requiring psychiatric records or neural measures. The findings suggest that STB might be understood within a cognitive framework for judgment with quantitative variables whose unique constellation separates passive and active suicidal thought (ideation) from suicide planning and planning for safety.",
        "conclusions": "The current work found that 15 judgment variables and limited mental health and demographic information predicted four STB measures with sensitivities and specificities around 80% using a BRF approach that produced the highest sensitivities of the approaches used. There appear to be few studies that integrate quantitative judgment features, such as from a short behavioral task, to predict distinct STB measures. This work supports publications suggesting that social and behavioral measures play a key role in the prediction of STB, sometimes surpassing clinical variables in predictive accuracies10,13. Contextual risk factors are also not typically studied in ML applications of STB7, yet predictive variables of suicidality can be contextual7,16 and the reported mediation/moderation results strongly support these reports. The current results contrast tendencies in the literature to either (1) use large feature sets for prediction (for example, hundreds to thousands of variables)19,20,64,66,67,68,69,70 or (2) collect expensive clinical or biological measures for prediction20,21,22,23,64,65,67,68,69,70. The data needed for prediction in this study can readily be acquired by smart phones and other digital devices, which are currently available for 92% of the US population78 and 85% of the world population48. The analysis does not require a supercomputer and thus can be scaled to populations for which big data and expensive clinical or biological measures are not available, meeting frameworks proposed by others for the development of a scalable detection platform for prediction of suicidality10. By combining multiple variables around STB, including assessments of planning for safety, this framework suggests a digital approach for early assessment and triage, which is particularly needed now10.Going forward, future work might assess a broader set of features that can be extracted from the preference curves (that is the value, tradeoff and limit functions) besides the 15 used herein. Additionally, the analysis could be expanded to more deeply assess age and other demographic variables, such as between groups of adolescents and elderly participants. These age groups have different contextual risk factors79,80,81,82, making relevant contextual variables (retirement versus work status, insurance coverage, other medical illnesses, illness in peer group, familial social network and social media usage) potentially relevant variables. The study might also be followed up post pandemic to see if other variables become important as predictors or mediators/moderators. Given the current results, and the fact that every step of data collection, analysis and prediction can be automated, research groups with the requisite expertise might move forward with testing of such a system for populations at high risk (for example, higher education and the military)83,84.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Molecular histopathology of matrix proteins through autofluorescence super-resolution microscopy",
        "link": "https://www.nature.com/articles/s41598-024-61178-0",
        "publication_date": "08 May 2024",
        "abstract": "Extracellular matrix diseases like fibrosis are elusive to diagnose early on, to avoid complete loss of organ function or even cancer progression, making early diagnosis crucial. Imaging the matrix densities of proteins like collagen in fixed tissue sections with suitable stains and labels is a standard for diagnosis and staging. However, fine changes in matrix density are difficult to realize by conventional histological staining and microscopy as the matrix fibrils are finer than the resolving capacity of these microscopes. The dyes further blur the outline of the matrix and add a background that bottlenecks high-precision early diagnosis of matrix diseases. Here we demonstrate the multiple signal classification method-MUSICAL-otherwise a computational super-resolution microscopy technique to precisely estimate matrix density in fixed tissue sections using fibril autofluorescence with image stacks acquired on a conventional epifluorescence microscope. We validated the diagnostic and staging performance of the method in extracted collagen fibrils, mouse skin during repair, and pre-cancers in human oral mucosa. The method enables early high-precision label-free diagnosis of matrix-associated fibrotic diseases without needing additional infrastructure or rigorous clinical training.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multimodal data fusion using sparse canonical correlation analysis and cooperative learning: a COVID-19 cohort study",
        "link": "https://www.nature.com/articles/s41746-024-01128-2",
        "publication_date": "07 May 2024",
        "abstract": "Through technological innovations, patient cohorts can be examined from multiple views with high-dimensional, multiscale biomedical data to classify clinical phenotypes and predict outcomes. Here, we aim to present our approach for analyzing multimodal data using unsupervised and supervised sparse linear methods in a COVID-19 patient cohort. This prospective cohort study of 149 adult patients was conducted in a tertiary care academic center. First, we used sparse canonical correlation analysis (CCA) to identify and quantify relationships across different data modalities, including viral genome sequencing, imaging, clinical data, and laboratory results. Then, we used cooperative learning to predict the clinical outcome of COVID-19 patients: Intensive care unit admission. We show that serum biomarkers representing severe disease and acute phase response correlate with original and wavelet radiomics features in the LLL frequency channel (cor(Xu1, Zv1) = 0.596, p value < 0.001). Among radiomics features, histogram-based first-order features reporting the skewness, kurtosis, and uniformity have the lowest negative, whereas entropy-related features have the highest positive coefficients. Moreover, unsupervised analysis of clinical data and laboratory results gives insights into distinct clinical phenotypes. Leveraging the availability of global viral genome databases, we demonstrate that the Word2Vec natural language processing model can be used for viral genome encoding. It not only separates major SARS-CoV-2 variants but also allows the preservation of phylogenetic relationships among them. Our quadruple model using Word2Vec encoding achieves better prediction results in the supervised task. The model yields area under the curve (AUC) and accuracy values of 0.87 and 0.77, respectively. Our study illustrates that sparse CCA analysis and cooperative learning are powerful techniques for handling high-dimensional, multimodal data to investigate multivariate associations in unsupervised and supervised tasks.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction and causal inference of cardiovascular and cerebrovascular diseases based on lifestyle questionnaires",
        "link": "https://www.nature.com/articles/s41598-024-61047-w",
        "publication_date": "07 May 2024",
        "abstract": "Cardiovascular and cerebrovascular diseases (CCVD) are prominent mortality causes in Japan, necessitating effective preventative measures, early diagnosis, and treatment to mitigate their impact. A diagnostic model was developed to identify patients with ischemic heart disease (IHD), stroke, or both, using specific health examination data. Lifestyle habits affecting CCVD development were analyzed using five causal inference methods. This study included 473,734 patients aged ≥ 40 years who underwent specific health examinations in Kanazawa, Japan between 2009 and 2018 to collect data on basic physical information, lifestyle habits, and laboratory parameters such as diabetes, lipid metabolism, renal function, and liver function. Four machine learning algorithms were used: Random Forest, Logistic regression, Light Gradient Boosting Machine, and eXtreme-Gradient-Boosting (XGBoost). The XGBoost model exhibited superior area under the curve (AUC), with mean values of 0.770 (± 0.003), 0.758 (± 0.003), and 0.845 (± 0.005) for stroke, IHD, and CCVD, respectively. The results of the five causal inference analyses were summarized, and lifestyle behavior changes were observed after the onset of CCVD. A causal relationship from ‘reduced mastication’ to ‘weight gain’ was found for all causal species theory methods. This prediction algorithm can screen for asymptomatic myocardial ischemia and stroke. By selecting high-risk patients suspected of having CCVD, resources can be used more efficiently for secondary testing.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of clinically relevant T cell receptors for personalized T cell therapy using combinatorial algorithms",
        "link": "https://www.nature.com/articles/s41587-024-02232-0",
        "publication_date": "07 May 2024",
        "abstract": "A central challenge in developing personalized cancer cell immunotherapy is the identification of tumor-reactive T cell receptors (TCRs). By exploiting the distinct transcriptomic profile of tumor-reactive T cells relative to bystander cells, we build and benchmark TRTpred, an antigen-agnostic in silico predictor of tumor-reactive TCRs. We integrate TRTpred with an avidity predictor to derive a combinatorial algorithm of clinically relevant TCRs for personalized T cell therapy and benchmark it in patient-derived xenografts.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "STR mutations on chromosome 15q cause thyrotropin resistance by activating a primate-specific enhancer of MIR7-2/MIR1179",
        "link": "https://www.nature.com/articles/s41588-024-01717-7",
        "publication_date": "07 May 2024",
        "abstract": "Thyrotropin (TSH) is the master regulator of thyroid gland growth and function. Resistance to TSH (RTSH) describes conditions with reduced sensitivity to TSH. Dominantly inherited RTSH has been linked to a locus on chromosome 15q, but its genetic basis has remained elusive. Here we show that non-coding mutations in a (TTTG)4 short tandem repeat (STR) underlie dominantly inherited RTSH in all 82 affected participants from 12 unrelated families. The STR is contained in a primate-specific Alu retrotransposon with thyroid-specific cis-regulatory chromatin features. Fiber-seq and RNA-seq studies revealed that the mutant STR activates a thyroid-specific enhancer cluster, leading to haplotype-specific upregulation of the bicistronic MIR7-2/MIR1179 locus 35 kb downstream and overexpression of its microRNA products in the participants’ thyrocytes. An imbalance in signaling pathways targeted by these micro-RNAs provides a working model for this cause of RTSH. This finding broadens our current knowledge of genetic defects altering pituitary–thyroid feedback regulation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Common cold viruses circulating in children threaten wild chimpanzees through asymptomatic adult carriers",
        "link": "https://www.nature.com/articles/s41598-024-61236-7",
        "publication_date": "07 May 2024",
        "abstract": "Reverse zoonotic respiratory diseases threaten great apes across Sub-Saharan Africa. Studies of wild chimpanzees have identified the causative agents of most respiratory disease outbreaks as “common cold” paediatric human pathogens, but reverse zoonotic transmission pathways have remained unclear. Between May 2019 and August 2021, we conducted a prospective cohort study of 234 children aged 3–11 years in communities bordering Kibale National Park, Uganda, and 30 adults who were forest workers and regularly entered the park. We collected 2047 respiratory symptoms surveys to quantify clinical severity and simultaneously collected 1989 nasopharyngeal swabs approximately monthly for multiplex viral diagnostics. Throughout the course of the study, we also collected 445 faecal samples from 55 wild chimpanzees living nearby in Kibale in social groups that have experienced repeated, and sometimes lethal, epidemics of human-origin respiratory viral disease. We characterized respiratory pathogens in each cohort and examined statistical associations between PCR positivity for detected pathogens and potential risk factors. Children exhibited high incidence rates of respiratory infections, whereas incidence rates in adults were far lower. COVID-19 lockdown in 2020–2021 significantly decreased respiratory disease incidence in both people and chimpanzees. Human respiratory infections peaked in June and September, corresponding to when children returned to school. Rhinovirus, which caused a 2013 outbreak that killed 10% of chimpanzees in a Kibale community, was the most prevalent human pathogen throughout the study and the only pathogen present at each monthly sampling, even during COVID-19 lockdown. Rhinovirus was also most likely to be carried asymptomatically by adults. Although we did not detect human respiratory pathogens in the chimpanzees during the cohort study, we detected human metapneumovirus in two chimpanzees from a February 2023 outbreak that were genetically similar to viruses detected in study participants in 2019. Our data suggest that respiratory pathogens circulate in children and that adults become asymptomatically infected during high-transmission times of year. These asymptomatic adults may then unknowingly carry the pathogens into forest and infect chimpanzees. This conclusion, in turn, implies that intervention strategies based on respiratory symptoms in adults are unlikely to be effective for reducing reverse zoonotic transmission of respiratory viruses to chimpanzees.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Glaucoma detection using non-perfused areas in OCTA",
        "link": "https://www.nature.com/articles/s41598-024-60839-4",
        "publication_date": "05 May 2024",
        "abstract": "Multiple ophthalmic diseases lead to decreased capillary perfusion that can be visualized using optical coherence tomography angiography images. To quantify the decrease in perfusion, past studies have often used the vessel density, which is the percentage of vessel pixels in the image. However, this method is often not sensitive enough to detect subtle changes in early pathology. More recent methods are based on quantifying non-perfused or intercapillary areas between the vessels. These methods rely upon the accuracy of vessel segmentation, which is a challenging task and therefore a limiting factor for reliability. Intercapillary areas computed from perfusion-distance measures are less sensitive to errors in the vessel segmentation since the distance to the next vessel is only slightly changing if gaps are present in the segmentation. We present a novel method for distinguishing between glaucoma patients and healthy controls based on features computed from the probability density function of these perfusion-distance areas. The proposed approach is evaluated on different capillary plexuses and outperforms previously proposed methods that use handcrafted features for classification. Moreover the results of the proposed method are in the same range as the ones of convolutional neural networks trained on the raw input images and is therefore a computationally efficient, simple to implement and explainable alternative to deep learning-based approaches.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sync fast and solve things—best practices for responsible digital health",
        "link": "https://www.nature.com/articles/s41746-024-01105-9",
        "publication_date": "04 May 2024",
        "abstract": "Digital health innovation is expected to transform healthcare, but it also generates ethical and societal concerns, such as privacy risks, and biases that can compound existing health inequalities. While such concerns are widely recognized, existing regulatory principles, oversight methods and ethical frameworks seem out of sync with digital health innovation. New governance and innovation best practices are thus needed to bring such principles to bear with the reality of business, innovation, and regulation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Differential diagnosis of thyroid nodules using heterogeneity quantification software on ultrasound images: correlation with the Bethesda system and surgical pathology",
        "link": "https://www.nature.com/articles/s41598-024-60881-2",
        "publication_date": "04 May 2024",
        "abstract": "Ultrasonography (US)-guided fine-needle aspiration cytology (FNAC) is the primary modality for evaluating thyroid nodules. However, in cases of atypia of undetermined significance (AUS) or follicular lesion of undetermined significance (FLUS), supplemental tests are necessary for a definitive diagnosis. Accordingly, we aimed to develop a non-invasive quantification software using the heterogeneity scores of thyroid nodules. This cross-sectional study retrospectively enrolled 188 patients who were categorized into four groups according to their diagnostic classification in the Bethesda system and surgical pathology [II-benign (B) (n = 24); III-B (n = 52); III-malignant (M) (n = 54); V/VI-M (n = 58)]. Heterogeneity scores were derived using an image pixel-based heterogeneity index, utilized as a coefficient of variation (CV) value, and analyzed across all US images. Differences in heterogeneity scores were compared using one-way analysis of variance with Tukey’s test. Diagnostic accuracy was determined by calculating the area under the receiver operating characteristic (AUROC) curve. The results of this study indicated significant differences in mean heterogeneity scores between benign and malignant thyroid nodules, except in the comparison between III-M and V/VI-M nodules. Among malignant nodules, the Bethesda classification was not observed to be associated with mean heterogeneity scores. Moreover, there was a positive correlation between heterogeneity scores and the combined diagnostic category, which was based on the Bethesda system and surgical cytology grades (R = 0.639, p < 0.001). AUROC for heterogeneity scores showed the highest diagnostic performance (0.818; cut-off: 30.22% CV value) for differentiating the benign group (normal/II-B/III-B) from the malignant group (III-M/V&VI-M), with a diagnostic accuracy of 72.5% (161/122). Quantitative heterogeneity measurement of US images is a valuable non-invasive diagnostic tool for predicting the likelihood of malignancy in thyroid nodules, including AUS or FLUS.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A Dataset for Evaluating Contextualized Representation of Biomedical Concepts in Language Models",
        "link": "https://www.nature.com/articles/s41597-024-03317-w",
        "publication_date": "04 May 2024",
        "abstract": "Due to the complexity of the biomedical domain, the ability to capture semantically meaningful representations of terms in context is a long-standing challenge. Despite important progress in the past years, no evaluation benchmark has been developed to evaluate how well language models represent biomedical concepts according to their corresponding context. Inspired by the Word-in-Context (WiC) benchmark, in which word sense disambiguation is reformulated as a binary classification task, we propose a novel dataset, BioWiC, to evaluate the ability of language models to encode biomedical terms in context. BioWiC comprises 20’156 instances, covering over 7’400 unique biomedical terms, making it the largest WiC dataset in the biomedical domain. We evaluate BioWiC both intrinsically and extrinsically and show that it could be used as a reliable benchmark for evaluating context-dependent embeddings in biomedical corpora. In addition, we conduct several experiments using a variety of discriminative and generative large language models to establish robust baselines that can serve as a foundation for future research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting the risk of pancreatic cancer in adults with new-onset diabetes: development and internal–external validation of a clinical risk prediction model",
        "link": "https://www.nature.com/articles/s41416-024-02693-9",
        "publication_date": "03 May 2024",
        "abstract": "The National Institute for Health and Care Excellence (NICE) recommends that people aged 60+ years with newly diagnosed diabetes and weight loss undergo abdominal imaging to assess for pancreatic cancer. More nuanced stratification could lead to enrichment of these referral pathways.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Effect of pooled tracheal sample testing on the probability of Mycoplasma hyopneumoniae detection",
        "link": "https://www.nature.com/articles/s41598-024-60377-z",
        "publication_date": "03 May 2024",
        "abstract": "Tracheal pooling for Mycoplasma hyopneumoniae (M. hyopneumoniae) DNA detection allows for decreased diagnostic cost, one of the main constraints in surveillance programs. The objectives of this study were to estimate the sensitivity of pooled-sample testing for the detection of M. hyopneumoniae in tracheal samples and to develop probability of M. hyopneumoniae detection estimates for tracheal samples pooled by 3, 5, and 10. A total of 48 M. hyopneumoniae PCR-positive field samples were pooled 3-, 5-, and 10-times using field M. hyopneumoniae DNA-negative samples and tested in triplicate. The sensitivity was estimated at 0.96 (95% credible interval [Cred. Int.]: 0.93, 0.98) for pools of 3, 0.95 (95% Cred. Int: 0.92, 0.98) for pools of 5, and 0.93 (95% Cred. Int.: 0.89, 0.96) for pools of 10. All pool sizes resulted in PCR-positive if the individual tracheal sample Ct value was < 33. Additionally, there was no significant decrease in the probability of detecting at least one M. hyopneumoniae-infected pig given any pool size (3, 5, or 10) of tracheal swabs. Furthermore, this manuscript applies the probability of detection estimates to various real-life diagnostic testing scenarios. Combining increased total animals sampled with pooling can be a cost-effective tool to maximize the performance of M. hyopneumoniae surveillance programs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning for predicting elective fertility preservation outcomes",
        "link": "https://www.nature.com/articles/s41598-024-60671-w",
        "publication_date": "02 May 2024",
        "abstract": "This retrospective study applied machine-learning models to predict treatment outcomes of women undergoing elective fertility preservation. Two-hundred-fifty women who underwent elective fertility preservation at a tertiary center, 2019–2022 were included. Primary outcome was the number of metaphase II oocytes retrieved. Outcome class was based on oocyte count (OC): Low (≤ 8), Medium (9–15) or High (≥ 16). Machine-learning models and statistical regression were used to predict outcome class, first based on pre-treatment parameters, and then using post-treatment data from ovulation-triggering day. OC was 136 Low, 80 Medium, and 34 High. Random Forest Classifier (RFC) was the most accurate model (pre-treatment receiver operating characteristic (ROC) area under the curve (AUC) was 77%, and post-treatment ROC AUC was 87%), followed by XGBoost Classifier (pre-treatment ROC AUC 74%, post-treatment ROC AUC 86%). The most important pre-treatment parameters for RFC were basal FSH (22.6%), basal LH (19.1%), AFC (18.2%), and basal estradiol (15.6%). Post-treatment parameters were estradiol levels on trigger-day (17.7%), basal FSH (11%), basal LH (9%), and AFC (8%). Machine-learning models trained with clinical data appear to predict fertility preservation treatment outcomes with relatively high accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Demystifying COVID-19 mortality causes with interpretable data mining",
        "link": "https://www.nature.com/articles/s41598-024-60841-w",
        "publication_date": "02 May 2024",
        "abstract": "While COVID-19 becomes periodical, old individuals remain vulnerable to severe disease with high mortality. Although there have been some studies on revealing different risk factors affecting the death of COVID-19 patients, researchers rarely provide a comprehensive analysis to reveal the relationships and interactive effects of the risk factors of COVID-19 mortality, especially in the elderly. Through retrospectively including 1917 COVID-19 patients (102 were dead) admitted to Xiangya Hospital from December 2022 to March 2023, we used the association rule mining method to identify the risk factors leading causes of death among the elderly. Firstly, we used the Affinity Propagation clustering to extract key features from the dataset. Then, we applied the Apriori Algorithm to obtain 6 groups of abnormal feature combinations with significant increments in mortality rate. The results showed a relationship between the number of abnormal feature combinations and mortality rates within different groups. Patients with “C-reactive protein > 8 mg/L”, “neutrophils percentage > 75.0 %”, “lymphocytes percentage < 20%”, and “albumin < 40 g/L” have a 2\\(\\times\\) mortality rate than the basic one. When the characteristics of “D-dimer > 0.5 mg/L” and “WBC > \\(9.5 \\times 10^9\\) /L” are continuously included in this foundation, the mortality rate can be increased to 3\\(\\times\\) or 4\\(\\times\\). In addition, we also found that liver and kidney diseases significantly affect patient mortality, and the mortality rate can be as high as 100%. These findings can support auxiliary diagnosis and treatment to facilitate early intervention in patients, thereby reducing patient mortality.",
        "conclusions": "The current study has effectively summarized the medical characteristics of the patients and has identified seven distinct groups at different risk of mortality. Healthcare providers should heighten their awareness of features such as age, CRP, lymphocyte and neutrophil levels, albumin, D-dimer, hemoglobin, and comorbidities. Clinicians can identify individuals and implement tailored treatment strategies, ultimately facilitating reducing the incidence of severe COVID-19 cases and overall mortality.Advantages and limitationsAdvantages: For parameters selection, we used AP clustering and significance analysis rather than LASSO and survival tree analysis. Patients were clustered into different groups with various mortality rates, and then we investigated which indicators contributed the differences in mortality rates. This method is more reliable than directly using results from models. Then, we further explored how the combinations of indicators interactively influenced mortality rates. We set thresholds for indicators based on medical standards and used the association rule analysis algorithm, Apriori, to discover which abnormal combinations of indicators significantly affected mortality rates. Compared to methods such as XGBoost and random forest models, which derive results based on thresholds determined by the model, our approach is better at reducing biases and improving interpretability.Limitations: It is worth noting that the majority of our patients originated from the middle area of China. This might introduce certain demographic disparities and statistical biases into our analysis. Meanwhile, limited by the sample size, group 7 requires large cohort studies or retrospective investigation to be verified.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Progression subtypes in Parkinson’s disease identified by a data-driven multi cohort analysis",
        "link": "https://www.nature.com/articles/s41531-024-00712-3",
        "publication_date": "02 May 2024",
        "abstract": "The progression of Parkinson’s disease (PD) is heterogeneous across patients, affecting counseling and inflating the number of patients needed to test potential neuroprotective treatments. Moreover, disease subtypes might require different therapies. This work uses a data-driven approach to investigate how observed heterogeneity in PD can be explained by the existence of distinct PD progression subtypes. To derive stable PD progression subtypes in an unbiased manner, we analyzed multimodal longitudinal data from three large PD cohorts and performed extensive cross-cohort validation. A latent time joint mixed-effects model (LTJMM) was used to align patients on a common disease timescale. Progression subtypes were identified by variational deep embedding with recurrence (VaDER). In each cohort, we identified a fast-progressing and a slow-progressing subtype, reflected by different patterns of motor and non-motor symptoms progression, survival rates, treatment response, features extracted from DaTSCAN imaging and digital gait assessments, education, and Alzheimer’s disease pathology. Progression subtypes could be predicted with ROC-AUC up to 0.79 for individual patients when a one-year observation period was used for model training. Simulations demonstrated that enriching clinical trials with fast-progressing patients based on these predictions can reduce the required cohort size by 43%. Our results show that heterogeneity in PD can be explained by two distinct subtypes of PD progression that are stable across cohorts. These subtypes align with the brain-first vs. body-first concept, which potentially provides a biological explanation for subtype differences. Our predictive models will enable clinical trials with significantly lower sample sizes by enriching fast-progressing patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Ultra high frequency ultrasound enables real-time visualization of blood supply from chorioallantoic membrane to human autosomal dominant polycystic kidney tissue",
        "link": "https://www.nature.com/articles/s41598-024-60783-3",
        "publication_date": "02 May 2024",
        "abstract": "Ultra high frequency (UHF) ultrasound enables the visualization of very small structures that cannot be detected by conventional ultrasound. The utilization of UHF imaging as a new imaging technique for the 3D-in-vivo chorioallantoic membrane (CAM) model can facilitate new insights into tissue perfusion and survival. Therefore, human renal cystic tissue was grafted onto the CAM and examined using UHF ultrasound imaging. Due to the unprecedented resolution of UHF ultrasound, it was possible to visualize microvessels, their development, and the formation of anastomoses. This enabled the observation of anastomoses between human and chicken vessels only 12 h after transplantation. These observations were validated by 3D reconstructions from a light sheet microscopy image stack, indocyanine green angiography, and histological analysis. Contrary to the assumption that the nutrient supply of the human cystic tissue and the gas exchange happens through diffusion from CAM vessels, this study shows that the vasculature of the human cystic tissue is directly connected to the blood vessels of the CAM and perfusion is established within a short period. Therefore, this in-vivo model combined with UHF imaging appears to be the ideal platform for studying the effects of intravenously applied therapeutics to inhibit renal cyst growth.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A patient-based iPSC-derived hepatocyte model of alcohol-associated cirrhosis reveals bioenergetic insights into disease pathogenesis",
        "link": "https://www.nature.com/articles/s41467-024-47085-y",
        "publication_date": "01 May 2024",
        "abstract": "Only ~20% of heavy drinkers develop alcohol cirrhosis (AC). While differences in metabolism, inflammation, signaling, microbiome signatures and genetic variations have been tied to the pathogenesis of AC, the key underlying mechanisms for this interindividual variability, remain to be fully elucidated. Induced pluripotent stem cell-derived hepatocytes (iHLCs) from patients with AC and healthy controls differ transcriptomically, bioenergetically and histologically. They include a greater number of lipid droplets (LDs) and LD-associated mitochondria compared to control cells. These pre-pathologic indicators are effectively reversed by Aramchol, an inhibitor of stearoyl-CoA desaturase. Bioenergetically, AC iHLCs have lower spare capacity, slower ATP production and their mitochondrial fuel flexibility towards fatty acids and glutamate is weakened. MARC1 and PNPLA3, genes implicated by GWAS in alcohol cirrhosis, show to correlate with lipid droplet-associated and mitochondria-mediated oxidative damage in AC iHLCs. Knockdown of PNPLA3 expression exacerbates mitochondrial deficits and leads to lipid droplets alterations. These findings suggest that differences in mitochondrial bioenergetics and lipid droplet formation are intrinsic to AC hepatocytes and can play a role in its pathogenesis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring post-COVID-19 health effects and features with advanced machine learning techniques",
        "link": "https://www.nature.com/articles/s41598-024-60504-w",
        "publication_date": "30 Apr 2024",
        "abstract": "COVID-19 is an infectious respiratory disease that has had a significant impact, resulting in a range of outcomes including recovery, continued health issues, and the loss of life. Among those who have recovered, many experience negative health effects, particularly influenced by demographic factors such as gender and age, as well as physiological and neurological factors like sleep patterns, emotional states, anxiety, and memory. This research aims to explore various health factors affecting different demographic profiles and establish significant correlations among physiological and neurological factors in the post-COVID-19 state. To achieve these objectives, we have identified the post-COVID-19 health factors and based on these factors survey data were collected from COVID-recovered patients in Bangladesh. Employing diverse machine learning algorithms, we utilised the best prediction model for post-COVID-19 factors. Initial findings from statistical analysis were further validated using Chi-square to demonstrate significant relationships among these elements. Additionally, Pearson’s coefficient was utilized to indicate positive or negative associations among various physiological and neurological factors in the post-COVID-19 state. Finally, we determined the most effective machine learning model and identified key features using analytical methods such as the Gini Index, Feature Coefficients, Information Gain, and SHAP Value Assessment. And found that the Decision Tree model excelled in identifying crucial features while predicting the extent of post-COVID-19 impact.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction and causal inference of hyperuricemia using gut microbiota",
        "link": "https://www.nature.com/articles/s41598-024-60427-6",
        "publication_date": "30 Apr 2024",
        "abstract": "Hyperuricemia (HUA) is a symptom of high blood uric acid (UA) levels, which causes disorders such as gout and renal urinary calculus. Prolonged HUA is often associated with hypertension, atherosclerosis, diabetes mellitus, and chronic kidney disease. Studies have shown that gut microbiota (GM) affect these chronic diseases. This study aimed to determine the relationship between HUA and GM. The microbiome of 224 men and 254 women aged 40 years was analyzed through next-generation sequencing and machine learning. We obtained GM data through 16S rRNA-based sequencing of the fecal samples, finding that alpha-diversity by Shannon index was significantly low in the HUA group. Linear discriminant effect size analysis detected a high abundance of the genera Collinsella and Faecalibacterium in the HUA and non-HUA groups. Based on light gradient boosting machine learning, we propose that HUA can be predicted with high AUC using four clinical characteristics and the relative abundance of nine bacterial genera, including Collinsella and Dorea. In addition, analysis of causal relationships using a direct linear non-Gaussian acyclic model indicated a positive effect of the relative abundance of the genus Collinsella on blood UA levels. Our results suggest abundant Collinsella in the gut can increase blood UA levels.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A decision tree algorithm to identify predictors of post-stroke complex regional pain syndrome",
        "link": "https://www.nature.com/articles/s41598-024-60597-3",
        "publication_date": "30 Apr 2024",
        "abstract": "This prospective cohort study aimed to identify the risk factors for post-stroke complex regional pain syndrome (CRPS) using a decision tree algorithm while comprehensively assessing upper limb and lower limb disuse and physical inactivity. Upper limb disuse (Fugl-Meyer assessment of upper extremity [FMA-UE], Action Research Arm Test, Motor Activity Log), lower limb disuse (Fugl-Meyer Assessment of lower extremity [FMA-LE]), balance performance (Berg balance scale), and physical inactivity time (International Physical Activity Questionnaire-Short Form [IPAQ-SF]) of 195 stroke patients who visited the Kishiwada Rehabilitation Hospital were assessed at admission. The incidence of post-stroke CRPS was 15.4% in all stroke patients 3 months after admission. The IPAQ, FMA-UE, and FMA-LE were extracted as risk factors for post-stroke CRPS. According to the decision tree algorithm, the incidence of post-stroke CRPS was 1.5% in patients with a short physical inactivity time (IPAQ-SF < 635), while it increased to 84.6% in patients with a long inactivity time (IPAQ-SF ≥ 635) and severe disuse of upper and lower limbs (FMA-UE score < 19.5; FMA-LE score < 16.5). The incidence of post-stroke CRPS may increase with lower-limb disuse and physical inactivity, in addition to upper-limb disuse. Increasing physical activity and addressing lower- and upper-limb motor paralysis may reduce post-stroke CRPS.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Innovative decision making tools using discrete mathematics for stress urinary incontinence treatment",
        "link": "https://www.nature.com/articles/s41598-024-60407-w",
        "publication_date": "30 Apr 2024",
        "abstract": "In this study, we applied graph theory to clinical decision-making for Stress Urinary Incontinence (SUI) treatment. Utilizing discrete mathematics, we developed a system to visually understand the shortest path to the desired treatment outcomes by considering various patient variables. Focusing on women aged 35–50, we examined the effectiveness of Tension-free Vaginal Tape (TVT) surgery and Vaginal Erbium Laser (VEL) treatment for over 15 years. The TVT group consisted of 102 patients who underwent surgery using either the Advantage Fit mid-urethral sling system (Boston Scientific Co., MA, USA) or the GYNECARE TVT retropubic system (Ethicon Inc., NJ, USA). The VEL group included 113 patients treated with a non-ablative Erbium: YAG laser (FotonaSmooth™ XS; Fotona d.o.o., Ljubljana, Slovenia), and there were 112 patients in the control group. We constructed a network diagram analyzing the correlations between health, demographic factors, treatment methods, and patient outcomes. By calculating the shortest path using heuristic functions, we identified significant correlations and treatment effects. This approach supports patient decision making by choosing between TVT and VEL treatments based on individual objectives. Our findings provide new insights into SUI treatment, highlighting the value of a data-driven personalized approach for clinical decision-making. This interdisciplinary study bridges the gap between mathematics and medicine, demonstrating the importance of a data-centric approach in clinical decisions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Diagnosing an overcrowded emergency department from its Electronic Health Records",
        "link": "https://www.nature.com/articles/s41598-024-60888-9",
        "publication_date": "30 Apr 2024",
        "abstract": "Emergency department overcrowding is a complex problem that persists globally. Data of visits constitute an opportunity to understand its dynamics. However, the gap between the collected information and the real-life clinical processes, and the lack of a whole-system perspective, still constitute a relevant limitation. An analytical pipeline was developed to analyse one-year of production data following the patients that came from the ED (n = 49,938) at Uppsala University Hospital (Uppsala, Sweden) by involving clinical experts in all the steps of the analysis. The key internal issues to the ED were the high volume of generic or non-specific diagnoses from non-urgent visits, and the delayed decision regarding hospital admission caused by several imaging assessments and lack of hospital beds. Furthermore, the external pressure of high frequent re-visits of geriatric, psychiatric, and patients with unspecified diagnoses dramatically contributed to the overcrowding. Our work demonstrates that through analysis of production data of the ED patient flow and participation of clinical experts in the pipeline, it was possible to identify systemic issues and directions for solutions. A critical factor was to take a whole systems perspective, as it opened the scope to the boundary effects of inflow and outflow in the whole healthcare system.",
        "conclusions": "Our analysis reveals insights into ED overcrowding and enables to identify systemic issues and directions for solutions. The whole systems perspective opened the scope to the boundary effects of inflow and outflow of the ED inside the hospital. Finally, our approach demonstrates that to enhance and unlock the potential of real-world data in studying ED overcrowding challenge we need to look to systems beyond the walls of the ED and the hospitals to solve this problem.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "poisoning"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Improving inceptionV4 model based on fractional-order snow leopard optimization algorithm for diagnosing of ACL tears",
        "link": "https://www.nature.com/articles/s41598-024-60419-6",
        "publication_date": "29 Apr 2024",
        "abstract": "In the current research study, a new method is presented to diagnose Anterior Cruciate Ligament (ACL) tears by introducing an optimized version of the InceptionV4 model. Our proposed methodology utilizes a custom-made variant of the Snow Leopard Optimization Algorithm, known as the Fractional-order Snow Leopard Optimization Algorithm (FO-LOA), to extract essential features from knee magnetic resonance imaging (MRI) images. This results in a substantial improvement in the accuracy of ACL tear detection. By effectively extracting critical features from knee MRI images, our proposed methodology significantly enhances diagnostic accuracy, potentially reducing false negatives and false positives. The enhanced model based on FO-LOA underwent thorough testing using the MRNet dataset, demonstrating exceptional performance metrics including an accuracy rate of 98.00%, sensitivity of 98.00%, precision of 97.00%, specificity of 98.00%, F1-score of 98.00%, and Matthews Correlation Coefficient (MCC) of 88.00%. These findings surpass current methodologies like Convolutional Neural Network (CNN), Inception-v3, Deep Belief Networks and Improved Honey Badger Algorithm (DBN/IHBA), integration of the CNN with an Amended Cooking Training-based Optimizer version (CNN/ACTO), Self-Supervised Representation Learning (SSRL), signifying a significant breakthrough in ACL injury diagnosis. Using FO-SLO to optimize the InceptionV4 framework shows promise in improving the accuracy of ACL tear identification, enabling prompt and efficient treatment interventions.",
        "conclusions": "The ACL has been considered a significant ligament within the joint of knee, serving to provide stability and prevent excessive forward movement of the tibia in relation to the femur (thighbone). ACL tears are a common injury resulting from sports-related activities, which can occur due to sudden stops, changes in direction, or direct impact to the knee. The prompt and accurate diagnosis of ACL tears is crucial in determining appropriate treatment strategies and minimizing the risk of further complications. The utilization of deep learning and metaheuristics techniques offers several advantages in the diagnosis of ACL injuries. Deep learning algorithms, mostly CNNs, excel at automatically extracting meaningful features from medical images. By training CNN models on large datasets of knee MRI images, these models can learn to identify patterns and characteristics indicative of an ACL tear. Deep learning-based approaches have demonstrated superior accuracy in detecting ACL tears compared to traditional image analysis techniques. This research study presents an optimized version of the InceptionV4 model, which utilizes a modified metaheuristic algorithm, namely Fractional-order Snow Leopard Optimization Algorithm (FO-LOA) to detect ACL tears. The model optimized with FO-LOA was subjected to thorough testing on the MRNet dataset, demonstrating exceptional performance metrics. It achieved an accuracy rate of 98.00%, sensitivity of 98.00%, precision of 97.00%, specificity of 98.00%, F1-score of 98.00%, and a Matthews Correlation Coefficient (MCC) of 88.00%. These outcomes surpass well-known methodologies like Convolutional Neural Network (CNN), Inception-v3, Deep Belief Networks, and Improved Honey Badger Algorithm (DBN/IHBA), as well as the combination of CNN with a modified Cooking Training-based Optimizer version (CNN/ACTO) and Self-Supervised Representation Learning (SSRL). This progress represents a significant advancement in ACL injury diagnosis. The use of FO-SLO to optimize the InceptionV4 framework shows promise in improving the accuracy of ACL tear detection, enabling prompt and efficient treatment interventions.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cognitive function is associated with performance in time up and go test and with leptin blood levels in community-dwelling older women",
        "link": "https://www.nature.com/articles/s41598-024-60274-5",
        "publication_date": "29 Apr 2024",
        "abstract": "Considering the challenge that cognitive dysfunction and dementia represent to health is imperative to prioritize early diagnosis strategies and explore the pathophysiological mechanisms. There is no consensus on specific markers and physical tests that indicate cognitive decline in older. The objective of this study was to evaluate a panel of inflammatory biomarkers and physical function and investigate their association with cognitive function in community-dwelling older women. Seventy-one participants were included in this study. Cognitive function was assessed by Mini Mental State Examination, muscle strength using dynamometer, body composition using Dual X-ray absorptiometry, respiratory muscle strength using manuvacuometer, and physical function using the Short Physical Performance Battery and Time Up and Go (TUG) tests. Blood samples were collected to analyze a panel of inflammatory biomarkers. The cognitive function was associated with TUG (β = − 0.48; 95%IC = − 0.54 to − 0.21; p < 0.001), inspiratory muscle strength (β = 0.30; 95%IC = 0.005–0.03; p = 0.009), and leptin concentrations (β = 0.32; 95% IC = 0.001–0.006; 0.007). Time spent on TUG test and leptin levels accounted for 27% of variability in cognitive function independent of age. Poorer physical function with leptin plasma levels is associated with decreased cognitive function in older women. These findings contribute to comprehension of pathophysiology underlying cognitive decline and informing the development of new approaches to prevent, diagnose, monitoring and treat cognitive decline in aging.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "DRA-Net: Medical image segmentation based on adaptive feature extraction and region-level information fusion",
        "link": "https://www.nature.com/articles/s41598-024-60475-y",
        "publication_date": "27 Apr 2024",
        "abstract": "Medical image segmentation is a key task in computer aided diagnosis. In recent years, convolutional neural network (CNN) has made some achievements in medical image segmentation. However, the convolution operation can only extract features in a fixed size region at a time, which leads to the loss of some key features. The recently popular Transformer has global modeling capabilities, but it does not pay enough attention to local information and cannot accurately segment the edge details of the target area. Given these issues, we proposed dynamic regional attention network (DRA-Net). Different from the above methods, it first measures the similarity of features and concentrates attention on different dynamic regions. In this way, the network can adaptively select different modeling scopes for feature extraction, reducing information loss. Then, regional feature interaction is carried out to better learn local edge details. At the same time, we also design ordered shift multilayer perceptron (MLP) blocks to enhance communication within different regions, further enhancing the network’s ability to learn local edge details. After several experiments, the results indicate that our network produces more accurate segmentation performance compared to other CNN and Transformer based networks.",
        "conclusions": "In this paper, an adaptive feature extraction and region-level information fusion medical image segmentation network is proposed. It uses CNN as the backbone for semantic feature extraction. Noticed that the targets of medical images usually exist in regions, we designs a dynamic regional attention module, which uses a similarity measure to extract features. Different from local fixed or global forms, this method can adaptively select a suitable modeling range based on features. At the same time, we also use the ordered shift MLP module to enhance the feature interaction within different regional blocks, so that the network can not only focus on the fixed size of the region, but also focus on the feature information of the more distant or surrounding areas. In this way, we can enhance the network’s ability to extract local detail information and reduce information loss, thereby more accurately and reliably segmenting the target area in medical images. After in-depth analysis, we have found reasonable parameters to achieve better experimental results. The experimental results show that the proposed method performs better on the dataset than other methods. It not only breaks the limitation of using local fixation to extract information, but also brings a new solution for dealing with data with scattered foreground information. Compared with other methods, we have better results in model parameters and computational complexity, but our inference speed is slightly slower than some methods. So, our future work will not only focus on extending this multi angle feature extraction method to other medical images, but also improve the running rules of the algorithm to achieve higher efficiency.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Heart patient health monitoring system using invasive and non-invasive measurement",
        "link": "https://www.nature.com/articles/s41598-024-60500-0",
        "publication_date": "26 Apr 2024",
        "abstract": "The abnormal heart conduction, known as arrhythmia, can contribute to cardiac diseases that carry the risk of fatal consequences. Healthcare professionals typically use electrocardiogram (ECG) signals and certain preliminary tests to identify abnormal patterns in a patient’s cardiac activity. To assess the overall cardiac health condition, cardiac specialists monitor these activities separately. This procedure may be arduous and time-intensive, potentially impacting the patient’s well-being. This study automates and introduces a novel solution for predicting the cardiac health conditions, specifically identifying cardiac morbidity and arrhythmia in patients by using invasive and non-invasive measurements. The experimental analyses conducted in medical studies entail extremely sensitive data and any partial or biased diagnoses in this field are deemed unacceptable. Therefore, this research aims to introduce a new concept of determining the uncertainty level of machine learning algorithms using information entropy. To assess the effectiveness of machine learning algorithms information entropy can be considered as a unique performance evaluator of the machine learning algorithm which is not selected previously any studies within the realm of bio-computational research. This experiment was conducted on arrhythmia and heart disease datasets collected from Massachusetts Institute of Technology-Berth Israel Hospital-arrhythmia (DB-1) and Cleveland Heart Disease (DB-2), respectively. Our framework consists of four significant steps: 1) Data acquisition, 2) Feature preprocessing approach, 3) Implementation of learning algorithms, and 4) Information Entropy. The results demonstrate the average performance in terms of accuracy achieved by the classification algorithms: Neural Network (NN) achieved 99.74%, K-Nearest Neighbor (KNN) 98.98%, Support Vector Machine (SVM) 99.37%, Random Forest (RF) 99.76 % and Naïve Bayes (NB) 98.66% respectively. We believe that this study paves the way for further research, offering a framework for identifying cardiac health conditions through machine learning techniques.",
        "conclusions": "A feature preprocessing approach is presented in this work to identify the cardiac health condition in terms of normal, abnormal(arrhythmic beat), and heart disease using two datasets. Furthermore, we introduce a new concept (information entropy) for determining classifier uncertainty levels when using medical datasets to overcome biased data diagnosis. This framework can assist researchers working in the fields of biotechnology, bioinformatics, and computational biology. Finally, the authors aim to conduct additional experiments based on the limitations discussed in section 5.3 in future work.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]