[
    {
        "title": "Assessing the clinical utility of inertial sensors for home monitoring in Parkinson’s disease: a comprehensive review",
        "link": "https://www.nature.com/articles/s41531-024-00755-6",
        "publication_date": "20 Aug 2024",
        "abstract": "This review screened 296 articles on wearable sensors for home monitoring of people with Parkinson’s Disease within the PubMed Database, from January 2017 to May 2023. A three-level maturity framework was applied for classifying the aims of 59 studies included: demonstrating technical efficacy, diagnostic sensitivity, or clinical utility. As secondary analysis, user experience (usability and patient adherence) was evaluated. The evidences provided by the studies were categorized and stratified according to the level of maturity. Our results indicate that approximately 75% of articles investigated diagnostic sensitivity, i.e. correlation of sensor-data with clinical parameters. Evidence of clinical utility, defined as improvement on health outcomes or clinical decisions after the use of the wearables, was found only in nine papers. A third of the articles included reported evidence of user experience. Future research should focus more on clinical utility, to facilitate the translation of research results within the management of Parkinson’s Disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Brain of miyoshi myopathy/dysferlinopathy patients presents with structural and metabolic anomalies",
        "link": "https://www.nature.com/articles/s41598-024-69966-4",
        "publication_date": "20 Aug 2024",
        "abstract": "Miyoshi myopathy/dysferlinopathy (MMD) is a rare muscle disease caused by DYSF gene mutations. Apart from skeletal muscles, DYSF is also expressed in the brain. However, the impact of MMD-causing DYSF variants on brain structure and function remains unexplored. To investigate this, we utilized magnetic resonance (MR) modalities (MR volumetry and 31P MR spectroscopy) in a family with seven children, four of whom have the illness. The MMD siblings showed distinct differences from healthy controls: (1) a significant (p < 0.001) right-sided volume asymmetry (+ 232 mm3) of the inferior lateral ventricles; and (2) a significant (p < 0.001) decrease in [Mg2+], along with a modified energy metabolism profile and altered membrane turnover in the hippocampus and motor and premotor cortices. The patients' [Mg2+], energy metabolism, and membrane turnover measures returned to those of healthy relatives after a month of 400 mg/day magnesium supplementation. This work is the first to describe anatomical and functional abnormalities characteristic of neurodegeneration in the MMD brain. Therefore, we call for further examination of brain functions in larger cohorts of MMD patients and testing of magnesium supplementation, which has proven to be an effective corrective approach in our study.",
        "conclusions": "We have identified a large family with four siblings affected by MMD. These siblings are compound heterozygotes carrying an allele of the dysferlin gene with the previously described mutation c.4076 T > C and an allele with the newly identified mutation c.2864 + 1dupG. Based on the results presented here, we have found that: (1) the newly identified mutant DYSF variant c.2864 + 1dupG is pathogenic, and its presence with the second mutant allele c.4076 T > C is causal in relation to the onset and progression of MMD; (2) all MMD patients exhibit a prominent right-sided volume asymmetry of ILV; (3) [Mg2+] in the motor and premotor cortex and hippocampus of MMD patients is considerably lower compared with that of healthy family members; (4) energy metabolism and membrane turnover are altered in the motor and premotor cortex and hippocampus of MMD patients compared with those of healthy family members; (5) a one-month oral supplementation with Mg at an effective dose of 400 mg/day in the form of Mg citrate is sufficient to replenish Mg2+ pools in the studied brain areas of the patients to the levels measured in healthy family members; (6) Mg supplementation has a measurable corrective effect on the phospho-metabolites (parameters of energy metabolism and membrane turnover) in the studied brain areas of the patients. Our findings substantiate MMD as being a far more complex disease than previously thought, extending beyond muscular ailments.Study limitationsThe observed/measured structural and metabolic clinically relevant phenomena seen in MMD brains might be specific to the mutations DYSF c.2864 + 1dupG and/or its combination with DYSF c.4076 T > C (p.Leu1359Pro) and might not be present in MMD patients with other configurations of DYSF mutations. Therefore, a similar study should be performed with a heterogeneous cohort of MMD patients. Another limitation is the small sample size. The rarity of this disease in our region hampers the performance of similar research on a larger cohort of such patients. An international consortium thus needs to be assembled focusing on the examination of the brain structure, pathophysiology, and neurochemistry of MMD patients.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A reference framework for standardization and harmonization of CT radiomics features on cadaveric sample",
        "link": "https://www.nature.com/articles/s41598-024-68158-4",
        "publication_date": "20 Aug 2024",
        "abstract": "Radiomics features (RFs) serve as quantitative metrics to characterize shape, density/intensity, and texture patterns in radiological images. Despite their promise, RFs exhibit reproducibility challenges across acquisition settings, thus limiting implementation into clinical practice. In this investigation, we evaluate the effects of different CT scanners and CT acquisition protocols (KV, mA, field-of-view, and reconstruction kernel settings) on RFs extracted from lumbar vertebrae of a cadaveric trunk. Employing univariate and multivariate Generalized Linear Models (GLM), we evaluated the impact of each acquisition parameter on RFs. Our findings indicate that variations in mA had negligible effects on RFs, while alterations in kV resulted in exponential changes in several RFs, notably First Order (94.4%), GLCM (87.5%), and NGTDM (100%). Moreover, we demonstrated that a tailored GLM model was superior to the ComBat algorithm in harmonizing CT images. GLM achieved R2 > 0.90 in 21 RFs (19.6%), contrasting ComBat's mean R2 above 0.90 in only 1 RF (0.9%). This pioneering study unveils the effects of CT acquisition parameters on bone RFs in cadaveric specimens, highlighting significant variations across parameters and scanner datasets. The proposed GLM model presents a robust solution for mitigating these differences, potentially advancing harmonization efforts in Radiomics-based studies across diverse CT protocols and vendors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "BAX and DDB2 as biomarkers for acute radiation exposure in the human blood ex vivo and non-human primate models",
        "link": "https://www.nature.com/articles/s41598-024-69852-z",
        "publication_date": "20 Aug 2024",
        "abstract": "There are currently no available FDA-cleared biodosimetry tools for rapid and accurate assessment of absorbed radiation dose following a radiation/nuclear incident. Previously we developed a protein biomarker-based FAST-DOSE bioassay system for biodosimetry. The aim of this study was to integrate an ELISA platform with two high-performing FAST-DOSE biomarkers, BAX and DDB2, and to construct machine learning models that employ a multiparametric biomarker strategy for enhancing the accuracy of exposure classification and radiation dose prediction. The bioassay showed 97.92% and 96% accuracy in classifying samples in human and non-human primate (NHP) blood samples exposed ex vivo to 0–5 Gy X-rays, respectively up to 48 h after exposure, and an adequate correlation between reconstructed and actual dose in the human samples (R2 = 0.79, RMSE = 0.80 Gy, and MAE = 0.63 Gy) and NHP (R2 = 0.80, RMSE = 0.78 Gy, and MAE = 0.61 Gy). Biomarker measurements in vivo from four NHPs exposed to a single 2.5 Gy total body dose showed a persistent upregulation in blood samples collected on days 2 and 5 after irradiation. The data indicates that using a combined approach of targeted proteins can increase bioassay sensitivity and provide a more accurate dose prediction.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Causal effect of video gaming on mental well-being in Japan 2020–2022",
        "link": "https://www.nature.com/articles/s41562-024-01948-y",
        "publication_date": "19 Aug 2024",
        "abstract": "The widespread use of video games has raised concerns about their potential negative impact on mental well-being. Nevertheless, the empirical evidence supporting this notion is largely based on correlational studies, warranting further investigation into the causal relationship. Here we identify the causal effect of video gaming on mental well-being in Japan (2020–2022) using game console lotteries as a natural experiment. Employing approaches designed for causal inference on survey data (n = 97,602), we found that game console ownership, along with increased game play, improved mental well-being. The console ownership reduced psychological distress and improved life satisfaction by 0.1–0.6 standard deviations. Furthermore, a causal forest machine learning algorithm revealed divergent impacts between different types of console, with one showing smaller benefits for adolescents and females while the other showed larger benefits for adolescents. These findings highlight the complex impact of digital media on mental well-being and the importance of considering differential screen time effects.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": [
                "model control"
            ]
        }
    },
    {
        "title": "Synthesis and quality assessment of combined time-series and static medical data using a real-world time-series generative adversarial network",
        "link": "https://www.nature.com/articles/s41598-024-69812-7",
        "publication_date": "17 Aug 2024",
        "abstract": "This study addresses challenges related to privacy issues in utilizing medical data, particularly the protection of personal information. To overcome this obstacle, the research focuses on data synthesis using real-world time-series generative adversarial networks (RTSGAN). A total of 53,005 data were synthesized using the dataset of 15,799 patients with colorectal cancer. The results of the quantitative evaluation of the synthetic data’s quality are as follows: the Hellinger distance ranged from 0 to 0.25; the train on synthetic, test on real (TSTR) and train on real, test on synthetic (TRTS) results showed an average area under the curve of 0.99 and 0.98; a propensity mean squared error was 0.223. The synthetic and real data were similar in the qualitative methods including t-SNE and histogram analyses. The application of synthetic data in predicting five-year survival in colorectal cancer patients demonstrates comparable performance to models based on real data. This study employs distance to closest records and membership inference test to assess potential privacy exposure, revealing minimal risk. This study demonstrated that it is feasible to synthesize medical data, including time-series data, using the RTSGAN, and the synthetic data can be evaluated to accurately reflect the characteristics of real data through quantitative and qualitative methods as well as by utilizing real-world artificial intelligence models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "membership inference"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Beyond hand-crafted features for pretherapeutic molecular status identification of pediatric low-grade gliomas",
        "link": "https://www.nature.com/articles/s41598-024-69870-x",
        "publication_date": "17 Aug 2024",
        "abstract": "The use of targeted agents in the treatment of pediatric low-grade gliomas (pLGGs) relies on the determination of molecular status. It has been shown that genetic alterations in pLGG can be identified non-invasively using MRI-based radiomic features or convolutional neural networks (CNNs). We aimed to build and assess a combined radiomics and CNN non-invasive pLGG molecular status identification model. This retrospective study used the tumor regions, manually segmented from T2-FLAIR MR images, of 336 patients treated for pLGG between 1999 and 2018. We designed a CNN and Random Forest radiomics model, along with a model relying on a combination of CNN and radiomic features, to predict the genetic status of pLGG. Additionally, we investigated whether CNNs could predict radiomic feature values from MR images. The combined model (mean AUC: 0.824) outperformed the radiomics model (0.802) and CNN (0.764). The differences in model performance were statistically significant (p-values < 0.05). The CNN was able to learn predictive radiomic features such as surface-to-volume ratio (average correlation: 0.864), and difference matrix dependence non-uniformity normalized (0.924) well but was unable to learn others such as run-length matrix variance (− 0.017) and non-uniformity normalized (− 0.042). Our results show that a model relying on both CNN and radiomic-based features performs better than either approach separately in differentiating the genetic status of pLGGs, and that CNNs are unable to express all handcrafted features.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Electronic data capture in resource-limited settings using the lightweight clinical data acquisition and recording system",
        "link": "https://www.nature.com/articles/s41598-024-69550-w",
        "publication_date": "17 Aug 2024",
        "abstract": "Our prototype system designed for clinical data acquisition and recording of studies is a novel electronic data capture (EDC) software for simple and lightweight data capture in clinical research. Existing software tools are either costly or suffer from very limited features. To overcome these shortcomings, we designed an EDC software together with a mobile client. We aimed at making it easy to set-up, modifiable, scalable and thereby facilitating research. We wrote the software in R using a modular approach and implemented existing data standards along with a meta data driven interface and database structure. The prototype is an adaptable open-source software, which can be installed locally or in the cloud without advanced IT-knowledge. A mobile web interface and progressive web app for mobile use and desktop computers is added. We show the software’s capability, by demonstrating four clinical studies with over 1600 participants and 679 variables per participant. We delineate a simple deployment approach for a server-installation and indicate further use-cases. The software is available under the MIT open-source license. Conclusively the software is versatile, easily deployable, highly modifiable, and extremely scalable for clinical studies. As an open-source R-software it is accessible, open to community-driven development and improvement in the future.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Biologically interpretable multi-task deep learning pipeline predicts molecular alterations, grade, and prognosis in glioma patients",
        "link": "https://www.nature.com/articles/s41698-024-00670-2",
        "publication_date": "16 Aug 2024",
        "abstract": "Deep learning models have been developed for various predictions in glioma; yet, they were constrained by manual segmentation, task-specific design, or a lack of biological interpretation. Herein, we aimed to develop an end-to-end multi-task deep learning (MDL) pipeline that can simultaneously predict molecular alterations and histological grade (auxiliary tasks), as well as prognosis (primary task) in gliomas. Further, we aimed to provide the biological mechanisms underlying the model’s predictions. We collected multiscale data including baseline MRI images from 2776 glioma patients across two private (FAHZU and HPPH, n = 1931) and three public datasets (TCGA, n = 213; UCSF, n = 410; and EGD, n = 222). We trained and internally validated the MDL model using our private datasets, and externally validated it using the three public datasets. We used the model-predicted deep prognosis score (DPS) to stratify patients into low-DPS and high-DPS subtypes. Additionally, a radio-multiomics analysis was conducted to elucidate the biological basis of the DPS. In the external validation cohorts, the MDL model achieved average areas under the curve of 0.892–0.903, 0.710–0.894, and 0.850–0.879 for predicting IDH mutation status, 1p/19q co-deletion status, and tumor grade, respectively. Moreover, the MDL model yielded a C-index of 0.723 in the TCGA and 0.671 in the UCSF for the prediction of overall survival. The DPS exhibits significant correlations with activated oncogenic pathways, immune infiltration patterns, specific protein expression, DNA methylation, tumor mutation burden, and tumor-stroma ratio. Accordingly, our work presents an accurate and biologically meaningful tool for predicting molecular subtypes, tumor grade, and survival outcomes in gliomas, which provides personalized clinical decision-making in a global and non-invasive manner.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "DNA liquid biopsy-based prediction of cancer-associated venous thromboembolism",
        "link": "https://www.nature.com/articles/s41591-024-03195-0",
        "publication_date": "15 Aug 2024",
        "abstract": "Cancer-associated venous thromboembolism (VTE) is a major source of oncologic cost, morbidity and mortality. Identifying high-risk patients for prophylactic anticoagulation is challenging and adds to clinician burden. Circulating tumor DNA (ctDNA) sequencing assays (‘liquid biopsies’) are widely implemented, but their utility for VTE prognostication is unknown. Here we analyzed three plasma sequencing cohorts: a pan-cancer discovery cohort of 4,141 patients with non-small cell lung cancer (NSCLC) or breast, pancreatic and other cancers; a prospective validation cohort consisting of 1,426 patients with the same cancer types; and an international generalizability cohort of 463 patients with advanced NSCLC. ctDNA detection was associated with VTE independent of clinical and radiographic features. A machine learning model trained on liquid biopsy data outperformed previous risk scores (discovery, validation and generalizability c-indices 0.74, 0.73 and 0.67, respectively, versus 0.57, 0.61 and 0.54 for the Khorana score). In real-world data, anticoagulation was associated with lower VTE rates if ctDNA was detected (n = 2,522, adjusted hazard ratio (HR) = 0.50, 95% confidence interval (CI): 0.30–0.81); ctDNA− patients (n = 1,619) did not benefit from anticoagulation (adjusted HR = 0.89, 95% CI: 0.40–2.0). These results provide preliminary evidence that liquid biopsies may improve VTE risk stratification in addition to clinical parameters. Interventional, randomized prospective studies are needed to confirm the clinical utility of liquid biopsies for guiding anticoagulation in patients with cancer.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring the electrophysiology of Parkinson’s disease with magnetoencephalography and deep brain recordings",
        "link": "https://www.nature.com/articles/s41597-024-03768-1",
        "publication_date": "15 Aug 2024",
        "abstract": "Aberrant information processing in the basal ganglia and connected cortical areas are key to many neurological movement disorders such as Parkinson’s disease. Investigating the electrophysiology of this system is difficult in humans because non-invasive methods, such as electroencephalography or magnetoencephalography, have limited sensitivity to deep brain areas. Recordings from electrodes implanted for therapeutic deep brain stimulation, in contrast, provide clear deep brain signals but are not suited for studying cortical activity. Therefore, we combine magnetoencephalography and local field potential recordings from deep brain stimulation electrodes in individuals with Parkinson’s disease. Here, we make these data available, inviting a broader scientific community to explore the dynamics of neural activity in the subthalamic nucleus and its functional connectivity to cortex. The dataset encompasses resting-state recordings, plus two motor tasks: static forearm extension and self-paced repetitive fist clenching. Most patients were recorded both in the medicated and the unmedicated state. Along with the raw data, we provide metadata on channels, events and scripts for pre-processing to help interested researchers get started.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning analysis of serum cholesterol's impact on knee osteoarthritis progression",
        "link": "https://www.nature.com/articles/s41598-024-69906-2",
        "publication_date": "14 Aug 2024",
        "abstract": "The controversy surrounding whether serum total cholesterol is a risk factor for the graded progression of knee osteoarthritis (KOA) has prompted this study to develop an authentic prediction model using a machine learning (ML) algorithm. The objective was to investigate whether serum total cholesterol plays a significant role in the progression of KOA. This cross-sectional study utilized data from the public database DRYAD. LASSO regression was employed to identify risk factors associated with the graded progression of KOA. Additionally, six ML algorithms were utilized in conjunction with clinical features and relevant variables to construct a prediction model. The significance and ranking of variables were carefully analyzed. The variables incorporated in the model include JBS3, Diabetes, Hypertension, HDL, TC, BMI, SES, and AGE. Serum total cholesterol emerged as a significant risk factor for the graded progression of KOA in all six ML algorithms used for importance ranking. XGBoost algorithm was based on the combined best performance of the training and validation sets. The ML algorithm enables predictive modeling of risk factors for the progression of the KOA K–L classification and confirms that serum total cholesterol is an important risk factor for the progression of KOA.",
        "conclusions": "In summary, this study constructed a prediction model based on the ML model, and the XGB Classifier model showed better performance in the study. In addition, we also visualized with a SHAP-Value diagram of KOA patients with imaging grading progression provided a personalized risk assessment, and confirmed that TC is an important risk factor. This study may help clinicians and patients to identify the risk of KOA progression at an early stage, and interfering with the risk factors may potentially help to slow or block the progression of KOA.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Hybridizing mechanistic modeling and deep learning for personalized survival prediction after immune checkpoint inhibitor immunotherapy",
        "link": "https://www.nature.com/articles/s41540-024-00415-8",
        "publication_date": "14 Aug 2024",
        "abstract": "We present a study where predictive mechanistic modeling is combined with deep learning methods to predict individual patient survival probabilities under immune checkpoint inhibitor (ICI) immunotherapy. This hybrid approach enables prediction based on both measures that are calculable from mechanistic models of key mechanisms underlying ICI therapy that may not be directly measurable in the clinic and easily measurable quantities or patient characteristics that are not always readily incorporated into predictive mechanistic models. A deep learning time-to-event predictive model trained on a hybrid mechanistic + clinical data set from 93 patients achieved higher per-patient predictive accuracy based on event-time concordance, Brier score, and negative binomial log-likelihood-based criteria than when trained on only mechanistic model-derived values or only clinical data. Feature importance analysis revealed that both clinical and model-derived parameters play prominent roles in increasing prediction accuracy, further supporting the advantage of our hybrid approach.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automatic detection and visualization of temporomandibular joint effusion with deep neural network",
        "link": "https://www.nature.com/articles/s41598-024-69848-9",
        "publication_date": "14 Aug 2024",
        "abstract": "This study investigated the usefulness of deep learning-based automatic detection of temporomandibular joint (TMJ) effusion using magnetic resonance imaging (MRI) in patients with temporomandibular disorder and whether the diagnostic accuracy of the model improved when patients’ clinical information was provided in addition to MRI images. The sagittal MR images of 2948 TMJs were collected from 1017 women and 457 men (mean age 37.19 ± 18.64 years). The TMJ effusion diagnostic performances of three convolutional neural networks (scratch, fine-tuning, and freeze schemes) were compared with those of human experts based on areas under the curve (AUCs) and diagnosis accuracies. The fine-tuning model with proton density (PD) images showed acceptable prediction performance (AUC = 0.7895), and the from-scratch (0.6193) and freeze (0.6149) models showed lower performances (p < 0.05). The fine-tuning model had excellent specificity compared to the human experts (87.25% vs. 58.17%). However, the human experts were superior in sensitivity (80.00% vs. 57.43%) (all p < 0.001). In gradient-weighted class activation mapping (Grad-CAM) visualizations, the fine-tuning scheme focused more on effusion than on other structures of the TMJ, and the sparsity was higher than that of the from-scratch scheme (82.40% vs. 49.83%, p < 0.05). The Grad-CAM visualizations agreed with the model learned through important features in the TMJ area, particularly around the articular disc. Two fine-tuning models on PD and T2-weighted images showed that the diagnostic performance did not improve compared with using PD alone (p < 0.05). Diverse AUCs were observed across each group when the patients were divided according to age (0.7083–0.8375) and sex (male:0.7576, female:0.7083). The prediction accuracy of the ensemble model was higher than that of the human experts when all the data were used (74.21% vs. 67.71%, p < 0.05). A deep neural network (DNN) was developed to process multimodal data, including MRI and patient clinical data. Analysis of four age groups with the DNN model showed that the 41–60 age group had the best performance (AUC = 0.8258). The fine-tuning model and DNN were optimal for judging TMJ effusion and may be used to prevent true negative cases and aid in human diagnostic performance. Assistive automated diagnostic methods have the potential to increase clinicians’ diagnostic accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Extracellular NAD+ response to post-hepatectomy liver failure: bridging preclinical and clinical findings",
        "link": "https://www.nature.com/articles/s42003-024-06661-0",
        "publication_date": "14 Aug 2024",
        "abstract": "Liver fibrosis progressing to cirrhosis is a major risk factor for liver cancer, impacting surgical treatment and survival. Our study focuses on the role of extracellular nicotinamide adenine dinucleotide (eNAD+) in liver fibrosis, analyzing liver disease patients undergoing surgery. Additionally, we explore NAD+’s therapeutic potential in a mouse model of extended liver resection and in vitro using 3D hepatocyte spheroids. eNAD+ correlated with aspartate transaminase (AST) and bilirubin after liver resection (AST: r = 0.2828, p = 0.0087; Bilirubin: r = 0.2584, p = 0.0176). Concordantly, post-hepatectomy liver failure (PHLF) was associated with higher eNAD+ peaks (n = 10; p = 0.0063). Post-operative eNAD+ levels decreased significantly (p < 0.05), but in advanced stages of liver fibrosis or cirrhosis, this decline not only diminished but actually showed a trend towards an increase. The expression of NAD+ biosynthesis rate-limiting enzymes, nicotinamide phosphoribosyltransferase (NAMPT) and nicotinamide mononucleotide adenylyltransferase 3 (NMNAT3), were upregulated significantly in the liver tissue of patients with higher liver fibrosis stages (p < 0.0001). Finally, the administration of NAD+ in a 3D hepatocyte spheroid model rescued hepatocytes from TNFalpha-induced cell death and improved viability (p < 0.0001). In a mouse model of extended liver resection, NAD+ treatment significantly improved survival (p = 0.0158) and liver regeneration (p = 0.0186). Our findings reveal that eNAD+ was upregulated in PHLF, and rate-limiting enzymes of NAD+ biosynthesis demonstrated higher expressions under liver fibrosis. Further, eNAD+ administration improved survival after extended liver resection in mice and enhanced hepatocyte viability in vitro. These insights may offer a potential target for future therapies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Isocitrate dehydrogenase (IDH) 1 and 2 mutations predict better outcome in patients with acute myeloid leukemia undergoing allogeneic hematopoietic cell transplantation: a study of the ALWP of the EBMT",
        "link": "https://www.nature.com/articles/s41409-024-02384-2",
        "publication_date": "14 Aug 2024",
        "abstract": "Isocitrate dehydrogenase 1 and 2 (IDH1 and IDH2) mutations have uncertain prognostic implications in AML. We investigate the impact IDH1 and IDH2 mutations in AML patients undergoing allogeneic hematopoietic cell transplantation (allo-HCT) in first complete remission (CR1). In total, 1515 adult patients were included, 15.91% (n = 241) carried IDH1 mutation (mIDH1), and 26.27% (n = 398) IDH2 mutation (mIDH2) and 57.82% (n = 876) had no-IDH mutation. NPM1 was frequently encountered with IDH1 mutation (no-IDH group, n = 217, 24.8%, mIDH1, n = 103, 42.7%, mIDH2, n = 111, 27.9%, p < 0.0001). At day 180, the cumulative incidence (CI) of grade II-IV acute graft-versus-host disease (GVHD) was significantly lower in mIDH1 and mIDH2 compared to no-IDH groups (Hazard ratio [HR] = 0.66 (95% CI 0.47–0.91), p = 0.011; HR = 0.73 (95% CI 0.56–0.96), p = 0.025, respectively). In the mIDH1 group, overall survival (OS) was improved compared to no-IDH (HR = 0.68 (95% CI 0.48–0.94), p = 0.021), whereas mIDH2 was associated with lower incidence of relapse (HR = 0.49 (95% CI 0.34–0.7), p < 0.001), improved leukemia free survival (LFS) (HR = 0.7 (95% CI 0.55–0.9), p = 0.004) and OS (HR = 0.74 (95% CI 0.56–0.97), p = 0.027). In the subgroup of NPM1 wild type, only IDH2 was associated with improved outcomes. In conclusion, our data suggest that IDH1 and IDH2 mutations are associated with improved outcomes in patients with AML undergoing allo-HCT in CR1.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Utilizing multimodal radiomics technology from cervical MRI for diagnosis of cervical spinal cord injury and spinal cord concussion",
        "link": "https://www.nature.com/articles/s41598-024-69784-8",
        "publication_date": "12 Aug 2024",
        "abstract": "The primary aim of this study is to assess the viability of employing multimodal radiomics techniques for distinguishing between cervical spinal cord injury and spinal cord concussion in cervical magnetic resonance imaging. This is a multicenter study involving 288 patients from a major medical center as the training group, and 75 patients from two other medical centers as the testing group. Data regarding the presence of spinal cord injury symptoms and their recovery status within 72 h were documented. These patients underwent sagittal T1-weighted and T2-weighted imaging using cervical magnetic resonance imaging. Radiomics techniques are used to help diagnose whether these patients have cervical spinal cord injury or spinal cord concussion. 1197 radiomics features were extracted for each modality of each patient. The accuracy of T1 modal in testing group is 0.773, AUC is 0.799. The accuracy of T2 modal in testing group is 0.707, AUC is 0.813. The accuracy of T1 + T2 modal in testing group is 0.800, AUC is 0.840. Our research indicates that multimodal radiomics techniques utilizing cervical magnetic resonance imaging can effectively diagnose the presence of cervical spinal cord injury or spinal cord concussion.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparative analysis of feature selection techniques for COVID-19 dataset",
        "link": "https://www.nature.com/articles/s41598-024-69209-6",
        "publication_date": "11 Aug 2024",
        "abstract": "In the context of early disease detection, machine learning (ML) has emerged as a vital tool. Feature selection (FS) algorithms play a crucial role in ensuring the accuracy of predictive models by identifying the most influential variables. This study, focusing on a retrospective cohort of 4778 COVID-19 patients from Iran, explores the performance of various FS methods, including filter, embedded, and hybrid approaches, in predicting mortality outcomes. The researchers leveraged 115 routine clinical, laboratory, and demographic features and employed 13 ML models to assess the effectiveness of these FS methods based on classification accuracy, predictive accuracy, and statistical tests. The results indicate that a Hybrid Boruta-VI model combined with the Random Forest algorithm demonstrated superior performance, achieving an accuracy of 0.89, an F1 score of 0.76, and an AUC value of 0.95 on test data. Key variables identified as important predictors of adverse outcomes include age, oxygen saturation levels, albumin levels, neutrophil counts, platelet levels, and markers of kidney function. These findings highlight the potential of advanced FS techniques and ML models in enhancing early disease detection and informing clinical decision-making.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning versus manual morphology-based embryo selection in IVF: a randomized, double-blind noninferiority trial",
        "link": "https://www.nature.com/articles/s41591-024-03166-5",
        "publication_date": "09 Aug 2024",
        "abstract": "To assess the value of deep learning in selecting the optimal embryo for in vitro fertilization, a multicenter, randomized, double-blind, noninferiority parallel-group trial was conducted across 14 in vitro fertilization clinics in Australia and Europe. Women under 42 years of age with at least two early-stage blastocysts on day 5 were randomized to either the control arm, using standard morphological assessment, or the study arm, employing a deep learning algorithm, intelligent Data Analysis Score (iDAScore), for embryo selection. The primary endpoint was a clinical pregnancy rate with a noninferiority margin of 5%. The trial included 1,066 patients (533 in the iDAScore group and 533 in the morphology group). The iDAScore group exhibited a clinical pregnancy rate of 46.5% (248 of 533 patients), compared to 48.2% (257 of 533 patients) in the morphology arm (risk difference −1.7%; 95% confidence interval −7.7, 4.3; P = 0.62). This study was not able to demonstrate noninferiority of deep learning for clinical pregnancy rate when compared to standard morphology and a predefined prioritization scheme. Australian New Zealand Clinical Trials Registry (ANZCTR) registration: 379161.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Establishing a method for the cryopreservation of viable peripheral blood mononuclear cells in the International Space Station",
        "link": "https://www.nature.com/articles/s41526-024-00423-2",
        "publication_date": "09 Aug 2024",
        "abstract": "The analysis of cells frozen within the International Space Station (ISS) will provide crucial insights into the impact of the space environment on cellular functions and properties. The objective of this study was to develop a method for cryopreserving blood cells under the specific constraints of the ISS. In a ground experiment, mouse blood was directly mixed with a cryoprotectant and gradually frozen at −80 °C. Thawing the frozen blood sample resulted in the successful recovery of viable mononuclear cells when using a mixed solution of dimethylsulfoxide and hydroxyethyl starch as a cryoprotectant. In addition, we developed new freezing cases to minimize storage space utilization within the ISS freezer. Finally, we confirmed the recovery of major mononuclear immune cell subsets from the cryopreserved blood cells through a high dimensional analysis of flow cytometric data using 13 cell surface markers. Consequently, this ground study lays the foundation for the cryopreservation of viable blood cells on the ISS, enabling their analysis upon return to Earth. The application of this method in ISS studies will contribute to understanding the impact of space environments on human cells. Moreover, this method may find application in the cryopreservation of blood cells in situations where research facilities are inadequate.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "The role of blockchain to secure internet of medical things",
        "link": "https://www.nature.com/articles/s41598-024-68529-x",
        "publication_date": "08 Aug 2024",
        "abstract": "This study explores integrating blockchain technology into the Internet of Medical Things (IoMT) to address security and privacy challenges. Blockchain’s transparency, confidentiality, and decentralization offer significant potential benefits in the healthcare domain. The research examines various blockchain components, layers, and protocols, highlighting their role in IoMT. It also explores IoMT applications, security challenges, and methods for integrating blockchain to enhance security. Blockchain integration can be vital in securing and managing this data while preserving patient privacy. It also opens up new possibilities in healthcare, medical research, and data management. The results provide a practical approach to handling a large amount of data from IoMT devices. This strategy makes effective use of data resource fragmentation and encryption techniques. It is essential to have well-defined standards and norms, especially in the healthcare sector, where upholding safety and protecting the confidentiality of information are critical. These results illustrate that it is essential to follow standards like HIPAA, and blockchain technology can help ensure these criteria are met. Furthermore, the study explores the potential benefits of blockchain technology for enhancing inter-system communication in the healthcare industry while maintaining patient privacy protection. The results highlight the effectiveness of blockchain’s consistency and cryptographic techniques in combining identity management and healthcare data protection, protecting patient privacy and data integrity. Blockchain is an unchangeable distributed ledger system. In short, the paper provides important insights into how blockchain technology may transform the healthcare industry by effectively addressing significant challenges and generating legal, safe, and interoperable solutions. Researchers, doctors, and graduate students are the audience for our paper.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting major clinical events among Canadian adults with laboratory-confirmed influenza infection using the influenza severity scale",
        "link": "https://www.nature.com/articles/s41598-024-67931-9",
        "publication_date": "08 Aug 2024",
        "abstract": "We developed and validated the Influenza Severity Scale (ISS), a standardized risk assessment for influenza, to estimate and predict the probability of major clinical events in patients with laboratory-confirmed infection. Data from the Canadian Immunization Research Network’s Serious Outcomes Surveillance Network (2011/2012–2018/2019 influenza seasons) enabled the selecting of all laboratory-confirmed influenza patients. A machine learning-based approach then identified variables, generated weighted scores, and evaluated model performance. This study included 12,954 patients with laboratory-confirmed influenza infections. The optimal scale encompassed ten variables: demographic (age and sex), health history (smoking status, chronic pulmonary disease, diabetes mellitus, and influenza vaccination status), clinical presentation (cough, sputum production, and shortness of breath), and function (need for regular support for activities of daily living). As a continuous variable, the scale had an AU-ROC of 0.73 (95% CI, 0.71–0.74). Aggregated scores classified participants into three risk categories: low (ISS < 30; 79.9% sensitivity, 51% specificity), moderate (ISS ≥ 30 but < 50; 54.5% sensitivity, 55.9% specificity), and high (ISS ≥ 50; 51.4% sensitivity, 80.5% specificity). ISS demonstrated a solid ability to identify patients with hospitalized laboratory-confirmed influenza at increased risk for Major Clinical Events, potentially impacting clinical practice and research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep learning system for myopia onset prediction and intervention effectiveness evaluation in children",
        "link": "https://www.nature.com/articles/s41746-024-01204-7",
        "publication_date": "07 Aug 2024",
        "abstract": "The increasing prevalence of myopia worldwide presents a significant public health challenge. A key strategy to combat myopia is with early detection and prediction in children as such examination allows for effective intervention using readily accessible imaging technique. To this end, we introduced DeepMyopia, an artificial intelligence (AI)-enabled decision support system to detect and predict myopia onset and facilitate targeted interventions for children at risk using routine retinal fundus images. Based on deep learning architecture, DeepMyopia had been trained and internally validated on a large cohort of retinal fundus images (n = 1,638,315) and then externally tested on datasets from seven sites in China (n = 22,060). Our results demonstrated robustness of DeepMyopia, with AUCs of 0.908, 0.813, and 0.810 for 1-, 2-, and 3-year myopia onset prediction with the internal test set, and AUCs of 0.796, 0.808, and 0.767 with the external test set. DeepMyopia also effectively stratified children into low- and high-risk groups (p < 0.001) in both test sets. In an emulated randomized controlled trial (eRCT) on the Shanghai outdoor cohort (n = 3303) where DeepMyopia showed effectiveness in myopia prevention compared to NonCyc-based model, with an adjusted relative reduction (ARR) of −17.8%, 95% CI: −29.4%, −6.4%. DeepMyopia-assisted interventions attained quality-adjusted life years (QALYs) of 0.75 (95% CI: 0.53, 1.04) per person and avoided blindness years of 13.54 (95% CI: 9.57, 18.83) per 1 million persons compared to natural lifestyle with no active intervention. Our findings demonstrated DeepMyopia as a reliable and efficient AI-based decision support system for intervention guidance for children.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Continuous sepsis trajectory prediction using tensor-reduced physiological signals",
        "link": "https://www.nature.com/articles/s41598-024-68901-x",
        "publication_date": "06 Aug 2024",
        "abstract": "The quick Sequential Organ Failure Assessment (qSOFA) system identifies an individual’s risk to progress to poor sepsis-related outcomes using minimal variables. We used Support Vector Machine, Learning Using Concave and Convex Kernels, and Random Forest to predict an increase in qSOFA score using electronic health record (EHR) data, electrocardiograms (ECG), and arterial line signals. We structured physiological signals data in a tensor format and used Canonical Polyadic/Parallel Factors (CP) decomposition for feature reduction. Random Forests trained on ECG data show improved performance after tensor decomposition for predictions in a 6-h time frame (AUROC 0.67 ± 0.06 compared to 0.57 ± 0.08, \\(p = 0.01\\)). Adding arterial line features can also improve performance (AUROC 0.69 ± 0.07, \\(p < 0.01\\)), and benefit from tensor decomposition (AUROC 0.71 ± 0.07, \\(p = 0.01\\)). Adding EHR data features to a tensor-reduced signal model further improves performance (AUROC 0.77 ± 0.06, \\(p < 0.01\\)). Despite reduction in performance going from an EHR data-informed model to a tensor-reduced waveform data model, the signals-informed model offers distinct advantages. The first is that predictions can be made on a continuous basis in real-time, and second is that these predictions are not limited by the availability of EHR data. Additionally, structuring the waveform features as a tensor conserves structural and temporal information that would otherwise be lost if the data were presented as flat vectors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Different hierarchical reconfigurations in the brain by psilocybin and escitalopram for depression",
        "link": "https://www.nature.com/articles/s44220-024-00298-y",
        "publication_date": "05 Aug 2024",
        "abstract": "Effective interventions for neuropsychiatric disorders may work by rebalancing the brain’s functional hierarchical organization. Here we directly investigated the effects of two different serotonergic pharmacological interventions on functional brain hierarchy in major depressive disorder in a two-arm double-blind phase II randomized controlled trial comparing psilocybin therapy (22 patients) with escitalopram (20 patients). Patients with major depressive disorder received either 2 × 25 mg of oral psilocybin, three weeks apart, plus six weeks of daily placebo (‘psilocybin arm’) or 2 × 1 mg of oral psilocybin, three weeks apart, plus six weeks of daily escitalopram (10–20 mg; ‘escitalopram arm’). Resting-state functional magnetic resonance imaging scans were acquired at baseline and three weeks after the second psilocybin dose (NCT03429075). The brain mechanisms were captured by generative effective connectivity, estimated from whole-brain modeling of resting state for each session and patient. Hierarchy was determined for each of these sessions using measures of directedness and trophic levels on the effective connectivity, which captures cycle structure, stability and percolation. The results showed that the two pharmacological interventions created significantly different hierarchical reconfigurations of whole-brain dynamics with differential, opposite statistical effect responses. Furthermore, the use of machine learning revealed significant differential reorganization of brain hierarchy before and after the two treatments. Machine learning was also able to predict treatment response with an accuracy of 0.85 ± 0.04. Overall, the results demonstrate that psilocybin and escitalopram work in different ways for rebalancing brain dynamics in depression. This suggests the hypothesis that neuropsychiatric disorders could be closely linked to the breakdown in regions orchestrating brain dynamics from the top of the hierarchy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Autofluorescence-based tissue characterization enhances clinical prospects of light-sheet-microscopy",
        "link": "https://www.nature.com/articles/s41598-024-67366-2",
        "publication_date": "04 Aug 2024",
        "abstract": "Light sheet fluorescence microscopy (LSFM) is a transformative imaging method that enables the visualization of non-dissected specimen in real-time 3D. Optical clearing of tissues is essential for LSFM, typically employing toxic solvents. Here, we test the applicability of a non-hazardous alternative, ethyl cinnamate (ECi). We comprehensively characterized autofluorescence (AF) spectra in diverse murine tissues—ocular globe, knee, and liver—employing LSFM under various excitation wavelengths (405–785 nm) to test the feasibility of unstained samples for diagnostic purposes, in particular regarding percutaneous biopsies, as they constitute to most harvested type of tissue sample in clinical routine. Ocular globe structures were best discerned with 640 nm excitation. Knee tissue showed complex variation in AF spectra variation influenced by tissue depth and structure. Liver exhibited a unique AF pattern, likely linked to vasculature. Hepatic tissue samples were used to demonstrate the compatibility of our protocol for antibody staining. Furthermore, we employed machine learning to augment raw images and segment liver structures based on AF spectra. Radiologists rated representative samples transferred to the clinical assessment software. Learning-generated images scored highest in quality. Additionally, we investigated an actual murine biopsy. Our study pioneers the application of AF spectra for tissue characterization and diagnostic potential of optically cleared unstained percutaneous biopsies, contributing to the clinical translation of LSFM.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multimodal Eye Imaging, Retina Characteristics, and Psychological Assessment Dataset",
        "link": "https://www.nature.com/articles/s41597-024-03690-6",
        "publication_date": "02 Aug 2024",
        "abstract": "The eyes provide insights into psychology, potentially offering a distinctive perspective for psychological health profiles. However, there exist a notable deficiency in datasets that simultaneously encompass eye features and psychological assessments. To address this gap, our study presents a dataset that included Fundus Photography, Psychological Assessment, Retina Characteristics, and Multimodal Imaging (FPRM). FPRM dataset comprise fundus images at different wavelengths (548 nm and 605 nm), image of oxygen saturation for the retina and 8 specific retinal vessels, videos of retinal blood flow and pupillary light reflex, along with 61 items of multimodal quantitative measurement from 384 participants. Additionally, it features psychological assessments across five dimensions (geriatric depression, generalized anxiety disorder, insomnia, activities of daily living, and deterioration), accompanied by fundus photographs and 6 items of retina characteristics from 1683 participants. FPRM dataset is the first to integrate multimodal ophthalmic data and psychological assessments, not only advancing the development of machine learning applications but also facilitating in-depth research into the relationship between eye health and psychological health profiles.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The stroke outcome optimization project: Acute ischemic strokes from a comprehensive stroke center",
        "link": "https://www.nature.com/articles/s41597-024-03667-5",
        "publication_date": "02 Aug 2024",
        "abstract": "Stroke is a leading cause of disability, and Magnetic Resonance Imaging (MRI) is routinely acquired for acute stroke management. Publicly sharing these datasets can aid in the development of machine learning algorithms, particularly for lesion identification, brain health quantification, and prognosis. These algorithms thrive on large amounts of information, but require diverse datasets to avoid overfitting to specific populations or acquisitions. While there are many large public MRI datasets, few of these include acute stroke. We describe clinical MRI using diffusion-weighted, fluid-attenuated and T1-weighted modalities for 1715 individuals admitted in the upstate of South Carolina, of whom 1461 have acute ischemic stroke. Demographic and impairment data are provided for 1106 of the stroke survivors from this cohort. Our validation demonstrates that machine learning can leverage the imaging data to predict stroke severity as measured by the NIH Stroke Scale/Score (NIHSS). We share not only the raw data, but also the scripts for replicating our findings. These tools can aid in education, and provide a benchmark for validating improved methods.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Robotic scrub nurse to anticipate surgical instruments based on real-time laparoscopic video analysis",
        "link": "https://www.nature.com/articles/s43856-024-00581-0",
        "publication_date": "02 Aug 2024",
        "abstract": "Machine learning and robotics technologies are increasingly being used in the healthcare domain to improve the quality and efficiency of surgeries and to address challenges such as staff shortages. Robotic scrub nurses in particular offer great potential to address staff shortages by assuming nursing tasks such as the handover of surgical instruments.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Eye tracking insights into physician behaviour with safe and unsafe explainable AI recommendations",
        "link": "https://www.nature.com/articles/s41746-024-01200-x",
        "publication_date": "02 Aug 2024",
        "abstract": "We studied clinical AI-supported decision-making as an example of a high-stakes setting in which explainable AI (XAI) has been proposed as useful (by theoretically providing physicians with context for the AI suggestion and thereby helping them to reject unsafe AI recommendations). Here, we used objective neurobehavioural measures (eye-tracking) to see how physicians respond to XAI with N = 19 ICU physicians in a hospital’s clinical simulation suite. Prescription decisions were made both pre- and post-reveal of either a safe or unsafe AI recommendation and four different types of simultaneously presented XAI. We used overt visual attention as a marker for where physician mental attention was directed during the simulations. Unsafe AI recommendations attracted significantly greater attention than safe AI recommendations. However, there was no appreciably higher level of attention placed onto any of the four types of explanation during unsafe AI scenarios (i.e. XAI did not appear to ‘rescue’ decision-makers). Furthermore, self-reported usefulness of explanations by physicians did not correlate with the level of attention they devoted to the explanations reinforcing the notion that using self-reports alone to evaluate XAI tools misses key aspects of the interaction behaviour between human and machine.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Early predictive values of clinical assessments for ARDS mortality: a machine-learning approach",
        "link": "https://www.nature.com/articles/s41598-024-68653-8",
        "publication_date": "01 Aug 2024",
        "abstract": "Acute respiratory distress syndrome (ARDS) is a devastating critical care syndrome with significant morbidity and mortality. The objective of this study was to evaluate the predictive values of dynamic clinical indices by developing machine-learning (ML) models for early and accurate clinical assessment of the disease prognosis of ARDS. We conducted a retrospective observational study by applying dynamic clinical data collected in the ARDSNet FACTT Trial (n = 1000) to ML-based algorithms for predicting mortality. In order to compare the significance of clinical features dynamically, we further applied the random forest (RF) model to nine selected clinical parameters acquired at baseline and day 3 independently. An RF model trained using clinical data collected at day 3 showed improved performance and prognostication efficacy (area under the curve [AUC]: 0.84, 95% CI: 0.78–0.89) compared to baseline with an AUC value of 0.72 (95% CI: 0.65–0.78). Mean airway pressure (MAP), bicarbonate, age, platelet count, albumin, heart rate, and glucose were the most significant clinical indicators associated with mortality at day 3. Thus, clinical features collected early (day 3) improved performance of integrative ML models with better prognostication for mortality. Among these, MAP represented the most important feature for ARDS patients’ early risk stratification.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Bimodal machine learning model for unstable hips in infants: integration of radiographic images with automatically-generated clinical measurements",
        "link": "https://www.nature.com/articles/s41598-024-68484-7",
        "publication_date": "01 Aug 2024",
        "abstract": "Bimodal convolutional neural networks (CNNs) are frequently combined with patient information or several medical images to enhance the diagnostic performance. However, the technologies that integrate automatically generated clinical measurements within the images are scarce. Hence, we developed a bimodal model that produced automatic algorithm for clinical measurement (aaCM) from radiographic images and integrated the model with CNNs. In this multicenter research project, the diagnostic performance of the model was investigated with 813 radiographic hip images of infants at risk of developmental dysplasia of the hips (232 and 581 images of unstable and stable hips, respectively), with the ground truth defined by provocative examinations. The results indicated that the accuracy of aaCM was equal or higher than that of specialists, and the bimodal model showed better diagnostic performance than LightGBM, XGBoost, SVM, and single CNN models. aaCM can provide expert’s knowledge in a high level, and our proposed bimodal model has better performance than the state-of-art models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A methylation risk score for chronic kidney disease: a HyperGEN study",
        "link": "https://www.nature.com/articles/s41598-024-68470-z",
        "publication_date": "01 Aug 2024",
        "abstract": "Chronic kidney disease (CKD) impacts about 1 in 7 adults in the United States, but African Americans (AAs) carry a disproportionately higher burden of disease. Epigenetic modifications, such as DNA methylation at cytosine-phosphate-guanine (CpG) sites, have been linked to kidney function and may have clinical utility in predicting the risk of CKD. Given the dynamic relationship between the epigenome, environment, and disease, AAs may be especially sensitive to environment-driven methylation alterations. Moreover, risk models incorporating CpG methylation have been shown to predict disease across multiple racial groups. In this study, we developed a methylation risk score (MRS) for CKD in cohorts of AAs. We selected nine CpG sites that were previously reported to be associated with estimated glomerular filtration rate (eGFR) in epigenome-wide association studies to construct a MRS in the Hypertension Genetic Epidemiology Network (HyperGEN). In logistic mixed models, the MRS was significantly associated with prevalent CKD and was robust to multiple sensitivity analyses, including CKD risk factors. There was modest replication in validation cohorts. In summary, we demonstrated that an eGFR-based CpG score is an independent predictor of prevalent CKD, suggesting that MRS should be further investigated for clinical utility in evaluating CKD risk and progression.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A new model for determining risk of male infertility from serum hormone levels, without semen analysis",
        "link": "https://www.nature.com/articles/s41598-024-67910-0",
        "publication_date": "31 Jul 2024",
        "abstract": "We investigated a screening method using only serum hormone levels and AI (artificial intelligence) predictive analysis. Among 3662 patients, numbers for NOA (non-obstructive azoospermia), OA (obstructive azoospermia), cryptozoospermia, oligozoospermia and/or asthenozoospermia, normal, and ejaculation disorder were 448, 210, 46, 1619, 1333, and 6, respectively. “Normal” was defined as semen findings normal according to the WHO (World Health Organization) Manual for Human Semen Testing of 2021. We extracted age, LH (luteinizing hormone), FSH (follicle stimulating hormone), PRL (prolactin), testosterone, E2 (estradiol), and T (testosterone)/E2 from medical records. A total motility sperm count of 9.408 × 106 (1.4 ml × 16 × 106/ml × 42%) was defined as the lower limit of normal. The Prediction One-based AI model had an AUC (area under the curve) of 74.42%. For the AutoML Tables-based model, AUC ROC (receiver operating characteristic) was 74.2% and AUC PR (precision–recall) 77.2%. In a ranking of feature importance from 1st to 3rd, FSH came a clear 1st. T/E2 and LH ranked 2nd and 3rd for both Prediction One and AutoML Tables. Using data from 2021 and 2022 to verify the Prediction One-based AI model, the predicted and actual results for NOA were 100% matched in both years.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A prospective pilot study of gut microbiome in cerebral vasospasm and delayed cerebral ischemia after aneurysmal subarachnoid hemorrhage",
        "link": "https://www.nature.com/articles/s41598-024-68722-y",
        "publication_date": "30 Jul 2024",
        "abstract": "A recent systematic review indicated that gut–microbiota–brain axis contributes to growth and rupture of intracranial aneurysms. However, gaps were detected in the role of intestinal microbiome in cerebral vasospasm (CVS) after aneurysmal subarachnoid hemorrhage (aSAH). This is the first pilot study aiming to test study feasibility and identify differences in gut microbiota between subjects with and without CVS following aSAH. A prospective nested case–control pilot study with 1:1 matching was conducted recruiting subjects with aSAH: cases with CVS; and controls without CVS based on the clinical picture and structured bedside transcranial Doppler (TCD). Fecal samples for microbiota analyses by means of 16S rRNA gene amplicon sequencing were collected within the first 96 h after ictus. Operational taxonomic unit tables were constructed, diversity metrics calculated, phylogenetic trees built, and differential abundance analysis (DAA) performed. At baseline, the groups did not differ significantly in basic demographic and aneurysm-related characteristics (p > 0.05). Alpha-diversity (richness and Shannon Index) was significantly reduced in cases of middle cerebral artery (MCA) vasospasm (p < 0.05). In DAA, relative abundance of genus Acidaminococcus was associated with MCA vasospasm (p = 0.00013). Two butyrate-producing genera, Intestinimonas and Butyricimonas, as well as [Clostridium] innocuum group had the strongest negative correlation with the mean blood flow velocity in anterior cerebral arteries (p < 0.01; rho = − 0.63; − 0.57, and − 0.57, respectively). In total, 16 gut microbial genera were identified to correlate with TCD parameters, and two intestinal genera correlated with outcome upon discharge. In this pilot study, we prove study feasibility and present the first preliminary evidence of gut microbiome signature associating with CVS as a significant cause of stroke in subjects with aSAH.",
        "conclusions": "In this pilot study, we confirmed that the used methodology was appropriate and we have presented the first preliminary evidence of gut microbiome-based signature associating with CVS as a significant cause of stroke in subjects with aneurysmal subarachnoid hemorrhage. It is the only attempt in the literature of sequencing 16S rRNA gene of the intestinal microbiota in subjects with CVS and DCI, which provides insights into its metagenomic landscape. Moreover, these findings could fuel further research on gut microbiome as a potential biomarker in diagnosis or a target for prevention and treatment of cerebral vasospasm.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting graft and patient outcomes following kidney transplantation using interpretable machine learning models",
        "link": "https://www.nature.com/articles/s41598-024-66976-0",
        "publication_date": "29 Jul 2024",
        "abstract": "The decision to accept a deceased donor organ offer for transplant, or wait for something potentially better in the future, can be challenging. Clinical decision support tools predicting transplant outcomes are lacking. This project uses interpretable methods to predict both graft failure and patient death using data from previously accepted kidney transplant offers. Using more than 25 years of transplant outcome data, we train and compare several survival analysis models in single risk settings. In addition, we use post hoc interpretability techniques to clinically validate these models. Neural networks show comparable performance to the Cox proportional hazard model, with concordance of 0.63 and 0.79 for prediction of graft failure and patient death, respectively. Donor and recipient ages, the number of mismatches at DR locus, dialysis type, and primary renal disease appear to be important features for transplant outcome prediction. Owing to their good predictive performance and the clinical relevance of their post hoc interpretation, neural networks represent a promising core component in the construction of future decision support systems for transplant offering.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Application of a novel nested ensemble algorithm in predicting motor function recovery in patients with traumatic cervical spinal cord injury",
        "link": "https://www.nature.com/articles/s41598-024-65755-1",
        "publication_date": "29 Jul 2024",
        "abstract": "Traumatic cervical spinal cord injury (TCSCI) often causes varying degrees of motor dysfunction, common assessed by the International Standards for Neurological Classification of Spinal Cord Injury (ISNCSCI), in association with the American Spinal Injury Association (ASIA) Impairment Scale. Accurate prediction of motor function recovery is extremely important for formulating effective diagnosis, therapeutic and rehabilitation programs. The aim of this study is to investigate the validity of a novel nested ensemble algorithm that uses the very early ASIA motor score (AMS) of ISNCSCI examination to predict motor function recovery 6 months after injury in TCSCI patients. This retrospective study included complete data of 315 TCSCI patients. The dataset consisting of the first AMS at ≤ 24 h post-injury and follow-up AMS at 6 months post-injury was divided into a training set (80%) and a test set (20%). The nested ensemble algorithm was established in a two-stage manner. Support Vector Classification (SVC), Adaboost, Weak-learner and Dummy were used in the first stage, and Adaboost was selected as second-stage model. The prediction results of the first stage models were uploaded into second-stage model to obtain the final prediction results. The model performance was evaluated using precision, recall, accuracy, F1 score, and confusion matrix. The nested ensemble algorithm was applied to predict motor function recovery of TCSCI, achieving an accuracy of 80.6%, a F1 score of 80.6%, and balancing sensitivity and specificity. The confusion matrix showed few false-negative rate, which has crucial practical implications for prognostic prediction of TCSCI. This novel nested ensemble algorithm, simply based on very early AMS, provides a useful tool for predicting motor function recovery 6 months after TCSCI, which is graded in gradients that progressively improve the accuracy and reliability of the prediction, demonstrating a strong potential of ensemble learning to personalize and optimize the rehabilitation and care of TCSCI patients.",
        "conclusions": "We have developed a nested ensemble algorithm, whose performance and effectiveness were evaluated through accuracy, precision, recall, F1 score, and confusion matrix, and the model not only showed good overall accuracy in predicting patients’ motor function recovery but also could effectively identify patients of high risk for poor prognosis with few false positive rate. This may revolutionize the method and way of thinking in predicting motor function recovery in patients with TCSCI.The algorithm can utilize very early clinical indicators in a timely and effective manner to provide objective recommendations to clinicians at all levels, assist them clinicians in making early intervention plans, and set objective expectations for patients and their families to deal with the severity and prognosis for recovery.",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting bone metastasis-free survival in non-small cell lung cancer from preoperative CT via deep learning",
        "link": "https://www.nature.com/articles/s41698-024-00649-z",
        "publication_date": "28 Jul 2024",
        "abstract": "Accurate prediction of bone metastasis-free survival (BMFS) after complete surgical resection in patients with non-small cell lung cancer (NSCLC) may facilitate appropriate follow-up planning. The aim of this study was to establish and validate a preoperative CT-based deep learning (DL) signature to predict BMFS in NSCLC patients. We performed a retrospective analysis of 1547 NSCLC patients who underwent complete surgical resection, followed by at least 36 months of monitoring at two hospitals. We constructed a DL signature from multiparametric CT images using 3D convolutional neural networks, and we integrated this signature with clinical-imaging factors to establish a deep learning clinical-imaging signature (DLCS). We evaluated performance using Harrell’s concordance index (C-index) and the time-dependent receiver operating characteristic. We also assessed the risk of bone metastasis (BM) in NSCLC patients at different clinical stages using DLCS. The DL signature successfully predicted BM, with C-indexes of 0.799 and 0.818 for the validation cohorts. DLCS outperformed the DL signature with corresponding C-indexes of 0.806 and 0.834. Ranges for area under the curve at 1, 2, and 3 years were 0.820–0.865 for internal and 0.860–0.884 for external validation cohorts. Furthermore, DLCS successfully stratified patients with different clinical stages of NSCLC as high- and low-risk groups for BM (p < 0.05). CT-based DL can predict BMFS in NSCLC patients undergoing complete surgical resection, and may assist in the assessment of BM risk for patients at different clinical stages.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Spectral characterization of intraoperative renal perfusion using hyperspectral imaging and artificial intelligence",
        "link": "https://www.nature.com/articles/s41598-024-68280-3",
        "publication_date": "27 Jul 2024",
        "abstract": "Accurate intraoperative assessment of organ perfusion is a pivotal determinant in preserving organ function e.g. during kidney surgery including partial nephrectomy or kidney transplantation. Hyperspectral imaging (HSI) has great potential to objectively describe and quantify this perfusion as opposed to conventional surrogate techniques such as ultrasound flowmeter, indocyanine green or the subjective eye of the surgeon. An established live porcine model under general anesthesia received median laparotomy and renal mobilization. Different scenarios that were measured using HSI were (1) complete, (2) gradual and (3) partial malperfusion. The differences in spectral reflectance as well as HSI oxygenation (StO2) between different perfusion states were compelling and as high as 56.9% with 70.3% (± 11.0%) for “physiological” vs. 13.4% (± 3.1%) for “venous congestion”. A machine learning (ML) algorithm was able to distinguish between these perfusion states with a balanced prediction accuracy of 97.8%. Data from this porcine study including 1300 recordings across 57 individuals was compared to a human dataset of 104 recordings across 17 individuals suggesting clinical transferability. Therefore, HSI is a highly promising tool for intraoperative microvascular evaluation of perfusion states with great advantages over existing surrogate techniques. Clinical trials are required to prove patient benefit.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a diagnostic prediction model for children with pertussis",
        "link": "https://www.nature.com/articles/s41598-024-65856-x",
        "publication_date": "26 Jul 2024",
        "abstract": "To develop and validate a diagnostic prediction model based on blood parameters for predicting the pertussis in children. A retrospective study of 477 children with suspected pertussis at Zigong First People’s Hospital was performed between January 2020 and December 2021. The patients were randomly divided into training cohort and validation cohort. Stepwise regression and R software was performed to develop and validate the model. Stepwise regression analysis showed that white blood cell (WBC), hematocrit (HCT), lymphocyte (LYMPH), C-reactive protein (CRP) and platelet distribution width to mean platelet volume ratio (PDW-MPV-R) were found to be independent factors associated with pertussis. The model containing WBC, CRP and PDW-MPV-R had the best performance. The area under curve (ROC, 0.77 for the training cohort and 0.80 for the validation cohort) of the model indicated satisfactory discriminative ability. The sensitivity and specificity of the model were 72.1% and 72.6% in training cohort and 74% and 72.1%, respectively, in validation cohort. Based on the ROC analysis, calibration plots, and decision curve analysis, we concluded that the model exhibited excellent performance. A model based on blood parameters is sufficiently accurate to predict the probability of pertussis in children, and may provide some reference for clinical decisions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical phenotypes and short-term outcomes based on prehospital point-of-care testing and on-scene vital signs",
        "link": "https://www.nature.com/articles/s41746-024-01194-6",
        "publication_date": "24 Jul 2024",
        "abstract": "Error fetching abstract: 'NoneType' object has no attribute 'lower'",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "A Curated Cell Life Imaging Dataset of Immune-enriched Pancreatic Cancer Organoids with Pre-trained AI Models",
        "link": "https://www.nature.com/articles/s41597-024-03631-3",
        "publication_date": "24 Jul 2024",
        "abstract": "Tumor organoids are three-dimensional in vitro models which can recapitulate the complex mutational landscape and tissue architecture observed in cancer patients, providing a realistic model for testing novel therapies, including immunotherapies. A significant challenge in organoid research in oncology lies in developing efficient and reliable methods for segmenting organoid images, quantifying organoid growth, regression and response to treatments, as well as predicting the behavior of organoid systems. Up to now, a curated dataset of organoids co-cultured with immune cells is not available. To address this gap, we present a new public dataset, comprising both phase-contrast images of murine and patient-derived tumor organoids of one of the deadliest cancer types, the Pancreatic Ductal Adenocarcinoma, co-cultured with immune cells, and state-of-the-art algorithms for object detection and segmentation. Our dataset, OrganoIDNetData, encompassing 180 images with 33906 organoids, can be a potential common benchmark for different organoids segmentation protocols, moving beyond the current practice of training and testing these algorithms on isolated datasets.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Explainable AI decision support improves accuracy during telehealth strep throat screening",
        "link": "https://www.nature.com/articles/s43856-024-00568-x",
        "publication_date": "24 Jul 2024",
        "abstract": "Artificial intelligence-based (AI) clinical decision support systems (CDSS) using unconventional data, like smartphone-acquired images, promise transformational opportunities for telehealth; including remote diagnosis. Although such solutions’ potential remains largely untapped, providers’ trust and understanding are vital for effective adoption. This study examines how different human–AI interaction paradigms affect clinicians’ responses to an emerging AI CDSS for streptococcal pharyngitis (strep throat) detection from smartphone throat images.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Single-cell multi-omic and spatial profiling of human kidneys implicates the fibrotic microenvironment in kidney disease progression",
        "link": "https://www.nature.com/articles/s41588-024-01802-x",
        "publication_date": "24 Jul 2024",
        "abstract": "Kidneys are intricate three-dimensional structures in the body, yet the spatial and molecular principles of kidney health and disease remain inadequately understood. We generated high-quality datasets for 81 samples, including single-cell, single-nuclear, spot-level (Visium) and single-cell resolution (CosMx) spatial-RNA expression and single-nuclear open chromatin, capturing cells from healthy, diabetic and hypertensive diseased human kidneys. Combining these data, we identify cell types and map them to their locations within the tissue. Unbiased deconvolution of the spatial data identifies the following four distinct microenvironments: glomerular, immune, tubule and fibrotic. We describe the complex organization of microenvironments in health and disease and find that the fibrotic microenvironment is able to molecularly classify human kidneys and offers an improved prognosis compared to traditional histopathology. We provide a comprehensive spatially resolved molecular roadmap of the human kidney and the fibrotic process, demonstrating the clinical utility of spatial transcriptomics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A scheme combining feature fusion and hybrid deep learning models for epileptic seizure detection and prediction",
        "link": "https://www.nature.com/articles/s41598-024-67855-4",
        "publication_date": "23 Jul 2024",
        "abstract": "Epilepsy is one of the most well-known neurological disorders globally, leading to individuals experiencing sudden seizures and significantly impacting their quality of life. Hence, there is an urgent necessity for an efficient method to detect and predict seizures in order to mitigate the risks faced by epilepsy patients. In this paper, a new method for seizure detection and prediction is proposed, which is based on multi-class feature fusion and the convolutional neural network-gated recurrent unit-attention mechanism (CNN-GRU-AM) model. Initially, the Electroencephalography (EEG) signal undergoes wavelet decomposition through the Discrete Wavelet Transform (DWT), resulting in six subbands. Subsequently, time–frequency domain and nonlinear features are extracted from each subband. Finally, the CNN-GRU-AM further extracts features and performs classification. The CHB-MIT dataset is used to validate the proposed approach. The results of tenfold cross validation show that our method achieved a sensitivity of 99.24% and 95.47%, specificity of 99.51% and 94.93%, accuracy of 99.35% and 95.16%, and an AUC of 99.34% and 95.15% in seizure detection and prediction tasks, respectively. The results show that the method proposed in this paper can effectively achieve high-precision detection and prediction of seizures, so as to remind patients and doctors to take timely protective measures.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Human gender estimation from CT images of skull using deep feature selection and feature fusion",
        "link": "https://www.nature.com/articles/s41598-024-65521-3",
        "publication_date": "23 Jul 2024",
        "abstract": "This research endeavors to prognosticate gender by harnessing the potential of skull computed tomography (CT) images, given the seminal role of gender identification in the realm of identification. The study encompasses a corpus of CT images of cranial structures derived from 218 male and 203 female subjects, constituting a total cohort of 421 individuals within the age bracket of 25 to 65 years. Employing deep learning, a prominent subset of machine learning algorithms, the study deploys convolutional neural network (CNN) models to excavate profound attributes inherent in the skull CT images. In pursuit of the research objective, the focal methodology involves the exclusive application of deep learning algorithms to image datasets, culminating in an accuracy rate of 96.4%. The gender estimation process exhibits a precision of 96.1% for male individuals and 96.8% for female individuals. The precision performance varies across different selections of feature numbers, namely 100, 300, and 500, alongside 1000 features without feature selection. The respective precision rates for these selections are recorded as 95.0%, 95.5%, 96.2%, and 96.4%. It is notable that gender estimation via visual radiography mitigates the discrepancy in measurements between experts, concurrently yielding an expedited estimation rate. Predicated on the empirical findings of this investigation, it is inferred that the efficacy of the CNN model, the configurational intricacies of the classifier, and the judicious selection of features collectively constitute pivotal determinants in shaping the performance attributes of the proposed methodology.",
        "conclusions": "In this study, a computer-aided decision support system is proposed to determine gender from the skull. In this system, machine learning-based deep learning models took data as input and features were obtained from fully connected layers. In the tests made with SVM and Neural network classifiers, the final performance was 96.4% without feature selection and 95.0% in the lowest number of feature selections when feature selection was made. Based on these results, it can be said that the CNN model, Classifier configuration, and feature selection are critical factors in the formation of performance values.In the future, it is aimed to develop a parameter setting optimization module for automating the CNN model and model parameters, classifier configuration, and feature selection. In future studies, it is also aimed to determine gender by making use of other anatomical components as well as skull images used in the study.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "DNA language model GROVER learns sequence context in the human genome",
        "link": "https://www.nature.com/articles/s42256-024-00872-0",
        "publication_date": "23 Jul 2024",
        "abstract": "Deep-learning models that learn a sense of language on DNA have achieved a high level of performance on genome biological tasks. Genome sequences follow rules similar to natural language but are distinct in the absence of a concept of words. We established byte-pair encoding on the human genome and trained a foundation language model called GROVER (Genome Rules Obtained Via Extracted Representations) with the vocabulary selected via a custom task, next-k-mer prediction. The defined dictionary of tokens in the human genome carries best the information content for GROVER. Analysing learned representations, we observed that trained token embeddings primarily encode information related to frequency, sequence content and length. Some tokens are primarily localized in repeats, whereas the majority widely distribute over the genome. GROVER also learns context and lexical ambiguity. Average trained embeddings of genomic regions relate to functional genomics annotation and thus indicate learning of these structures purely from the contextual relationships of tokens. This highlights the extent of information content encoded by the sequence that can be grasped by GROVER. On fine-tuning tasks addressing genome biology with questions of genome element identification and protein–DNA binding, GROVER exceeds other models’ performance. GROVER learns sequence context, a sense for structure and language rules. Extracting this knowledge can be used to compose a grammar book for the code of life.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Next-generation phenotyping integrated in a national framework for patients with ultrarare disorders improves genetic diagnostics and yields new molecular findings",
        "link": "https://www.nature.com/articles/s41588-024-01836-1",
        "publication_date": "22 Jul 2024",
        "abstract": "Individuals with ultrarare disorders pose a structural challenge for healthcare systems since expert clinical knowledge is required to establish diagnoses. In TRANSLATE NAMSE, a 3-year prospective study, we evaluated a novel diagnostic concept based on multidisciplinary expertise in Germany. Here we present the systematic investigation of the phenotypic and molecular genetic data of 1,577 patients who had undergone exome sequencing and were partially analyzed with next-generation phenotyping approaches. Molecular genetic diagnoses were established in 32% of the patients totaling 370 distinct molecular genetic causes, most with prevalence below 1:50,000. During the diagnostic process, 34 novel and 23 candidate genotype–phenotype associations were identified, mainly in individuals with neurodevelopmental disorders. Sequencing data of the subcohort that consented to computer-assisted analysis of their facial images with GestaltMatcher could be prioritized more efficiently compared with approaches based solely on clinical features and molecular scores. Our study demonstrates the synergy of using next-generation sequencing and phenotyping for diagnosing ultrarare diseases in routine healthcare and discovering novel etiologies by multidisciplinary teams.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Retrospective analysis of interpretable machine learning in predicting ICU thrombocytopenia in geriatric ICU patients",
        "link": "https://www.nature.com/articles/s41598-024-67785-1",
        "publication_date": "20 Jul 2024",
        "abstract": "We developed an interpretable machine learning algorithm that prospectively predicts the risk of thrombocytopenia in older critically ill patients during their stay in the intensive care unit (ICU), ultimately aiding clinical decision-making and improving patient care. Data from 2286 geriatric patients who underwent surgery and were admitted to the ICU of Dongyang People’s Hospital between 2012 and 2021 were retrospectively analyzed. Integrated algorithms were developed, and four machine-learning algorithms were used. Selected characteristics included common demographic data, biochemical indicators, and vital signs. Eight key variables were selected using the Least Absolute Shrinkage and Selection Operator and Random Forest Algorithm. Thrombocytopenia occurred in 18.2% of postoperative geriatric patients, with a higher mortality rate. The C5.0 model showed the best performance, with an area under the receiver operating characteristic curve close to 0.85, along with unparalleled accuracy, precision, specificity, recall, and balanced accuracy scores of 0.88, 0.98, 0.89, 0.98, and 0.85, respectively. The support vector machine model excelled at predictively assessing thrombocytopenia severity, demonstrating an accuracy rate of 0.80 in the MIMIC database. Thus, our machine learning-based models have considerable potential in effectively predicting the risk and severity of postoperative thrombocytopenia in geriatric ICU patients for better clinical decision-making and patient care.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep learning approach to hard exudates detection and disorganization of retinal inner layers identification on OCT images",
        "link": "https://www.nature.com/articles/s41598-024-63844-9",
        "publication_date": "19 Jul 2024",
        "abstract": "The purpose of the study was to detect Hard Exudates (HE) and classify Disorganization of Retinal Inner Layers (DRIL) implementing a Deep Learning (DL) system on optical coherence tomography (OCT) images of eyes with diabetic macular edema (DME). We collected a dataset composed of 442 OCT images on which we annotated 6847 HE and the presence of DRIL. A complex operational pipeline was defined to implement data cleaning and image transformations, and train two DL models. The state-of-the-art neural network architectures (Yolov7, ConvNeXt, RegNetX) and advanced techniques were exploited to aggregate the results (Ensemble learning, Edge detection) and obtain a final model. The DL approach reached good performance in detecting HE and classifying DRIL. Regarding HE detection the model got an AP@0.5 score equal to 34.4% with Precision of 48.7% and Recall of 43.1%; while for DRIL classification an Accuracy of 91.1% with Sensitivity and Specificity both of 91.1% and AUC and AUPR values equal to 91% were obtained. The P-value was lower than 0.05 and the Kappa coefficient was 0.82. The DL models proved to be able to identify HE and DRIL in eyes with DME with a very good accuracy and all the metrics calculated confirmed the system performance. Our DL approach demonstrated to be a good candidate as a supporting tool for ophthalmologists in OCT images analysis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]