[
    {
        "title": "New genetic variants associated with major adverse cardiovascular events in patients with acute coronary syndromes and treated with clopidogrel and aspirin",
        "link": "https://www.nature.com/articles/s41397-021-00245-5",
        "publication_date": "22 Jun 2021",
        "abstract": "Although a few studies have reported the effects of several polymorphisms on major adverse cardiovascular events (MACE) in patients with acute coronary syndromes (ACS) and those undergoing percutaneous coronary intervention (PCI), these genotypes account for only a small fraction of the variation and evidence is insufficient. This study aims to identify new genetic variants associated with MACE end point during the 18-month follow-up period by a two-stage large-scale sequencing data, including high-depth whole exome sequencing of 168 patients in the discovery cohort and high-depth targeted sequencing of 1793 patients in the replication cohort. We discovered eight new genotypes and their genes associated with MACE in patients with ACS, including MYOM2 (rs17064642), WDR24 (rs11640115), NECAB1 (rs74569896), EFR3A (rs4736529), AGAP3 (rs75750968), ZDHHC3 (rs3749187), ECHS1 (rs140410716), and KRTAP10-4 (rs201441480). Notably, the expressions of MYOM2 and ECHS1 are downregulated in both animal models and patients with phenotypes related to MACE. Importantly, we developed the first superior classifier for predicting 18-month MACE and achieved high predictive performance (AUC ranged between 0.92 and 0.94 for three machine-learning methods). Our findings shed light on the pathogenesis of cardiovascular outcomes and may help the clinician to make a decision on the therapeutic intervention for ACS patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning enhances the performance of short and long-term mortality prediction model in non-ST-segment elevation myocardial infarction",
        "link": "https://www.nature.com/articles/s41598-021-92362-1",
        "publication_date": "18 Jun 2021",
        "abstract": "Machine learning (ML) has been suggested to improve the performance of prediction models. Nevertheless, research on predicting the risk in patients with acute myocardial infarction (AMI) has been limited and showed inconsistency in the performance of ML models versus traditional models (TMs). This study developed ML-based models (logistic regression with regularization, random forest, support vector machine, and extreme gradient boosting) and compared their performance in predicting the short- and long-term mortality of patients with AMI with those of TMs with comparable predictors. The endpoints were the in-hospital mortality of 14,183 participants and the three- and 12-month mortality in patients who survived at discharge. The performance of the ML models in predicting the mortality of patients with an ST-segment elevation myocardial infarction (STEMI) was comparable to the TMs. In contrast, the areas under the curves (AUC) of the ML models for non-STEMI (NSTEMI) in predicting the in-hospital, 3-month, and 12-month mortality were 0.889, 0.849, and 0.860, respectively, which were superior to the TMs, which had corresponding AUCs of 0.873, 0.795, and 0.808. Overall, the performance of the predictive model could be improved, particularly for long-term mortality in NSTEMI, from the ML algorithm rather than using more clinical predictors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A predictive model for pain response following radiotherapy for treatment of spinal metastases",
        "link": "https://www.nature.com/articles/s41598-021-92363-0",
        "publication_date": "18 Jun 2021",
        "abstract": "To establish a predictive model for pain response following radiotherapy using a combination of radiomic and clinical features of spinal metastasis. This retrospective study enrolled patients with painful spine metastases who received palliative radiation therapy from 2018 to 2019. Pain response was defined using the International Consensus Criteria. The clinical and radiomic features were extracted from medical records and pre-treatment CT images. Feature selection was performed and a random forests ensemble learning method was used to build a predictive model. Area under the curve (AUC) was used as a predictive performance metric. 69 patients were enrolled with 48 patients showing a response. Random forest models built on the radiomic, clinical, and ‘combined’ features achieved an AUC of 0.824, 0.702, 0.848, respectively. The sensitivity and specificity of the combined features model were 85.4% and 76.2%, at the best diagnostic decision point. We built a pain response model in patients with spinal metastases using a combination of clinical and radiomic features. To the best of our knowledge, we are the first to examine pain response using pre-treatment CT radiomic features. Our model showed the potential to predict patients who respond to radiation therapy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting the probability of death using proteomics",
        "link": "https://www.nature.com/articles/s42003-021-02289-6",
        "publication_date": "18 Jun 2021",
        "abstract": "Predicting all-cause mortality risk is challenging and requires extensive medical data. Recently, large-scale proteomics datasets have proven useful for predicting health-related outcomes. Here, we use measurements of levels of 4,684 plasma proteins in 22,913 Icelanders to develop all-cause mortality predictors both for short- and long-term risk. The participants were 18-101 years old with a mean follow up of 13.7 (sd. 4.7) years. During the study period, 7,061 participants died. Our proposed predictor outperformed, in survival prediction, a predictor based on conventional mortality risk factors. We could identify the 5% at highest risk in a group of 60-80 years old, where 88% died within ten years and 5% at the lowest risk where only 1% died. Furthermore, the predicted risk of death correlates with measures of frailty in an independent dataset. Our results show that the plasma proteome can be used to assess general health and estimate the risk of death.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Associations of maternal and infant metabolomes with immune maturation and allergy development at 12 months in the Swedish NICE-cohort",
        "link": "https://www.nature.com/articles/s41598-021-92239-3",
        "publication_date": "16 Jun 2021",
        "abstract": "Allergic diseases are the most common chronic diseases in childrenin the Western world, but little is know about what factors influence immune maturation and allergy development. We therefore aimed to associate infant and maternal metabolomes to T- and B-cell subpopulations and allergy diagnosis. We performed liquid chromatography-mass spectrometry based untargeted metabolomics on blood plasma from mothers (third trimester, n = 605; delivery, n = 558) and from the umbilical cord (n = 366). The measured metabolomes were associated to T- and B-cell subpopulations up to 4 months after delivery and to doctor´s diagnosed eczema, food allergy and asthma at one year of age using random forest analysis. Maternal and cord plasma at delivery could predict the number of CD24+CD38low memory B-cells (p = 0.033, n = 26 and p = 0.009, n = 22), but future allergy status could not be distinguished from any of the three measured metabolomes. Replication of previous literature findings showed hypoxanthine to be upregulated in the umbilical cord of children with subsequent asthma. This exploratory study suggests foetal immune programming occuring during pregnancy as the metabolomic profiles of mothers and infants at delivery related to infants’ B-cell maturation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Shortwave infrared otoscopy for diagnosis of middle ear effusions: a machine-learning-based approach",
        "link": "https://www.nature.com/articles/s41598-021-91736-9",
        "publication_date": "15 Jun 2021",
        "abstract": "Otitis media, a common disease marked by the presence of fluid within the middle ear space, imparts a significant global health and economic burden. Identifying an effusion through the tympanic membrane is critical to diagnostic success but remains challenging due to the inherent limitations of visible light otoscopy and user interpretation. Here we describe a powerful diagnostic approach to otitis media utilizing advancements in otoscopy and machine learning. We developed an otoscope that visualizes middle ear structures and fluid in the shortwave infrared region, holding several advantages over traditional approaches. Images were captured in vivo and then processed by a novel machine learning based algorithm. The model predicts the presence of effusions with greater accuracy than current techniques, offering specificity and sensitivity over 90%. This platform has the potential to reduce costs and resources associated with otitis media, especially as improvements are made in shortwave imaging and machine learning.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of transdiagnostic psychiatric disorder subtypes using unsupervised learning",
        "link": "https://www.nature.com/articles/s41386-021-01051-0",
        "publication_date": "14 Jun 2021",
        "abstract": "Psychiatric disorders show heterogeneous symptoms and trajectories, with current nosology not accurately reflecting their molecular etiology and the variability and symptomatic overlap within and between diagnostic classes. This heterogeneity impedes timely and targeted treatment. Our study aimed to identify psychiatric patient clusters that share clinical and genetic features and may profit from similar therapies. We used high-dimensional data clustering on deep clinical data to identify transdiagnostic groups in a discovery sample (N = 1250) of healthy controls and patients diagnosed with depression, bipolar disorder, schizophrenia, schizoaffective disorder, and other psychiatric disorders. We observed five diagnostically mixed clusters and ordered them based on severity. The least impaired cluster 0, containing most healthy controls, showed general well-being. Clusters 1–3 differed predominantly regarding levels of maltreatment, depression, daily functioning, and parental bonding. Cluster 4 contained most patients diagnosed with psychotic disorders and exhibited the highest severity in many dimensions, including medication load. Depressed patients were present in all clusters, indicating that we captured different disease stages or subtypes. We replicated all but the smallest cluster 1 in an independent sample (N = 622). Next, we analyzed genetic differences between clusters using polygenic scores (PGS) and the psychiatric family history. These genetic variables differed mainly between clusters 0 and 4 (prediction area under the receiver operating characteristic curve (AUC) = 81%; significant PGS: cross-disorder psychiatric risk, schizophrenia, and educational attainment). Our results confirm that psychiatric disorders consist of heterogeneous subtypes sharing molecular factors and symptoms. The identification of transdiagnostic clusters advances our understanding of the heterogeneity of psychiatric disorders and may support the development of personalized treatments.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Fourier transform infrared spectroscopy coupled with machine learning classification for identification of oxidative damage in freeze-dried heart valves",
        "link": "https://www.nature.com/articles/s41598-021-91802-2",
        "publication_date": "10 Jun 2021",
        "abstract": "Freeze-drying can be used to ensure off-the-shelf availability of decellularized heart valves for cardiovascular surgery. In this study, decellularized porcine aortic heart valves were analyzed by nitroblue tetrazolium (NBT) staining and Fourier transform infrared spectroscopy (FTIR) to identify oxidative damage during freeze-drying and subsequent storage as well as after treatment with H2O2 and FeCl3. NBT staining revealed that sucrose at a concentration of at least 40% (w/v) is needed to prevent oxidative damage during freeze-drying. Dried specimens that were stored at 4 °C depict little to no oxidative damage during storage for up to 2 months. FTIR analysis shows that fresh control, freeze-dried and stored heart valve specimens cannot be distinguished from one another, whereas H2O2- and FeCl3-treated samples could be distinguished in some tissue section. A feed forward artificial neural network model could accurately classify H2O2 and FeCl3 treated samples. However, fresh control, freeze-dried and stored samples could not be distinguished from one another, which implies that these groups are very similar in terms of their biomolecular fingerprints. Taken together, we conclude that sucrose can minimize oxidative damage caused by freeze-drying, and that subsequent dried storage has little effects on the overall biochemical composition of heart valve scaffolds.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive analytics and tailored interventions improve clinical outcomes in older adults: a randomized controlled trial",
        "link": "https://www.nature.com/articles/s41746-021-00463-y",
        "publication_date": "10 Jun 2021",
        "abstract": "This study explored the potential to improve clinical outcomes in patients at risk of moving to the top segment of the cost acuity pyramid. This randomized controlled trial evaluated the impact of a Stepped-Care approach (predictive analytics + tailored nurse-driven interventions) on healthcare utilization among 370 older adult patients enrolled in a homecare management program and using a Personal Emergency Response System. The Control group (CG) received care as usual, while the Intervention group (IG) received Stepped-Care during a 180-day intervention period. The primary outcome, decrease in emergency encounters, was not statistically significant (15%, p = 0.291). However, compared to the CG, the IG had significant reductions in total 90-day readmissions (68%, p = 0.007), patients with 90-day readmissions (76%, p = 0.011), total 180-day readmissions (53%, p = 0.020), and EMS encounters (49%, p = 0.006). Predictive analytics combined with tailored interventions could potentially improve clinical outcomes in older adults, supporting population health management in home or community settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical risk models for preterm birth less than 28 weeks and less than 32 weeks of gestation using a large retrospective cohort",
        "link": "https://www.nature.com/articles/s41372-021-01109-3",
        "publication_date": "10 Jun 2021",
        "abstract": "To develop risk prediction models for singleton preterm birth (PTB) < 28 weeks and <32 weeks.",
        "conclusions": "Using administrative data, we identified important predictors of PTB < 28 and <32 weeks. Our validated prediction models showed moderate to acceptable levels of discrimination for PTB < 28 weeks and <32 weeks. Our models also had very high negative predictive values for overall PTB and spontaneous PTB during both the first and second trimesters in nulliparous and multiparous women.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying and characterizing high-risk clusters in a heterogeneous ICU population with deep embedded clustering",
        "link": "https://www.nature.com/articles/s41598-021-91297-x",
        "publication_date": "08 Jun 2021",
        "abstract": "Critically ill patients constitute a highly heterogeneous population, with seemingly distinct patients having similar outcomes, and patients with the same admission diagnosis having opposite clinical trajectories. We aimed to develop a machine learning methodology that identifies and provides better characterization of patient clusters at high risk of mortality and kidney injury. We analysed prospectively collected data including co-morbidities, clinical examination, and laboratory parameters from a minimally-selected population of 743 patients admitted to the ICU of a Dutch hospital between 2015 and 2017. We compared four clustering methodologies and trained a classifier to predict and validate cluster membership. The contribution of different variables to the predicted cluster membership was assessed using SHapley Additive exPlanations values. We found that deep embedded clustering yielded better results compared to the traditional clustering algorithms. The best cluster configuration was achieved for 6 clusters. All clusters were clinically recognizable, and differed in in-ICU, 30-day, and 90-day mortality, as well as incidence of acute kidney injury. We identified two high mortality risk clusters with at least 60%, 40%, and 30% increased. ICU, 30-day and 90-day mortality, and a low risk cluster with 25–56% lower mortality risk. This machine learning methodology combining deep embedded clustering and variable importance analysis, which we made publicly available, is a possible solution to challenges previously encountered by clustering analyses in heterogeneous patient populations and may help improve the characterization of risk groups in critical care.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Human immune system adaptations to simulated microgravity revealed by single-cell mass cytometry",
        "link": "https://www.nature.com/articles/s41598-021-90458-2",
        "publication_date": "07 Jun 2021",
        "abstract": "Exposure to microgravity (µG) during space flights produces a state of immunosuppression, leading to increased viral shedding, which could interfere with long term missions. However, the cellular mechanisms that underlie the immunosuppressive effects of µG are ill-defined. A deep understanding of human immune adaptations to µG is a necessary first step to design data-driven interventions aimed at preserving astronauts’ immune defense during short- and long-term spaceflights. We employed a high-dimensional mass cytometry approach to characterize over 250 cell-specific functional responses in 18 innate and adaptive immune cell subsets exposed to 1G or simulated (s)µG using the Rotating Wall Vessel. A statistically stringent elastic net method produced a multivariate model that accurately stratified immune responses observed in 1G and sµG (p value 2E−4, cross-validation). Aspects of our analysis resonated with prior knowledge of human immune adaptations to µG, including the dampening of Natural Killer, CD4+ and CD8+ T cell responses. Remarkably, we found that sµG enhanced STAT5 signaling responses of immunosuppressive Tregs. Our results suggest µG exerts a dual effect on the human immune system, simultaneously dampening cytotoxic responses while enhancing Treg function. Our study provides a single-cell readout of sµG-induced immune dysfunctions and an analytical framework for future studies of human immune adaptations to human long-term spaceflights.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Endothelial-derived cardiovascular disease-related microRNAs elevated with prolonged sitting pattern among postmenopausal women",
        "link": "https://www.nature.com/articles/s41598-021-90154-1",
        "publication_date": "03 Jun 2021",
        "abstract": "Time spent sitting is positively correlated with endothelial dysfunction and cardiovascular disease risk. The underlying molecular mechanisms are unknown. MicroRNAs contained in extracellular vesicles (EVs) reflect cell/tissue status and mediate intercellular communication. We explored the association between sitting patterns and microRNAs isolated from endothelial cell (EC)-derived EVs. Using extant actigraphy based sitting behavior data on a cohort of 518 postmenopausal overweight/obese women, we grouped the woman as Interrupted Sitters (IS; N = 18) or Super Sitters (SS; N = 53) if they were in the shortest or longest sitting pattern quartile, respectively. The cargo microRNA in EC-EVs from the IS and SS women were compared. MicroRNA data were weighted by age, physical functioning, MVPA, device wear days, device wear time, waist circumference, and body mass index. Screening of CVD-related microRNAs demonstrated that miR-199a-5p, let-7d-5p, miR-140-5p, miR-142-3p, miR-133b level were significantly elevated in SS compared to IS groups. Group differences in let-7d-5p, miR-133b, and miR-142-3p were validated in expanded groups. Pathway enrichment analyses show that mucin-type O-glycan biosynthesis and cardiomyocyte adrenergic signaling (P < 0.001) are downstream of the three validated microRNAs. This proof-of-concept study supports the possibility that CVD-related microRNAs in EC-EVs may be molecular transducers of sitting pattern-associated CVD risk in overweight postmenopausal women.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Differential effects of heat-not-burn and conventional cigarettes on coronary flow, myocardial and vascular function",
        "link": "https://www.nature.com/articles/s41598-021-91245-9",
        "publication_date": "03 Jun 2021",
        "abstract": "We compared the effects of Heat-not-Burn cigarette (HNBC) to those of tobacco cigarette (Tcig), on myocardial, coronary and arterial function as well as on oxidative stress and platelet activation in 75 smokers. In the acute study, 50 smokers were randomised into smoking a single Tcig or a HNBC and after 60 min were crossed-over to the alternate smoking. For chronic phase, 50 smokers were switched to HNBC and were compared with an external group of 25 Tcig smokers before and after 1 month. Exhaled carbon monoxide (CO), pulse wave velocity (PWV), malondialdehyde (MDA) and thromboxane B2 (TxB2) were assessed in the acute and chronic study. Global longitudinal strain (GLS), myocardial work index (GWI), wasted myocardial work (GWW), coronary flow reserve (CFR), total arterial compliance (TAC) and flow-mediated dilation (FMD) were assessed in the chronic study. Acute HNBC smoking caused a smaller increase of PWV than Tcig (change 1.1 vs 0.54 m/s, p < 0.05) without change in CO and biomarkers in contrast to Tcig. Compared to Tcig, switching to HNBC for 1-month improved CO, FMD, CFR, TAC, GLS, GWW, MDA, TxB2 (differences 10.42 ppm, 4.3%, 0.98, 1.8 mL/mmHg, 2.35%, 19.72 mmHg%, 0.38 nmol/L and 45 pg/mL respectively, p < 0.05). HNBCs exert a less detrimental effect on vascular and cardiac function than tobacco cigarettes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Additional partial hepatectomy at the time of portal vein ligation accelerates the regeneration of the future liver remnant",
        "link": "https://www.nature.com/articles/s41598-021-90819-x",
        "publication_date": "03 Jun 2021",
        "abstract": "Portal vein ligation (PVL) has been adopted to induce hypertrophy of the future liver remnant (FLR) in patients with primarily irresectable liver tumor. However, regeneration of the FLR is not always sufficient to allow curative resection of the portally-deprived tumor-bearing liver lobe. We hypothesize that simultaneous hepatectomy (PHx) and PVL augments regeneration of the FLR and that the effect is related to the extent of the additional resection. Seventy-two Lewis rats were enrolled into 3 groups: 20%PVL + 70%PHx; 70%PVL + 20%PHx; 90%PVL. Animals were observed for 1, 2, 3 and 7 days postoperatively (n = 6/time point). Liver enzymes, caudate liver/body-weight-ratio, BrdU-proliferation-index (PI), proliferating-cell-nuclear-antigen (PCNA)-mRNA-expression level and autophagy-related-proteins were evaluated. Compared with 90% PVL, additional PHx induced significantly more hypertrophy during the observation time, which was confirmed by significantly higher PI and higher level of PCNA-mRNA expression. Similarly, the additional PHx induced more autophagy in the FLR compared with PVL alone. However, both effects were not clearly related to the extent of additional resection. Additional resection augmented liver regeneration and autophagy substantially compared with PVL alone. Therefore, we concluded that autophagy might play a critical role in regulating hepatocyte proliferation and the size of the FLR after simultaneous PVL + PHx.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Differences in plasma microRNA content impair microRNA-based signature for breast cancer diagnosis in cohorts recruited from heterogeneous environmental sites",
        "link": "https://www.nature.com/articles/s41598-021-91278-0",
        "publication_date": "03 Jun 2021",
        "abstract": "Circulating microRNAs are non-invasive biomarkers that can be used for breast cancer diagnosis. However, differences in cancer tissue microRNA expression are observed in populations with different genetic/environmental backgrounds. This work aims at checking if a previously identified diagnostic circulating microRNA signature is efficient in other genetic and environmental contexts, and if a universal circulating signature might be possible. Two populations are used: women recruited in Belgium and Rwanda. Breast cancer patients and healthy controls were recruited in both populations (Belgium: 143 primary breast cancers and 136 healthy controls; Rwanda: 82 primary breast cancers and 73 healthy controls; Ntot = 434), and cohorts with matched age and cancer subtypes were compared. Plasmatic microRNA profiling was performed by RT-qPCR. Random Forest was used to (1) evaluate the performances of the previously described breast cancer diagnostic tool identified in Belgian-recruited cohorts on Rwandan-recruited cohorts and vice versa; (2) define new diagnostic signatures common to both recruitment sites; (3) define new diagnostic signatures efficient in the Rwandan population. None of the circulating microRNA signatures identified is accurate enough to be used as a diagnostic test in both populations. However, accurate circulating microRNA signatures can be found for each specific population, when taken separately.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep database of medical abbreviations and acronyms for natural language processing",
        "link": "https://www.nature.com/articles/s41597-021-00929-4",
        "publication_date": "02 Jun 2021",
        "abstract": "The recognition, disambiguation, and expansion of medical abbreviations and acronyms is of upmost importance to prevent medically-dangerous misinterpretation in natural language processing. To support recognition, disambiguation, and expansion, we present the Medical Abbreviation and Acronym Meta-Inventory, a deep database of medical abbreviations. A systematic harmonization of eight source inventories across multiple healthcare specialties and settings identified 104,057 abbreviations with 170,426 corresponding senses. Automated cross-mapping of synonymous records using state-of-the-art machine learning reduced redundancy, which simplifies future application. Additional features include semi-automated quality control to remove errors. The Meta-Inventory demonstrated high completeness or coverage of abbreviations and senses in new clinical text, a substantial improvement over the next largest repository (6–14% increase in abbreviation coverage; 28–52% increase in sense coverage). To our knowledge, the Meta-Inventory is the most complete compilation of medical abbreviations and acronyms in American English to-date. The multiple sources and high coverage support application in varied specialties and settings. This allows for cross-institutional natural language processing, which previous inventories did not support. The Meta-Inventory is available at https://bit.ly/github-clinical-abbreviations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Study on the prognosis predictive model of COVID-19 patients based on CT radiomics",
        "link": "https://www.nature.com/articles/s41598-021-90991-0",
        "publication_date": "02 Jun 2021",
        "abstract": "Making timely assessments of disease progression in patients with COVID-19 could help offer the best personalized treatment. The purpose of this study was to explore an effective model to predict the outcome of patients with COVID-19. We retrospectively included 188 patients (124 in the training set and 64 in the test set) diagnosed with COVID-19. Patients were divided into aggravation and improvement groups according to the disease progression. Three kinds of models were established, including the radiomics, clinical, and combined model. Receiver operating characteristic curves, decision curves, and Delong’s test were used to evaluate and compare the models. Our analysis showed that all the established prediction models had good predictive performance in predicting the progress and outcome of COVID-19.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Common neurobiological correlates of resilience and personality traits within the triple resting-state brain networks assessed by 7-Tesla ultra-high field MRI",
        "link": "https://www.nature.com/articles/s41598-021-91056-y",
        "publication_date": "02 Jun 2021",
        "abstract": "Despite numerous studies investigating resilience and personality trials, a paucity of information regarding their neurobiological commonalities at the level of the large resting-state networks (rsNWs) remains. Here we address this topic using the advantages of ultra-high-field (UHF) 7T-MRI, characterized by higher signal-to-noise ratio and increased sensitivity. The association between resilience, personality traits and three fMRI measures (fractional amplitude of low-frequency fluctuations (fALFF), degree centrality (DC) and regional homogeneity (ReHo)) determined for three core rsNWs (default mode (DMN), salience (SN), and central executive network (CEN)) were examined in 32 healthy volunteers. The investigation revealed a significant role of SN in both resilience and personality traits and a tight association of the DMN with resilience. DC in CEN emerged as a significant moderator for the correlations of resilience with the personality traits of neuroticism and extraversion. Our results indicate that the common neurobiological basis of resilience and the Big Five personality traits may be reflected at the level of the core rsNWs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Portable rotating grating stimulation for anisometropic amblyopia with 6 months training",
        "link": "https://www.nature.com/articles/s41598-021-90936-7",
        "publication_date": "01 Jun 2021",
        "abstract": "Treatment of grating stimulation has been used in amblyopia for decades, but high dropout rate and inconvenience for daily practice occur in previous studies. We developed a home-based portable system with rotating grating stimulation on a tablet. Thirty anisometropic amblyopic children were randomly allocated into the control or Grating group. They drew contour of the picture under patch of a better eye for 6 months. Best-corrected visual acuity (BCVA), grating acuity (GA), and contrast sensitivity (CS) were assessed at the baseline, 1st, 2nd, 3rd, and 6th months of training. All participants completed the 6-month training. Patched eyes of both groups exhibited no difference. Trained eyes of the control group had significantly slight improvement in BCVA and GA. In particular, the Grating group exhibited significantly higher BCVA, GA, and CS compared with those of the control group at the 3rd and 6th months of training. Moreover, percentage of the Grating group with great improvement (BCVA ≥ 0.3 or CS ≥ 0.3) was significantly larger than those of the control group at the 3rd or 6th months of training. The portable grating stimulation system demonstrates its trainability by no dropout and effectiveness by significant improvements in all assessments through a well experimental design.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Differentiation between non-small cell lung cancer and radiation pneumonitis after carbon-ion radiotherapy by 18F-FDG PET/CT texture analysis",
        "link": "https://www.nature.com/articles/s41598-021-90674-w",
        "publication_date": "01 Jun 2021",
        "abstract": "The differentiation of non-small cell lung cancer (NSCLC) and radiation pneumonitis (RP) is critically essential for selecting optimal clinical therapeutic strategies to manage post carbon-ion radiotherapy (CIRT) in patients with NSCLC. The aim of this study was to assess the ability of 18F-FDG PET/CT metabolic parameters and its textural image features to differentiate NSCLC from RP after CIRT to develop a differential diagnosis of malignancy and benign lesion. We retrospectively analyzed 18F-FDG PET/CT image data from 32 patients with histopathologically proven NSCLC who were scheduled to undergo CIRT and 31 patients diagnosed with RP after CIRT. The SUV parameters, metabolic tumor volume (MTV), total lesion glycolysis (TLG) as well as fifty-six texture parameters derived from seven matrices were determined using PETSTAT image-analysis software. Data were statistically compared between NSCLC and RP using Wilcoxon rank-sum tests. Diagnostic accuracy was assessed using receiver operating characteristics (ROC) curves. Several texture parameters significantly differed between NSCLC and RP (p < 0.05). The parameters that were high in areas under the ROC curves (AUC) were as follows: SUVmax, 0.64; GLRLM run percentage, 0.83 and NGTDM coarseness, 0.82. Diagnostic accuracy was improved using GLRLM run percentage or NGTDM coarseness compared with SUVmax (p < 0.01). The texture parameters of 18F-FDG uptake yielded excellent outcomes for differentiating NSCLC from radiation pneumonitis after CIRT, which outperformed SUV-based evaluation. In particular, GLRLM run percentage and NGTDM coarseness of 18F-FDG PET/CT images would be appropriate parameters that can offer high diagnostic accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive modeling for peri-implantitis by using machine learning techniques",
        "link": "https://www.nature.com/articles/s41598-021-90642-4",
        "publication_date": "27 May 2021",
        "abstract": "The purpose of this retrospective cohort study was to create a model for predicting the onset of peri-implantitis by using machine learning methods and to clarify interactions between risk indicators. This study evaluated 254 implants, 127 with and 127 without peri-implantitis, from among 1408 implants with at least 4 years in function. Demographic data and parameters known to be risk factors for the development of peri-implantitis were analyzed with three models: logistic regression, support vector machines, and random forests (RF). As the results, RF had the highest performance in predicting the onset of peri-implantitis (AUC: 0.71, accuracy: 0.70, precision: 0.72, recall: 0.66, and f1-score: 0.69). The factor that had the most influence on prediction was implant functional time, followed by oral hygiene. In addition, PCR of more than 50% to 60%, smoking more than 3 cigarettes/day, KMW less than 2 mm, and the presence of less than two occlusal supports tended to be associated with an increased risk of peri-implantitis. Moreover, these risk indicators were not independent and had complex effects on each other. The results of this study suggest that peri-implantitis onset was predicted in 70% of cases, by RF which allows consideration of nonlinear relational data with complex interactions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting youth diabetes risk using NHANES data and machine learning",
        "link": "https://www.nature.com/articles/s41598-021-90406-0",
        "publication_date": "27 May 2021",
        "abstract": "Prediabetes and diabetes mellitus (preDM/DM) have become alarmingly prevalent among youth in recent years. However, simple questionnaire-based screening tools to reliably assess diabetes risk are only available for adults, not youth. As a first step in developing such a tool, we used a large-scale dataset from the National Health and Nutritional Examination Survey (NHANES) to examine the performance of a published pediatric clinical screening guideline in identifying youth with preDM/DM based on American Diabetes Association diagnostic biomarkers. We assessed the agreement between the clinical guideline and biomarker criteria using established evaluation measures (sensitivity, specificity, positive/negative predictive value, F-measure for the positive/negative preDM/DM classes, and Kappa). We also compared the performance of the guideline to those of machine learning (ML) based preDM/DM classifiers derived from the NHANES dataset. Approximately 29% of the 2858 youth in our study population had preDM/DM based on biomarker criteria. The clinical guideline had a sensitivity of 43.1% and specificity of 67.6%, positive/negative predictive values of 35.2%/74.5%, positive/negative F-measures of 38.8%/70.9%, and Kappa of 0.1 (95%CI: 0.06–0.14). The performance of the guideline varied across demographic subgroups. Some ML-based classifiers performed comparably to or better than the screening guideline, especially in identifying preDM/DM youth (p = 5.23 × 10−5).We demonstrated that a recommended pediatric clinical screening guideline did not perform well in identifying preDM/DM status among youth. Additional work is needed to develop a simple yet accurate screener for youth diabetes risk, potentially by using advanced ML methods and a wider range of clinical and behavioral health data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The association between four scoring systems and 30-day mortality among intensive care patients with sepsis: a cohort study",
        "link": "https://www.nature.com/articles/s41598-021-90806-2",
        "publication_date": "27 May 2021",
        "abstract": "Several commonly used scoring systems (SOFA, SAPS II, LODS, and SIRS) are currently lacking large sample data to confirm the predictive value of 30-day mortality from sepsis, and their clinical net benefits of predicting mortality are still inconclusive. The baseline data, LODS score, SAPS II score, SIRS score, SOFA score, and 30-day prognosis of patients who met the diagnostic criteria of sepsis were retrieved from the Medical Information Mart for Intensive Care III (MIMIC-III) intensive care unit (ICU) database. Receiver operating characteristic (ROC) curves and comparisons between the areas under the ROC curves (AUC) were conducted. Decision curve analysis (DCA) was performed to determine the net benefits between the four scoring systems and 30-day mortality of sepsis. For all cases in the cohort study, the AUC of LODS, SAPS II, SIRS, SOFA were 0.733, 0.787, 0.597, and 0.688, respectively. The differences between the scoring systems were statistically significant (all P-values < 0.0001), and stratified analyses (the elderly and non-elderly) also showed the superiority of SAPS II among the four systems. According to the DCA, the net benefit ranges in descending order were SAPS II, LODS, SOFA, and SIRS. For stratified analyses of the elderly or non-elderly groups, the results also showed that SAPS II had the most net benefit. Among the four commonly used scoring systems, the SAPS II score has the highest predictive value for 30-day mortality from sepsis, which is better than LODS, SIRS, and SOFA. The results of the DCA curves show that using the SAPS II score to predict the 30-day mortality of intensive care patients with sepsis to guide clinical applications may obtain the highest net benefit.",
        "conclusions": "Among the four commonly used scoring systems, the SAPS II score has the highest predictive value for 30-day mortality from sepsis, which is better than LODS, SIRS, and SOFA. The results of the DCA curves show that using the SAPS II score to predict the 30-day mortality of patients with sepsis to guide clinical applications may obtain the highest net benefit.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Space-time characterization of community noise and sound sources in Accra, Ghana",
        "link": "https://www.nature.com/articles/s41598-021-90454-6",
        "publication_date": "27 May 2021",
        "abstract": "Urban noise pollution is an emerging public health concern in growing cities in sub-Saharan Africa (SSA), but the sound environment in SSA cities is understudied. We leveraged a large-scale measurement campaign to characterize the spatial and temporal patterns of measured sound levels and sound sources in Accra, Ghana. We measured sound levels and recorded audio clips at 146 representative locations, involving 7-days (136 locations) and 1-year measurements between 2019 and 2020. We calculated metrics of noise levels and intermittency and analyzed audio recordings using a pre-trained neural network to identify sources. Commercial, business, and industrial areas and areas near major roads had the highest median daily sound levels (LAeq24hr: 69 dBA and 72 dBA) and the lowest percentage of intermittent sound; the vice-versa was found for peri urban areas. Road-transport sounds dominated the overall sound environment but mixtures of other sound sources, including animals, human speech, and outdoor music, dominated in various locations and at different times. Environmental noise levels in Accra exceeded both international and national health-based guidelines. Detailed information on the acoustical environmental quality (including sound levels and types) in Accra may guide environmental policy formulation and evaluation to improve the health of urban residents.",
        "conclusions": "Like many other SSA cities, Accra is growing rapidly amid a growing challenge of environmental pollution, including rising community noise levels. From a large-scale and comprehensive community noise measurement campaign, we characterized sound levels, patterns, and sources across the Greater Accra Metropolitan Area. The data collection and characterization approach may be applied to other cities in SSA and globally to support noise management strategies, targeted interventions, and to provide additional characterization for application to epidemiologic studies. Our results showed that sound levels in Accra largely surpassed local and international health-based guidelines. Road transport-related sources were the main contributor to community sound, though mixtures of sources were present. Stronger regulation and enforcement are needed in Accra in order to ensure that permissible limits, which are in place to safeguard public health, are met. Policy makers can also partner with traditional authorities in Accra, who play an important role in civil government, in managing community noise.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Brain tumor segmentation based on deep learning and an attention mechanism using MRI multi-modalities brain images",
        "link": "https://www.nature.com/articles/s41598-021-90428-8",
        "publication_date": "25 May 2021",
        "abstract": "Brain tumor localization and segmentation from magnetic resonance imaging (MRI) are hard and important tasks for several applications in the field of medical analysis. As each brain imaging modality gives unique and key details related to each part of the tumor, many recent approaches used four modalities T1, T1c, T2, and FLAIR. Although many of them obtained a promising segmentation result on the BRATS 2018 dataset, they suffer from a complex structure that needs more time to train and test. So, in this paper, to obtain a flexible and effective brain tumor segmentation system, first, we propose a preprocessing approach to work only on a small part of the image rather than the whole part of the image. This method leads to a decrease in computing time and overcomes the overfitting problems in a Cascade Deep Learning model. In the second step, as we are dealing with a smaller part of brain images in each slice, a simple and efficient Cascade Convolutional Neural Network (C-ConvNet/C-CNN) is proposed. This C-CNN model mines both local and global features in two different routes. Also, to improve the brain tumor segmentation accuracy compared with the state-of-the-art models, a novel Distance-Wise Attention (DWA) mechanism is introduced. The DWA mechanism considers the effect of the center location of the tumor and the brain inside the model. Comprehensive experiments are conducted on the BRATS 2018 dataset and show that the proposed model obtains competitive results: the proposed method achieves a mean whole tumor, enhancing tumor, and tumor core dice scores of 0.9203, 0.9113 and 0.8726 respectively. Other quantitative and qualitative assessments are presented and discussed.",
        "conclusions": "In this paper, we have developed a new brain tumor segmentation architecture that benefits from the characterization of the four MRI modalities. It means that each modality has unique characteristics to help the network efficiently distinguish between classes. We have demonstrated that working only on a part of the brain image near the tumor tissue allows a CNN model (that is the most popular deep learning architecture) to reach performance close to human observers. Moreover, a simple but efficient cascade CNN model has been proposed to extract both local and global features in two different ways with different sizes of extraction patches. In our method, after extracting the tumor’s expected area using a powerful preprocessing approach, those patches are selected to feed the network that their center is located inside this area. This leads to reducing the computational time and capability to make predictions fast for classifying the clinical image as it removes a large number of insignificant pixels off the image in the preprocessing step. Comprehensive experiments have indicated the effectiveness of the Distance-Wise Attention mechanism in our algorithm as well as the remarkable capacity of our entire model when compared with the state-of-the-art approaches.Although the proposed approach’s outstanding results compared to the other recently published models, our algorithm has still limitations when encountering tumor volume of more than one-third of the whole of the brain. This is because of an increase in the size of the tumor’s expected area which leads to a decrease in the feature extraction performance.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Observing deep radiomics for the classification of glioma grades",
        "link": "https://www.nature.com/articles/s41598-021-90555-2",
        "publication_date": "25 May 2021",
        "abstract": "Deep learning is a promising method for medical image analysis because it can automatically acquire meaningful representations from raw data. However, a technical challenge lies in the difficulty of determining which types of internal representation are associated with a specific task, because feature vectors can vary dynamically according to individual inputs. Here, based on the magnetic resonance imaging (MRI) of gliomas, we propose a novel method to extract a shareable set of feature vectors that encode various parts in tumor imaging phenotypes. By applying vector quantization to latent representations, features extracted by an encoder are replaced with a fixed set of feature vectors. Hence, the set of feature vectors can be used in downstream tasks as imaging markers, which we call deep radiomics. Using deep radiomics, a classifier is established using logistic regression to predict the glioma grade with 90% accuracy. We also devise an algorithm to visualize the image region encoded by each feature vector, and demonstrate that the classification model preferentially relies on feature vectors associated with the presence or absence of contrast enhancement in tumor regions. Our proposal provides a data-driven approach to enhance the understanding of the imaging appearance of gliomas.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Elastic transformation of histological slices allows precise co-registration with microCT data sets for a refined virtual histology approach",
        "link": "https://www.nature.com/articles/s41598-021-89841-w",
        "publication_date": "25 May 2021",
        "abstract": "Although X-ray based 3D virtual histology is an emerging tool for the analysis of biological tissue, it falls short in terms of specificity when compared to conventional histology. Thus, the aim was to establish a novel approach that combines 3D information provided by microCT with high specificity that only (immuno-)histochemistry can offer. For this purpose, we developed a software frontend, which utilises an elastic transformation technique to accurately co-register various histological and immunohistochemical stainings with free propagation phase contrast synchrotron radiation microCT. We demonstrate that the precision of the overlay of both imaging modalities is significantly improved by performing our elastic registration workflow, as evidenced by calculation of the displacement index. To illustrate the need for an elastic co-registration approach we examined specimens from a mouse model of breast cancer with injected metal-based nanoparticles. Using the elastic transformation pipeline, we were able to co-localise the nanoparticles to specifically stained cells or tissue structures into their three-dimensional anatomical context. Additionally, we performed a semi-automated tissue structure and cell classification. This workflow provides new insights on histopathological analysis by combining CT specific three-dimensional information with cell/tissue specific information provided by classical histology.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Modulation of the immune microenvironment of high-risk ductal carcinoma in situ by intralesional pembrolizumab injection",
        "link": "https://www.nature.com/articles/s41523-021-00267-z",
        "publication_date": "25 May 2021",
        "abstract": "Ductal carcinoma in situ (DCIS) is a risk factor for the subsequent development of invasive breast cancer. High-risk features include age <45 years, size >5 cm, high-grade, palpable mass, hormone receptor negativity, and HER2 positivity. We have previously shown that immune infiltrates are positively associated with these high-risk features, suggesting that manipulating the immune microenvironment in high-risk DCIS could potentially alter disease progression. Patients with high-risk DCIS were enrolled in this 3 × 3 phase 1 dose-escalation pilot study of 2, 4, and 8 mg intralesional injections of the PD-1 immune checkpoint inhibitor, pembrolizumab. Study participants received two intralesional injections, three weeks apart, prior to surgery. Tissue from pre-treatment biopsies and post-treatment surgical resections was analyzed using multiplex immunofluorescence (mIF) staining for various immune cell populations. The intralesional injections were easily administered and well-tolerated. mIF analyses demonstrated significant increases in total T cell and CD8+ T cell percentages in most patients after receiving pembrolizumab, even at the 2 mg dose. T cell expansion was confined primarily to the stroma rather than within DCIS-containing ducts. Neither cleaved caspase 3 (CC3) staining, a marker for apoptosis, nor DCIS volume (as measured by MRI) changed significantly following treatment. Intralesional injection of pembrolizumab is safe and feasible in patients with DCIS. Nearly all patients experienced robust total and CD8+ T cell responses. However, we did not observe evidence of cell death or tumor volume decrease by MRI, suggesting that additional strategies may be needed to elicit stronger anti-tumor immunity.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Association between visual field damage and corneal structural parameters",
        "link": "https://www.nature.com/articles/s41598-021-90298-0",
        "publication_date": "24 May 2021",
        "abstract": "The main goal of this study is to identify the association between corneal shape, elevation, and thickness parameters and visual field damage using machine learning. A total of 676 eyes from 568 patients from the Jichi Medical University in Japan were included in this study. Corneal topography, pachymetry, and elevation images were obtained using anterior segment optical coherence tomography (OCT) and visual field tests were collected using standard automated perimetry with 24-2 Swedish Interactive Threshold Algorithm. The association between corneal structural parameters and visual field damage was investigated using machine learning and evaluated through tenfold cross-validation of the area under the receiver operating characteristic curves (AUC). The average mean deviation was − 8.0 dB and the average central corneal thickness (CCT) was 513.1 µm. Using ensemble machine learning bagged trees classifiers, we detected visual field abnormality from corneal parameters with an AUC of 0.83. Using a tree-based machine learning classifier, we detected four visual field severity levels from corneal parameters with an AUC of 0.74. Although CCT and corneal hysteresis have long been accepted as predictors of glaucoma development and future visual field loss, corneal shape and elevation parameters may also predict glaucoma-induced visual functional loss.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Wearable sensors enable personalized predictions of clinical laboratory measurements",
        "link": "https://www.nature.com/articles/s41591-021-01339-0",
        "publication_date": "24 May 2021",
        "abstract": "Vital signs, including heart rate and body temperature, are useful in detecting or monitoring medical conditions, but are typically measured in the clinic and require follow-up laboratory testing for more definitive diagnoses. Here we examined whether vital signs as measured by consumer wearable devices (that is, continuously monitored heart rate, body temperature, electrodermal activity and movement) can predict clinical laboratory test results using machine learning models, including random forest and Lasso models. Our results demonstrate that vital sign data collected from wearables give a more consistent and precise depiction of resting heart rate than do measurements taken in the clinic. Vital sign data collected from wearables can also predict several clinical laboratory measurements with lower prediction error than predictions made using clinically obtained vital sign measurements. The length of time over which vital signs are monitored and the proximity of the monitoring period to the date of prediction play a critical role in the performance of the machine learning models. These results demonstrate the value of commercial wearable devices for continuous and longitudinal assessment of physiological measurements that today can be measured only with clinical laboratory tests.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparing machine learning algorithms for predicting ICU admission and mortality in COVID-19",
        "link": "https://www.nature.com/articles/s41746-021-00456-x",
        "publication_date": "21 May 2021",
        "abstract": "As predicting the trajectory of COVID-19 is challenging, machine learning models could assist physicians in identifying high-risk individuals. This study compares the performance of 18 machine learning algorithms for predicting ICU admission and mortality among COVID-19 patients. Using COVID-19 patient data from the Mass General Brigham (MGB) Healthcare database, we developed and internally validated models using patients presenting to the Emergency Department (ED) between March-April 2020 (n = 3597) and further validated them using temporally distinct individuals who presented to the ED between May-August 2020 (n = 1711). We show that ensemble-based models perform better than other model types at predicting both 5-day ICU admission and 28-day mortality from COVID-19. CRP, LDH, and O2 saturation were important for ICU admission models whereas eGFR <60 ml/min/1.73 m2, and neutrophil and lymphocyte percentages were the most important variables for predicting mortality. Implementing such models could help in clinical decision-making for future infectious disease outbreaks including COVID-19.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Classification of directionally specific vagus nerve activity using an upper airway obstruction model in anesthetized rodents",
        "link": "https://www.nature.com/articles/s41598-021-89624-3",
        "publication_date": "21 May 2021",
        "abstract": "Electrical signals from the peripheral nervous system have the potential to provide the necessary motor, sensory or autonomic information for implementing closed-loop control of neuroprosthetic or neuromodulatory systems. However, developing methods to recover information encoded in these signals is a significant challenge. Our goal was to test the feasibility of measuring physiologically generated nerve action potentials that can be classified as sensory or motor signals. A tetrapolar recording nerve cuff electrode was used to measure vagal nerve (VN) activity in a rodent model of upper airway obstruction. The effect of upper airway occlusions on VN activity related to respiration (RnP) was calculated and compared for 4 different cases: (1) intact VN, (2) VN transection only proximal to recording electrode, (3) VN transection only distal to the recording electrode, and (4) transection of VN proximal and distal to electrode. We employed a Support Vector Machine (SVM) model with Gaussian Kernel to learn a model capable of classifying efferent and afferent waveforms obtained from the tetrapolar electrode. In vivo results showed that the RnP values decreased significantly during obstruction by 91.7% ± 3.1%, and 78.2% ± 3.4% for cases of intact VN or proximal transection, respectively. In contrast, there were no significant changes for cases of VN transection at the distal end or both ends of the electrode. The SVM model yielded an 85.8% accuracy in distinguishing motor and sensory signals. The feasibility of measuring low-noise directionally-sensitive neural activity using a tetrapolar nerve cuff electrode along with the use of an SVM classifier was shown. Future experimental work in chronic implant studies is needed to support clinical translatability.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The lexicon of antimicrobial peptides: a complete set of arginine and tryptophan sequences",
        "link": "https://www.nature.com/articles/s42003-021-02137-7",
        "publication_date": "21 May 2021",
        "abstract": "Our understanding of the activity of cationic antimicrobial peptides (AMPs) has focused on well-characterized natural sequences, or limited sets of synthetic peptides designed de novo. We have undertaken a comprehensive investigation of the underlying primary structural features that give rise to the development of activity in AMPs. We consider a complete set of all possible peptides, up to 7 residues long, composed of positively charged arginine (R) and / or hydrophobic tryptophan (W), two features most commonly associated with activity. We found the shortest active peptides were 4 or 5 residues in length, and the overall landscapes of activity against gram-positive and gram-negative bacteria and a yeast were positively correlated. For all three organisms we found a single activity peak corresponding to sequences with around 40% R; the presence of adjacent W duplets and triplets also conferred greater activity. The mechanistic basis of these activities comprises a combination of lipid binding, particularly to negatively charged membranes, and additionally peptide aggregation, a mode of action previously uninvestigated for such peptides. The maximum specific antimicrobial activity appeared to occur in peptides of around 10 residues, suggesting ‘diminishing returns’ for developing larger peptides, when activity is considered per residue of peptide.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Analysing wideband absorbance immittance in normal and ears with otitis media with effusion using machine learning",
        "link": "https://www.nature.com/articles/s41598-021-89588-4",
        "publication_date": "20 May 2021",
        "abstract": "Wideband Absorbance Immittance (WAI) has been available for more than a decade, however its clinical use still faces the challenges of limited understanding and poor interpretation of WAI results. This study aimed to develop Machine Learning (ML) tools to identify the WAI absorbance characteristics across different frequency-pressure regions in the normal middle ear and ears with otitis media with effusion (OME) to enable diagnosis of middle ear conditions automatically. Data analysis included pre-processing of the WAI data, statistical analysis and classification model development, and key regions extraction from the 2D frequency-pressure WAI images. The experimental results show that ML tools appear to hold great potential for the automated diagnosis of middle ear diseases from WAI data. The identified key regions in the WAI provide guidance to practitioners to better understand and interpret WAI data and offer the prospect of quick and accurate diagnostic decisions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Med-BERT: pretrained contextualized embeddings on large-scale structured electronic health records for disease prediction",
        "link": "https://www.nature.com/articles/s41746-021-00455-y",
        "publication_date": "20 May 2021",
        "abstract": "Deep learning (DL)-based predictive models from electronic health records (EHRs) deliver impressive performance in many clinical tasks. Large training cohorts, however, are often required by these models to achieve high accuracy, hindering the adoption of DL-based models in scenarios with limited training data. Recently, bidirectional encoder representations from transformers (BERT) and related models have achieved tremendous successes in the natural language processing domain. The pretraining of BERT on a very large training corpus generates contextualized embeddings that can boost the performance of models trained on smaller datasets. Inspired by BERT, we propose Med-BERT, which adapts the BERT framework originally developed for the text domain to the structured EHR domain. Med-BERT is a contextualized embedding model pretrained on a structured EHR dataset of 28,490,650 patients. Fine-tuning experiments showed that Med-BERT substantially improves the prediction accuracy, boosting the area under the receiver operating characteristics curve (AUC) by 1.21–6.14% in two disease prediction tasks from two clinical databases. In particular, pretrained Med-BERT obtains promising performances on tasks with small fine-tuning training sets and can boost the AUC by more than 20% or obtain an AUC as high as a model trained on a training set ten times larger, compared with deep learning models without Med-BERT. We believe that Med-BERT will benefit disease prediction studies with small local training datasets, reduce data collection expenses, and accelerate the pace of artificial intelligence aided healthcare.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "3D free-hand ultrasound to register anatomical landmarks at the pelvis and localize the hip joint center in lean and obese individuals",
        "link": "https://www.nature.com/articles/s41598-021-89763-7",
        "publication_date": "20 May 2021",
        "abstract": "3D free-hand ultrasound (3DFUS) is becoming increasingly popular to assist clinical gait analysis because it is cost- and time-efficient and does not expose participants to radiation. The aim of this study was to evaluate its reliability in localizing the anterior superior iliac spine (ASIS) at the pelvis and the hip joint centers (HJC). Additionally, we evaluated its accuracy to get a rough estimation of the potential to use of 3DFUS to segment bony surface. This could offer potential to register medical images to motion capture data in future. To evaluate reliability, a test–retest study was conducted in 16 lean and 19 obese individuals. The locations of the ASIS were determined by manual marker placement (MMP), an instrumented pointer technique (IPT), and with 3DFUS. The HJC location was also determined with 3DFUS. To quantify reliability, intraclass correlation coefficients (ICCs), the standard error of measurement (SEm), among other statistical parameters, were calculated for the identified locations between the test and retest. To assess accuracy, the surface of a human plastic pelvic phantom was segmented with 3DFUS in a distilled water bath in 27 trials and compared to a 3D laser scan of the pelvis. Regarding reliability, the MMP, but especially the IPT showed high reliability in lean (SEm: 2–3 mm) and reduced reliability in obese individuals (SEm: 6–15 mm). Compared to MMP and IPT, 3DFUS presented lower reliability in the lean group (SEm: 2–4 mm vs. 2–8 mm, respectively) but slightly better values in the obese group (SEm: 7–11 mm vs. 6–16 mm, respectively). Correlations between test–retest reliability and torso body fat mass (% of body mass) indicated a moderate to strong relationship for MMP and IPT but only a weak correlation for the 3DFUS approach. The water-bath experiments indicated an acceptable level of 3.5 (1.7) mm of accuracy for 3DFUS in segmenting bone surface. Despite some difficulties with single trials, our data give further rise to the idea that 3DFUS could serve as a promising tool in future to inform marker placement and hip joint center location, especially in groups with higher amount of body fat.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Feasibility of predicting allele specific expression from DNA sequencing using machine learning",
        "link": "https://www.nature.com/articles/s41598-021-89904-y",
        "publication_date": "19 May 2021",
        "abstract": "Allele specific expression (ASE) concerns divergent expression quantity of alternative alleles and is measured by RNA sequencing. Multiple studies show that ASE plays a role in hereditary diseases by modulating penetrance or phenotype severity. However, genome diagnostics is based on DNA sequencing and therefore neglects gene expression regulation such as ASE. To take advantage of ASE in absence of RNA sequencing, it must be predicted using only DNA variation. We have constructed ASE models from BIOS (n = 3432) and GTEx (n = 369) that predict ASE using DNA features. These models are highly reproducible and comprise many different feature types, highlighting the complex regulation that underlies ASE. We applied the BIOS-trained model to population variants in three genes in which ASE plays a clinically relevant role: BRCA2, RET and NF1. This resulted in predicted ASE effects for 27 variants, of which 10 were known pathogenic variants. We demonstrated that ASE can be predicted from DNA features using machine learning. Future efforts may improve sensitivity and translate these models into a new type of genome diagnostic tool that prioritizes candidate pathogenic variants or regulators thereof for follow-up validation by RNA sequencing. All used code and machine learning models are available at GitHub and Zenodo.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Probing an AI regression model for hand bone age determination using gradient-based saliency mapping",
        "link": "https://www.nature.com/articles/s41598-021-90157-y",
        "publication_date": "19 May 2021",
        "abstract": "Understanding how a neural network makes decisions holds significant value for users. For this reason, gradient-based saliency mapping was tested on an artificial intelligence (AI) regression model for determining hand bone age from X-ray radiographs. The partial derivative (PD) of the inferred age with respect to input image intensity at each pixel served as a saliency marker to find sensitive areas contributing to the outcome. The mean of the absolute PD values was calculated for five anatomical regions of interest, and one hundred test images were evaluated with this procedure. The PD maps suggested that the AI model employed a holistic approach in determining hand bone age, with the wrist area being the most important at early ages. However, this importance decreased with increasing age. The middle section of the metacarpal bones was the least important area for bone age determination. The muscular region between the first and second metacarpal bones also exhibited high PD values but contained no bone age information, suggesting a region of vulnerability in age determination. An end-to-end gradient-based saliency map can be obtained from a black box regression AI model and provide insight into how the model makes decisions.",
        "conclusions": "A gradient-based saliency map is useful for providing insights into how a regression AI model makes decisions. The map can be readily calculated by treating the model as a complete black box. When used with other investigation tools, this method may be useful for identifying areas of importance and unimportance for the task.",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Survival prediction and treatment optimization of multiple myeloma patients using machine-learning models based on clinical and gene expression data",
        "link": "https://www.nature.com/articles/s41375-021-01286-2",
        "publication_date": "18 May 2021",
        "abstract": "Multiple myeloma (MM) remains mostly an incurable disease with a heterogeneous clinical evolution. Despite the availability of several prognostic scores, substantial room for improvement still exists. Promising results have been obtained by integrating clinical and biochemical data with gene expression profiling (GEP). In this report, we applied machine learning algorithms to MM clinical and RNAseq data collected by the CoMMpass consortium. We created a 50-variable random forests model (IAC-50) that could predict overall survival with high concordance between both training and validation sets (c-indexes, 0.818 and 0.780). This model included the following covariates: patient age, ISS stage, serum B2-microglobulin, first-line treatment, and the expression of 46 genes. Survival predictions for each patient considering the first line of treatment evidenced that those individuals treated with the best-predicted drug combination were significantly less likely to die than patients treated with other schemes. This was particularly important among patients treated with a triplet combination including bortezomib, an immunomodulatory drug (ImiD), and dexamethasone. Finally, the model showed a trend to retain its predictive value in patients with high-risk cytogenetics. In conclusion, we report a predictive model for MM survival based on the integration of clinical, biochemical, and gene expression data with machine learning tools.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Early bradycardia detection and therapeutic interventions in preterm infant monitoring",
        "link": "https://www.nature.com/articles/s41598-021-89468-x",
        "publication_date": "18 May 2021",
        "abstract": "In very preterm infants, cardio-respiratory events and associated hypoxemia occurring during early postnatal life have been associated with risks of retinopathy, growth alteration and neurodevelopment impairment. These events are commonly detected by continuous cardio-respiratory monitoring in neonatal intensive care units (NICU), through the associated bradycardia. NICU nurse interventions are mainly triggered by these alarms. In this work, we acquired data from 52 preterm infants during NICU monitoring, in order to propose an early bradycardia detector which is based on a decentralized fusion of three detectors. The main objective is to improve automatic detection under real-life conditions without altering performance with respect to that of a monitor commonly used in NICU. We used heart rate lower than 80 bpm during at least 10 sec to define bradycardia. With this definition we observed a high rate of false alarms (64%) in real-life and that 29% of the relevant alarms were not followed by manual interventions. Concerning the proposed detection method, when compared to current monitors, it provided a significant decrease of the detection delay of 2.9 seconds, without alteration of the sensitivity (97.6% vs 95.2%) and false alarm rate (63.7% vs 64.1%). We expect that such an early detection will improve the response of the newborn to the intervention and allow for the development of new automatic therapeutic strategies which could complement manual intervention and decrease the sepsis risk.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Fast and accurate automated recognition of the dominant cells from fecal images based on Faster R-CNN",
        "link": "https://www.nature.com/articles/s41598-021-89863-4",
        "publication_date": "14 May 2021",
        "abstract": "Fecal samples can easily be collected and are representative of a person’s current health state; therefore, the demand for routine fecal examination has increased sharply. However, manual operation may pollute the samples, and low efficiency limits the general examination speed; therefore, automatic analysis is needed. Nevertheless, recognition exhaustion time and accuracy remain major challenges in automatic testing. Here, we introduce a fast and efficient cell-detection algorithm based on the Faster-R-CNN technique: the Resnet-152 convolutional neural network architecture. Additionally, a region proposal network and a network combined with principal component analysis are proposed for cell location and recognition in microscopic images. Our algorithm achieved a mean average precision of 84% and a 723 ms detection time per sample for 40,560 fecal images. Thus, this approach may provide a solid theoretical basis for real-time detection in routine clinical examinations while accelerating the process to satisfy increasing demand.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predictive SNPs for β0-thalassemia/HbE disease severity",
        "link": "https://www.nature.com/articles/s41598-021-89641-2",
        "publication_date": "14 May 2021",
        "abstract": "β-Thalassemia/HbE disease has a wide spectrum of clinical phenotypes ranging from asymptomatic to dependent on regular blood transfusions. Ability to predict disease severity is helpful for clinical management and treatment decision making. A thalassemia severity score has been developed from Mediterranean β-thalassemia patients. However, different ethnic groups may have different allele frequency and linkage disequilibrium structures. Here, Thai β0-thalassemia/HbE disease genome-wild association studies (GWAS) data of 487 patients were analyzed by SNP interaction prioritization algorithm, interacting Loci (iLoci), to find predictive SNPs for disease severity. Three SNPs from two SNP interaction pairs associated with disease severity were identifies. The three-SNP disease severity risk score composed of rs766432 in BCL11A, rs9399137 in HBS1L-MYB and rs72872548 in HBE1 showed more than 85% specificity and 75% accuracy. The three-SNP predictive score was then validated in two independent cohorts of Thai and Malaysian β0-thalassemia/HbE patients with comparable specificity and accuracy. The SNP risk score could be used for prediction of clinical severity for Southeast Asia β0-thalassemia/HbE population.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An ensemble of neural networks provides expert-level prenatal detection of complex congenital heart disease",
        "link": "https://www.nature.com/articles/s41591-021-01342-5",
        "publication_date": "14 May 2021",
        "abstract": "Congenital heart disease (CHD) is the most common birth defect. Fetal screening ultrasound provides five views of the heart that together can detect 90% of complex CHD, but in practice, sensitivity is as low as 30%. Here, using 107,823 images from 1,326 retrospective echocardiograms and screening ultrasounds from 18- to 24-week fetuses, we trained an ensemble of neural networks to identify recommended cardiac views and distinguish between normal hearts and complex CHD. We also used segmentation models to calculate standard fetal cardiothoracic measurements. In an internal test set of 4,108 fetal surveys (0.9% CHD, >4.4 million images), the model achieved an area under the curve (AUC) of 0.99, 95% sensitivity (95% confidence interval (CI), 84–99%), 96% specificity (95% CI, 95–97%) and 100% negative predictive value in distinguishing normal from abnormal hearts. Model sensitivity was comparable to that of clinicians and remained robust on outside-hospital and lower-quality images. The model’s decisions were based on clinically relevant features. Cardiac measurements correlated with reported measures for normal and abnormal hearts. Applied to guideline-recommended imaging, ensemble learning models could significantly improve detection of fetal CHD, a critical and global diagnostic challenge.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Large-scale plasma proteomic analysis identifies proteins and pathways associated with dementia risk",
        "link": "https://www.nature.com/articles/s43587-021-00064-0",
        "publication_date": "14 May 2021",
        "abstract": "The plasma proteomic changes that precede the onset of dementia could yield insights into disease biology and highlight new biomarkers and avenues for intervention. We quantified 4,877 plasma proteins in nondemented older adults in the Atherosclerosis Risk in Communities cohort and performed a proteome-wide association study of dementia risk over five years (n = 4,110; 428 incident cases). Thirty-eight proteins were associated with incident dementia after Bonferroni correction. Of these, 16 were also associated with late-life dementia risk when measured in plasma collected nearly 20 years earlier, during mid-life. Two-sample Mendelian randomization causally implicated two dementia-associated proteins (SVEP1 and angiostatin) in Alzheimer’s disease. SVEP1, an immunologically relevant cellular adhesion protein, was found to be part of larger dementia-associated protein networks, and circulating levels were associated with atrophy in brain regions vulnerable to Alzheimer’s pathology. Pathway analyses for the broader set of dementia-associated proteins implicated immune, lipid, metabolic signaling and hemostasis pathways in dementia pathogenesis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Enhancement of cerebrovascular 4D flow MRI velocity fields using machine learning and computational fluid dynamics simulation data",
        "link": "https://www.nature.com/articles/s41598-021-89636-z",
        "publication_date": "13 May 2021",
        "abstract": "Blood flow metrics obtained with four-dimensional (4D) flow phase contrast (PC) magnetic resonance imaging (MRI) can be of great value in clinical and experimental cerebrovascular analysis. However, limitations in both quantitative and qualitative analyses can result from errors inherent to PC MRI. One method that excels in creating low-error, physics-based, velocity fields is computational fluid dynamics (CFD). Augmentation of cerebral 4D flow MRI data with CFD-informed neural networks may provide a method to produce highly accurate physiological flow fields. In this preliminary study, the potential utility of such a method was demonstrated by using high resolution patient-specific CFD data to train a convolutional neural network, and then using the trained network to enhance MRI-derived velocity fields in cerebral blood vessel data sets. Through testing on simulated images, phantom data, and cerebrovascular 4D flow data from 20 patients, the trained network successfully de-noised flow images, decreased velocity error, and enhanced near-vessel-wall velocity quantification and visualization. Such image enhancement can improve experimental and clinical qualitative and quantitative cerebrovascular PC MRI analysis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting sex from retinal fundus photographs using automated deep learning",
        "link": "https://www.nature.com/articles/s41598-021-89743-x",
        "publication_date": "13 May 2021",
        "abstract": "Deep learning may transform health care, but model development has largely been dependent on availability of advanced technical expertise. Herein we present the development of a deep learning model by clinicians without coding, which predicts reported sex from retinal fundus photographs. A model was trained on 84,743 retinal fundus photos from the UK Biobank dataset. External validation was performed on 252 fundus photos from a tertiary ophthalmic referral center. For internal validation, the area under the receiver operating characteristic curve (AUROC) of the code free deep learning (CFDL) model was 0.93. Sensitivity, specificity, positive predictive value (PPV) and accuracy (ACC) were 88.8%, 83.6%, 87.3% and 86.5%, and for external validation were 83.9%, 72.2%, 78.2% and 78.6% respectively. Clinicians are currently unaware of distinct retinal feature variations between males and females, highlighting the importance of model explainability for this task. The model performed significantly worse when foveal pathology was present in the external validation dataset, ACC: 69.4%, compared to 85.4% in healthy eyes, suggesting the fovea is a salient region for model performance OR (95% CI): 0.36 (0.19, 0.70) p = 0.0022. Automated machine learning (AutoML) may enable clinician-driven automated discovery of novel insights and disease biomarkers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence in detecting temporomandibular joint osteoarthritis on orthopantomogram",
        "link": "https://www.nature.com/articles/s41598-021-89742-y",
        "publication_date": "13 May 2021",
        "abstract": "Orthopantomogram (OPG) is important for primary diagnosis of temporomandibular joint osteoarthritis (TMJOA), because of cost and the radiation associated with computed tomograms (CT). The aims of this study were to develop an artificial intelligence (AI) model and compare its TMJOA diagnostic performance from OPGs with that of an oromaxillofacial radiology (OMFR) expert. An AI model was developed using Karas’ ResNet model and trained to classify images into three categories: normal, indeterminate OA, and OA. This study included 1189 OPG images confirmed by cone-beam CT and evaluated the results by model (accuracy, precision, recall, and F1 score) and diagnostic performance (accuracy, sensitivity, and specificity). The model performance was unsatisfying when AI was developed with 3 categories. After the indeterminate OA images were reclassified as normal, OA, or omission, the AI diagnosed TMJOA in a similar manner to an expert and was in most accord with CBCT when the indeterminate OA category was omitted (accuracy: 0.78, sensitivity: 0.73, and specificity: 0.82). Our deep learning model showed a sensitivity equivalent to that of an expert, with a better balance between sensitivity and specificity, which implies that AI can play an important role in primary diagnosis of TMJOA from OPGs in most general practice clinics where OMFR experts or CT are not available.",
        "conclusions": "Collectively, an AI may read OPGs to diagnose TMJOA as well as OMFR experts can with respect to sensitivity and has greater accordance with CBCT interpretations than do OMFR experts, which implies that AI can play an important role in diagnosing TMJOA primarily from OPGs in most general practice clinics, where OMFR experts or CBCT are not available.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Genomic selection signatures in autism spectrum disorder identifies cognitive genomic tradeoff and its relevance in paradoxical phenotypes of deficits versus potentialities",
        "link": "https://www.nature.com/articles/s41598-021-89798-w",
        "publication_date": "13 May 2021",
        "abstract": "Autism spectrum disorder (ASD) is a heterogeneous neurodevelopmental disorder characterized by paradoxical phenotypes of deficits as well as gain in brain function. To address this a genomic tradeoff hypothesis was tested and followed up with the biological interaction and evolutionary significance of positively selected ASD risk genes. SFARI database was used to retrieve the ASD risk genes while for population datasets 1000 genome data was used. Common risk SNPs were subjected to machine learning as well as independent tests for selection, followed by Bayesian analysis to identify the cumulative effect of selection on risk SNPs. Functional implication of these positively selected risk SNPs was assessed and subjected to ontology analysis, pertaining to their interaction and enrichment of biological and cellular functions. This was followed by comparative analysis with the ancient genomes to identify their evolutionary patterns. Our results identified significant positive selection signals in 18 ASD risk SNPs. Functional and ontology analysis indicate the role of biological and cellular processes associated with various brain functions. The core of the biological interaction network constitutes genes for cognition and learning while genes in the periphery of the network had direct or indirect impact on brain function. Ancient genome analysis identified de novo and conserved evolutionary selection clusters. The de-novo evolutionary cluster represented genes involved in cognitive function. Relative enrichment of the ASD risk SNPs from the respective evolutionary cluster or biological interaction networks may help in addressing the phenotypic diversity in ASD. This cognitive genomic tradeoff signatures impacting the biological networks can explain the paradoxical phenotypes in ASD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Detection of Plasmodium falciparum in laboratory-reared and naturally infected wild mosquitoes using near-infrared spectroscopy",
        "link": "https://www.nature.com/articles/s41598-021-89715-1",
        "publication_date": "13 May 2021",
        "abstract": "There is an urgent need for high throughput, affordable methods of detecting pathogens inside insect vectors to facilitate surveillance. Near-infrared spectroscopy (NIRS) has shown promise to detect arbovirus and malaria in the laboratory but has not been evaluated in field conditions. Here we investigate the ability of NIRS to identify Plasmodium falciparum in Anopheles coluzzii mosquitoes. NIRS models trained on laboratory-reared mosquitoes infected with wild malaria parasites can detect the parasite in comparable mosquitoes with moderate accuracy though fails to detect oocysts or sporozoites in naturally infected field caught mosquitoes. Models trained on field mosquitoes were unable to predict the infection status of other field mosquitoes. Restricting analyses to mosquitoes of uninfectious and highly-infectious status did improve predictions suggesting sensitivity and specificity may be better in mosquitoes with higher numbers of parasites. Detection of infection appears restricted to homogenous groups of mosquitoes diminishing NIRS utility for detecting malaria within mosquitoes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    }
]