[
    {
        "title": "The quality monitoring of paracetamol medicament using a noninvasive microwave sensor",
        "link": "https://www.nature.com/articles/s41598-023-43409-y",
        "publication_date": "14 Oct 2023",
        "abstract": "Environmental conditions, including temperature, humidity, and light, can impact the quality of drugs. Microwave-based approaches offer a fast and cost-effective way to detect quality variations, providing an alternative to traditional techniques in the pharmaceutical and cosmetic industries. This article proposes the use of a microwave sensor for monitoring the quality of pharmaceutical drugs at distinct temperature levels. A small planar sensor based on three hexagonal split ring resonators (TH-SRR) is fabricated. The design is manufactured on an FR-4 dielectric substrate. The sensor is tested on a 1000 mg paracetamol tablet, at temperatures ranging from 40 to 80 \\(^\\circ\\)C. The Variation in the permittivity that characterizes product degradation is translated into a shift in the frequency of the scattering matrix elements. To validate the microwave approach, drug quality is examined with the laser-induced breakdown spectroscopy (LIBS) technique, an optical emission laser used for both qualitative and quantitative investigations of elements contained in a sample. The existing elements are classified using the National Institute of Standards and Technology (NIST) database and categorized according to their spectral line wavelengths. The experiments show the presence of optimal wavelength values for carbon (C), hydrogen (H), nitrogen (N), and oxygen (O) at 247.92 nm, 656.49 nm, 244.23 nm, and 777.48 nm, respectively. The microwave experimental results show a shift frequency of approximately 1 MHz on average when the tablet is heated at 80 \\(^\\circ\\)C for 15 min. Meanwhile, the LIBS measurement shows a remarkable shift in terms of intensity of approximately 8884 and 812 for carbon and hydrogen, respectively. Understanding how paracetamol dries under high temperatures and improving the process settings of the microwave sensor are investigated and assessed in this work.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "A multimodal deep learning model for predicting severe hemorrhage in placenta previa",
        "link": "https://www.nature.com/articles/s41598-023-44634-1",
        "publication_date": "13 Oct 2023",
        "abstract": "Placenta previa causes life-threatening bleeding and accurate prediction of severe hemorrhage leads to risk stratification and optimum allocation of interventions. We aimed to use a multimodal deep learning model to predict severe hemorrhage. Using MRI T2-weighted image of the placenta and tabular data consisting of patient demographics and preoperative blood examination data, a multimodal deep learning model was constructed to predict cases of intraoperative blood loss > 2000 ml. We evaluated the prediction performance of the model by comparing it with that of two machine learning methods using only tabular data and MRI images, as well as with that of two human expert obstetricians. Among the enrolled 48 patients, 26 (54.2%) lost > 2000 ml of blood and 22 (45.8%) lost < 2000 ml of blood. Multimodal deep learning model showed the best accuracy of 0.68 and AUC of 0.74, whereas the machine learning model using tabular data and MRI images had a class accuracy of 0.61 and 0.53, respectively. The human experts had median accuracies of 0.61. Multimodal deep learning models could integrate the two types of information and predict severe hemorrhage cases. The model might assist human expert in the prediction of intraoperative hemorrhage in the case of placenta previa.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a prediction tool for intraoperative blood transfusion in brain tumor resection surgery: a retrospective analysis",
        "link": "https://www.nature.com/articles/s41598-023-44549-x",
        "publication_date": "13 Oct 2023",
        "abstract": "Early identification of a patient with a high risk of blood transfusion during brain tumor resection surgery is difficult but critical for implementing preoperative blood-saving strategies. This study aims to develop and validate a machine learning prediction tool for intraoperative blood transfusion in brain tumor resection surgery. A total of 541 patients who underwent brain tumor resection surgery in our hospital from January 2019 to December 2021 were retrospectively enrolled in this study. We incorporated demographics, preoperative comorbidities, and laboratory risk factors. Features were selected using the least absolute shrinkage and selection operator (LASSO). Eight machine learning algorithms were benchmarked to identify the best model to predict intraoperative blood transfusion. The prediction tool was established based on the best algorithm and evaluated with discriminative ability. The data were randomly split into training and test groups at a ratio of 7:3. LASSO identified seven preoperative relevant factors in the training group: hemoglobin, diameter, prothrombin time, white blood cell count (WBC), age, physical status of the American Society of Anesthesiologists (ASA) classification, and heart function. Logistic regression, linear discriminant analysis, supporter vector machine, and ranger all performed better in the eight machine learning algorithms with classification errors of 0.185, 0.193, 0.199, and 0.196, respectively. A nomogram was then established, and the model showed a better discrimination ability [0.817, 95% CI (0.739, 0.895)] than hemoglobin [0.663, 95% CI (0.557, 0.770)] alone in the test group (P = 0.000). Hemoglobin, diameter, prothrombin time, WBC, age, ASA status, and heart function are risk factors of intraoperative blood transfusion in brain tumor resection surgery. The prediction tool established using the logistic regression algorithm showed a good discriminative ability than hemoglobin alone for predicting intraoperative blood transfusion in brain tumor resection surgery.",
        "conclusions": "This study identified seven risk factors, namely preoperative HB, tumor diameter, PT, WBC, age, the physical status of the ASA classification, and heart function, that affect intraoperative blood transfusion during brain tumor resection surgery. Based on the seven indicators, a prediction tool was established, and this tool enables an accurate assessment of the probability of intraoperative blood transfusion during brain tumor resection surgery (Supplementary Information).",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Retest variability and patient reliability indices of quantitative fundus autofluorescence in age-related macular degeneration: a MACUSTAR study report",
        "link": "https://www.nature.com/articles/s41598-023-43417-y",
        "publication_date": "13 Oct 2023",
        "abstract": "This study aimed to determine the retest variability of quantitative fundus autofluorescence (QAF) in patients with and without age-related macular degeneration (AMD) and evaluate the predictive value of patient reliability indices on retest reliability. A total of 132 eyes from 68 patients were examined, including healthy individuals and those with various stages of AMD. Duplicate QAF imaging was conducted at baseline and 2 weeks later across six study sites. Intraclass correlation (ICC) analysis was used to evaluate the consistency of imaging, and mean opinion scores (MOS) of image quality were generated by two researchers. The contribution of MOS and other factors to retest variation was assessed using mixed-effect linear models. Additionally, a Random Forest Regressor was trained to evaluate the extent to which manual image grading of image quality could be replaced by automated assessment (inferred MOS). The results showed that ICC values were high for all QAF images, with slightly lower values in AMD-affected eyes. The average inter-day ICC was found to be 0.77 for QAF segments within the QAF8 ring and 0.74 for peripheral segments. Image quality was predicted with a mean absolute error of 0.27 on a 5-point scale, and of all evaluated reliability indices, MOS/inferred MOS proved most important. The findings suggest that QAF allows for reliable testing of autofluorescence levels at the posterior pole in patients with AMD in a multicenter, multioperator setting. Patient reliability indices could serve as eligibility criteria for clinical trials, helping identify patients with adequate retest reliability.",
        "conclusions": "In conclusion, QAF retest reliability for iAMD patients was good, higher for same day than different day repeats. Image quality, assessed by human or automated grading, is the major driver of retest variability. Based on our results we propose solutions for patient selection to augment retest reliability and pave the way for QAF inclusion in future interventional clinical trials.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Psoriasis severity classification based on adaptive multi-scale features for multi-severity disease",
        "link": "https://www.nature.com/articles/s41598-023-44478-9",
        "publication_date": "13 Oct 2023",
        "abstract": "Psoriasis is a skin disease that causes lesions of various sizes across the body and can persist for years with cyclic deterioration and improvement. During treatment, and a multiple-severity disease, with irregular severity within the observation area may be found. The current psoriasis evaluation is based on the subjective evaluation criteria of the clinician using the psoriasis area and severity index (PASI). We proposed a novel psoriasis evaluation method that detects representative regions as evaluation criteria, and extracts severity features to improve the evaluation performance of various types of psoriasis, including multiple-severity diseases. We generated multiple-severity disease images using CutMix and proposed a hierarchical multi-scale deformable attention module (MS-DAM) that can adaptively detect representative regions of irregular and complex patterns in multiple-severity disease analyses. EfficientNet B1 with MS-DAM exhibited the best classification performance with an F1-score of 0.93. Compared with the performance of the six existing self-attention methods, the proposed MS-DAM showed more than 5% higher accuracy than that of multiscale channel attention module (MS-CAM). Using the gradient-weighted activation mapping method, we confirmed that the proposed method works at par with human visual perception. We performed a more objective, effective, and accurate analysis of psoriasis severity using the proposed method.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An adaptive categorical effect size method based on intuitionistic meta fuzzy functions",
        "link": "https://www.nature.com/articles/s41598-023-44691-6",
        "publication_date": "13 Oct 2023",
        "abstract": "Error fetching abstract: 'NoneType' object has no attribute 'lower'",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Proteogenetic drug response profiling elucidates targetable vulnerabilities of myelofibrosis",
        "link": "https://www.nature.com/articles/s41467-023-42101-z",
        "publication_date": "12 Oct 2023",
        "abstract": "Myelofibrosis is a hematopoietic stem cell disorder belonging to the myeloproliferative neoplasms. Myelofibrosis patients frequently carry driver mutations in either JAK2 or Calreticulin (CALR) and have limited therapeutic options. Here, we integrate ex vivo drug response and proteotype analyses across myelofibrosis patient cohorts to discover targetable vulnerabilities and associated therapeutic strategies. Drug sensitivities of mutated and progenitor cells were measured in patient blood using high-content imaging and single-cell deep learning-based analyses. Integration with matched molecular profiling revealed three targetable vulnerabilities. First, CALR mutations drive BET and HDAC inhibitor sensitivity, particularly in the absence of high Ras pathway protein levels. Second, an MCM complex-high proliferative signature corresponds to advanced disease and sensitivity to drugs targeting pro-survival signaling and DNA replication. Third, homozygous CALR mutations result in high endoplasmic reticulum (ER) stress, responding to ER stressors and unfolded protein response inhibition. Overall, our integrated analyses provide a molecularly motivated roadmap for individualized myelofibrosis patient treatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Optimal view detection for ultrasound-guided supraclavicular block using deep learning approaches",
        "link": "https://www.nature.com/articles/s41598-023-44170-y",
        "publication_date": "11 Oct 2023",
        "abstract": "Successful ultrasound-guided supraclavicular block (SCB) requires the understanding of sonoanatomy and identification of the optimal view. Segmentation using a convolutional neural network (CNN) is limited in clearly determining the optimal view. The present study describes the development of a computer-aided diagnosis (CADx) system using a CNN that can determine the optimal view for complete SCB in real time. The aim of this study was the development of computer-aided diagnosis system that aid non-expert to determine the optimal view for complete supraclavicular block in real time. Ultrasound videos were retrospectively collected from 881 patients to develop the CADx system (600 to the training and validation set and 281 to the test set). The CADx system included classification and segmentation approaches, with Residual neural network (ResNet) and U-Net, respectively, applied as backbone networks. In the classification approach, an ablation study was performed to determine the optimal architecture and improve the performance of the model. In the segmentation approach, a cascade structure, in which U-Net is connected to ResNet, was implemented. The performance of the two approaches was evaluated based on a confusion matrix. Using the classification approach, ResNet34 and gated recurrent units with augmentation showed the highest performance, with average accuracy 0.901, precision 0.613, recall 0.757, f1-score 0.677 and AUROC 0.936. Using the segmentation approach, U-Net combined with ResNet34 and augmentation showed poorer performance than the classification approach. The CADx system described in this study showed high performance in determining the optimal view for SCB. This system could be expanded to include many anatomical regions and may have potential to aid clinicians in real-time settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prevalence and course of pregnancy symptoms using self-reported pregnancy app symptom tracker data",
        "link": "https://www.nature.com/articles/s41746-023-00935-3",
        "publication_date": "11 Oct 2023",
        "abstract": "During pregnancy, almost all women experience pregnancy-related symptoms. The relationship between symptoms and their association with pregnancy outcomes is not well understood. Many pregnancy apps allow pregnant women to track their symptoms. To date, the resulting data are primarily used from a commercial rather than a scientific perspective. In this work, we aim to examine symptom occurrence, course, and their correlation throughout pregnancy. Self-reported app data of a pregnancy symptom tracker is used. In this context, we present methods to handle noisy real-world app data from commercial applications to understand the trajectory of user and patient-reported data. We report real-world evidence from patient-reported outcomes that exceeds previous works: 1,549,186 tracked symptoms from 183,732 users of a smartphone pregnancy app symptom tracker are analyzed. The majority of users track symptoms on a single day. These data are generalizable to those users who use the tracker for at least 5 months. Week-by-week symptom report data are presented for each symptom. There are few or conflicting reports in the literature on the course of diarrhea, fatigue, headache, heartburn, and sleep problems. A peak in fatigue in the first trimester, a peak in headache reports around gestation week 15, and a steady increase in the reports of sleeping difficulty throughout pregnancy are found. Our work highlights the potential of secondary use of industry data. It reveals and clarifies several previously unknown or disputed symptom trajectories and relationships. Collaboration between academia and industry can help generate new scientific knowledge.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep convolutional neural network with fusion strategy for skin cancer recognition: model development and validation",
        "link": "https://www.nature.com/articles/s41598-023-42693-y",
        "publication_date": "10 Oct 2023",
        "abstract": "We aimed to develop an accurate and efficient skin cancer classification system using deep-learning technology with a relatively small dataset of clinical images. We proposed a novel skin cancer classification method, SkinFLNet, which utilizes model fusion and lifelong learning technologies. The SkinFLNet's deep convolutional neural networks were trained using a dataset of 1215 clinical images of skin tumors diagnosed at Taichung and Taipei Veterans General Hospital between 2015 and 2020. The dataset comprised five categories: benign nevus, seborrheic keratosis, basal cell carcinoma, squamous cell carcinoma, and malignant melanoma. The SkinFLNet's performance was evaluated using 463 clinical images between January and December 2021. SkinFLNet achieved an overall classification accuracy of 85%, precision of 85%, recall of 82%, F-score of 82%, sensitivity of 82%, and specificity of 93%, outperforming other deep convolutional neural network models. We also compared SkinFLNet's performance with that of three board-certified dermatologists, and the average overall performance of SkinFLNet was comparable to, or even better than, the dermatologists. Our study presents an efficient skin cancer classification system utilizing model fusion and lifelong learning technologies that can be trained on a relatively small dataset. This system can potentially improve skin cancer screening accuracy in clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Proteomics of CKD progression in the chronic renal insufficiency cohort",
        "link": "https://www.nature.com/articles/s41467-023-41642-7",
        "publication_date": "10 Oct 2023",
        "abstract": "Progression of chronic kidney disease (CKD) portends myriad complications, including kidney failure. In this study, we analyze associations of 4638 plasma proteins among 3235 participants of the Chronic Renal Insufficiency Cohort Study with the primary outcome of 50% decline in estimated glomerular filtration rate or kidney failure over 10 years. We validate key findings in the Atherosclerosis Risk in the Communities study. We identify 100 circulating proteins that are associated with the primary outcome after multivariable adjustment, using a Bonferroni statistical threshold of significance. Individual protein associations and biological pathway analyses highlight the roles of bone morphogenetic proteins, ephrin signaling, and prothrombin activation. A 65-protein risk model for the primary outcome has excellent discrimination (C-statistic[95%CI] 0.862 [0.835, 0.889]), and 14/65 proteins are druggable targets. Potentially causal associations for five proteins, to our knowledge not previously reported, are supported by Mendelian randomization: EGFL9, LRP-11, MXRA7, IL-1 sRII and ILT-2. Modifiable protein risk markers can guide therapeutic drug development aimed at slowing CKD progression.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "COVID-Net Biochem: an explainability-driven framework to building machine learning models for predicting survival and kidney injury of COVID-19 patients from clinical and biochemistry data",
        "link": "https://www.nature.com/articles/s41598-023-42203-0",
        "publication_date": "09 Oct 2023",
        "abstract": "Since the World Health Organization declared COVID-19 a pandemic in 2020, the global community has faced ongoing challenges in controlling and mitigating the transmission of the SARS-CoV-2 virus, as well as its evolving subvariants and recombinants. A significant challenge during the pandemic has not only been the accurate detection of positive cases but also the efficient prediction of risks associated with complications and patient survival probabilities. These tasks entail considerable clinical resource allocation and attention. In this study, we introduce COVID-Net Biochem, a versatile and explainable framework for constructing machine learning models. We apply this framework to predict COVID-19 patient survival and the likelihood of developing Acute Kidney Injury during hospitalization, utilizing clinical and biochemical data in a transparent, systematic approach. The proposed approach advances machine learning model design by seamlessly integrating domain expertise with explainability tools, enabling model decisions to be based on key biomarkers. This fosters a more transparent and interpretable decision-making process made by machines specifically for medical applications. More specifically, the framework comprises two phases: In the first phase, referred to as the “clinician-guided design” phase, the dataset is preprocessed using explainable AI and domain expert input. To better demonstrate this phase, we prepared a benchmark dataset of carefully curated clinical and biochemical markers based on clinician assessments for survival and kidney injury prediction in COVID-19 patients. This dataset was selected from a patient cohort of 1366 individuals at Stony Brook University. Moreover, we designed and trained a diverse collection of machine learning models, encompassing gradient-based boosting tree architectures and deep transformer architectures, specifically for survival and kidney injury prediction based on the selected markers. In the second phase, called the “explainability-driven design refinement” phase, the proposed framework employs explainability methods to not only gain a deeper understanding of each model’s decision-making process but also to identify the overall impact of individual clinical and biochemical markers for bias identification. In this context, we used the models constructed in the previous phase for the prediction task and analyzed the explainability outcomes alongside a clinician with over 8 years of experience to gain a deeper understanding of the clinical validity of the decisions made. The explainability-driven insights obtained, in conjunction with the associated clinical feedback, are then utilized to guide and refine the training policies and architectural design iteratively. This process aims to enhance not only the prediction performance but also the clinical validity and trustworthiness of the final machine learning models. Employing the proposed explainability-driven framework, we attained 93.55% accuracy in survival prediction and 88.05% accuracy in predicting kidney injury complications. The models have been made available through an open-source platform. Although not a production-ready solution, this study aims to serve as a catalyst for clinical scientists, machine learning researchers, and citizen scientists to develop innovative and trustworthy clinical decision support solutions, ultimately assisting clinicians worldwide in managing pandemic outcomes.",
        "conclusions": "In this work, we presented an explainability-driven framework for developing transparent machine learning models that utilize clinically relevant markers for prediction. As a proof of concept, we applied this framework to predict survival and acute kidney injury during the hospitalization of COVID-19 patients. Experimental results demonstrate that the constructed machine learning models were not only able to achieve high predictive performance but also relied on clinically-sound clinical and biochemical markers in their decision-making processes. In this context, we provided a thorough evaluation of the models’ accuracy, recall, precision, F1 score, and confusion matrix using a benchmark dataset. Additionally, we interpreted the models’ decision-making process employing quantitative explainability techniques via GSInquire. Ultimately, we revealed that the model considers acute kidney injury as the primary factor in determining the survival likelihood of COVID-19 patients and relies on Creatinine biochemical markers as the principal factor for assessing the risk of developing kidney injury, which aligns with clinical interpretation.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Partner relationships, hopelessness, and health status strongly predict maternal well-being: an approach using light gradient boosting machine",
        "link": "https://www.nature.com/articles/s41598-023-44410-1",
        "publication_date": "09 Oct 2023",
        "abstract": "No recent study has explicitly focused on predicting the well-being of pregnant women. This study used data from an extensive online survey in Japan to examine the predictors of the subjective well-being of pregnant women. We developed and validated a light Gradient Boosting Machine (lightGBM) model using data from 400 pregnant women in 2020 to identify three factors that predict subjective well-being. The results confirmed that the model could predict subjective well-being in pregnant women with 84% accuracy. New variables that contributed significantly to this prediction were \"partner help\", \"hopelessness,\" and \"health status\". A new lightGBM model was built with these three factors, trained and validated using data from 400 pregnant women in 2020, and predicted using data from 1791 pregnant women in 2021, with an accuracy of 88%. These factors were also significant risk factors for subjective well-being in the regression analysis adjusted for maternal age, region, parity, education level, and the presence of mental illness. Mediation analysis, with “hopelessness” as the mediator, showed that both “partner help” and “health status” directly and indirectly affected the outcome.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Rapid discovery of high-affinity antibodies via massively parallel sequencing, ribosome display and affinity screening",
        "link": "https://www.nature.com/articles/s41551-023-01093-3",
        "publication_date": "09 Oct 2023",
        "abstract": "Developing therapeutic antibodies is laborious and costly. Here we report a method for antibody discovery that leverages the Illumina HiSeq platform to, within 3 days, screen in the order of 108 antibody–antigen interactions. The method, which we named ‘deep screening’, involves the clustering and sequencing of antibody libraries, the conversion of the DNA clusters into complementary RNA clusters covalently linked to the instrument’s flow-cell surface on the same location, the in situ translation of the clusters into antibodies tethered via ribosome display, and their screening via fluorescently labelled antigens. By using deep screening, we discovered low-nanomolar nanobodies to a model antigen using 4 × 106 unique variants from yeast-display-enriched libraries, and high-picomolar single-chain antibody fragment leads for human interleukin-7 directly from unselected synthetic repertoires. We also leveraged deep screening of a library of 2.4 × 105 sequences of the third complementarity-determining region of the heavy chain of an anti-human epidermal growth factor receptor 2 (HER2) antibody as input for a large language model that generated new single-chain antibody fragment sequences with higher affinity for HER2 than those in the original library.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "ctDNA response after pembrolizumab in non-small cell lung cancer: phase 2 adaptive trial results",
        "link": "https://www.nature.com/articles/s41591-023-02598-9",
        "publication_date": "09 Oct 2023",
        "abstract": "Circulating tumor DNA (ctDNA) has shown promise in capturing primary resistance to immunotherapy. BR.36 is a multi-center, randomized, ctDNA-directed, phase 2 trial of molecular response-adaptive immuno-chemotherapy for patients with lung cancer. In the first of two independent stages, 50 patients with advanced non-small cell lung cancer received pembrolizumab as standard of care. The primary objectives of stage 1 were to ascertain ctDNA response and determine optimal timing and concordance with radiologic Response Evaluation Criteria in Solid Tumors (RECIST) response. Secondary endpoints included the evaluation of time to ctDNA response and correlation with progression-free and overall survival. Maximal mutant allele fraction clearance at the third cycle of pembrolizumab signified molecular response (mR). The trial met its primary endpoint, with a sensitivity of ctDNA response for RECIST response of 82% (90% confidence interval (CI): 52–97%) and a specificity of 75% (90% CI: 56.5–88.5%). Median time to ctDNA response was 2.1 months (90% CI: 1.5–2.6), and patients with mR attained longer progression-free survival (5.03 months versus 2.6 months) and overall survival (not reached versus 7.23 months). These findings are incorporated into the ctDNA-driven interventional molecular response-adaptive second stage of the BR.36 trial in which patients at risk of progression are randomized to treatment intensification or continuation of therapy. ClinicalTrials.gov ID: NCT04093167.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Association of graph-based spatial features with overall survival status of glioblastoma patients",
        "link": "https://www.nature.com/articles/s41598-023-44353-7",
        "publication_date": "09 Oct 2023",
        "abstract": "Glioblastoma is the most common malignant brain tumor with less than 15 months median survival. To aid prognosis, there is a need for decision tools that leverage diagnostic modalities such as MRI to inform survival. In this study, we examine higher-order spatial proximity characteristics from habitats and propose two graph-based methods (minimum spanning tree and graph run-length matrix) to characterize spatial heterogeneity over tumor MRI-derived intensity habitats and assess their relationships with overall survival as well as the immune signature status of patients with glioblastoma. A data set of 74 patients was studied based on the availability of post-contrast T1-weighted and T2-weighted fluid attenuated inversion recovery (FLAIR) image data in The Cancer Image Archive (TCIA). We assessed the predictive value of MST- and GRLM-derived features from 2D images for prediction of 12-month survival status and immune signature status of patients with glioblastoma via a receiver operating characteristic curve analysis. For 12-month survival prediction using MST-based method, sensitivity and specificity were 0.82 and 0.79 respectively. For GRLM-based method, sensitivity and specificity were 0.73 and 0.77 respectively. For immune status, sensitivity and specificity were 0.91 and 0.69, respectively, for the GRLM-based method with an immune effector. Our results show that the proposed MST- and GRLM-derived features are predictive of 12-month survival status as well as the immune signature status of patients with glioblastoma. To our knowledge, this is the first application of MST- and GRLM-based proximity analyses for the study of radiologically-defined tumor habitats in glioblastoma.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Exploring the complex spectrum of dominance and recessiveness in genetic cardiomyopathies",
        "link": "https://www.nature.com/articles/s44161-023-00346-3",
        "publication_date": "09 Oct 2023",
        "abstract": "Discrete categorization of Mendelian disease genes into dominant and recessive models often oversimplifies their underlying genetic architecture. Cardiomyopathies (CMs) are genetic diseases with complex etiologies for which an increasing number of recessive associations have recently been proposed. Here, we comprehensively analyze all published evidence pertaining to biallelic variation associated with CM phenotypes to identify high-confidence recessive genes and explore the spectrum of monoallelic and biallelic variant effects in established recessive and dominant disease genes. We classify 18 genes with robust recessive association with CMs, largely characterized by dilated phenotypes, early disease onset and severe outcomes. Several of these genes have monoallelic association with disease outcomes and cardiac traits in the UK Biobank, including LMOD2 and ALPK3 with dilated and hypertrophic CM, respectively. Our data provide insights into the complex spectrum of dominance and recessiveness in genetic heart disease and demonstrate how such approaches enable the discovery of unexplored genetic associations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Weight-cycling over 6 years is associated with pain, physical function and depression in the Osteoarthritis Initiative cohort",
        "link": "https://www.nature.com/articles/s41598-023-44052-3",
        "publication_date": "09 Oct 2023",
        "abstract": "Body weight significantly impacts health and quality of life, and is a leading risk factor for the development of knee osteoarthritis (OA). Weight cycling may have more negative health consequences compared to steady high or low weight. Using the Osteoarthritis Initiative dataset, we investigated the effects of weight cycling on physical function, quality of life, and depression over 72-months compared to stable or unidirectional body weight trajectories. Participants (n = 731) had knee OA and were classified as: (1) stable-low (BMI < 25), (2) stable-overweight (BMI = 25–29.9), and (3) stable-obese (BMI ≥ 30); (4) steady-weight-loss; (5) steady-weight-gain (weight loss/gain ≥ 2.2 kg every 2-years); (6) gain–loss–gain weight cycling, and (7) loss–gain–loss weight cycling (weight loss/gain with return to baseline), based on bi-annual assessments. We compared Knee Injury and Osteoarthritis Outcome Knee-Related Quality of Life, Function in Sports and Recreation, Physical Activity in the Elderly, Short Form SF-12, repeated chair rise, 20-m gait speed, and Center for Epidemiological Studies Depression using repeated-measures ANOVA. The steady weight loss group demonstrated the worst pain, physical function, and depressive symptoms over time (p’s < 0.05). More research is needed to confirm these findings, and elucidate the mechanisms by which steady weight loss is associated with functional decline in knee OA.",
        "conclusions": "In this cohort of middle to older-aged adults with knee OA, we did not detect significantly worse effects of weight cycling (gain–loss–gain or loss–gain–loss) on functional outcomes, quality of life or depressive symptoms compared to stable or unidirectional weight change trajectories. Steady weight loss was associated with worse outcomes and highest depressive symptomatology over a 72-month follow-up compared to stable weight, unidirectional or the two weight cycling patterns studied here. Consistent participation in muscle strengthening activities, especially among individuals with steady weight loss alone or in combination with strategies to improve psychological wellbeing may help counteract functional decline.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Qualitative and quantitative comparison of two semi-manual retinal vascular density analyzing methods on optical coherence tomography angiography images of healthy individuals",
        "link": "https://www.nature.com/articles/s41598-023-44234-z",
        "publication_date": "09 Oct 2023",
        "abstract": "The aim of this study was to evaluate qualitative and quantitative differences in vascular density analysis of an established and a novel alternative for post-processing on optical coherence tomography angiography (OCTA) images in healthy individuals. OCTA examinations of 38 subjects were performed. After extracting the images, two semi-manual post-processing techniques, the already established Mexican hat filtering (MHF) and an alternative, the Shanbhag thresholding (ST) were applied. We assessed Vessel Density (VD), Skeleton Density (SkD) and Vessel Diameter Index (VDI). We analyzed the results in order to establish similarities or potentially relevant differences. Regarding SkD and VD, MHF generally gave higher values than ST. Simultaneously, mean values were also predominantly higher by MHF; however, standard deviations (SD) were higher by ST (range [mean ± SD]: 0.054 ± 0.038 to 0.134 ± 0.01 and 0.134 ± 0.095 to 0.362 ± 0.028 vs 0.012 ± 0.014 to 0.087 ± 0.03 and 0.039 ± 0.047 to 0.4 ± 0.095 for SkD and VD with MHF vs SkD and VD with ST, respectively). Values of VDI were considerably higher with ST than with MHF, while standard deviation was still significantly higher with ST (range [mean ± SD]: 2.459 ± 0.144 to 2.71 ± 0.084 and 2.983 ± 0.929 to 5.19 ± 1.064 for VDI with MHF and ST, respectively). The noise level reduction of the two methods were almost identical (noise levels: 65.8% with MHT and 65.24% with ST). Using MHF, the vascular network gets more fragmented by an average of 40% compared to ST. Both methods allow the segmentation of the vascular network and the examination of vascular density parameters, but they produce largely inconsistent results. To determine if these inconsistent results are clinically meaningful, and which method is more suitable for clinical use, our results provide further evidence that detailed understanding of the image analysis method is essential for reliable decision making for patients with retinal pathology. For longitudinal monitoring, use of the same image processing method is recommended.",
        "conclusions": "In this study, we processed the same OCTA images with two different methods. Both Mexican hat filtering and Shanbhag thresholding allowed the investigation of VD, SkD, and VDI in the superficial vascular layer in all sectors of the macula, with numerous differences. Noise level reduction was almost identical, the Shanbhag method broke the vascular network into fewer pieces, and both methods showed different artefacts. Regarding the examined vascular parameters, the two methods produced largely inconsistent results, meaning that they cannot be used interchangeably. This is in line with previous similar studies, that concluded that different VAD assessment methods are not cross-comparable, and even a minor change in processing parameters can lead to different final results. Further studies are required to determine if these inconsistent results are clinically meaningful and which algorithm is superior as there is no gold standard for vascular density analysis and the actual density is not known. For longitudinal monitoring purposes, use of the same image processing method is recommended, and an expert consensus is required to determine the best processing algorithm. Our study provides a detailed exploration of the Shanbhag thresholding technique, which is not commonly employed in OCTA post-processing in ophthalmology, potentially laying the groundwork for future studies in this area.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of motor progression in Parkinson’s disease using wearable sensors and machine learning",
        "link": "https://www.nature.com/articles/s41531-023-00581-2",
        "publication_date": "07 Oct 2023",
        "abstract": "Wearable devices offer the potential to track motor symptoms in neurological disorders. Kinematic data used together with machine learning algorithms can accurately identify people living with movement disorders and the severity of their motor symptoms. In this study we aimed to establish whether a combination of wearable sensor data and machine learning algorithms with automatic feature selection can estimate the clinical rating scale and whether it is possible to monitor the motor symptom progression longitudinally, for people with Parkinson’s Disease. Seventy-four patients visited the lab seven times at 3-month intervals. Their walking (2-minutes) and postural sway (30-seconds,eyes-closed) were recorded using six Inertial Measurement Unit sensors. Simple linear regression and Random Forest algorithms were utilised together with different routines of automatic feature selection or factorisation, resulting in seven different machine learning algorithms to estimate the clinical rating scale (Movement Disorder Society- Unified Parkinson’s Disease Rating Scale part III; MDS-UPDRS-III). Twenty-nine features were found to significantly progress with time at group level. The Random Forest model revealed the most accurate estimation of the MDS-UPDRS-III among the seven models. The model estimations detected a statistically significant progression of the motor symptoms within 15 months when compared to the first visit, whereas the MDS-UPDRS-III did not capture any change. Wearable sensors and machine learning can track the motor symptom progression in people with PD better than the conventionally used clinical rating scales. The methods described in this study can be utilised complimentary to the clinical rating scales to improve the diagnostic and prognostic accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The impact of imputation quality on machine learning classifiers for datasets with missing values",
        "link": "https://www.nature.com/articles/s43856-023-00356-z",
        "publication_date": "06 Oct 2023",
        "abstract": "Classifying samples in incomplete datasets is a common aim for machine learning practitioners, but is non-trivial. Missing data is found in most real-world datasets and these missing values are typically imputed using established methods, followed by classification of the now complete samples. The focus of the machine learning researcher is to optimise the classifier’s performance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning and clustering approaches for dental implant size classification based on periapical radiographs",
        "link": "https://www.nature.com/articles/s41598-023-42385-7",
        "publication_date": "06 Oct 2023",
        "abstract": "This study investigated two artificial intelligence (AI) methods for automatically classifying dental implant diameter and length based on periapical radiographs. The first method, deep learning (DL), involved utilizing the pre-trained VGG16 model and adjusting the fine-tuning degree to analyze image data obtained from periapical radiographs. The second method, clustering analysis, was accomplished by analyzing the implant-specific feature vector derived from three key points coordinates of the dental implant using the k-means++ algorithm and adjusting the weight of the feature vector. DL and clustering model classified dental implant size into nine groups. The performance metrics of AI models were accuracy, sensitivity, specificity, F1-score, positive predictive value, negative predictive value, and area under the receiver operating characteristic curve (AUC-ROC). The final DL model yielded performances above 0.994, 0.950, 0.994, 0.974, 0.952, 0.994, and 0.975, respectively, and the final clustering model yielded performances above 0.983, 0.900, 0.988, 0.923, 0.909, 0.988, and 0.947, respectively. When comparing the AI model before tuning and the final AI model, statistically significant performance improvements were observed in six out of nine groups for DL models and four out of nine groups for clustering models based on AUC-ROC. Two AI models showed reliable classification performances. For clinical applications, AI models require validation on various multicenter data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Re-evaluation of publicly available gene-expression databases using machine-learning yields a maximum prognostic power in breast cancer",
        "link": "https://www.nature.com/articles/s41598-023-41090-9",
        "publication_date": "05 Oct 2023",
        "abstract": "Gene expression signatures refer to patterns of gene activities and are used to classify different types of cancer, determine prognosis, and guide treatment decisions. Advancements in high-throughput technology and machine learning have led to improvements to predict a patient’s prognosis for different cancer phenotypes. However, computational methods for analyzing signatures have not been used to evaluate their prognostic power. Contention remains on the utility of gene expression signatures for prognosis. The prevalent approaches include random signatures, expert knowledge, and machine learning to construct an improved signature. We unify these approaches to evaluate their prognostic power. Re-evaluation of publicly available gene-expression data from 8 databases with 9 machine-learning models revealed previously unreported results. Gene-expression signatures are confirmed to be useful in predicting a patient’s prognosis. Convergent evidence from \\(\\approx\\) 10,000 signatures implicates a maximum prognostic power. By calculating the concordance index, which measures how well patients with different prognoses can be discriminated, we show that a signature can correctly discriminate patients’ prognoses no more than 80% of the time. Additionally, we show that more than 50% of the potentially available information is still missing at this value. We surmise that an accurate prognosis must incorporate molecular, clinical, histological, and other complementary factors.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A pilot study of implication of machine learning for relapse prediction after allogeneic stem cell transplantation in adults with Ph-positive acute lymphoblastic leukemia",
        "link": "https://www.nature.com/articles/s41598-023-43950-w",
        "publication_date": "05 Oct 2023",
        "abstract": "The posttransplant relapse in Ph-positive ALL increases the risk of death. There is an unmet need for instruments to predict the risk of relapse and plan prophylaxis. In this study, we analyzed posttransplant data by machine learning algorithms. Seventy-four Ph-positive ALL patients with a median age of 30 (range 18–55) years who previously underwent allo-HSCT, were retrospectively enrolled. Ninety-three percent of patients received prophylactic/preemptive TKIs after allo-HSCT. The values of the BCR::ABL1 level at serial assessments and over variables were collected in specified intervals after allo-HSCT. They were used to model relapse risk with several machine-learning approaches. GBM proved superior to the other algorithms and provided a maximal AUC score of 0.91. BCR::ABL1 level before and after allo-HSCT, prediction moment, and chronic GvHD had the highest value in the model. It was shown that after Day + 100, both error rates do not exceed 22%, while before D + 100, the model fails to make accurate predictions. As a result, we determined BCR::ABL1 levels at which the relapse risk remains low. Thus, the current BCR::ABL1 level less than 0.06% in patients with chronic GvHD predicts low risk of relapse. At the same time, patients without chronic GVHD after allo-HSCT should be classified as high risk with any level of BCR::ABL1. GBM model with posttransplant laboratory values of BCR::ABL1 provides a high prediction of relapse after allo-HSCT in the era of TKIs prophylaxis. Validation of this approach is warranted.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Treatment effect heterogeneity following type 2 diabetes treatment with GLP1-receptor agonists and SGLT2-inhibitors: a systematic review",
        "link": "https://www.nature.com/articles/s43856-023-00359-w",
        "publication_date": "05 Oct 2023",
        "abstract": "A precision medicine approach in type 2 diabetes requires the identification of clinical and biological features that are reproducibly associated with differences in clinical outcomes with specific anti-hyperglycaemic therapies. Robust evidence of such treatment effect heterogeneity could support more individualized clinical decisions on optimal type 2 diabetes therapy.",
        "conclusions": "There is limited evidence of treatment effect heterogeneity with SGLT2i and GLP1-RA for glycaemic, cardiovascular, and renal outcomes in people with type 2 diabetes. This lack of evidence likely reflects the methodological limitations of the current evidence base. Robust future studies to fill the research gaps identified in this review are required for precision medicine in type 2 diabetes to translate to clinical care.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Scalable Infrastructure Supporting Reproducible Nationwide Healthcare Data Analysis toward FAIR Stewardship",
        "link": "https://www.nature.com/articles/s41597-023-02580-7",
        "publication_date": "04 Oct 2023",
        "abstract": "Transparent and FAIR disclosure of meta-information about healthcare data and infrastructure is essential but has not been well publicized. In this paper, we provide a transparent disclosure of the process of standardizing a common data model and developing a national data infrastructure using national claims data. We established an Observational Medical Outcome Partnership (OMOP) common data model database for national claims data of the Health Insurance Review and Assessment Service of South Korea. To introduce a data openness policy, we built a distributed data analysis environment and released metadata based on the FAIR principle. A total of 10,098,730,241 claims and 56,579,726 patients’ data were converted as OMOP common data model. We also built an analytics environment for distributed research and made the metadata publicly available. Disclosure of this infrastructure to researchers will help to eliminate information inequality and contribute to the generation of high-quality medical evidence.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Physical and chemical characterizations of a reference e-cigarette used in animal testing",
        "link": "https://www.nature.com/articles/s41598-023-43733-3",
        "publication_date": "03 Oct 2023",
        "abstract": "A minimal necessary condition for preclinical studies to contribute to risk assessments of e-cigarettes (ECs) is the ability to expose laboratory animals to an appropriate dosage of aerosols. In this study, we examined the fulfilment of this essential consistency condition for the ECX-Joyetech E-Vic Mini (ECX), a piece of computerized exposure equipment manufactured by SCIREQ, which has been employed by numerous in vivo testing. We began by calibrating the customary Evic VTC mini device mod and the 4 coils available, reproducing in the laboratory the operation of the ECX in the power-control and temperature-control modes, using puffing parameters recommended by its documentation. We then conducted the following tests for each coil: (1) verifying whether the generated aerosols satisfy an optimal operational regime, free from overheating, as determined by a linear relation between the mass of vaporized e-liquid vs. supplied power and (2) obtaining the mean yields of aldehydes for each of the tested power settings and coils. The results of these tests show that, under the main conditions used in in vivo testing, the ECX equipment fails to comply with these consistency requirements, especially for coils with low subohm resistance, a shortcoming that can be corrected by applying much larger airflows for these coils. Therefore, the outcomes of preclinical studies using the ECX equipment should be examined with great scepticism and subjected to further testing.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying potential biomarkers of idiopathic pulmonary fibrosis through machine learning analysis",
        "link": "https://www.nature.com/articles/s41598-023-43834-z",
        "publication_date": "02 Oct 2023",
        "abstract": "Idiopathic pulmonary fibrosis (IPF) is the most common and serious type of idiopathic interstitial pneumonia, characterized by chronic, progressive, and low survival rates, while unknown disease etiology. Until recently, patients with idiopathic pulmonary fibrosis have a poor prognosis, high mortality, and limited treatment options, due to the lack of effective early diagnostic and prognostic tools. Therefore, we aimed to identify biomarkers for idiopathic pulmonary fibrosis based on multiple machine-learning approaches and to evaluate the role of immune infiltration in the disease. The gene expression profile and its corresponding clinical data of idiopathic pulmonary fibrosis patients were downloaded from Gene Expression Omnibus (GEO) database. Next, the differentially expressed genes (DEGs) with the threshold of FDR < 0.05 and |log2 foldchange (FC)| > 0.585 were analyzed via R package “DESeq2” and GO enrichment and KEGG pathways were run in R software. Then, least absolute shrinkage and selection operator (LASSO) logistic regression, support vector machine-recursive feature elimination (SVM-RFE) and random forest (RF) algorithms were combined to screen the key potential biomarkers of idiopathic pulmonary fibrosis. The diagnostic performance of these biomarkers was evaluated through receiver operating characteristic (ROC) curves. Moreover, the CIBERSORT algorithm was employed to assess the infiltration of immune cells and the relationship between the infiltrating immune cells and the biomarkers. Finally, we sought to understand the potential pathogenic role of the biomarker (SLAIN1) in idiopathic pulmonary fibrosis using a mouse model and cellular model. A total of 3658 differentially expressed genes of idiopathic pulmonary fibrosis were identified, including 2359 upregulated genes and 1299 downregulated genes. FHL2, HPCAL1, RNF182, and SLAIN1 were identified as biomarkers of idiopathic pulmonary fibrosis using LASSO logistic regression, RF, and SVM-RFE algorithms. The ROC curves confirmed the predictive accuracy of these biomarkers both in the training set and test set. Immune cell infiltration analysis suggested that patients with idiopathic pulmonary fibrosis had a higher level of B cells memory, Plasma cells, T cells CD8, T cells follicular helper, T cells regulatory (Tregs), Macrophages M0, and Mast cells resting compared with the control group. Correlation analysis demonstrated that FHL2 was significantly associated with the infiltrating immune cells. qPCR and western blotting analysis suggested that SLAIN1 might be a signature for the diagnosis of idiopathic pulmonary fibrosis. In this study, we identified four potential biomarkers (FHL2, HPCAL1, RNF182, and SLAIN1) and evaluated the potential pathogenic role of SLAIN1 in idiopathic pulmonary fibrosis. These findings may have great significance in guiding the understanding of disease mechanisms and potential therapeutic targets in idiopathic pulmonary fibrosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep neural network for real-time optoacoustic image reconstruction with adjustable speed of sound",
        "link": "https://www.nature.com/articles/s42256-023-00724-3",
        "publication_date": "02 Oct 2023",
        "abstract": "Multispectral optoacoustic tomography is a high-resolution functional imaging modality that can non-invasively access a broad range of pathophysiological phenomena. Real-time imaging would enable translation of multispectral optoacoustic tomography into clinical imaging, visualize dynamic pathophysiological changes associated with disease progression and enable in situ diagnoses. Model-based reconstruction affords state-of-the-art optoacoustic images but cannot be used for real-time imaging. On the other hand, deep learning enables fast reconstruction of optoacoustic images, but the lack of experimental ground-truth training data leads to reduced image quality for in vivo scans. In this work we achieve accurate optoacoustic image reconstruction in 31 ms per image for arbitrary (experimental) input data by expressing model-based reconstruction with a deep neural network. The proposed deep learning framework, DeepMB, generalizes to experimental test data through training on optoacoustic signals synthesized from real-world images and ground truth optoacoustic images generated by model-based reconstruction. Based on qualitative and quantitative evaluation on a diverse dataset of in vivo images, we show that DeepMB reconstructs images approximately 1,000-times faster than the iterative model-based reference method while affording near-identical image qualities. Accurate and real-time image reconstructions with DeepMB can enable full access to the high-resolution and multispectral contrast of handheld optoacoustic tomography, thus adoption into clinical routines.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Top-down holmium laser enucleation of the prostate (HoLEP) versus traditional HoLEP for the treatment of benign prostatic hyperplasia (BPH): 1-year outcomes of a randomized controlled trial",
        "link": "https://www.nature.com/articles/s41391-023-00730-x",
        "publication_date": "02 Oct 2023",
        "abstract": "The top-down holmium laser enucleation of the prostate (HoLEP) technique recently emerged as a safe and effective modification of traditional HoLEP. In our randomized controlled trial, we compared intraoperative and postoperative outcomes of traditional and top-down HoLEP for the treatment of benign prostatic hyperplasia (BPH) in patients with a prostate size ≥80 g.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "ESX1 gene as a potential candidate responsible for male infertility in nonobstructive azoospermia",
        "link": "https://www.nature.com/articles/s41598-023-43854-9",
        "publication_date": "02 Oct 2023",
        "abstract": "Infertility is a problem that affects approximately 15% of couples, and male infertility is responsible for 40–50% of these cases. The cause of male infertility is still poorly diagnosed and treated. One of the prominent causes of male infertility is disturbed spermatogenesis, which can lead to nonobstructive azoospermia (NOA). Whole-genome sequencing (WGS) allows us to identify novel rare variants in potentially NOA-associated genes, among others, in the ESX1 gene. The aim of this study was to activate the ESX1 gene using CRISPRa technology in human germ cells (testicular seminoma cells—TCam-2). Successful activation of the ESX1 gene in TCam-2 cells using the CRISPRa system was achieved, and the expression level of the ESX1 gene was significantly higher in modified TCam-2 cells than in WT cells or the negative control with nontargeted gRNA (p < 0.01). Using RNA-seq, a network of over 50 genes potentially regulated by the ESX1 gene was determined. Finally, 6 genes, NANOG, CXCR4, RPS6KA5, CCND1, PDE1C, and LINC00662, participating in cell proliferation and differentiation were verified in azoospermic patients with and without a mutation in the ESX1 gene as well as in men with normal spermatogenesis, where inverse correlations in the expression levels of the observed genes were noted.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep-learning pipeline to diagnose pediatric intussusception and assess severity during ultrasound scanning: a multicenter retrospective-prospective study",
        "link": "https://www.nature.com/articles/s41746-023-00930-8",
        "publication_date": "30 Sept 2023",
        "abstract": "Ileocolic intussusception is one of the common acute abdomens in children and is first diagnosed urgently using ultrasound. Manual diagnosis requires extensive experience and skill, and identifying surgical indications in assessing the disease severity is more challenging. We aimed to develop a real-time lesion visualization deep-learning pipeline to solve this problem. This multicenter retrospective-prospective study used 14,085 images in 8736 consecutive patients (median age, eight months) with ileocolic intussusception who underwent ultrasound at six hospitals to train, validate, and test the deep-learning pipeline. Subsequently, the algorithm was validated in an internal image test set and an external video dataset. Furthermore, the performances of junior, intermediate, senior, and junior sonographers with AI-assistance were prospectively compared in 242 volunteers using the DeLong test. This tool recognized 1,086 images with three ileocolic intussusception signs with an average of the area under the receiver operating characteristic curve (average-AUC) of 0.972. It diagnosed 184 patients with no intussusception, nonsurgical intussusception, and surgical intussusception in 184 ultrasound videos with an average-AUC of 0.956. In the prospective pilot study using 242 volunteers, junior sonographers’ performances were significantly improved with AI-assistance (average-AUC: 0.966 vs. 0.857, P < 0.001; median scanning-time: 9.46 min vs. 3.66 min, P < 0.001), which were comparable to those of senior sonographers (average-AUC: 0.966 vs. 0.973, P = 0.600). Thus, here, we report that the deep-learning pipeline that guides lesions in real-time and is interpretable during ultrasound scanning could assist sonographers in improving the accuracy and efficiency of diagnosing intussusception and identifying surgical indications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A multimodal radiomic machine learning approach to predict the LCK expression and clinical prognosis in high-grade serous ovarian cancer",
        "link": "https://www.nature.com/articles/s41598-023-43543-7",
        "publication_date": "29 Sept 2023",
        "abstract": "We developed and validated a multimodal radiomic machine learning approach to noninvasively predict the expression of lymphocyte cell-specific protein-tyrosine kinase (LCK) expression and clinical prognosis of patients with high-grade serous ovarian cancer (HGSOC). We analyzed gene enrichment using 343 HGSOC cases extracted from The Cancer Genome Atlas. The corresponding biomedical computed tomography images accessed from The Cancer Imaging Archive were used to construct the radiomic signature (Radscore). A radiomic nomogram was built by combining the Radscore and clinical and genetic information based on multimodal analysis. We compared the model performances and clinical practicability via area under the curve (AUC), Kaplan–Meier survival, and decision curve analyses. LCK mRNA expression was associated with the prognosis of HGSOC patients, serving as a significant prognostic marker of the immune response and immune cells infiltration. Six radiomic characteristics were chosen to predict the expression of LCK and overall survival (OS) in HGSOC patients. The logistic regression (LR) radiomic model exhibited slightly better predictive abilities than the support vector machine model, as assessed by comparing combined results. The performance of the LR radiomic model for predicting the level of LCK expression with five-fold cross-validation achieved AUCs of 0.879 and 0.834, respectively, in the training and validation sets. Decision curve analysis at 60 months demonstrated the high clinical utility of our model within thresholds of 0.25 and 0.7. The radiomic nomograms were robust and displayed effective calibration. Abnormally high expression of LCK in HGSOC patients is significantly correlated with the tumor immune microenvironment and can be used as an essential indicator for predicting the prognosis of HGSOC. The multimodal radiomic machine learning approach can capture the heterogeneity of HGSOC, noninvasively predict the expression of LCK, and replace LCK for predictive analysis, providing a new idea for predicting the clinical prognosis of HGSOC and formulating a personalized treatment plan.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Müller matrix polarimetry for pancreatic tissue characterization",
        "link": "https://www.nature.com/articles/s41598-023-43195-7",
        "publication_date": "29 Sept 2023",
        "abstract": "Polarimetry is an optical characterization technique capable of analyzing the polarization state of light reflected by materials and biological samples. In this study, we investigate the potential of Müller matrix polarimetry (MMP) to analyze fresh pancreatic tissue samples. Due to its highly heterogeneous appearance, pancreatic tissue type differentiation is a complex task. Furthermore, its challenging location in the body makes creating direct imaging difficult. However, accurate and reliable methods for diagnosing pancreatic diseases are critical for improving patient outcomes. To this end, we measured the Müller matrices of ex-vivo unfixed human pancreatic tissue and leverage the feature-learning capabilities of a machine-learning model to derive an optimized data representation that minimizes normal-abnormal classification error. We show experimentally that our approach accurately differentiates between normal and abnormal pancreatic tissue. This is, to our knowledge, the first study to use ex-vivo unfixed human pancreatic tissue combined with feature-learning from raw Müller matrix readings for this purpose.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multimodal analysis of cell-free DNA whole-methylome sequencing for cancer detection and localization",
        "link": "https://www.nature.com/articles/s41467-023-41774-w",
        "publication_date": "27 Sept 2023",
        "abstract": "Multimodal epigenetic characterization of cell-free DNA (cfDNA) could improve the performance of blood-based early cancer detection. However, integrative profiling of cfDNA methylome and fragmentome has been technologically challenging. Here, we adapt an enzyme-mediated methylation sequencing method for comprehensive analysis of genome-wide cfDNA methylation, fragmentation, and copy number alteration (CNA) characteristics for enhanced cancer detection. We apply this method to plasma samples of 497 healthy controls and 780 patients of seven cancer types and develop an ensemble classifier by incorporating methylation, fragmentation, and CNA features. In the test cohort, our approach achieves an area under the curve value of 0.966 for overall cancer detection. Detection sensitivity for early-stage patients achieves 73% at 99% specificity. Finally, we demonstrate the feasibility to accurately localize the origin of cancer signals with combined methylation and fragmentation profiling of tissue-specific accessible chromatin regions. Overall, this proof-of-concept study provides a technical platform to utilize multimodal cfDNA features for improved cancer detection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Biopsy-free AI-aided precision MRI assessment in prediction of prostate cancer biochemical recurrence",
        "link": "https://www.nature.com/articles/s41416-023-02441-5",
        "publication_date": "27 Sept 2023",
        "abstract": "To investigate the predictive ability of high-throughput MRI with deep survival networks for biochemical recurrence (BCR) of prostate cancer (PCa) after prostatectomy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prehospital predicting factors using a decision tree model for patients with witnessed out-of-hospital cardiac arrest and an initial shockable rhythm",
        "link": "https://www.nature.com/articles/s41598-023-43106-w",
        "publication_date": "27 Sept 2023",
        "abstract": "The effect of prehospital factors on favorable neurological outcomes remains unclear in patients with witnessed out-of-hospital cardiac arrest (OHCA) and a shockable rhythm. We developed a decision tree model for these patients by using prehospital factors. Using a nationwide OHCA registry database between 2005 and 2020, we retrospectively analyzed a cohort of 1,930,273 patients, of whom 86,495 with witnessed OHCA and an initial shockable rhythm were included. The primary endpoint was defined as favorable neurological survival (cerebral performance category score of 1 or 2 at 1 month). A decision tree model was developed from randomly selected 77,845 patients (development cohort) and validated in 8650 patients (validation cohort). In the development cohort, the presence of prehospital return of spontaneous circulation was the best predictor of favorable neurological survival, followed by the absence of adrenaline administration and age. The patients were categorized into 9 groups with probabilities of favorable neurological survival ranging from 5.7 to 70.8% (areas under the receiver operating characteristic curve of 0.851 and 0.844 in the development and validation cohorts, respectively). Our model is potentially helpful in stratifying the probability of favorable neurological survival in patients with witnessed OHCA and an initial shockable rhythm.",
        "conclusions": "Our decision tree model suggested that prehospital ROSC, absence of adrenaline use in the field, younger age, bystander CPR, earlier defibrillation attempts, and earlier transportation to hospitals were important predictors of favorable neurological survival at 1 month in patients with witnessed OHCA with a shockable rhythm. This prediction model can provide clinicians with risk stratification information in the emergency department.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Assessing robustness of quantitative susceptibility-based MRI radiomic features in patients with multiple sclerosis",
        "link": "https://www.nature.com/articles/s41598-023-42914-4",
        "publication_date": "27 Sept 2023",
        "abstract": "Multiple Sclerosis (MS) is an autoimmune demyelinating disease characterised by changes in iron and myelin content. These biomarkers are detectable by Quantitative Susceptibility Mapping (QSM), an advanced Magnetic Resonance Imaging technique detecting magnetic properties. When analysed with radiomic techniques that exploit its intrinsic quantitative nature, QSM may furnish biomarkers to facilitate early diagnosis of MS and timely assessment of progression. In this work, we explore the robustness of QSM radiomic features by varying the number of grey levels (GLs) and echo times (TEs), in a sample of healthy controls and patients with MS. We analysed the white matter in total and within six clinically relevant tracts, including the cortico-spinal tract and the optic radiation. After optimising the number of GLs (n = 64), at least 65% of features were robust for each Volume of Interest (VOI), with no difference (p > .05) between left and right hemispheres. Different outcomes in feature robustness among the VOIs depend on their characteristics, such as volume and variance of susceptibility values. This study validated the processing pipeline for robustness analysis and established the reliability of QSM-based radiomics features against GLs and TEs. Our results provide important insights for future radiomics studies using QSM in clinical applications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Large-scale capture of hidden fluorescent labels for training generalizable markerless motion capture models",
        "link": "https://www.nature.com/articles/s41467-023-41565-3",
        "publication_date": "26 Sept 2023",
        "abstract": "Deep learning-based markerless tracking has revolutionized studies of animal behavior. Yet the generalizability of trained models tends to be limited, as new training data typically needs to be generated manually for each setup or visual environment. With each model trained from scratch, researchers track distinct landmarks and analyze the resulting kinematic data in idiosyncratic ways. Moreover, due to inherent limitations in manual annotation, only a sparse set of landmarks are typically labeled. To address these issues, we developed an approach, which we term GlowTrack, for generating orders of magnitude more training data, enabling models that generalize across experimental contexts. We describe: a) a high-throughput approach for producing hidden labels using fluorescent markers; b) a multi-camera, multi-light setup for simulating diverse visual conditions; and c) a technique for labeling many landmarks in parallel, enabling dense tracking. These advances lay a foundation for standardized behavioral pipelines and more complete scrutiny of movement.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Upper limb modeling and motion extraction based on multi-space-fusion",
        "link": "https://www.nature.com/articles/s41598-023-36767-0",
        "publication_date": "26 Sept 2023",
        "abstract": "Modeling and motion extraction of human upper limbs are essential for interpreting the natural behavior of upper limb. Owing to the high degrees of freedom (DOF) and highly dynamic nature, existing upper limb modeling methods have limited applications. This study proposes a generic modeling and motion extraction method, named Primitive-Based triangular body segment method (P-BTBS), which follows the physiology of upper limbs, allows high accuracy of motion angles, and describes upper-limb motions with high accuracy. For utilizing the upper-limb modular motion model, the motion angles and bones can be selected as per the research topics (The generic nature of the study targets). Additionally, P-BTBS is suitable in most scenarios for estimating spatial coordinates (The generic nature of equipment and technology). Experiments in continuous motions with seven DOFs and upper-limb motion description validated the excellent performance and robustness of P-BTBS in extracting motion information and describing upper-limb motions, respectively. P-BTBS provides a new perspective and mathematical tool for human understanding and exploration of upper-limb motions, which theoretically supports upper-limb research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Artificial intelligence based system for predicting permanent stoma after sphincter saving operations",
        "link": "https://www.nature.com/articles/s41598-023-43211-w",
        "publication_date": "25 Sept 2023",
        "abstract": "Although the goal of rectal cancer treatment is to restore gastrointestinal continuity, some patients with rectal cancer develop a permanent stoma (PS) after sphincter-saving operations. Although many studies have identified the risk factors and causes of PS, few have precisely predicted the probability of PS formation before surgery. To validate whether an artificial intelligence model can accurately predict PS formation in patients with rectal cancer after sphincter-saving operations. Patients with rectal cancer who underwent a sphincter-saving operation at Taipei Medical University Hospital between January 1, 2012, and December 31, 2021, were retrospectively included in this study. A machine learning technique was used to predict whether a PS would form after a sphincter-saving operation. We included 19 routinely available preoperative variables in the artificial intelligence analysis. To evaluate the efficiency of the model, 6 performance metrics were utilized: accuracy, sensitivity, specificity, positive predictive value, negative predictive value, and area under the receiving operating characteristic curve. In our classification pipeline, the data were randomly divided into a training set (80% of the data) and a validation set (20% of the data). The artificial intelligence models were trained using the training dataset, and their performance was evaluated using the validation dataset. Synthetic minority oversampling was used to solve the data imbalance. A total of 428 patients were included, and the PS rate was 13.6% (58/428) in the training set. The logistic regression (LR), Gaussian Naïve Bayes (GNB), Extreme Gradient Boosting (XGB), Gradient Boosting (GB), random forest, decision tree and light gradient boosting machine (LightGBM) algorithms were employed. The accuracies of the logistic regression (LR), Gaussian Naïve Bayes (GNB), Extreme Gradient Boosting (XGB), Gradient Boosting (GB), random forest (RF), decision tree (DT) and light gradient boosting machine (LightGBM) models were 70%, 76%, 89%, 93%, 95%, 79% and 93%, respectively. The area under the receiving operating characteristic curve values were 0.79 for the LR model, 0.84 for the GNB, 0.95 for the XGB, 0.95 for the GB, 0.99 for the RF model, 0.79 for the DT model and 0.98 for the LightGBM model. The key predictors that were identified were the distance of the lesion from the anal verge, clinical N stage, age, sex, American Society of Anesthesiologists score, and preoperative albumin and carcinoembryonic antigen levels. Integration of artificial intelligence with available preoperative data can potentially predict stoma outcomes after sphincter-saving operations. Our model exhibited excellent predictive ability and can improve the process of obtaining informed consent.",
        "conclusions": "The present study’s integration of AI with clinically available preoperative data demonstrated potential for use in predicting PS formation after a sphincter-saving operation. Our model exhibited excellent predictive ability and can improve the process of obtaining informed consent from patients. In the future, we will optimize the system by collecting more clinical data and adding data from other centers.",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The effect of environment on depressive symptoms in late adolescence and early adulthood: an exposome-wide association study and twin modeling",
        "link": "https://www.nature.com/articles/s44220-023-00124-x",
        "publication_date": "25 Sept 2023",
        "abstract": "The exposome represents the totality of environmental effects, but systematic evaluation between it and depressive symptoms is scant. Here we sought to comprehensively identify the association of the exposome with depressive symptoms in late adolescence and early adulthood and determine genetic and environmental covariances between them. Based on the FinnTwin12 cohort (3,025 participants in young adulthood and 4,127 at age 17), the exposome-wide association study (ExWAS) design was used to identify significant exposures from 12 domains. Bivariate Cholesky twin models were fitted to an exposome score and depressive symptoms. In ExWASes, 29 and 46 exposures were significantly associated with depressive symptoms in young adulthood and at age 17, respectively, and familial exposures were the most influential. Twin models indicated considerable genetic and environmental covariances between the exposome score and depressive symptoms with sex differences. The findings underscore the systematic approach of the exposome and the consideration of relevant genetic effects.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based analysis of regional differences in out-of-hospital cardiopulmonary arrest outcomes and resuscitation interventions in Japan",
        "link": "https://www.nature.com/articles/s41598-023-43210-x",
        "publication_date": "23 Sept 2023",
        "abstract": "Refining out-of-hospital cardiopulmonary arrest (OHCA) resuscitation protocols for local emergency practices is vital. The lack of comprehensive evaluation methods for individualized protocols impedes targeted improvements. Thus, we employed machine learning to assess emergency medical service (EMS) records for examining regional disparities in time reduction strategies. In this retrospective study, we examined Japanese EMS records and neurological outcomes from 2015 to 2020 using nationwide data. We included patients aged ≥ 18 years with cardiogenic OHCA and visualized EMS activity time variations across prefectures. A five-layer neural network generated a neurological outcome predictive model that was trained on 80% of the data and tested on the remaining 20%. We evaluated interventions associated with changes in prognosis by simulating these changes after adjusting for time factors, including EMS contact to hospital arrival and initial defibrillation or drug administration. The study encompassed 460,540 patients, with the model’s area under the curve and accuracy being 0.96 and 0.95, respectively. Reducing transport time and defibrillation improved outcomes universally, while combining transport time and drug administration showed varied efficacy. In conclusion, the association of emergency activity time with neurological outcomes varied across Japanese prefectures, suggesting the need to set targets for reducing activity time in localized emergency protocols.",
        "conclusions": "This study highlights the regional differences in EMS activity time targets and their implications in tailored prehospital care. The study findings may help enhance in EMS protocols and improve patient outcomes. However, it is crucial to address the identified limitations to strengthen our recommendations.",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning for tumor margin identification in electromagnetic imaging",
        "link": "https://www.nature.com/articles/s41598-023-42625-w",
        "publication_date": "23 Sept 2023",
        "abstract": "In this work, a novel method for tumor margin identification in electromagnetic imaging is proposed to optimize the tumor removal surgery. This capability will enable the visualization of the border of the cancerous tissue for the surgeon prior or during the excision surgery. To this end, the border between the normal and tumor parts needs to be identified. Therefore, the images need to be segmented into tumor and normal areas. We propose a deep learning technique which divides the electromagnetic images into two regions: tumor and normal, with high accuracy. We formulate deep learning from a perspective relevant to electromagnetic image reconstruction. A recurrent auto-encoder network architecture (termed here DeepTMI) is presented. The effectiveness of the algorithm is demonstrated by segmenting the reconstructed images of an experimental tissue-mimicking phantom. The structure similarity measure (SSIM) and mean-square-error (MSE) average of normalized reconstructed results by the DeepTMI method are about 0.94 and 0.04 respectively, while that average obtained from the conventional backpropagation (BP) method can hardly overcome 0.35 and 0.41 respectively.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Improving CNNs classification with pathologist-based expertise: the renal cell carcinoma case study",
        "link": "https://www.nature.com/articles/s41598-023-42847-y",
        "publication_date": "23 Sept 2023",
        "abstract": "The prognosis of renal cell carcinoma (RCC) malignant neoplasms deeply relies on an accurate determination of the histological subtype, which currently involves the light microscopy visual analysis of histological slides, considering notably tumor architecture and cytology. RCC subtyping is therefore a time-consuming and tedious process, sometimes requiring expert review, with great impact on diagnosis, prognosis and treatment of RCC neoplasms. In this study, we investigate the automatic RCC subtyping classification of 91 patients, diagnosed with clear cell RCC, papillary RCC, chromophobe RCC, or renal oncocytoma, through deep learning based methodologies. We show how the classification performance of several state-of-the-art Convolutional Neural Networks (CNNs) are perfectible among the different RCC subtypes. Thus, we introduce a new classification model leveraging a combination of supervised deep learning models (specifically CNNs) and pathologist’s expertise, giving birth to a hybrid approach that we termed ExpertDeepTree (ExpertDT). Our findings prove ExpertDT’s superior capability in the RCC subtyping task, with respect to traditional CNNs, and suggest that introducing some expert-based knowledge into deep learning models may be a valuable solution for complex classification cases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Febrile infants risk score at triage (FIRST) for the early identification of serious bacterial infections",
        "link": "https://www.nature.com/articles/s41598-023-42854-z",
        "publication_date": "22 Sept 2023",
        "abstract": "We aimed to derive the Febrile Infants Risk Score at Triage (FIRST) to quantify risk for serious bacterial infections (SBIs), defined as bacteremia, meningitis and urinary tract infections. We performed a prospective observational study on febrile infants < 3 months old at a tertiary hospital in Singapore between 2018 and 2021. We utilized machine learning and logistic regression to derive 2 models: FIRST, based on patient demographics, vital signs and history, and FIRST + , adding laboratory results to the same variables. SBIs were diagnosed in 224/1002 (22.4%) infants. Among 994 children with complete data, age (adjusted odds ratio [aOR] 1.01 95%CI 1.01–1.02, p < 0.001), high temperature (aOR 2.22 95%CI 1.69–2.91, p < 0.001), male sex (aOR 2.62 95%CI 1.86–3.70, p < 0.001) and fever of ≥ 2 days (aOR 1.79 95%CI 1.18–2.74, p = 0.007) were independently associated with SBIs. For FIRST + , abnormal urine leukocyte esterase (aOR 16.46 95%CI 10.00–27.11, p < 0.001) and procalcitonin (aOR 1.05 95%CI 1.01–1.09, p = 0.009) were further identified. A FIRST + threshold of ≥ 15% predicted risk had a sensitivity of 81.8% (95%CI 70.5–91.0%) and specificity of 65.6% (95%CI 57.8–72.7%). In the testing dataset, FIRST + had an area under receiver operating characteristic curve of 0.87 (95%CI 0.81–0.94). These scores can potentially guide triage and prioritization of febrile infants.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Survival prediction and prognostic factors in colorectal cancer after curative surgery: insights from cox regression and neural networks",
        "link": "https://www.nature.com/articles/s41598-023-42926-0",
        "publication_date": "21 Sept 2023",
        "abstract": "Medical research frequently relies on Cox regression to analyze the survival distribution of cancer patients. Nonetheless, in specific scenarios, neural networks hold the potential to serve as a robust alternative. In this study, we aim to scrutinize the effectiveness of Cox regression and neural network models in assessing the survival outcomes of patients who have undergone treatment for colorectal cancer. We conducted a retrospective study on 284 colorectal cancer patients who underwent surgery at Imam Khomeini clinic in Hamadan between 2001 and 2017. The data was used to train both Cox regression and neural network models, and their predictive accuracy was compared using diagnostic measures such as sensitivity, specificity, positive predictive value, accuracy, negative predictive value, and area under the receiver operating characteristic curve. The analyses were performed using STATA 17 and R4.0.4 software. The study revealed that the best neural network model had a sensitivity of 74.5% (95% CI 61.0–85.0), specificity of 83.3% (65.3–94.4), positive predictive value of 89.1% (76.4–96.4), negative predictive value of 64.1% (47.2–78.8), AUC of 0.79 (0.70–0.88), and accuracy of 0.776 for death prediction. For recurrence, the best neural network model had a sensitivity of 88.1% (74.4–96.0%), specificity of 83.7% (69.3–93.2%), positive predictive value of 84.1% (69.9–93.4%), negative predictive value of 87.8% (73.8–95.9%), AUC of 0.86 (0.78–0.93), and accuracy of 0.859. The Cox model had comparable results, with a sensitivity of 73.6% (64.8–81.2) and 85.5% (78.3–91.0), specificity of 89.6% (83.8–93.8) and 98.0% (94.4–99.6), positive predictive value of 84.0% (75.6–90.4) and 97.4% (92.6–99.5), negative predictive value of 82.0% (75.6–90.4) and 88.8% (0.83–93.1), AUC of 0.82 (0.77–0.86) and 0.92 (0.89–0.95), and accuracy of 0.88 and 0.92 for death and recurrence prediction, respectively. In conclusion, the study found that both Cox regression and neural network models are effective in predicting early recurrence and death in patients with colorectal cancer after curative surgery. The neural network model showed slightly better sensitivity and negative predictive value for death, while the Cox model had better specificity and positive predictive value for recurrence. Overall, both models demonstrated high accuracy and AUC, indicating their usefulness in predicting these outcomes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The relationship between hyperglycaemia on admission and patient outcome is modified by hyperlactatemia and diabetic status: a retrospective analysis of the eICU collaborative research database",
        "link": "https://www.nature.com/articles/s41598-023-43044-7",
        "publication_date": "21 Sept 2023",
        "abstract": "Both blood glucose and lactate are well-known predictors of organ dysfunction and mortality in critically ill patients. Previous research has shown that concurrent adjustment for glucose and lactate modifies the relationship between these variables and patient outcomes, including blunting of the association between blood glucose and patient outcome. We aim to investigate the relationship between ICU admission blood glucose and hospital mortality while accounting for lactate and diabetic status. Across 43,250 ICU admissions, weighted to account for missing data, we assessed the predictive ability of several logistic regression and generalised additive models that included blood glucose, blood lactate and diabetic status. We found that inclusion of blood glucose marginally improved predictive performance in all patients: AUC-ROC 0.665 versus 0.659 (p = 0.005), with a greater degree of improvement seen in non-diabetics: AUC-ROC 0.675 versus 0.663 (p < 0.001). Inspection of the estimated risk profiles revealed the standard U-shaped risk profile for blood glucose was only present in non-diabetic patients after controlling for blood lactate levels. Future research should aim to utilise observational data to estimate whether interventions such as insulin further modify this effect, with the goal of informing future RCTs of interventions targeting glycaemic control in the ICU.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Decoding the endometrial niche of Asherman’s Syndrome at single-cell resolution",
        "link": "https://www.nature.com/articles/s41467-023-41656-1",
        "publication_date": "21 Sept 2023",
        "abstract": "Asherman’s Syndrome is characterized by intrauterine adhesions or scarring, which cause infertility, menstrual abnormalities, and recurrent pregnancy loss. The pathophysiology of this syndrome remains unknown, with treatment restricted to recurrent surgical removal of intrauterine scarring, which has limited success. Here, we decode the Asherman’s Syndrome endometrial cell niche by analyzing data from over 200,000 cells with single-cell RNA-sequencing in patients with this condition and through in vitro analyses of Asherman’s Syndrome patient-derived endometrial organoids. Our endometrial atlas highlights the loss of the endometrial epithelium, alterations to epithelial differentiation signaling pathways such as Wnt and Notch, and the appearance of characteristic epithelium expressing secretory leukocyte protease inhibitor during the window of implantation. We describe syndrome-associated alterations in cell-to-cell communication and gene expression profiles that support a dysfunctional pro-fibrotic, pro-inflammatory, and anti-angiogenic environment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cluster analysis driven by unsupervised latent feature learning of medications to identify novel pharmacophenotypes of critically ill patients",
        "link": "https://www.nature.com/articles/s41598-023-42657-2",
        "publication_date": "20 Sept 2023",
        "abstract": "Unsupervised clustering of intensive care unit (ICU) medications may identify unique medication clusters (i.e., pharmacophenotypes) in critically ill adults. We performed an unsupervised analysis with Restricted Boltzmann Machine of 991 medications profiles of patients managed in the ICU to explore pharmacophenotypes that correlated with ICU complications (e.g., mechanical ventilation) and patient-centered outcomes (e.g., length of stay, mortality). Six unique pharmacophenotypes were observed, with unique medication profiles and clinically relevant differences in ICU complications and patient-centered outcomes. While pharmacophenotypes 2 and 4 had no statistically significant difference in ICU length of stay, duration of mechanical ventilation, or duration of vasopressor use, their mortality differed significantly (9.0% vs. 21.9%, p < 0.0001). Pharmacophenotype 4 had a mortality rate of 21.9%, compared with the rest of the pharmacophenotypes ranging from 2.5 to 9%. Phenotyping approaches have shown promise in classifying the heterogenous syndromes of critical illness to predict treatment response and guide clinical decision support systems but have never included comprehensive medication information. This first-ever machine learning approach revealed differences among empirically-derived subgroups of ICU patients that are not typically revealed by traditional classifiers. Identification of pharmacophenotypes may enable enhanced decision making to optimize treatment decisions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]