[
    {
        "title": "Variability and reproducibility in deep learning for medical image segmentation",
        "link": "https://www.nature.com/articles/s41598-020-69920-0",
        "publication_date": "13 Aug 2020",
        "abstract": "Medical image segmentation is an important tool for current clinical applications. It is the backbone of numerous clinical diagnosis methods, oncological treatments and computer-integrated surgeries. A new class of machine learning algorithm, deep learning algorithms, outperforms the results of classical segmentation in terms of accuracy. However, these techniques are complex and can have a high range of variability, calling the reproducibility of the results into question. In this article, through a literature review, we propose an original overview of the sources of variability to better understand the challenges and issues of reproducibility related to deep learning for medical image segmentation. Finally, we propose 3 main recommendations to address these potential issues: (1) an adequate description of the framework of deep learning, (2) a suitable analysis of the different sources of variability in the framework of deep learning, and (3) an efficient system for evaluating the segmentation results.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical interpretation of an interpretable prognostic model for patients with COVID-19",
        "link": "https://www.nature.com/articles/s42256-020-0207-0",
        "publication_date": "12 Aug 2020",
        "abstract": "arising from L. Yan et al. Nature Machine Intelligence https://doi.org/10.1038/s42256-020-0180-7 (2020)",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Spatial regression analysis of MR diffusion reveals subject-specific white matter changes associated with repetitive head impacts in contact sports",
        "link": "https://www.nature.com/articles/s41598-020-70604-y",
        "publication_date": "12 Aug 2020",
        "abstract": "Repetitive head impacts (RHI) are a growing concern due to their possible neurocognitive effects, with research showing a season of RHI produce white matter (WM) changes seen on neuroimaging. We conducted a secondary analysis of diffusion tensor imaging (DTI) data for 28 contact athletes to compare WM changes. We collected pre-season and post-season DTI scans for each subject, approximately 3 months apart. We collected helmet data for the athletes, which we correlated with DTI data. We adapted the SPatial REgression Analysis of DTI (SPREAD) algorithm to conduct subject-specific longitudinal DTI analysis, and developed global inferential tools using functional norms and a novel robust p value combination test. At the individual level, most detected injured regions (93.3%) were associated with decreased FA values. Using meta-analysis techniques to combine injured regions across subjects, we found the combined injured region at the group level occupied the entire WM skeleton, suggesting the WM damage location is subject-specific. Several subject-specific functional summaries of SPREAD-detected WM change, e.g., the \\({L}^{\\infty }\\) norm, significantly correlated with helmet impact measures, e.g. cumulative unweighted rotational acceleration (adjusted p = 0.0049), time between hits rotational acceleration (adjusted p value 0.0101), and time until DTI rotational acceleration (adjusted p = 0.0084), suggesting RHIs lead to WM changes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Personal identification with orthopantomography using simple convolutional neural networks: a preliminary study",
        "link": "https://www.nature.com/articles/s41598-020-70474-4",
        "publication_date": "11 Aug 2020",
        "abstract": "Forensic dental examination has played an important role in personal identification (PI). However, PI has essentially been based on traditional visual comparisons of ante- and postmortem dental records and radiographs, and there is no globally accepted PI method based on digital technology. Although many effective image recognition models have been developed, they have been underutilized in forensic odontology. The aim of this study was to verify the usefulness of PI with paired orthopantomographs obtained in a relatively short period using convolutional neural network (CNN) technologies. Thirty pairs of orthopantomographs obtained on different days were analyzed in terms of the accuracy of dental PI based on six well-known CNN architectures: VGG16, ResNet50, Inception-v3, InceptionResNet-v2, Xception, and MobileNet-v2. Each model was trained and tested using paired orthopantomographs, and pretraining and fine-tuning transfer learning methods were validated. Higher validation accuracy was achieved with fine-tuning than with pretraining, and each architecture showed a detection accuracy of 80.0% or more. The VGG16 model achieved the highest accuracy (100.0%) with pretraining and with fine-tuning. This study demonstrated the usefulness of CNN for PI using small numbers of orthopantomographic images, and it also showed that VGG16 was the most useful of the six tested CNN architectures.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "On the correlation between second order texture features and human observer detection performance in digital images",
        "link": "https://www.nature.com/articles/s41598-020-69816-z",
        "publication_date": "11 Aug 2020",
        "abstract": "Image texture, the relative spatial arrangement of intensity values in an image, encodes valuable information about the scene. As it stands, much of this potential information remains untapped. Understanding how to decipher textural details would afford another method of extracting knowledge of the physical world from images. In this work, we attempt to bridge the gap in research between quantitative texture analysis and the visual perception of textures. The impact of changes in image texture on human observer’s ability to perform signal detection and localization tasks in complex digital images is not understood. We examine this critical question by studying task-based human observer performance in detecting and localizing signals in tomographic breast images. We have also investigated how these changes impact the formation of second-order image texture. We used digital breast tomosynthesis (DBT) an FDA approved tomographic X-ray breast imaging method as the modality of choice to show our preliminary results. Our human observer studies involve localization ROC (LROC) studies for low contrast mass detection in DBT. Simulated images are used as they offer the benefit of known ground truth. Our results prove that changes in system geometry or processing leads to changes in image texture magnitudes. We show that the variations in several well-known texture features estimated in digital images correlate with human observer detection–localization performance for signals embedded in them. This insight can allow efficient and practical techniques to identify the best imaging system design and algorithms or filtering tools by examining the changes in these texture features. This concept linking texture feature estimates and task based image quality assessment can be extended to several other imaging modalities and applications as well. It can also offer feedback in system and algorithm designs with a goal to improve perceptual benefits. Broader impact can be in wide array of areas including imaging system design, image processing, data science, machine learning, computer vision, perceptual and vision science. Our results also point to the caution that must be exercised in using these texture features as image-based radiomic features or as predictive markers for risk assessment as they are sensitive to system or image processing changes.",
        "conclusions": "With simulated but realistic digital tomographic breast images, we have shown that image texture features are sensitive to a number of system design and processing parameters. Here processing could be pre or post reconstruction filters as well as different image reconstruction methods. Thus the variations in these texture features often called ’radiomic features’ in medical imaging, is not a function of object inhomogeneity and structure (or genetic signatures manifested in the image). These features are more sensitive to image noise resulting from system geometry, reconstruction and image processing algorithms (all are vendor dependent). Thus using image texture as radiomic features must be done with extreme caution.A more important result in this paper is the identification that variations in several well known texture features estimated in digital images correlate with human observer detection-localization performance for signals embedded in them. Extensive literature in vision science has associated several texture features with human’s ability to discriminate between images. However, to date there has been no work that points to their impact on ability to detect and localize signals in digital images. This understanding is of key significance in several areas including medical imaging and radiology where humans (or sometimes machines) search for signals/targets whose average properties may be known. It can also be of significance in images generated for defense and security applications. We illustrated that several easily computable image texture features can give insight into how the noise properties generated by system design/algorithms may impact detection-localization benefits in these images. Image processing and system changes (like detector blurring or changes in sampling) changes the magnitude of correlated noise within the image which influences the human observer’s ability to detect signals embedded in them. We examined if several readily computable texture features respond to these changes.Our results confirm that several texture features that fall under the three well known texture metrics GLCM, NGTDM and RLM show high correlation with task-based signal detection performance in DBT images by human observers. Our preliminary investigations show that several other texture features (not reported here) from all three metrics (GLCM, NGTDM and RLM) also show high correlation to human observer studies. Our goal was to present a few popular features widely seen in vision science literature. We have highlighted some features that show high and robust correlation. These correlations stay significant against change in image noise due to geometry or processing algorithms—showing the potential utility of these methods to be used as surrogates for finding trends in task based performance assessments in medical imaging. These texture features can give reliable trends in task-based image quality that often requires tools like mathematical model observers which are computationally intensive or difficult to apply directly to clinical images. This points to the high significance of the results presented in this paper. Our findings have the potential to open new avenues in the development of practical task based assessment tools where reliable, qualitative trends would be deemed sufficient to compare imaging geometries and algorithms.Since our work relies on simulated realistic images with signal locations known to the experimenter (but unknown to the observer), we were able to correlate the localization and detection benefits simultaneously when the observer makes decision on a given test image for signal presence. Our results show concrete evidence of the correlation of some second order texture features to human visual perception. These high correlations remain robust for varying system configurations and noise levels. While the current study tested detection of low contrast masses, these same texture features might not show high correlation for other signal types like small microcalcifications (high frequency signals). These questions are part of our ongoing investigations. The insights offered in this work could allow fast algorithmic approaches to examining detection benefits of a newly designed clinical system or algorithm. It can also offer feedback in system and algorithm designs with a goal to improve perceptual benefits27. Besides understanding perception in medical images, our results could benefit multiple areas such as artificial intelligence, machine learning and computer vision. In all these domains, significant benefits including transparency and simplicity can be achieved by considering the physics of image formation and basic image science concepts53.",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based prediction of acute coronary syndrome using only the pre-hospital 12-lead electrocardiogram",
        "link": "https://www.nature.com/articles/s41467-020-17804-2",
        "publication_date": "07 Aug 2020",
        "abstract": "Prompt identification of acute coronary syndrome is a challenge in clinical practice. The 12-lead electrocardiogram (ECG) is readily available during initial patient evaluation, but current rule-based interpretation approaches lack sufficient accuracy. Here we report machine learning-based methods for the prediction of underlying acute myocardial ischemia in patients with chest pain. Using 554 temporal-spatial features of the 12-lead ECG, we train and test multiple classifiers on two independent prospective patient cohorts (n = 1244). While maintaining higher negative predictive value, our final fusion model achieves 52% gain in sensitivity compared to commercial interpretation software and 37% gain in sensitivity compared to experienced clinicians. Such an ultra-early, ECG-based clinical decision support tool, when combined with the judgment of trained emergency personnel, would help to improve clinical outcomes and reduce unnecessary costs in patients with chest pain.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Tales of 1,008 small molecules: phenomic profiling through live-cell imaging in a panel of reporter cell lines",
        "link": "https://www.nature.com/articles/s41598-020-69354-8",
        "publication_date": "06 Aug 2020",
        "abstract": "Phenomic profiles are high-dimensional sets of readouts that can comprehensively capture the biological impact of chemical and genetic perturbations in cellular assay systems. Phenomic profiling of compound libraries can be used for compound target identification or mechanism of action (MoA) prediction and other applications in drug discovery. To devise an economical set of phenomic profiling assays, we assembled a library of 1,008 approved drugs and well-characterized tool compounds manually annotated to 218 unique MoAs, and we profiled each compound at four concentrations in live-cell, high-content imaging screens against a panel of 15 reporter cell lines, which expressed a diverse set of fluorescent organelle and pathway markers in three distinct cell lineages. For 41 of 83 testable MoAs, phenomic profiles accurately ranked the reference compounds (AUC-ROC ≥ 0.9). MoAs could be better resolved by screening compounds at multiple concentrations than by including replicates at a single concentration. Screening additional cell lineages and fluorescent markers increased the number of distinguishable MoAs but this effect quickly plateaued. There remains a substantial number of MoAs that were hard to distinguish from others under the current study’s conditions. We discuss ways to close this gap, which will inform the design of future phenomic profiling efforts.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Defining and predicting transdiagnostic categories of neurodegenerative disease",
        "link": "https://www.nature.com/articles/s41551-020-0593-y",
        "publication_date": "03 Aug 2020",
        "abstract": "The prevalence of concomitant proteinopathies and heterogeneous clinical symptoms in neurodegenerative diseases hinders the identification of individuals who might be candidates for a particular intervention. Here, by applying an unsupervised clustering algorithm to post-mortem histopathological data from 895 patients with degeneration in the central nervous system, we show that six non-overlapping disease clusters can simultaneously account for tau neurofibrillary tangles, α-synuclein inclusions, neuritic plaques, inclusions of the transcriptional repressor TDP-43, angiopathy, neuron loss and gliosis. We also show that membership to the six transdiagnostic disease clusters, which explains more variance in cognitive phenotypes than can be explained by individual diagnoses, can be accurately predicted from scores of the Mini-Mental Status Exam, protein levels in cerebrospinal fluid, and genotype at the APOE and MAPT loci, via cross-validated multiple logistic regression. This combination of unsupervised and supervised data-driven tools provides a framework that could be used to identify latent disease subtypes in other areas of medicine.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Inferring disease subtypes from clusters in explanation space",
        "link": "https://www.nature.com/articles/s41598-020-68858-7",
        "publication_date": "30 Jul 2020",
        "abstract": "Identification of disease subtypes and corresponding biomarkers can substantially improve clinical diagnosis and treatment selection. Discovering these subtypes in noisy, high dimensional biomedical data is often impossible for humans and challenging for machines. We introduce a new approach to facilitate the discovery of disease subtypes: Instead of analyzing the original data, we train a diagnostic classifier (healthy vs. diseased) and extract instance-wise explanations for the classifier’s decisions. The distribution of instances in the explanation space of our diagnostic classifier amplifies the different reasons for belonging to the same class–resulting in a representation that is uniquely useful for discovering latent subtypes. We compare our ability to recover subtypes via cluster analysis on model explanations to classical cluster analysis on the original data. In multiple datasets with known ground-truth subclasses, particularly on UK Biobank brain imaging data and transcriptome data from the Cancer Genome Atlas, we show that cluster analysis on model explanations substantially outperforms the classical approach. While we believe clustering in explanation space to be particularly valuable for inferring disease subtypes, the method is more general and applicable to any kind of sub-type identification.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Distribution pattern of tumor infiltrating lymphocytes and tumor microenvironment composition as prognostic indicators in anorectal malignant melanoma",
        "link": "https://www.nature.com/articles/s41379-020-0633-x",
        "publication_date": "24 Jul 2020",
        "abstract": "Anorectal malignant melanoma (ARMM) is a rare disease with poor prognosis. Determining ARMM prognosis precisely is difficult due to the lack of proper assessment techniques. Immunotherapy has proven effective against cutaneous malignant melanoma and may show efficacy in ARMM. Herein, we assessed the immune profile of ARMM to identify possible prognostic biomarkers. Twenty-two ARMM formalin-fixed and paraffin-embedded samples were evaluated using an nCounter® PanCancer Immune Profiling Panel. Validation was performed through immunohistochemical staining for CD3, CD8, Foxp3, CD68, CD163, and PD-L1. RNA analysis revealed significantly decreased scores for pathways involved in cell regulation and function, as well as chemokines, in recurrent patients compared to nonrecurrent patients. In cell-type profiling, the recurrent cases displayed significantly low tumor infiltrating lymphocyte (TIL) scores. Recurrence/death prediction models were defined using logistic regression and showed significantly lower scores in recurrent and deceased patients (all, P < 0.001) compared to those in nonrecurrent and surviving patients. The high total TIL and tumor-associated macrophage (TAM) groups had significantly better overall survival outcomes compared to the low total TIL and TAM groups (P = 0.007 and P = 0.035, respectively). In addition, the presence of CD3 + TILs in the invasion front was an independent favorable prognostic indicator (P = 0.003, hazard ratio = 0.21, 95% confidential interval, 0.01–0.41). Patients with inflamed or brisk-infiltration type tumors also had a significantly better overall survival than that of patients with immune-desert/excluded and absent/non-brisk type tumors (P = 0.03 and P = 0.0023, respectively). In conclusion, TILs have a strong prognostic value in ARMM, and the quantification of TILs and an analysis of the TIL phenotype and infiltration pattern during pathological diagnosis are essential to guide treatment strategies and accurate prognosis in ARMM.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Using an ontology of the human cardiovascular system to improve the classification of histological images",
        "link": "https://www.nature.com/articles/s41598-020-69037-4",
        "publication_date": "23 Jul 2020",
        "abstract": "The advantages of automatically recognition of fundamental tissues using computer vision techniques are well known, but one of its main limitations is that sometimes it is not possible to classify correctly an image because the visual information is insufficient or the descriptors extracted are not discriminative enough. An Ontology could solve in part this problem, because it gathers and makes possible to use the specific knowledge that allows detecting clear mistakes in the classification, occasionally simply by pointing out impossible configurations in that domain. One of the main contributions of this work is that we used a Histological Ontology to correct, and therefore improve the classification of histological images. First, we described small regions of images, denoted as blocks, using Local Binary Pattern (LBP) based descriptors and we determined which tissue of the cardiovascular system was present using a cascade Support Vector Machine (SVM). Later, we built Resource Description Framework (RDF) triples for the occurrences of each discriminant class. Based on that, we used a Histological Ontology to correct, among others, “not possible” situations, improving in this way the global accuracy in the blocks first and in tissues classification later. For the experimental validation, we used a set of 6000 blocks of \\(100\\times100\\) pixels, obtaining F-Scores between 0.769 and 0.886. Thus, there is an improvement between 0.003 and \\(0.769\\%\\) when compared to the approach without the histological ontology. The methodology improves the automatic classification of histological images using a histological ontology. Another advantage of our proposal is that using the Ontology, we were capable of recognising the epithelial tissue, previously not detected by any of the computer vision methods used, including a CNN proposal called HistoResNet evaluated in the experiments. Finally, we also have created and made publicly available a dataset consisting of 6000 blocks of labelled histological tissues.",
        "conclusions": "In this paper, we presented a process that improves the classification of the healthy fundamental tissues and organs, obtained by computer vision techniques, by using the knowledge contained in a histological ontology. Our method enables to obtain more consistent information and to reduce the error and uncertainty through corroboration and verification, by comparing every analysis of the different data sources separately.We have improved the initial classification based on computer vision, by using the knowledge contained in a histological ontology. With the proposed method, between 0.769 and 0.886 F-Score were obtained. Additionally, the improved process increases F-Score of the initial classification between 0.003% and \\(0.769\\%\\) according to the histological image and its automatic classification. The results revealed that the proposed method increases F-Score in all cases.We compared our methodology with a CNN proposal called HistoResNet and an ensemble of classifiers in a late-fusion fashion (HistoResNet, HistoVGG16, HistoVGG19, and HistoInception) obtaining similar results in most of the classes except for the epithelial tissue, where our proposal demonstrates its superiority because it is capable of recognising this tissue whiles the CNN and the ensemble classifier are not.Additionally, we have introduced a new method to recognise the epithelial tissue based on the histological ontology classification. We have concluded that the improved classification using a histological ontology enables us to identify the epithelial tissue in images with \\(10\\times\\) magnification whereas images with \\(40\\times\\) magnification are not always available to recognise areas of epithelial tissue.Besides, the use of an Ontology, comparing with the use of taxonomies6, allows to obtain and infer more information of histological knowledge such as a system, a composition, but also as structures, relations, regions, layers, sectors, tissues and cells.The ontology-based classification includes histology information additional to texture features from image classification. This improve results and make the method more robust and complete. However, this proposal is limit to texture features in this stage. Additionally, as another contribution, we have created and made publicly available a dataset consisting of 6000 blocks that can be used to validate the results obtained in our work.In the future, we will extend this proposal by working in the following two lines: (i) exploring our ontology-based methodology using CNN strategies instead of SVM; (ii) exploring an adaptive block size to reduce the misclassification in edges areas; (iii) in this work, we compared our proposal against ensembles of CNNs. We used majority and weight voting. We plan to consider other ensembles strategies. (iii) including global features, spatial and relational features, on the classification performance to include more discriminant information among classes. (iv) to use macro-circulation identification to recognise micro-circulation organs; and (v) to apply the ontology-based classification process to different problems in medicine and industry. A re-definition of ontological rules to the specific context are needed considering knowledge information depends on the application domain or particular subject area.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Volatile organic compound analysis, a new tool in the quest for preterm birth prediction—an observational cohort study",
        "link": "https://www.nature.com/articles/s41598-020-69142-4",
        "publication_date": "22 Jul 2020",
        "abstract": "Preterm birth is the leading cause of death worldwide in children under five years. Due to its complex multifactorial nature, prediction is a challenge. Current research is aiming to develop accurate predictive models using patient history, ultrasound and biochemical markers. Volatile organic compound (VOC) analysis is an approach, which has good diagnostic potential to predict many disease states. Analysis of VOCs can reflect both the microbiome and host response to a condition. We aimed to ascertain if VOC analysis of vaginal swabs, taken throughout pregnancy, could predict which women go on to deliver preterm. Our prospective observational cohort study demonstrates that VOC analysis of vaginal swabs, taken in the midtrimester, is a fair test (AUC 0.79) for preterm prediction, with a sensitivity of 0.66 (95%CI 0.56–0.75) and specificity 0.89 (95%CI 0.82–0.94). Using vaginal swabs taken closest to delivery, VOC analysis is a good test (AUC 0.84) for the prediction of preterm birth with a sensitivity of 0.73 (95%CI 0.64–0.81) and specificity of 0.90 (95%CI 0.82–0.95). Consequently, VOC analysis of vaginal swabs has potential to be used as a predictive tool. With further work it could be considered as an additional component in models for predicting preterm birth.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Robust performance of deep learning for distinguishing glioblastoma from single brain metastasis using radiomic features: model development and validation",
        "link": "https://www.nature.com/articles/s41598-020-68980-6",
        "publication_date": "21 Jul 2020",
        "abstract": "We evaluated the diagnostic performance and generalizability of traditional machine learning and deep learning models for distinguishing glioblastoma from single brain metastasis using radiomics. The training and external validation cohorts comprised 166 (109 glioblastomas and 57 metastases) and 82 (50 glioblastomas and 32 metastases) patients, respectively. Two-hundred-and-sixty-five radiomic features were extracted from semiautomatically segmented regions on contrast-enhancing and peritumoral T2 hyperintense masks and used as input data. For each of a deep neural network (DNN) and seven traditional machine learning classifiers combined with one of five feature selection methods, hyperparameters were optimized through tenfold cross-validation in the training cohort. The diagnostic performance of the optimized models and two neuroradiologists was tested in the validation cohort for distinguishing glioblastoma from metastasis. In the external validation, DNN showed the highest diagnostic performance, with an area under receiver operating characteristic curve (AUC), sensitivity, specificity, and accuracy of 0.956 (95% confidence interval [CI], 0.918–0.990), 90.6% (95% CI, 80.5–100), 88.0% (95% CI, 79.0–97.0), and 89.0% (95% CI, 82.3–95.8), respectively, compared to the best-performing traditional machine learning model (adaptive boosting combined with tree-based feature selection; AUC, 0.890 (95% CI, 0.823–0.947)) and human readers (AUC, 0.774 [95% CI, 0.685–0.852] and 0.904 [95% CI, 0.852–0.951]). The results demonstrated deep learning using radiomic features can be useful for distinguishing glioblastoma from metastasis with good generalizability.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A telescope GWAS analysis strategy, based on SNPs-genes-pathways ensamble and on multivariate algorithms, to characterize late onset Alzheimer’s disease",
        "link": "https://www.nature.com/articles/s41598-020-67699-8",
        "publication_date": "21 Jul 2020",
        "abstract": "Genome–wide association studies (GWAS) have revealed a plethora of putative susceptibility genes for Alzheimer’s disease (AD), with the sole exception of APOE gene unequivocally validated in independent study. Considering that the etiology of complex diseases like AD could depend on functional multiple genes interaction network, here we proposed an alternative GWAS analysis strategy based on (i) multivariate methods and on a (ii) telescope approach, in order to guarantee the identification of correlated variables, and reveal their connections at three biological connected levels. Specifically as multivariate methods, we employed two machine learning algorithms and a genetic association test and we considered SNPs, Genes and Pathways features in the analysis of two public GWAS dataset (ADNI-1 and ADNI-2). For each dataset and for each feature we addressed two binary classifications tasks: cases vs. controls and the low vs. high risk of developing AD considering the allelic status of APOEe4. This complex strategy allowed the identification of SNPs, genes and pathways lists statistically robust and meaningful from the biological viewpoint. Among the results, we confirm the involvement of TOMM40 gene in AD and we propose GRM7 as a novel gene significantly associated with AD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Simultaneous FDG-PET/MRI detects hippocampal subfield metabolic differences in AD/MCI",
        "link": "https://www.nature.com/articles/s41598-020-69065-0",
        "publication_date": "21 Jul 2020",
        "abstract": "The medial temporal lobe is one of the most well-studied brain regions affected by Alzheimer’s disease (AD). Although the spread of neurofibrillary pathology in the hippocampus throughout the progression of AD has been thoroughly characterized and staged using histology and other imaging techniques, it has not been precisely quantified in vivo at the subfield level using simultaneous positron emission tomography (PET) and magnetic resonance imaging (MRI). Here, we investigate alterations in metabolism and volume using [18F]fluoro-deoxyglucose (FDG) and simultaneous time-of-flight (TOF) PET/MRI with hippocampal subfield analysis of AD, mild cognitive impairment (MCI), and healthy subjects. We found significant structural and metabolic changes within the hippocampus that can be sensitively assessed at the subfield level in a small cohort. While no significant differences were found between groups for whole hippocampal SUVr values (p = 0.166), we found a clear delineation in SUVr between groups in the dentate gyrus (p = 0.009). Subfield analysis may be more sensitive for detecting pathological changes using PET-MRI in AD compared to global hippocampal assessment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "High-resolution and differential analysis of rat microglial markers in traumatic brain injury: conventional flow cytometric and bioinformatics analysis",
        "link": "https://www.nature.com/articles/s41598-020-68770-0",
        "publication_date": "20 Jul 2020",
        "abstract": "Traumatic brain injury (TBI) results in a cascade of cellular responses, which produce neuroinflammation, partly due to microglial activation. Transforming from surveying to primed phenotypes, microglia undergo considerable molecular changes. However, specific microglial profiles in rat remain elusive due to tedious methodology and limited availability of reagents. Here, we present a flow cytometry-based analysis of rat microglia 24 h after TBI using the controlled cortical impact model, validated with a bioinformatics approach. Isolated microglia are analyzed for morphological changes and their expression of activation markers using flow cytometry, traditional gating-based analysis methods and support the data by employing bioinformatics statistical tools. We use CD45, CD11b/c, and p2y12 receptor to identify microglia and evaluate their activation state using CD32, CD86, RT1B, CD200R, and CD163. The results from logic-gated flow cytometry analysis was validated with bioinformatics-based analysis and machine learning algorithms to detect quantitative changes in morphology and marker expression in microglia due to activation following TBI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Altered proximal tubular cell glucose metabolism during acute kidney injury is associated with mortality",
        "link": "https://www.nature.com/articles/s42255-020-0238-1",
        "publication_date": "20 Jul 2020",
        "abstract": "Acute kidney injury (AKI) is strongly associated with mortality, independently of its cause. The kidney contributes to up to 40% of systemic glucose production by gluconeogenesis during fasting and under stress conditions. Whether kidney gluconeogenesis is impaired during AKI and how this might influence systemic metabolism remain unknown. Here we show that glucose production and lactate clearance are impaired during human and experimental AKI by using renal arteriovenous catheterization in patients, lactate tolerance testing in mice and glucose isotope labelling in rats. Single-cell transcriptomics reveal that gluconeogenesis is impaired in proximal tubule cells during AKI. In a retrospective cohort of critically ill patients, we demonstrate that altered glucose metabolism during AKI is a major determinant of systemic glucose and lactate levels and is strongly associated with mortality. Thiamine supplementation increases lactate clearance without modifying renal function in mice with AKI, enhances glucose production by renal tubular cells ex vivo and is associated with reduced mortality and improvement of the metabolic pattern in a retrospective cohort of critically ill patients with AKI. This study highlights an unappreciated systemic role of renal glucose and lactate metabolism under stress conditions, delineates general mechanisms of AKI-associated mortality and introduces a potential intervention targeting metabolism for a highly prevalent clinical condition with limited therapeutic options.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Uniaxial compression testing and Cauchy stress modeling to design anatomical silicone replicas",
        "link": "https://www.nature.com/articles/s41598-020-68886-3",
        "publication_date": "16 Jul 2020",
        "abstract": "Anatomically realistic organ replicas or phantoms allow for accurate studies and reproducible research. To recreate a human kidney, mimicry of the elastic properties of the human kidney is crucial. However, none of the related work addressed the design and development of a kidney phantom using only silicone as material. In contrast to paraffin and hydrogel, silicone is an ideal variant for its extended shelf life, soft-tissue-like feeling, and viscoelastic modularity. To this end, we conducted Uniaxial Compression testing and Cauchy stress modeling. Results indicate that none of the available manufacturer silicone brands are suitable for the task of creating a realistic kidney phantom. Indeed, the tested silicone mixtures in low and high strain fall outside the required approximate target compressive moduli of 20 kPa and 500 kPa, respectively. This work provides a frame of reference for future work by avoiding the pitfalls of the selected ready-made silicones and reusing the reported theoretical and experimental setup to design a realistic replica of the kidney organ.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A machine learning framework for computationally expensive transient models",
        "link": "https://www.nature.com/articles/s41598-020-67546-w",
        "publication_date": "13 Jul 2020",
        "abstract": "Transient simulations of dynamic systems, using physics-based scientific computing tools, are practically limited by availability of computational resources and power. While the promise of machine learning has been explored in a variety of scientific disciplines, its application in creation of a framework for computationally expensive transient models has not been fully explored. Here, we present an ensemble approach where one such computationally expensive tool, discrete element method, is combined with time-series forecasting via auto regressive integrated moving average and machine learning methods to simulate a complex pharmaceutical problem: development of an agitation protocol in an agitated filter dryer to ensure uniform solid bed mixing. This ensemble approach leads to a significant reduction in the computational burden, while retaining model accuracy and performance, practically rendering simulations possible. The developed machine-learning model shows good predictability and agreement with the literature, demonstrating its tremendous potential in scientific computing.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep-learning-based accurate hepatic steatosis quantification for histological assessment of liver biopsies",
        "link": "https://www.nature.com/articles/s41374-020-0463-y",
        "publication_date": "13 Jul 2020",
        "abstract": "Hepatic steatosis droplet quantification with histology biopsies has high clinical significance for risk stratification and management of patients with fatty liver diseases and in the decision to use donor livers for transplantation. However, pathology reviewing processes, when conducted manually, are subject to a high inter- and intra-reader variability, due to the overwhelmingly large number and significantly varying appearance of steatosis instances. This process is challenging as there is a large number of overlapped steatosis droplets with either missing or weak boundaries. In this study, we propose a deep-learning-based region-boundary integrated network for precise steatosis quantification with whole slide liver histopathology images. The proposed model consists of two sequential steps: a region extraction and a boundary prediction module for foreground regions and steatosis boundary prediction, followed by an integrated prediction map generation. Missing steatosis boundaries are next recovered from the predicted map and assembled from adjacent image patches to generate results for the whole slide histopathology image. The resulting steatosis measures both at the pixel level and steatosis object-level present strong correlation with pathologist annotations, radiology readouts and clinical data. In addition, the segregated steatosis object count is shown as a promising alternative measure to the traditional metrics at the pixel level. These results suggest a high potential of artificial intelligence-assisted technology to enhance liver disease decision support using whole slide images.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Estimating the efficacy of symptom-based screening for COVID-19",
        "link": "https://www.nature.com/articles/s41746-020-0300-0",
        "publication_date": "13 Jul 2020",
        "abstract": "There is substantial interest in using presenting symptoms to prioritize testing for COVID-19 and establish symptom-based surveillance. However, little is currently known about the specificity of COVID-19 symptoms. To assess the feasibility of symptom-based screening for COVID-19, we used data from tests for common respiratory viruses and SARS-CoV-2 in our health system to measure the ability to correctly classify virus test results based on presenting symptoms. Based on these results, symptom-based screening may not be an effective strategy to identify individuals who should be tested for SARS-CoV-2 infection or to obtain a leading indicator of new COVID-19 cases.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Generalizable deep temporal models for predicting episodes of sudden hypotension in critically ill patients: a personalized approach",
        "link": "https://www.nature.com/articles/s41598-020-67952-0",
        "publication_date": "10 Jul 2020",
        "abstract": "The vast quantities of data generated and collected in the Intensive Care Unit (ICU) have given rise to large retrospective datasets that are frequently used for observational studies. The temporal nature and fine granularity of much of the data collected in the ICU enable the pursuit of predictive modeling. In particular, forecasting acute hypotensive episodes (AHE) in intensive care patients has been of interest to researchers in critical care medicine. Given an advance warning of an AHE, care providers may be prompted to search for evolving disease processes and help mitigate negative clinical outcomes. However, the conventionally adopted definition of an AHE does not account for inter-patient variability and is restrictive. To reflect the wider trend of global clinical and research efforts in precision medicine, we introduce a patient-specific definition of AHE in this study and propose deep learning based models to predict this novel definition of AHE in data from multiple independent institutions. We provide extensive evaluation of the models by studying their accuracies in detecting patient-specific AHEs with lead-times ranging from 10 min to 1 hour before the onset of the event. The resulting models achieve AUROC values ranging from 0.57–0.87 depending on the lead time of the prediction. We demonstrate the generalizability and robustness of our approach through the use of independent multi-institutional data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Electrocardiographic changes predate Parkinson’s disease onset",
        "link": "https://www.nature.com/articles/s41598-020-68241-6",
        "publication_date": "09 Jul 2020",
        "abstract": "Autonomic nervous system involvement precedes the motor features of Parkinson’s disease (PD). Our goal was to develop a proof-of-concept model for identifying subjects at high risk of developing PD by analysis of cardiac electrical activity. We used standard 10-s electrocardiogram (ECG) recordings of 60 subjects from the Honolulu Asia Aging Study including 10 with prevalent PD, 25 with prodromal PD, and 25 controls who never developed PD. Various methods were implemented to extract features from ECGs including simple heart rate variability (HRV) metrics, commonly used signal processing methods, and a Probabilistic Symbolic Pattern Recognition (PSPR) method. Extracted features were analyzed via stepwise logistic regression to distinguish between prodromal cases and controls. Stepwise logistic regression selected four features from PSPR as predictors of PD. The final regression model built on the entire dataset provided an area under receiver operating characteristics curve (AUC) with 95% confidence interval of 0.90 [0.80, 0.99]. The five-fold cross-validation process produced an average AUC of 0.835 [0.831, 0.839]. We conclude that cardiac electrical activity provides important information about the likelihood of future PD not captured by classical HRV metrics. Machine learning applied to ECGs may help identify subjects at high risk of having prodromal PD.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Wireless monitoring and real-time adaptive predictive indicator of deterioration",
        "link": "https://www.nature.com/articles/s41598-020-67835-4",
        "publication_date": "09 Jul 2020",
        "abstract": "To assist in the early warning of deterioration in hospitalised children we studied the feasibility of collecting continuous wireless physiological data using Lifetouch (ECG-derived heart and respiratory rate) and WristOx2 (pulse-oximetry and derived pulse rate) sensors. We compared our bedside paediatric early warning (PEW) score and a machine learning automated approach: a Real-time Adaptive Predictive Indicator of Deterioration (RAPID) to identify children experiencing significant clinical deterioration. 982 patients contributed 7,073,486 min during 1,263 monitoring sessions. The proportion of intended monitoring time was 93% for Lifetouch and 55% for WristOx2. Valid clinical data was 63% of intended monitoring time for Lifetouch and 50% WristOx2. 29 patients experienced 36 clinically significant deteriorations. The RAPID Index detected significant deterioration more frequently (77% to 97%) and earlier than the PEW score ≥ 9/26. High sensitivity and negative predictive value for the RAPID Index was associated with low specificity and low positive predictive value. We conclude that it is feasible to collect clinically valid physiological data wirelessly for 50% of intended monitoring time. The RAPID Index identified more deterioration, before the PEW score, but has a low specificity. By using the RAPID Index with a PEW system some life-threatening events may be averted.",
        "conclusions": "Wireless monitoring in children can collect clinically valid data for more than 50% of intended monitoring time. An improved pulse oximeter sensor is required to improve data capture. We have shown it is feasible to develop and display a smart alarm in real-time. The RAPID Index can detect the majority of significant deteriorations before the current early warning system but has a low specificity and is currently associated with false alarms. The RAPID Index and PEW score are effective at ruling out the likelihood of significant deterioration. Further improvements in data quality will hopefully improve the precision. By using the RAPID Index in addition to PEW system it is possible that some life-threatening events may be averted. This data is very preliminary and the technology needs further efficacy and health economic evaluation prior to adoption.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Microbiome and health implications for ethnic minorities after enforced lifestyle changes",
        "link": "https://www.nature.com/articles/s41591-020-0963-8",
        "publication_date": "06 Jul 2020",
        "abstract": "Modern lifestyles increase the risk of chronic diseases, in part by modifying the microbiome, but the health effects of lifestyles enforced on ethnic minorities are understudied1,2,3. Lifestyle affects the microbiome early in life, when the microbiome is assembled and the immune system is undergoing maturation4,5,6. Moreover, the influence of lifestyle has been separated from genetic and geographic factors by studies of genetically similar populations and ethnically distinct groups living in the same geographic location7,8,9,10,11. The lifestyle of Irish Travellers, an ethnically distinct subpopulation, changed with legislation in 2002 that effectively ended nomadism and altered their living conditions. Comparative metagenomics of gut microbiomes shows that Irish Travellers retain a microbiota similar to that of non-industrialized societies. Their microbiota is associated with non-dietary factors and is proportionately linked with risk of microbiome-related metabolic disease. Our findings suggest there are microbiome-related public health implications when ethnic minorities are pressured to change lifestyles.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based prediction of acute severity in infants hospitalized for bronchiolitis: a multicenter prospective study",
        "link": "https://www.nature.com/articles/s41598-020-67629-8",
        "publication_date": "03 Jul 2020",
        "abstract": "We aimed to develop machine learning models to accurately predict bronchiolitis severity, and to compare their predictive performance with a conventional scoring (reference) model. In a 17-center prospective study of infants (aged < 1 year) hospitalized for bronchiolitis, by using routinely-available pre-hospitalization data as predictors, we developed four machine learning models: Lasso regression, elastic net regression, random forest, and gradient boosted decision tree. We compared their predictive performance—e.g., area-under-the-curve (AUC), sensitivity, specificity, and net benefit (decision curves)—using a cross-validation method, with that of the reference model. The outcomes were positive pressure ventilation use and intensive treatment (admission to intensive care unit and/or positive pressure ventilation use). Of 1,016 infants, 5.4% underwent positive pressure ventilation and 16.0% had intensive treatment. For the positive pressure ventilation outcome, machine learning models outperformed reference model (e.g., AUC 0.88 [95% CI 0.84–0.93] in gradient boosted decision tree vs 0.62 [95% CI 0.53–0.70] in reference model), with higher sensitivity (0.89 [95% CI 0.80–0.96] vs. 0.62 [95% CI 0.49–0.75]) and specificity (0.77 [95% CI 0.75–0.80] vs. 0.57 [95% CI 0.54–0.60]). The machine learning models also achieved a greater net benefit over ranges of clinical thresholds. Machine learning models consistently demonstrated a superior ability to predict acute severity and achieved greater net benefit.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "HAPPENN is a novel tool for hemolytic activity prediction for therapeutic peptides which employs neural networks",
        "link": "https://www.nature.com/articles/s41598-020-67701-3",
        "publication_date": "02 Jul 2020",
        "abstract": "The growing prevalence of resistance to antibiotics motivates the search for new antibacterial agents. Antimicrobial peptides are a diverse class of well-studied membrane-active peptides which function as part of the innate host defence system, and form a promising avenue in antibiotic drug research. Some antimicrobial peptides exhibit toxicity against eukaryotic membranes, typically characterised by hemolytic activity assays, but currently, the understanding of what differentiates hemolytic and non-hemolytic peptides is limited. This study leverages advances in machine learning research to produce a novel artificial neural network classifier for the prediction of hemolytic activity from a peptide’s primary sequence. The classifier achieves best-in-class performance, with cross-validated accuracy of \\(85.7\\%\\) and Matthews correlation coefficient of 0.71. This innovative classifier is available as a web server at https://research.timmons.eu/happenn, allowing the research community to utilise it for in silico screening of peptide drug candidates for high therapeutic efficacies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Finding hotspots: development of an adaptive spatial sampling approach",
        "link": "https://www.nature.com/articles/s41598-020-67666-3",
        "publication_date": "02 Jul 2020",
        "abstract": "The identification of disease hotspots is an increasingly important public health problem. While geospatial modeling offers an opportunity to predict the locations of hotspots using suitable environmental and climatological data, little attention has been paid to optimizing the design of surveys used to inform such models. Here we introduce an adaptive sampling scheme optimized to identify hotspot locations where prevalence exceeds a relevant threshold. Our approach incorporates ideas from Bayesian optimization theory to adaptively select sample batches. We present an experimental simulation study based on survey data of schistosomiasis and lymphatic filariasis across four countries. Results across all scenarios explored show that adaptive sampling produces superior results and suggest that similar performance to random sampling can be achieved with a fraction of the sample size.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Two latent classes of diagnostic and treatment procedures among traumatic brain injury inpatients",
        "link": "https://www.nature.com/articles/s41598-020-67576-4",
        "publication_date": "02 Jul 2020",
        "abstract": "To characterize latent classes of diagnostic and/or treatment procedures among hospitalized U.S. adults, 18–64 years, with primary diagnosis of TBI from 2004–2014 Nationwide Inpatient Samples, latent class analysis (LCA) was applied to 10 procedure groups and differences between latent classes on injury, patient, hospital and healthcare utilization outcome characteristics were modeled using multivariable regression. Using 266,586 eligible records, LCA resulted in two classes of hospitalizations, namely, class I (n = 217,988) (mostly non-surgical) and class II (n = 48,598) (mostly surgical). Whereas orthopedic procedures were equally likely among latent classes, skin-related, physical medicine and rehabilitation procedures as well as behavioral health procedures were more likely among class I, and other types of procedures were more likely among class II. Class II patients were more likely to have moderate-to-severe TBI, to be admitted on weekends, to urban, medium-to-large hospitals in Midwestern, Southern or Western regions, and less likely to be > 30 years, female or non-White. Class II patients were also less likely to be discharged home and necessitated longer hospital stays and greater hospitalization charges. Surgery appears to distinguish two classes of hospitalized patients with TBI with divergent healthcare needs, informing the planning of healthcare services in this target population.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "poisoning"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The major effects of health-related quality of life on 5-year survival prediction among lung cancer survivors: applications of machine learning",
        "link": "https://www.nature.com/articles/s41598-020-67604-3",
        "publication_date": "01 Jul 2020",
        "abstract": "The primary goal of this study was to evaluate the major roles of health-related quality of life (HRQOL) in a 5-year lung cancer survival prediction model using machine learning techniques (MLTs). The predictive performances of the models were compared with data from 809 survivors who underwent lung cancer surgery. Each of the modeling technique was applied to two feature sets: feature set 1 included clinical and sociodemographic variables, and feature set 2 added HRQOL factors to the variables from feature set 1. One of each developed prediction model was trained with the decision tree (DT), logistic regression (LR), bagging, random forest (RF), and adaptive boosting (AdaBoost) methods, and then, the best algorithm for modeling was determined. The models’ performances were compared using fivefold cross-validation. For feature set 1, there were no significant differences in model accuracies (ranging from 0.647 to 0.713). Among the models in feature set 2, the AdaBoost and RF models outperformed the other prognostic models [area under the curve (AUC) = 0.850, 0.898, 0.981, 0.966, and 0.949 for the DT, LR, bagging, RF and AdaBoost models, respectively] in the test set. Overall, 5-year disease-free lung cancer survival prediction models with MLTs that included HRQOL as well as clinical variables improved predictive performance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An artificial neural network approach for predicting hypertension using NHANES data",
        "link": "https://www.nature.com/articles/s41598-020-67640-z",
        "publication_date": "30 Jun 2020",
        "abstract": "This paper focus on a neural network classification model to estimate the association among gender, race, BMI, age, smoking, kidney disease and diabetes in hypertensive patients. It also shows that artificial neural network techniques applied to large clinical data sets may provide a meaningful data-driven approach to categorize patients for population health management, and support in the control and detection of hypertensive patients, which is part of the critical factors for diseases of the heart. Data was obtained from the National Health and Nutrition Examination Survey from 2007 to 2016. This paper utilized an imbalanced data set of 24,434 with (69.71%) non-hypertensive patients, and (30.29%) hypertensive patients. The results indicate a sensitivity of 40%, a specificity of 87%, precision of 57.8% and a measured AUC of 0.77 (95% CI [75.01–79.01]). This paper showed results that are to some degree more effectively than a previous study performed by the authors using a statistical model with similar input features that presents a calculated AUC of 0.73. This classification model can be used as an inference agent to assist the professionals in diseases of the heart field, and can be implemented in applications to assist population health management programs in identifying patients with high risk of developing hypertension.",
        "conclusions": "This paper presents a neural network approach to overthrown the non-linearity problem with the risk factors utilized as inputs for the model. This paper shows that the proposed model improves the accuracy and performance of a previous paper that used the same input features and the results were better than logistic regression in a small percentage. The main contribution of this paper is the developed model and based on results showed that ANN was the proper model compared with the previously developed LR model.Our multi-layer model confirmed the influence of the imbalanced data set to the class with more presence in the data. This paper showed that the proposed model could be a guide to the design of other models and inference engines for expert systems. This model cannot be used yet to provide the final diagnosis in developing hypertension in patients due that it requires clinician’s involvement for validation with real patients. However, this model can be used to make them aware that there is a probability that the patients could be developing hypertension.Knowledge of the current model, and their parameters on risk-prediction models in general, is constructive to determine how to best approach the build of prediction models for hypertension, design the study, and interpret its results. When there is a realistic chance to find an applicable positive effect on decision-making and patient outcome, this model on a new setting could be potentially useful. This paper outlines the process for the development of a neural network risk prediction model, from choosing a data source and selecting features to assess model performance, performing validation, and assessing the impact of the model outcomes.For future work, this model will be apply and re-train if necessary to a real balanced data set, and bigger network architectures will be considered. Also, new risk factors can be used to better handle the distribution and behavior of the input features for the model, and a sensitivity analysis will be performed to determine which inputs in our ANN model are significant with respect to the output. This paper will be the ground for the construction of a decision supporting tool that may be useful to healthcare practitioners for contributing to decision making about the risk of developing hypertension in typical or atypical patient screening circumstances.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Histopathologic, immunophenotypic, and proteomics characteristics of low-grade phyllodes tumor and fibroadenoma: more similarities than differences",
        "link": "https://www.nature.com/articles/s41523-020-0169-8",
        "publication_date": "26 Jun 2020",
        "abstract": "Distinguishing low-grade phyllodes tumor from fibroadenoma is practically challenging due to their overlapping histologic features. However, the final interpretation is essential to surgeons, who base their management on the final pathology report. Patients who receive a diagnosis of fibroadenoma might not undergo any additional intervention while lumpectomy with wide margins is the standard of care for phyllodes tumor, which can have significant cosmetic consequences. We studied the clinical, immunophenotypic, and proteomics profiles of 31 histologically confirmed low-grade phyllodes tumor and 30 fibroadenomas. Matrix-assisted laser desorption ionization (MALDI) imaging mass spectrometry (IMS) and immunohistochemistry for Ki-67, p53, β-catenin, and E-cadherin were performed on all cases. After the mass spectra for all 31 cases of low-grade phyllodes tumor and 30 cases of fibroadenoma were collected, an average peak value for all cases was generated. There was no significant difference in the overall mass spectra pattern in any of the peaks identified. There was also overlap in the percentage of cells staining positive for Ki-67, p53, β-catenin, and E-cadherin. The two groups of patients showed no statistically significant difference in age, tumor size, or disease-free survival. Neither group developed malignant transformation, distant metastases, or disease-related mortality. We have demonstrated low-grade phyllodes tumor and fibroadenoma to show significant overlapping clinical and proteomics features.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Safety and efficacy of the use of navigated retinal laser as a method of laser retinopexy in the treatment of symptomatic retinal tears",
        "link": "https://www.nature.com/articles/s41433-020-1050-6",
        "publication_date": "25 Jun 2020",
        "abstract": "To investigate the safety and efficacy of the use of navigated retinal laser as a delivery method of laser retinopexy in the treatment of symptomatic retinal tears.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Learning endometriosis phenotypes from patient-generated data",
        "link": "https://www.nature.com/articles/s41746-020-0292-9",
        "publication_date": "24 Jun 2020",
        "abstract": "Endometriosis is a systemic and chronic condition in women of childbearing age, yet a highly enigmatic disease with unresolved questions: there are no known biomarkers, nor established clinical stages. We here investigate the use of patient-generated health data and data-driven phenotyping to characterize endometriosis patient subtypes, based on their reported signs and symptoms. We aim at unsupervised learning of endometriosis phenotypes using self-tracking data from personal smartphones. We leverage data from an observational research study of over 4000 women with endometriosis that track their condition over more than 2 years. We extend a classical mixed-membership model to accommodate the idiosyncrasies of the data at hand, i.e., the multimodality and uncertainty of the self-tracked variables. The proposed method, by jointly modeling a wide range of observations (i.e., participant symptoms, quality of life, treatments), identifies clinically relevant endometriosis subtypes. Experiments show that our method is robust to different hyperparameter choices and the biases of self-tracking data (e.g., the wide variations in tracking frequency among participants). With this work, we show the promise of unsupervised learning of endometriosis subtypes from self-tracked data, as learned phenotypes align well with what is already known about the disease, but also suggest new clinically actionable findings. More generally, we argue that a continued research effort on unsupervised phenotyping methods with patient-generated health data via new mobile and digital technologies will have significant impact on the study of enigmatic diseases in particular, and health in general.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Metabolic activity in subcallosal cingulate predicts response to deep brain stimulation for depression",
        "link": "https://www.nature.com/articles/s41386-020-0745-5",
        "publication_date": "24 Jun 2020",
        "abstract": "Subcallosal cingulate (SCC) deep brain stimulation (DBS) is a promising therapy for treatment-resistant depression (TRD), but response rates in open-label studies were not replicated in a large multicenter trial. Identifying biomarkers of response could improve patient selection and outcomes. We examined SCC metabolic activity as both a predictor and marker of SCC DBS treatment response. Brain glucose metabolism (CMRGlu) was measured with [18F] FDG-PET at baseline and 6 months post DBS in 20 TRD patients in a double-blind randomized controlled trial where two stimulation types (long pulse width (LPW) n = 9 and short pulse width (SPW) n = 11) were used. Responders (n = 10) were defined by a ≥48% reduction in Hamilton Depression Rating Scale scores after 6 months. The response rates were similar with five responders in each stimulation group: LPW (55.6%) and SPW (44.5%). First, differences in SCC CMRGlu in responders and non-responders were compared at baseline. Then machine learning analysis was performed with a leave-one-out cross-validation using a Gaussian naive Bayes classifier to test whether baseline CMRGlu in SCC could categorize responders. Finally, we compared 6-month change in metabolic activity with change in depression severity. All analyses were controlled for age. Baseline SCC CMRGlu was significantly higher in responders than non-responders. The machine learning analysis predicted response with 80% accuracy. Furthermore, reduction in SCC CMRGlu 6 months post DBS correlated with symptom improvement (r(17) = 0.509; p = 0.031). This is the first evidence of an image-based treatment selection biomarker that predicts SCC DBS response. Future studies could utilize SCC metabolic activity for prospective patient selection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluation of deep convolutional neural networks for automatic classification of common maternal fetal ultrasound planes",
        "link": "https://www.nature.com/articles/s41598-020-67076-5",
        "publication_date": "23 Jun 2020",
        "abstract": "The goal of this study was to evaluate the maturity of current Deep Learning classification techniques for their application in a real maternal-fetal clinical environment. A large dataset of routinely acquired maternal-fetal screening ultrasound images (which will be made publicly available) was collected from two different hospitals by several operators and ultrasound machines. All images were manually labeled by an expert maternal fetal clinician. Images were divided into 6 classes: four of the most widely used fetal anatomical planes (Abdomen, Brain, Femur and Thorax), the mother’s cervix (widely used for prematurity screening) and a general category to include any other less common image plane. Fetal brain images were further categorized into the 3 most common fetal brain planes (Trans-thalamic, Trans-cerebellum, Trans-ventricular) to judge fine grain categorization performance. The final dataset is comprised of over 12,400 images from 1,792 patients, making it the largest ultrasound dataset to date. We then evaluated a wide variety of state-of-the-art deep Convolutional Neural Networks on this dataset and analyzed results in depth, comparing the computational models to research technicians, which are the ones currently performing the task daily. Results indicate for the first time that computational models have similar performance compared to humans when classifying common planes in human fetal examination. However, the dataset leaves the door open on future research to further improve results, especially on fine-grained plane categorization.",
        "conclusions": "To conclude, for the first time computational models have been shown to be mature enough for its widespread application to real maternal-fetal clinical settings, especially as support in general US recognition. However, several concerns remain about its transferability and application to fine-grained categorization, without which modern clinical diagnosis would not be possible. We hope this study and our maternal-fetal US dataset will serve as a catalyzer for future research.",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Detection and discrimination of intracranial tumors using plasma cell-free DNA methylomes",
        "link": "https://www.nature.com/articles/s41591-020-0932-2",
        "publication_date": "22 Jun 2020",
        "abstract": "Definitive diagnosis of intracranial tumors relies on tissue specimens obtained by invasive surgery. Noninvasive diagnostic approaches provide an opportunity to avoid surgery and mitigate unnecessary risk to patients. In the present study, we show that DNA-methylation profiles from plasma reveal highly specific signatures to detect and accurately discriminate common primary intracranial tumors that share cell-of-origin lineages and can be challenging to distinguish using standard-of-care imaging.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Gut Microbiota Profiles of Treated Metabolic Syndrome Patients and their Relationship with Metabolic Health",
        "link": "https://www.nature.com/articles/s41598-020-67078-3",
        "publication_date": "22 Jun 2020",
        "abstract": "Metabolic syndrome (MetS) has become a worldwide health issue. Recent studies reveal that the human gut microbiota exerts a significant role in the pathogenesis of this disease. While drug treatments may greatly improve metabolic symptoms, little is known about the gut microbiota composition of these treated MetS patients. This study aimed to characterize the gut microbiota composition of treated-MetS patients and analyse the possibility of using gut microbiota as an indicator of metabolic conditions. 16S rRNA metagenomic sequencing approach was used to profile gut microbiota of 111 treated MetS patients from The Cohort of patients at a high Risk of Cardiovascular Events (CORE)-Thailand registry. Our results show that the gut microbiota profiles of MetS patients are diverse across individuals, but can be classified based on their similarity into three groups or enterotypes. We also showed several associations between species abundance and metabolic parameters that are enterotype specific. These findings suggest that information on the gut microbiota can be useful for assessing treatment options for MetS patients. In addition, any correlations between species abundance and human properties are likely specific to each microbial community.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Serum adipokines/related inflammatory factors and ratios as predictors of infrapatellar fat pad volume in osteoarthritis: Applying comprehensive machine learning approaches",
        "link": "https://www.nature.com/articles/s41598-020-66330-0",
        "publication_date": "19 Jun 2020",
        "abstract": "Objective. The infrapatellar fat pad (IPFP) has been associated with knee osteoarthritis onset and progression. This study uses machine learning (ML) approaches to predict serum levels of some adipokines/related inflammatory factors and their ratios on knee IPFP volume of osteoarthritis patients.Methods. Serum and MRI were from the OAI at baseline. Variables comprised the 3 main osteoarthritis risk factors (age, gender, BMI), 6 adipokines, 3 inflammatory factors, and their 36 ratios. IPFP volume was assessed on MRI with a ML methodology. The best variables and models were identified in Total-cohort (n = 678), High-BMI (n = 341) and Low-BMI (n = 337), using a selection approach based on ML methods. Results. The best model for each group included three risk factors and adipsin/C-reactive protein combined for Total-cohort, adipsin/chemerin; High-BMI, chemerin/adiponectin HMW; and Low-BMI, interleukin-8. Gender separation improved the prediction (13–16%) compared to the BMI-based models. Reproducibility with osteoarthritis patients from a clinical trial was excellent (R: female 0.83, male 0.95). Pseudocodes based on gender were generated.Conclusion. This study demonstrates for the first time that the combination of the serum levels of adipokines/inflammatory factors and the three main risk factors of osteoarthritis could predict IPFP volume with high reproducibility, with the superior performance of the model accounting for gender separation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "BAGLS, a multihospital Benchmark for Automatic Glottis Segmentation",
        "link": "https://www.nature.com/articles/s41597-020-0526-3",
        "publication_date": "19 Jun 2020",
        "abstract": "Laryngeal videoendoscopy is one of the main tools in clinical examinations for voice disorders and voice research. Using high-speed videoendoscopy, it is possible to fully capture the vocal fold oscillations, however, processing the recordings typically involves a time-consuming segmentation of the glottal area by trained experts. Even though automatic methods have been proposed and the task is particularly suited for deep learning methods, there are no public datasets and benchmarks available to compare methods and to allow training of generalizing deep learning models. In an international collaboration of researchers from seven institutions from the EU and USA, we have created BAGLS, a large, multihospital dataset of 59,250 high-speed videoendoscopy frames with individually annotated segmentation masks. The frames are based on 640 recordings of healthy and disordered subjects that were recorded with varying technical equipment by numerous clinicians. The BAGLS dataset will allow an objective comparison of glottis segmentation methods and will enable interested researchers to train their own models and compare their methods.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Histologic tissue components provide major cues for machine learning-based prostate cancer detection and grading on prostatectomy specimens",
        "link": "https://www.nature.com/articles/s41598-020-66849-2",
        "publication_date": "18 Jun 2020",
        "abstract": "Automatically detecting and grading cancerous regions on radical prostatectomy (RP) sections facilitates graphical and quantitative pathology reporting, potentially benefitting post-surgery prognosis, recurrence prediction, and treatment planning after RP. Promising results for detecting and grading prostate cancer on digital histopathology images have been reported using machine learning techniques. However, the importance and applicability of those methods have not been fully investigated. We computed three-class tissue component maps (TCMs) from the images, where each pixel was labeled as nuclei, lumina, or other. We applied seven different machine learning approaches: three non-deep learning classifiers with features extracted from TCMs, and four deep learning, using transfer learning with the 1) TCMs, 2) nuclei maps, 3) lumina maps, and 4) raw images for cancer detection and grading on whole-mount RP tissue sections. We performed leave-one-patient-out cross-validation against expert annotations using 286 whole-slide images from 68 patients. For both cancer detection and grading, transfer learning using TCMs performed best. Transfer learning using nuclei maps yielded slightly inferior overall performance, but the best performance for classifying higher-grade cancer. This suggests that 3-class TCMs provide the major cues for cancer detection and grading primarily using nucleus features, which are the most important information for identifying higher-grade cancer.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A Metabolomics Approach for Early Prediction of Vincristine-Induced Peripheral Neuropathy",
        "link": "https://www.nature.com/articles/s41598-020-66815-y",
        "publication_date": "15 Jun 2020",
        "abstract": "Vincristine is a core chemotherapeutic drug administered to pediatric acute lymphoblastic leukemia patients. Despite its efficacy in treating leukemia, it can lead to severe peripheral neuropathy in a subgroup of the patients. Peripheral neuropathy is a debilitating and painful side-effect that can severely impact an individual’s quality of life. Currently, there are no established predictors of peripheral neuropathy incidence during the early stage of chemotherapeutic treatment. As a result, patients who are not susceptible to peripheral neuropathy may receive sub-therapeutic treatment due to an empirical upper cap on the dose, while others may experience severe neuropathy at the same dose. Contrary to previous genomics based approaches, we employed a metabolomics approach to identify small sets of metabolites that can be used to predict a patient’s susceptibility to peripheral neuropathy at different time points during the treatment. Using those identified metabolites, we developed a novel strategy to predict peripheral neuropathy and subsequently adjust the vincristine dose accordingly. In accordance with this novel strategy, we created a free user-friendly tool, VIPNp, for physicians to easily implement our prediction strategy. Our results showed that focusing on metabolites, which encompasses both genotypic and phenotypic variations, can enable early prediction of peripheral neuropathy in pediatric leukemia patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The development of a scoring and ranking strategy for a patient-tailored adverse drug reaction prediction in polypharmacy",
        "link": "https://www.nature.com/articles/s41598-020-66611-8",
        "publication_date": "12 Jun 2020",
        "abstract": "Only few applications are currently dealing with personalized adverse drug reactions (ADRs) prediction in case of polypharmacy. The study aimed to develop a patient-tailored ADR web application, considering characteristics from 734 drugs and relevant patient related factors. The application was designed in Python using a scoring and ranking system based on frequency and severity, computed for each ADR and expressed through an online platform. A neural networks algorithm was used for predicting the severity of ADRs. The application inputs are: age, gender, drugs, relevant pathologies. The outputs are: an overall severity profile (hospitalization and mortality risk), a stratified risk on specific ADR groups and a sorted list of the most important ADRs depending on frequency and severity. The Severity prediction model validation resulted in 79.7–85.1% Area Under the Receiver Operating Characteristic Curve Score, which lies in the good cut-off of 75–90%. The program offers a complex view regarding the ADR profile of a given patient and could be used by the physician and clinical pharmacist during patient safety monitoring, for a coherent therapy choice or medication adjustment, due to the good therapy coverage and the inclusion of relevant patient comorbidities.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Quantitative analyses of diameter and running pattern of choroidal vessels in central serous chorioretinopathy by en face images",
        "link": "https://www.nature.com/articles/s41598-020-66858-1",
        "publication_date": "12 Jun 2020",
        "abstract": "This study was to investigate the choroidal vessels in eyes with central serous chorioretinopathy (CSC) quantitatively. We studied 41 CSC eyes and their fellow eyes, and 41 normal eyes of 41 age-adjusted individuals. En-face optical coherence tomography image of the top 25% slab of Haller’s layer was analyze. The mean vessel area, vessel length, and vessel diameter were calculated. The running pattern of the vessels was quantified and used to determine the degree of symmetry, the “symmetry index”. The vessel area of CSC eyes was not significantly different from that of fellow eyes but significantly larger than that of normal eyes. The vessel length of CSC eyes was not significantly different from fellow eyes but significantly shorter than that of normal eyes. The mean vessel diameter was larger in CSC eyes than in the fellow eyes and the normal eye. The symmetry index was not significantly different in CSC eyes from that of their fellow eyes but was smaller than that of normal eyes. The quantitative analysis showed that eyes with CSC had larger choroidal vessels and asymmetrical vessels running in Haller’s layer.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A nonrandomized open-label phase 2 trial of nonischemic heart preservation for human heart transplantation",
        "link": "https://www.nature.com/articles/s41467-020-16782-9",
        "publication_date": "12 Jun 2020",
        "abstract": "Pre-clinical heart transplantation studies have shown that ex vivo non-ischemic heart preservation (NIHP) can be safely used for 24 h. Here we perform a prospective, open-label, non-randomized phase II study comparing NIHP to static cold preservation (SCS), the current standard for adult heart transplantation. All adult recipients on waiting lists for heart transplantation were included in the study, unless they met any exclusion criteria. The same standard acceptance criteria for donor hearts were used in both study arms. NIHP was scheduled in advance based on availability of device and trained team members. The primary endpoint was a composite of survival free of severe primary graft dysfunction, free of ECMO use within 7 days, and free of acute cellular rejection ≥2R within 180 days. Secondary endpoints were I/R-tissue injury, immediate graft function, and adverse events. Of the 31 eligible patients, six were assigned to NIHP and 25 to SCS. The median preservation time was 223 min (IQR, 202–263) for NIHP and 194 min (IQR, 164–223) for SCS. Over the first six months, all of the patients assigned to NIHP achieved event-free survival, compared with 18 of those assigned to SCS (Kaplan-Meier estimate of event free survival 72.0% [95% CI 50.0–86.0%]). CK-MB assessed 6 ± 2 h after ending perfusion was 76 (IQR, 50–101) ng/mL for NIHP compared with 138 (IQR, 72–198) ng/mL for SCS. Four deaths within six months after transplantation and three cardiac-related adverse events were reported in the SCS group compared with no deaths or cardiac-related adverse events in the NIHP group. This first-in-human study shows the feasibility and safety of NIHP for clinical use in heart transplantation. ClinicalTrial.gov, number NCT03150147",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Objective Assessment of Cerebellar Ataxia: A Comprehensive and Refined Approach",
        "link": "https://www.nature.com/articles/s41598-020-65303-7",
        "publication_date": "11 Jun 2020",
        "abstract": "Parametric analysis of Cerebellar Ataxia (CA) could be of immense value compared to its subjective clinical assessments. This study focuses on a comprehensive scheme for objective assessment of CA through the instrumented versions of 9 commonly used neurological tests in 5 domains- speech, upper limb, lower limb, gait and balance. Twenty-three individuals diagnosed with CA to varying degrees and eleven age-matched healthy controls were recruited. Wearable inertial sensors and Kinect camera were utilised for data acquisition. Binary and multilabel discrimination power and intra-domain relationships of the features extracted from the sensor measures and the clinical scores were compared using Graph Theory, Centrality Measures, Random Forest binary and multilabel classification approaches. An optimal subset of 13 most important Principal Component (PC) features were selected for CA-control classification. This classification model resulted in an impressive performance accuracy of 97% (F1 score = 95.2%) with Holmesian dimensions distributed as 47.7% Stability, 6.3% Timing, 38.75% Accuracy and 7.24% Rhythmicity. Another optimal subset of 11 PC features demonstrated an F1 score of 84.2% in mapping the total 27 PC across 5 domains during CA multilabel discrimination. In both cases, the balance (Romberg) test contributed the most (31.1% and 42% respectively), followed by the peripheral tests whereas gait (Walking) test contributed the least. These findings paved the way for a better understanding of the feasibility of an instrumented system to assist informed clinical decision-making.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep Learning for Improved Risk Prediction in Surgical Outcomes",
        "link": "https://www.nature.com/articles/s41598-020-62971-3",
        "publication_date": "09 Jun 2020",
        "abstract": "The Norwood surgical procedure restores functional systemic circulation in neonatal patients with single ventricle congenital heart defects, but this complex procedure carries a high mortality rate. In this study we address the need to provide an accurate patient specific risk prediction for one-year postoperative mortality or cardiac transplantation and prolonged length of hospital stay with the purpose of assisting clinicians and patients’ families in the preoperative decision making process. Currently available risk prediction models either do not provide patient specific risk factors or only predict in-hospital mortality rates. We apply machine learning models to predict and calculate individual patient risk for mortality and prolonged length of stay using the Pediatric Heart Network Single Ventricle Reconstruction trial dataset. We applied a Markov Chain Monte-Carlo simulation method to impute missing data and then fed the selected variables to multiple machine learning models. The individual risk of mortality or cardiac transplantation calculation produced by our deep neural network model demonstrated 89 ± 4% accuracy and 0.95 ± 0.02 area under the receiver operating characteristic curve (AUROC). The C-statistics results for prediction of prolonged length of stay were 85 ± 3% accuracy and AUROC 0.94 ± 0.04. These predictive models and calculator may help to inform clinical and organizational decision making.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "BacEffluxPred: A two-tier system to predict and categorize bacterial efflux mediated antibiotic resistance proteins",
        "link": "https://www.nature.com/articles/s41598-020-65981-3",
        "publication_date": "09 Jun 2020",
        "abstract": "Efflux proteins are transport proteins, which are involved in transporting different substrates from the cell to the external environment, including antibiotics. The efflux mechanism and efflux pumps are a major reason underlying emerging rampant antibiotic resistance (AR) in microbes. To reduce the resources required and time of identification, characterization and classification of bacterial efflux proteins, we have developed a fast and accurate support vector machine based two-tier prediction system, BacEffluxPred, which can predict bacterial efflux proteins responsible for AR and identify their corresponding families. A leave-one-out cross-validation also called jackknife procedure was used for performance evaluation. The accuracy to discriminate bacterial AR efflux from non-AR efflux was obtained as 85.81% (at tier-I) while accuracies for prediction of efflux pump families like ABC, MFS, RND and MATE family were found 92.13%, 85.39%, 91.01% and 99.44%, respectively (at tier-II). Benchmarking on an independent dataset also showed that BacEffluxPred had comparable accuracy for prediction of bacterial AR efflux pumps and their families. This is the first in-silico tool for predicting bacterial AR efflux proteins and their families and is freely available as both web-server and standalone versions at http://proteininformatics.org/mkumar/baceffluxpred/.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "A Nature-Inspired Search Space Reduction Technique for Spine Identification on Ultrasound Samples of Spina Bifida Cases",
        "link": "https://www.nature.com/articles/s41598-020-66468-x",
        "publication_date": "09 Jun 2020",
        "abstract": "Spina bifida is a birth defect caused by incomplete closing around the spinal cord. Spina bifida is diagnosed in a number of different ways. One approach involves searching for a deformity in the spinal axis via ultrasound. Although easy to apply, this approach requires a highly trained clinician to locate the abnormality due to the noise and distortion present in prenatal ultrasound images. Accordingly, visual examination of ultrasound images may be error prone and subjective. A computerized support system that would automatically detect the location of the spinal deformity may be helpful to the clinician in the diagnostic process. Such a software system first and foremost would require an algorithm for the identification of the entire (healthy or unhealthy) spine in the ultrasound image. This paper introduces a novel flocking dynamics based approach for reducing the size of the search space in the spine identification problem. Proposed approach accepts bone-like blobs on the ultrasound images as bird flocks and combine them into bone groups by calculating the migration path of each flock. Presented results reveal that the method is able to locate correct bones to be grouped together and reduce search space (i.e. number of bones) up to 68%.",
        "conclusions": "In this study, we have proposed a novel nature inspired methodology for reducing the search space in the spine identification problem associated with the ultrasound images of SB cases. The proposed search algorithm has been seen to combine bone regions into groups effectively to reduce the total number of bone blobs forming the search space. The reduction rate is very much dependent on the nature of the sample image and has varied between 26% and 68% for the samples used (Table 1). Even with a moderate decrease in the number of bone regions, the possible number of combinations that would make a spine can decrease typically several orders of magnitude, which is a more significant simplification than the percentage value reflects. Hence, this reduction in search space increases the effectiveness of the GA drastically.In this research, the GA is merely used to demonstrate the effectiveness of the search space reduction. To prevent any performance loss associated with the GA, it based on a known ground truth. In such a case, a GA is guaranteed to capture the ground truth eventually. In an actual spine identification problem, an appropriate fitness function needs to be proposed, such that the GA can cluster the bone groups, “pre-clustered” by the search space reduction algorithm, into spine and non-spine bones. We have developed and evaluated such a fitness function in a follow-up study, which will be submitted as another manuscript in the coming days. The search space reduction algorithm has connected blobs without any interclass (i.e. spine with non-spine) connections in nine out of fourteen samples. False elimination (i.e. removal of isolated spine blobs) has not been observed in any of the samples. Even if there are false connections in one sample image, the interpolation polynomial that is fit on the identified spine is typically close to the ground truth polynomial and to the expert-curves drawn on the raw ultrasound images. This observation is related with the fact that falsely connected bone regions are typically small and do not shift the centroid location of the bone group very much. It should be noted that the ground truth polynomial passes through the centroids of the individual spine bones, whereas the interpolation polynomial passes through the centroids of the grouped bones. Even if all spine bones are correctly identified in the search space reduction, the interpolation polynomial will pass through the group centroids and deviate slightly from the ground truth polynomial. This is why we have a small but non-zero RMSE for samples that have no false connections (for example, Samples 1, 2, 5 and 6 on Table 4). For all practical purposes, these samples can be considered error-free.In this study, we have worked on SB cases due to its clinical significance but the algorithm can work on healthy spine samples as well. We have experimented on healthy samples and observed that the performance of the algorithm has been comparable to the SB cases.While this study does not intend to propose a computer aided diagnosis (CAD) system for SB, the proposed methodology, together with an appropriate fitness function, can constitute the first natural stage of such a CAD system.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Precision Targeted Ablation of Fine Neurovascular Structures In Vivo Using Dual-mode Ultrasound Arrays",
        "link": "https://www.nature.com/articles/s41598-020-66209-0",
        "publication_date": "08 Jun 2020",
        "abstract": "Carotid bodies (CBs) are chemoreceptors that monitor and register changes in the blood, including the levels of oxygen, carbon dioxide, and pH, and regulate breathing. Enhanced activity of CBs was shown to correlate with a significant elevation in the blood pressure of patients with hypertension. CB removal or denervation were previously shown to reduce hypertension. Here we demonstrate the feasibility of a dual-mode ultrasound array (DMUA) system to safely ablate the CB in vivo in a spontaneously hypertensive rat (SHR) model of hypertension. DMUA imaging was used for guiding and monitoring focused ultrasound (FUS) energy delivered to the target region. In particular, 3D imaging was used to identify the carotid bifurcation for targeting the CBs. Intermittent, high frame rate imaging during image-guided FUS (IgFUS) delivery was used for monitoring the lesion formation. DMUA imaging provided feedback for closed-loop control (CLC) of the lesion formation process to avoid overexposure. The procedure was tolerated well in over 100 SHR and normotensive rats that received unilateral and bilateral treatments. The measured mean arterial pressure (MAP) exhibited measurable deviation from baseline 2–4 weeks post IgFUS treatment. The results suggest that the direct unilateral FUS treatment of the CB might be sufficient to reduce the blood pressure in hypertensive rats and justify further investigation in large animals and eventually in human patients.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]