[
    {
        "title": "A distributed feature selection pipeline for survival analysis using radiomics in non-small cell lung cancer patients",
        "link": "https://www.nature.com/articles/s41598-024-58241-1",
        "publication_date": "03 Apr 2024",
        "abstract": "Predictive modelling of cancer outcomes using radiomics faces dimensionality problems and data limitations, as radiomics features often number in the hundreds, and multi-institutional data sharing is  ()often unfeasible. Federated learning (FL) and feature selection (FS) techniques combined can help overcome these issues, as one provides the means of training models without exchanging sensitive data, while the other identifies the most informative features, reduces overfitting, and improves model interpretability. Our proposed FS pipeline based on FL principles targets data-driven radiomics FS in a multivariate survival study of non-small cell lung cancer patients. The pipeline was run across datasets from three institutions without patient-level data exchange. It includes two FS techniques, Correlation-based Feature Selection and LASSO regularization, and Cox Proportional-Hazard regression with Overall Survival as endpoint. Trained and validated on 828 patients overall, our pipeline yielded a radiomic signature comprising \"intensity-based energy\" and \"mean discretised intensity\". Validation resulted in a mean Harrell C-index of 0.59, showcasing fair efficacy in risk stratification. In conclusion, we suggest a distributed radiomics approach that incorporates preliminary feature selection to systematically decrease the feature set based on data-driven considerations. This aims to address dimensionality challenges beyond those associated with data constraints and interpretability concerns.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Ensemble detection of hand joint ankylosis and subluxation in radiographic images using deep neural networks",
        "link": "https://www.nature.com/articles/s41598-024-58242-0",
        "publication_date": "02 Apr 2024",
        "abstract": "The modified total Sharp score (mTSS) is often used as an evaluation index for joint destruction caused by rheumatoid arthritis. In this study, special findings (ankylosis, subluxation, and dislocation) are detected to estimate the efficacy of mTSS by using deep neural networks (DNNs). The proposed method detects and classifies finger joint regions using an ensemble mechanism. This integrates multiple DNN detection models, specifically single shot multibox detectors, using different training data for each special finding. For the learning phase, we prepared a total of 260 hand X-ray images, in which proximal interphalangeal (PIP) and metacarpophalangeal (MP) joints were annotated with mTSS by skilled rheumatologists and radiologists. We evaluated our model using five-fold cross-validation. The proposed model produced a higher detection accuracy, recall, precision, specificity, F-value, and intersection over union than individual detection models for both ankylosis and subluxation detection, with a detection rate above 99.8% for the MP and PIP joint regions. Our future research will aim at the development of an automatic diagnosis system that uses the proposed mTSS model to estimate the erosion and joint space narrowing score.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Early screening of colorectal cancer using feature engineering with artificial intelligence-enhanced analysis of nanoscale chromatin modifications",
        "link": "https://www.nature.com/articles/s41598-024-58016-8",
        "publication_date": "02 Apr 2024",
        "abstract": "Colonoscopy is accurate but inefficient for colorectal cancer (CRC) prevention due to the low (~ 7 to 8%) prevalence of target lesions, advanced adenomas. We leveraged rectal mucosa to identify patients who harbor CRC field carcinogenesis by evaluating chromatin 3D architecture. Supranucleosomal disordered chromatin chains (~ 5 to 20 nm, ~1 kbp) fold into chromatin packing domains (~ 100 to 200 nm, ~ 100 to 1000 kbp). In turn, the fractal-like conformation of DNA within chromatin domains and the folding of the genome into packing domains has been shown to influence multiple facets of gene transcription, including the transcriptional plasticity of cancer cells. We deployed an optical spectroscopic nanosensing technique, chromatin-sensitive partial wave spectroscopic microscopy (csPWS), to evaluate the packing density scaling D of the chromatin chain conformation within packing domains from rectal mucosa in 256 patients with varying degrees of progression to colorectal cancer. We found average packing scaling D of chromatin domains was elevated in tumor cells, histologically normal-appearing cells 4 cm proximal to the tumor, and histologically normal-appearing rectal mucosa compared to cells from control patients (p < 0.001). Nuclear D had a robust correlation with the model of 5-year risk of CRC with r2 = 0.94. Furthermore, rectal D was evaluated as a screening biomarker for patients with advanced adenomas presenting an AUC of 0.85 and 85% sensitivity and specificity. artificial intelligence-enhanced csPWS improved diagnostic performance with AUC = 0.90. Considering the low sensitivity of existing CRC tests, including liquid biopsies, to early-stage cancers our work highlights the potential of chromatin biomarkers of field carcinogenesis in detecting early, significant precancerous colon lesions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Data-driven normative values based on generative manifold learning for quantitative MRI",
        "link": "https://www.nature.com/articles/s41598-024-58141-4",
        "publication_date": "30 Mar 2024",
        "abstract": "In medicine, abnormalities in quantitative metrics such as the volume reduction of one brain region of an individual versus a control group are often provided as deviations from so-called normal values. These normative reference values are traditionally calculated based on the quantitative values from a control group, which can be adjusted for relevant clinical co-variables, such as age or sex. However, these average normative values do not take into account the globality of the available quantitative information. For example, quantitative analysis of T1-weighted magnetic resonance images based on anatomical structure segmentation frequently includes over 100 cerebral structures in the quantitative reports, and these tend to be analyzed separately. In this study, we propose a global approach to personalized normative values for each brain structure using an unsupervised Artificial Intelligence technique known as generative manifold learning. We test the potential benefit of these personalized normative values in comparison with the more traditional average normative values on a population of patients with drug-resistant epilepsy operated for focal cortical dysplasia, as well as on a supplementary healthy group and on patients with Alzheimer’s disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A multimodal stacked ensemble model for cardiac output prediction utilizing cardiorespiratory interactions during general anesthesia",
        "link": "https://www.nature.com/articles/s41598-024-57971-6",
        "publication_date": "29 Mar 2024",
        "abstract": "This study examined the possibility of estimating cardiac output (CO) using a multimodal stacking model that utilizes cardiopulmonary interactions during general anesthesia and outlined a retrospective application of machine learning regression model to a pre-collected dataset. The data of 469 adult patients (obtained from VitalDB) with normal pulmonary function tests who underwent general anesthesia were analyzed. The hemodynamic data in this study included non-invasive blood pressure, plethysmographic heart rate, and SpO2. CO was recorded using Vigileo and EV1000 (pulse contour technique devices). Respiratory data included mechanical ventilation parameters and end-tidal CO2 levels. A generalized linear regression model was used as the metalearner for the multimodal stacking ensemble method. Random forest, generalized linear regression, gradient boosting machine, and XGBoost were used as base learners. A Bland–Altman plot revealed that the multimodal stacked ensemble model for CO prediction from 327 patients had a bias of − 0.001 L/min and − 0.271% when calculating the percentage of difference using the EV1000 device. Agreement of model CO prediction and measured Vigileo CO in 142 patients reported a bias of − 0.01 and − 0.333%. Overall, this model predicts CO compared to data obtained by the pulse contour technique CO monitors with good agreement.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "aEEG in the first 3 days after extremely preterm delivery relates to neurodevelopmental outcomes",
        "link": "https://www.nature.com/articles/s41372-024-01945-z",
        "publication_date": "29 Mar 2024",
        "abstract": "Investigate relationships between aEEG in the first 72 h in extremely preterm infants with 1) infant, medical, and environmental factors, and 2) infant feeding and neurobehavioral outcomes at term and school-age.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": [
                "model control"
            ]
        }
    },
    {
        "title": "SANS-CNN: An automated machine learning technique for spaceflight associated neuro-ocular syndrome with astronaut imaging data",
        "link": "https://www.nature.com/articles/s41526-024-00364-w",
        "publication_date": "28 Mar 2024",
        "abstract": "Spaceflight associated neuro-ocular syndrome (SANS) is one of the largest physiologic barriers to spaceflight and requires evaluation and mitigation for future planetary missions. As the spaceflight environment is a clinically limited environment, the purpose of this research is to provide automated, early detection and prognosis of SANS with a machine learning model trained and validated on astronaut SANS optical coherence tomography (OCT) images. In this study, we present a lightweight convolutional neural network (CNN) incorporating an EfficientNet encoder for detecting SANS from OCT images titled “SANS-CNN.” We used 6303 OCT B-scan images for training/validation (80%/20% split) and 945 for testing with a combination of terrestrial images and astronaut SANS images for both testing and validation. SANS-CNN was validated with SANS images labeled by NASA to evaluate accuracy, specificity, and sensitivity. To evaluate real-world outcomes, two state-of-the-art pre-trained architectures were also employed on this dataset. We use GRAD-CAM to visualize activation maps of intermediate layers to test the interpretability of SANS-CNN’s prediction. SANS-CNN achieved 84.2% accuracy on the test set with an 85.6% specificity, 82.8% sensitivity, and 84.1% F1-score. Moreover, SANS-CNN outperforms two other state-of-the-art pre-trained architectures, ResNet50-v2 and MobileNet-v2, in accuracy by 21.4% and 13.1%, respectively. We also apply two class-activation map techniques to visualize critical SANS features perceived by the model. SANS-CNN represents a CNN model trained and validated with real astronaut OCT images, enabling fast and efficient prediction of SANS-like conditions for spaceflight missions beyond Earth’s orbit in which clinical and computational resources are extremely limited.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Harnessing Big Data in Critical Care: Exploring a new European Dataset",
        "link": "https://www.nature.com/articles/s41597-024-03164-9",
        "publication_date": "28 Mar 2024",
        "abstract": "Freely available datasets have become an invaluable tool to propel data-driven research, especially in the field of critical care medicine. However, the number of datasets available is limited. This leads to the repeated reuse of datasets, inherently increasing the risk of selection bias. Additionally, the need arose to validate insights derived from one dataset with another. In 2023, the Salzburg Intensive Care database (SICdb) was introduced. SICdb offers insights in currently 27,386 intensive care admissions from 21,583 patients. It contains cases of general and surgical intensive care from all disciplines. Amongst others SICdb contains information about: diagnosis, therapies (including data on preceding surgeries), scoring, laboratory values, respiratory and vital signals, and configuration data. Data for SICdb (1.0.6) was collected at one single tertiary care institution of the Department of Anesthesiology and Intensive Care Medicine at the Salzburger Landesklinik (SALK) and Paracelsus Medical University (PMU) between 2013 and 2021. This article aims to elucidate on the characteristics of the dataset, the technical implementation, and provides analysis of its strengths and limitations.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "In major dysmood disorder, physiosomatic, chronic fatigue and fibromyalgia symptoms are driven by immune activation and increased immune-associated neurotoxicity",
        "link": "https://www.nature.com/articles/s41598-024-57350-1",
        "publication_date": "28 Mar 2024",
        "abstract": "Major depressive disorder (MDD) is accompanied by activated neuro-immune pathways, increased physiosomatic and chronic fatigue-fibromyalgia (FF) symptoms. The most severe MDD phenotype, namely major dysmood disorder (MDMD), is associated with adverse childhood experiences (ACEs) and negative life events (NLEs) which induce cytokines/chemokines/growth factors. To delineate the impact of ACE + NLEs on physiosomatic and FF symptoms in first episode (FE)-MDMD, and examine whether these effects are mediated by immune profiles. ACEs, NLEs, physiosomatic and FF symptoms, and 48 cytokines/chemokines/growth factors were measured in 64 FE-MDMD patients and 32 normal controls. Physiosomatic, FF and gastro-intestinal symptoms belong to the same factor as depression, anxiety, melancholia, and insomnia. The first factor extracted from these seven domains is labeled the physio-affective phenome of depression. A part (59.0%) of the variance in physiosomatic symptoms is explained by the independent effects of interleukin (IL)-16 and IL-8 (positively), CCL3 and IL-1 receptor antagonist (inversely correlated). A part (46.5%) of the variance in physiosomatic (59.0%) symptoms is explained by the independent effects of interleukin (IL)-16, TNF-related apoptosis-inducing ligand (TRAIL) (positively) and combined activities of negative immunoregulatory cytokines (inversely associated). Partial least squares analysis shows that ACE + NLEs exert a substantial influence on the physio-affective phenome which are partly mediated by an immune network composed of interleukin-16, CCL27, TRAIL, macrophage-colony stimulating factor, and stem cell growth factor. The physiosomatic and FF symptoms of FE-MDMD are partly caused by immune-associated neurotoxicity due to T helper (Th)-1 polarization and M1 macrophage activation and relative lowered compensatory immunoregulatory protection.",
        "conclusions": "The findings of this study indicate that physiosomatic, FF and GIS symptoms are strongly associated with depression, anxiety, melancholia, and insomnia domains of MDMD. The first factor derived from these six different domains is designated as the physio-affective phenome of depression. A larger part of the variances in the physio-affective phenome, and the physiosomatic FF and GIS symptom domains is explained by immune variables. Specifically, IL-16, TRAIL and IL-8 have a positive correlation with these symptoms, while CCL3 and sIL-1RA exhibit an inverse correlation. The application of PLS analysis reveals that the combination of ACEs and NLEs has a significant impact on the physio-affective phenome. This influence is partially mediated by an immune network consisting of interleukin-16, CCL27, TRAIL, M-CSF, and SCGF. Overall, the physiosomatic and FF symptoms of FE-MDMD are attributed, in part, to Immu-NT linked to Th-1 polarization and M1 macrophage activation, as well as a decrease in CIRS protection. IL-16, Th-1 polarization, M1 activation and Immu-NT are new drug targets to treat the physiosomatic and FF symptoms of MDMD, and to desensitize the upregulated cytokine network and deprogram the detrimental effects of ACEs and NLEs.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Improved tactile speech robustness to background noise with a dual-path recurrent neural network noise-reduction method",
        "link": "https://www.nature.com/articles/s41598-024-57312-7",
        "publication_date": "28 Mar 2024",
        "abstract": "Many people with hearing loss struggle to understand speech in noisy environments, making noise robustness critical for hearing-assistive devices. Recently developed haptic hearing aids, which convert audio to vibration, can improve speech-in-noise performance for cochlear implant (CI) users and assist those unable to access hearing-assistive devices. They are typically body-worn rather than head-mounted, allowing additional space for batteries and microprocessors, and so can deploy more sophisticated noise-reduction techniques. The current study assessed whether a real-time-feasible dual-path recurrent neural network (DPRNN) can improve tactile speech-in-noise performance. Audio was converted to vibration on the wrist using a vocoder method, either with or without noise reduction. Performance was tested for speech in a multi-talker noise (recorded at a party) with a 2.5-dB signal-to-noise ratio. An objective assessment showed the DPRNN improved the scale-invariant signal-to-distortion ratio by 8.6 dB and substantially outperformed traditional noise-reduction (log-MMSE). A behavioural assessment in 16 participants showed the DPRNN improved tactile-only sentence identification in noise by 8.2%. This suggests that advanced techniques like the DPRNN could substantially improve outcomes with haptic hearing aids. Low-cost haptic devices could soon be an important supplement to hearing-assistive devices such as CIs or offer an alternative for people who cannot access CI technology.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Employing deep learning and transfer learning for accurate brain tumor detection",
        "link": "https://www.nature.com/articles/s41598-024-57970-7",
        "publication_date": "27 Mar 2024",
        "abstract": "Artificial intelligence-powered deep learning methods are being used to diagnose brain tumors with high accuracy, owing to their ability to process large amounts of data. Magnetic resonance imaging stands as the gold standard for brain tumor diagnosis using machine vision, surpassing computed tomography, ultrasound, and X-ray imaging in its effectiveness. Despite this, brain tumor diagnosis remains a challenging endeavour due to the intricate structure of the brain. This study delves into the potential of deep transfer learning architectures to elevate the accuracy of brain tumor diagnosis. Transfer learning is a machine learning technique that allows us to repurpose pre-trained models on new tasks. This can be particularly useful for medical imaging tasks, where labelled data is often scarce. Four distinct transfer learning architectures were assessed in this study: ResNet152, VGG19, DenseNet169, and MobileNetv3. The models were trained and validated on a dataset from benchmark database: Kaggle. Five-fold cross validation was adopted for training and testing. To enhance the balance of the dataset and improve the performance of the models, image enhancement techniques were applied to the data for the four categories: pituitary, normal, meningioma, and glioma. MobileNetv3 achieved the highest accuracy of 99.75%, significantly outperforming other existing methods. This demonstrates the potential of deep transfer learning architectures to revolutionize the field of brain tumor diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Proteomics for optimizing therapy in acute myeloid leukemia: venetoclax plus hypomethylating agents versus conventional chemotherapy",
        "link": "https://www.nature.com/articles/s41375-024-02208-8",
        "publication_date": "26 Mar 2024",
        "abstract": "The use of Hypomethylating agents combined with Venetoclax (VH) for the treatment of Acute Myeloid Leukemia (AML) has greatly improved outcomes in recent years. However not all patients benefit from the VH regimen and a way to rationally select between VH and Conventional Chemotherapy (CC) for individual AML patients is needed. Here, we developed a proteomic-based triaging strategy using Reverse-phase Protein Arrays (RPPA) to optimize therapy selection. We evaluated the expression of 411 proteins in 810 newly diagnosed adult AML patients, identifying 109 prognostic proteins, that divided into five patient expression profiles, which are useful for optimizing therapy selection. Furthermore, using machine learning algorithms, we determined a set of 14 proteins, among those 109, that were able to accurately recommend therapy, making it feasible for clinical application. Next, we identified a group of patients who did not benefit from either VH or CC and proposed target-based approaches to improve outcomes. Finally, we calculated that the clinical use of our proteomic strategy would have led to a change in therapy for 30% of patients, resulting in a 43% improvement in OS, resulting in around 2600 more cures from AML per year in the United States.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Integrated image and location analysis for wound classification: a deep learning approach",
        "link": "https://www.nature.com/articles/s41598-024-56626-w",
        "publication_date": "25 Mar 2024",
        "abstract": "The global burden of acute and chronic wounds presents a compelling case for enhancing wound classification methods, a vital step in diagnosing and determining optimal treatments. Recognizing this need, we introduce an innovative multi-modal network based on a deep convolutional neural network for categorizing wounds into four categories: diabetic, pressure, surgical, and venous ulcers. Our multi-modal network uses wound images and their corresponding body locations for more precise classification. A unique aspect of our methodology is incorporating a body map system that facilitates accurate wound location tagging, improving upon traditional wound image classification techniques. A distinctive feature of our approach is the integration of models such as VGG16, ResNet152, and EfficientNet within a novel architecture. This architecture includes elements like spatial and channel-wise Squeeze-and-Excitation modules, Axial Attention, and an Adaptive Gated Multi-Layer Perceptron, providing a robust foundation for classification. Our multi-modal network was trained and evaluated on two distinct datasets comprising relevant images and corresponding location information. Notably, our proposed network outperformed traditional methods, reaching an accuracy range of 74.79–100% for Region of Interest (ROI) without location classifications, 73.98–100% for ROI with location classifications, and 78.10–100% for whole image classifications. This marks a significant enhancement over previously reported performance metrics in the literature. Our results indicate the potential of our multi-modal network as an effective decision-support tool for wound image classification, paving the way for its application in various clinical contexts.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Radiomics analysis for distinctive identification of COVID-19 pulmonary nodules from other benign and malignant counterparts",
        "link": "https://www.nature.com/articles/s41598-024-57899-x",
        "publication_date": "25 Mar 2024",
        "abstract": "This observational study investigated the potential of radiomics as a non-invasive adjunct to CT in distinguishing COVID-19 lung nodules from other benign and malignant lung nodules. Lesion segmentation, feature extraction, and machine learning algorithms, including decision tree, support vector machine, random forest, feed-forward neural network, and discriminant analysis, were employed in the radiomics workflow. Key features such as Idmn, skewness, and long-run low grey level emphasis were identified as crucial in differentiation. The model demonstrated an accuracy of 83% in distinguishing COVID-19 from other benign nodules and 88% from malignant nodules. This study concludes that radiomics, through machine learning, serves as a valuable tool for non-invasive discrimination between COVID-19 and other benign and malignant lung nodules. The findings suggest the potential complementary role of radiomics in patients with COVID-19 pneumonia exhibiting lung nodules and suspicion of concurrent lung pathologies. The clinical relevance lies in the utilization of radiomics analysis for feature extraction and classification, contributing to the enhanced differentiation of lung nodules, particularly in the context of COVID-19.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The genetic architecture of multimodal human brain age",
        "link": "https://www.nature.com/articles/s41467-024-46796-6",
        "publication_date": "23 Mar 2024",
        "abstract": "The complex biological mechanisms underlying human brain aging remain incompletely understood. This study investigated the genetic architecture of three brain age gaps (BAG) derived from gray matter volume (GM-BAG), white matter microstructure (WM-BAG), and functional connectivity (FC-BAG). We identified sixteen genomic loci that reached genome-wide significance (P-value < 5×10−8). A gene-drug-disease network highlighted genes linked to GM-BAG for treating neurodegenerative and neuropsychiatric disorders and WM-BAG genes for cancer therapy. GM-BAG displayed the most pronounced heritability enrichment in genetic variants within conserved regions. Oligodendrocytes and astrocytes, but not neurons, exhibited notable heritability enrichment in WM and FC-BAG, respectively. Mendelian randomization identified potential causal effects of several chronic diseases on brain aging, such as type 2 diabetes on GM-BAG and AD on WM-BAG. Our results provide insights into the genetics of human brain aging, with clinical implications for potential lifestyle and therapeutic interventions. All results are publicly available at https://labs.loni.usc.edu/medicine.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Color-CADx: a deep learning approach for colorectal cancer classification through triple convolutional neural networks and discrete cosine transform",
        "link": "https://www.nature.com/articles/s41598-024-56820-w",
        "publication_date": "22 Mar 2024",
        "abstract": "Colorectal cancer (CRC) exhibits a significant death rate that consistently impacts human lives worldwide. Histopathological examination is the standard method for CRC diagnosis. However, it is complicated, time-consuming, and subjective. Computer-aided diagnostic (CAD) systems using digital pathology can help pathologists diagnose CRC faster and more accurately than manual histopathology examinations. Deep learning algorithms especially convolutional neural networks (CNNs) are advocated for diagnosis of CRC. Nevertheless, most previous CAD systems obtained features from one CNN, these features are of huge dimension. Also, they relied on spatial information only to achieve classification. In this paper, a CAD system is proposed called “Color-CADx” for CRC recognition. Different CNNs namely ResNet50, DenseNet201, and AlexNet are used for end-to-end classification at different training–testing ratios. Moreover, features are extracted from these CNNs and reduced using discrete cosine transform (DCT). DCT is also utilized to acquire spectral representation. Afterward, it is used to further select a reduced set of deep features. Furthermore, DCT coefficients obtained in the previous step are concatenated and the analysis of variance (ANOVA) feature selection approach is applied to choose significant features. Finally, machine learning classifiers are employed for CRC classification. Two publicly available datasets were investigated which are the NCT-CRC-HE-100 K dataset and the Kather_texture_2016_image_tiles dataset. The highest achieved accuracy reached 99.3% for the NCT-CRC-HE-100 K dataset and 96.8% for the Kather_texture_2016_image_tiles dataset. DCT and ANOVA have successfully lowered feature dimensionality thus reducing complexity. Color-CADx has demonstrated efficacy in terms of accuracy, as its performance surpasses that of the most recent advancements.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a novel risk classification tool for predicting long length of stay in NICU blood transfusion infants",
        "link": "https://www.nature.com/articles/s41598-024-57502-3",
        "publication_date": "22 Mar 2024",
        "abstract": "Newborns are as the primary recipients of blood transfusions. There is a possibility of an association between blood transfusion and unfavorable outcomes. Such complications not only imperil the lives of newborns but also cause long hospitalization. Our objective is to explore the predictor variables that may lead to extended hospital stays in neonatal intensive care unit (NICU) patients who have undergone blood transfusions and develop a predictive nomogram. A retrospective review of 539 neonates who underwent blood transfusion was conducted using median and interquartile ranges to describe their length of stay (LOS). Neonates with LOS above the 75th percentile (P75) were categorized as having a long LOS. The Least Absolute Shrinkage and Selection Operator (LASSO) regression method was employed to screen variables and construct a risk model for long LOS. A multiple logistic regression prediction model was then constructed using the selected variables from the LASSO regression model. The significance of the prediction model was evaluated by calculating the area under the ROC curve (AUC) and assessing the confidence interval around the AUC. The calibration curve is used to further validate the model’s calibration and predictability. The model’s clinical effectiveness was assessed through decision curve analysis. To evaluate the generalizability of the model, fivefold cross-validation was employed. Internal validation of the models was performed using bootstrap validation. Among the 539 infants who received blood transfusions, 398 infants (P75) had a length of stay (LOS) within the normal range of 34 days, according to the interquartile range. However, 141 infants (P75) experienced long LOS beyond the normal range. The predictive model included six variables: gestational age (GA) (< 28 weeks), birth weight (BW) (< 1000 g), type of respiratory support, umbilical venous catheter (UVC), sepsis, and resuscitation frequency. The area under the receiver operating characteristic (ROC) curve (AUC) for the training set was 0.851 (95% CI 0.805–0.891), and for the validation set, it was 0.859 (95% CI 0.789–0.920). Fivefold cross-validation indicates that the model has good generalization ability. The calibration curve demonstrated a strong correlation between the predicted risk and the observed actual risk, indicating good consistency. When the intervention threshold was set at 2%, the decision curve analysis indicated that the model had greater clinical utility. The results of our study have led to the development of a novel nomogram that can assist clinicians in predicting the probability of long hospitalization in blood transfused infants with reasonable accuracy. Our findings indicate that GA (< 28 weeks), BW(< 1000 g), type of respiratory support, UVC, sepsis, and resuscitation frequency are associated with a higher likelihood of extended hospital stays among newborns who have received blood transfusions.",
        "conclusions": "The present study introduced a novel nomogram that demonstrates satisfactory accuracy in assisting clinicians to assess the risk of long LOS in infants undergoing blood transfusion. GA (< 28 weeks), BW(< 1000 g), respiratory support type, UVC, sepsis and rescue frequency (≥ 3 times) were related to an increased risk of long length of NICU stay in infants receiving blood transfusion. This model can help healthcare professionals stratify the risk level of long hospital stay for children undergoing blood transfusion in NICU, conduct appropriate clinical interventions, and effectively allocate medical resources.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Inter hospital external validation of interpretable machine learning based triage score for the emergency department using common data model",
        "link": "https://www.nature.com/articles/s41598-024-54364-7",
        "publication_date": "20 Mar 2024",
        "abstract": "Emergency departments (ED) are complex, triage is a main task in the ED to prioritize patient with limited medical resources who need them most. Machine learning (ML) based ED triage tool, Score for Emergency Risk Prediction (SERP), was previously developed using an interpretable ML framework with single center. We aimed to develop SERP with 3 Korean multicenter cohorts based on common data model (CDM) without data sharing and compare performance with inter-hospital validation design. This retrospective cohort study included all adult emergency visit patients of 3 hospitals in Korea from 2016 to 2017. We adopted CDM for the standardized multicenter research. The outcome of interest was 2-day mortality after the patients’ ED visit. We developed each hospital SERP using interpretable ML framework and validated inter-hospital wisely. We accessed the performance of each hospital’s score based on some metrics considering data imbalance strategy. The study population for each hospital included 87,670, 83,363 and 54,423 ED visits from 2016 to 2017. The 2-day mortality rate were 0.51%, 0.56% and 0.65%. Validation results showed accurate for inter hospital validation which has at least AUROC of 0.899 (0.858–0.940). We developed multicenter based Interpretable ML model using CDM for 2-day mortality prediction and executed Inter-hospital external validation which showed enough high accuracy.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Mimicking clinical trials with synthetic acute myeloid leukemia patients using generative artificial intelligence",
        "link": "https://www.nature.com/articles/s41746-024-01076-x",
        "publication_date": "20 Mar 2024",
        "abstract": "Clinical research relies on high-quality patient data, however, obtaining big data sets is costly and access to existing data is often hindered by privacy and regulatory concerns. Synthetic data generation holds the promise of effectively bypassing these boundaries allowing for simplified data accessibility and the prospect of synthetic control cohorts. We employed two different methodologies of generative artificial intelligence – CTAB-GAN+ and normalizing flows (NFlow) – to synthesize patient data derived from 1606 patients with acute myeloid leukemia, a heterogeneous hematological malignancy, that were treated within four multicenter clinical trials. Both generative models accurately captured distributions of demographic, laboratory, molecular and cytogenetic variables, as well as patient outcomes yielding high performance scores regarding fidelity and usability of both synthetic cohorts (n = 1606 each). Survival analysis demonstrated close resemblance of survival curves between original and synthetic cohorts. Inter-variable relationships were preserved in univariable outcome analysis enabling explorative analysis in our synthetic data. Additionally, training sample privacy is safeguarded mitigating possible patient re-identification, which we quantified using Hamming distances. We provide not only a proof-of-concept for synthetic data generation in multimodal clinical data for rare diseases, but also full public access to synthetic data sets to foster further research.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "data reconstruction"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Plasma neutrophil gelatinase-associated lipocalin independently predicts dialysis need and mortality in critical COVID-19",
        "link": "https://www.nature.com/articles/s41598-024-57409-z",
        "publication_date": "20 Mar 2024",
        "abstract": "Neutrophil gelatinase-associated lipocalin (NGAL) is a novel kidney injury and inflammation biomarker. We investigated whether NGAL could be used to predict continuous renal replacement therapy (CRRT) and mortality in critical coronavirus disease 2019 (COVID-19). This prospective multicenter cohort study included adult COVID-19 patients in six intensive care units (ICUs) in Sweden between May 11, 2020 and May 10, 2021. Blood was sampled at admission, days two and seven in the ICU. The samples were batch analyzed for NGAL, creatinine, and cystatin c after the end of the study period. Initiation of CRRT and 90-day survival were used as dependent variables in regression models. Of 498 included patients, 494 were analyzed regarding CRRT and 399 were analyzed regarding survival. Seventy patients received CRRT and 154 patients did not survive past 90 days. NGAL, in combination with creatinine and cystatin c, predicted the subsequent initiation of CRRT with an area under the curve (AUC) of 0.95. For mortality, NGAL, in combination with age and sex, had an AUC of 0.83. In conclusion, NGAL is a valuable biomarker for predicting subsequent initiation of CRRT and 90-day mortality in critical COVID-19. NGAL should be considered when developing future clinical scoring systems.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Performance of probable dementia classification in a European multi-country survey",
        "link": "https://www.nature.com/articles/s41598-024-56734-7",
        "publication_date": "20 Mar 2024",
        "abstract": "Feasibility constraints limit availability of validated cognitive assessments in observational studies. Algorithm-based identification of ‘probable dementia’ is thus needed, but no algorithm developed so far has been applied in the European context. The present study sought to explore the usefulness of the Langa–Weir (LW) algorithm to detect ‘probable dementia’ while accounting for country-level variation in prevalence and potential underreporting of dementia. Data from 56 622 respondents of the Survey of Health, Ageing and Retirement in Europe (SHARE, 2017) aged 60 years and older with non-missing data were analyzed. Performance of LW was compared to a logistic regression, random forest and XGBoost classifier. Population-level ‘probable dementia’ prevalence was compared to estimates based on data from the Organisation for Economic Co-operation and Development. As such, application of the prevalence-specific LW algorithm, based on recall and limitations in instrumental activities of daily living, reduced underreporting from 61.0 (95% CI, 53.3–68.7%) to 30.4% (95% CI, 19.3–41.4%), outperforming tested machine learning algorithms. Performance in other domains of health and cognitive function was similar for participants classified ‘probable dementia’ and those self-reporting physician-diagnosis of dementia. Dementia classification algorithms can be adapted to cross-national cohort surveys such as SHARE and help reduce underreporting of dementia with a minimal predictor set.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Distinguishing features of Parkinson’s disease fallers based on wireless insole plantar pressure monitoring",
        "link": "https://www.nature.com/articles/s41531-024-00678-2",
        "publication_date": "19 Mar 2024",
        "abstract": "Postural instability is one of the most disabling motor signs of Parkinson’s disease (PD) and often underlies an increased likelihood of falling and loss of independence. Current clinical assessments of PD-related postural instability are based on a retropulsion test, which introduces human error and only evaluates reactive balance. There is an unmet need for objective, multi-dimensional assessments of postural instability that directly reflect activities of daily living in which individuals may experience postural instability. In this study, we trained machine-learning models on insole plantar pressure data from 111 participants (44 with PD and 67 controls) as they performed simulated static and active postural tasks of activities that often occur during daily living. Models accurately classified PD from young controls (area under the curve (AUC) 0.99+/− 0.00), PD from age-matched controls (AUC 0.99+/− 0.01), and PD fallers from PD non-fallers (AUC 0.91+/− 0.08). Utilizing features from both static and active postural tasks significantly improved classification performances, and all tasks were useful for separating PD from controls; however, tasks with higher postural threats were preferred for separating PD fallers from PD non-fallers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A visual-language foundation model for computational pathology",
        "link": "https://www.nature.com/articles/s41591-024-02856-4",
        "publication_date": "19 Mar 2024",
        "abstract": "The accelerated adoption of digital pathology and advances in deep learning have enabled the development of robust models for various pathology tasks across a diverse array of diseases and patient cohorts. However, model training is often difficult due to label scarcity in the medical domain, and a model’s usage is limited by the specific task and disease for which it is trained. Additionally, most models in histopathology leverage only image data, a stark contrast to how humans teach each other and reason about histopathologic entities. We introduce CONtrastive learning from Captions for Histopathology (CONCH), a visual-language foundation model developed using diverse sources of histopathology images, biomedical text and, notably, over 1.17 million image–caption pairs through task-agnostic pretraining. Evaluated on a suite of 14 diverse benchmarks, CONCH can be transferred to a wide range of downstream tasks involving histopathology images and/or text, achieving state-of-the-art performance on histology image classification, segmentation, captioning, and text-to-image and image-to-text retrieval. CONCH represents a substantial leap over concurrent visual-language pretrained systems for histopathology, with the potential to directly facilitate a wide array of machine learning-based workflows requiring minimal or no further supervised fine-tuning.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Denoising OCT videos based on temporal redundancy",
        "link": "https://www.nature.com/articles/s41598-024-56935-0",
        "publication_date": "19 Mar 2024",
        "abstract": "The identification of eye diseases and their progression often relies on a clear visualization of the anatomy and on different metrics extracted from Optical Coherence Tomography (OCT) B-scans. However, speckle noise hinders the quality of rapid OCT imaging, hampering the extraction and reliability of biomarkers that require time series. By synchronizing the acquisition of OCT images with the timing of the cardiac pulse, we transform a low-quality OCT video into a clear version by phase-wrapping each frame to the heart pulsation and averaging frames that correspond to the same instant in the cardiac cycle. Here, we compare the performance of our one-cycle denoising strategy with a deep-learning architecture, Noise2Noise, as well as classical denoising methods such as BM3D and Non-Local Means (NLM). We systematically analyze different image quality descriptors as well as region-specific metrics to assess the denoising performance based on the anatomy of the eye. The one-cycle method achieves the highest denoising performance, increases image quality and preserves the high-resolution structures within the eye tissues. The proposed workflow can be readily implemented in a clinical setting.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Analysis and experimental validation of IL-17 pathway and key genes as central roles associated with inflammation in hepatic ischemia–reperfusion injury",
        "link": "https://www.nature.com/articles/s41598-024-57139-2",
        "publication_date": "18 Mar 2024",
        "abstract": "Hepatic ischemia–reperfusion injury (HIRI) elicits an immune-inflammatory response that may result in hepatocyte necrosis and apoptosis, ultimately culminating in postoperative hepatic dysfunction and hepatic failure. The precise mechanisms governing the pathophysiology of HIRI remain incompletely understood, necessitating further investigation into key molecules and pathways implicated in disease progression to guide drug discovery and potential therapeutic interventions. Gene microarray data was downloaded from the GEO expression profile database. Integrated bioinformatic analyses were performed to identify HIRI signature genes, which were subsequently validated for expression levels and diagnostic efficacy. Finally, the gene expression was verified in an experimental HIRI model and the effect of anti-IL17A antibody intervention in three time points (including pre-ischemic, post-ischemic, and at 1 h of reperfusion) on HIRI and the expression of these genes was investigated. Bioinformatic analyses of the screened characterized genes revealed that inflammation, immune response, and cell death modulation were significantly associated with HIRI pathophysiology. CCL2, BTG2, GADD45A, FOS, CXCL10, TNFRSF12A, and IL-17 pathway were identified as key components involved in the HIRI. Serum and liver IL-17A expression were significantly upregulated during the initial phase of HIRI. Pretreatment with anti-IL-17A antibody effectively alleviated the damage of liver tissue, suppressed inflammatory factors, and serum transaminase levels, and downregulated the mRNA expression of CCL2, GADD45A, FOS, CXCL10, and TNFRSF12A. Injection of anti-IL17A antibody after ischemia and at 1 h of reperfusion failed to demonstrate anti-inflammatory and attenuating HIRI benefits relative to earlier intervention. Our study reveals that the IL-17 pathway and related genes may be involved in the proinflammatory mechanism of HIRI, which may provide a new perspective and theoretical basis for the prevention and treatment of HIRI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Fully automated landmarking and facial segmentation on 3D photographs",
        "link": "https://www.nature.com/articles/s41598-024-56956-9",
        "publication_date": "18 Mar 2024",
        "abstract": "Three-dimensional facial stereophotogrammetry provides a detailed representation of craniofacial soft tissue without the use of ionizing radiation. While manual annotation of landmarks serves as the current gold standard for cephalometric analysis, it is a time-consuming process and is prone to human error. The aim in this study was to develop and evaluate an automated cephalometric annotation method using a deep learning-based approach. Ten landmarks were manually annotated on 2897 3D facial photographs. The automated landmarking workflow involved two successive DiffusionNet models. The dataset was randomly divided into a training and test dataset. The precision of the workflow was evaluated by calculating the Euclidean distances between the automated and manual landmarks and compared to the intra-observer and inter-observer variability of manual annotation and a semi-automated landmarking method. The workflow was successful in 98.6% of all test cases. The deep learning-based landmarking method achieved precise and consistent landmark annotation. The mean precision of 1.69 ± 1.15 mm was comparable to the inter-observer variability (1.31 ± 0.91 mm) of manual annotation. Automated landmark annotation on 3D photographs was achieved with the DiffusionNet-based approach. The proposed method allows quantitative analysis of large datasets and may be used in diagnosis, follow-up, and virtual surgical planning.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Advanced brain aging in Parkinson’s disease with cognitive impairment",
        "link": "https://www.nature.com/articles/s41531-024-00673-7",
        "publication_date": "16 Mar 2024",
        "abstract": "Patients with Parkinson’s disease and cognitive impairment (PD-CI) deteriorate faster than those without cognitive impairment (PD-NCI), suggesting an underlying difference in the neurodegeneration process. We aimed to verify brain age differences in PD-CI and PD-NCI and their clinical significance. A total of 94 participants (PD-CI, n = 27; PD-NCI, n = 34; controls, n = 33) were recruited. Predicted age difference (PAD) based on gray matter (GM) and white matter (WM) features were estimated to represent the degree of brain aging. Patients with PD-CI showed greater GM-PAD (7.08 ± 6.64 years) and WM-PAD (8.82 ± 7.69 years) than those with PD-NCI (GM: 1.97 ± 7.13, Padjusted = 0.011; WM: 4.87 ± 7.88, Padjusted = 0.049) and controls (GM: -0.58 ± 7.04, Padjusted = 0.004; WM: 0.88 ± 7.45, Padjusted = 0.002) after adjusting demographic factors. In patients with PD, GM-PAD was negatively correlated with MMSE (Padjusted = 0.011) and MoCA (Padjusted = 0.013) and positively correlated with UPDRS Part II (Padjusted = 0.036). WM-PAD was negatively correlated with logical memory of immediate and delayed recalls (Padjusted = 0.003 and Padjusted < 0.001). Also, altered brain regions in PD-CI were identified and significantly correlated with brain age measures, implicating the neuroanatomical underpinning of neurodegeneration in PD-CI. Moreover, the brain age metrics can improve the classification between PD-CI and PD-NCI. The findings suggest that patients with PD-CI had advanced brain aging that was associated with poor cognitive functions. The identified neuroimaging features and brain age measures can serve as potential biomarkers of PD-CI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Lesion-conditioning of synthetic MRI-derived subtraction-MIPs of the breast using a latent diffusion model",
        "link": "https://www.nature.com/articles/s41598-024-56853-1",
        "publication_date": "16 Mar 2024",
        "abstract": "The purpose of this feasibility study is to investigate if latent diffusion models (LDMs) are capable to generate contrast enhanced (CE) MRI-derived subtraction maximum intensity projections (MIPs) of the breast, which are conditioned by lesions. We trained an LDM with n = 2832 CE-MIPs of breast MRI examinations of n = 1966 patients (median age: 50 years) acquired between the years 2015 and 2020. The LDM was subsequently conditioned with n = 756 segmented lesions from n = 407 examinations, indicating their location and BI-RADS scores. By applying the LDM, synthetic images were generated from the segmentations of an independent validation dataset. Lesions, anatomical correctness, and realistic impression of synthetic and real MIP images were further assessed in a multi-rater study with five independent raters, each evaluating n = 204 MIPs (50% real/50% synthetic images). The detection of synthetic MIPs by the raters was akin to random guessing with an AUC of 0.58. Interrater reliability of the lesion assessment was high both for real (Kendall’s W = 0.77) and synthetic images (W = 0.85). A higher AUC was observed for the detection of suspicious lesions (BI-RADS \\(\\ge \\) 4) in synthetic MIPs (0.88 vs. 0.77; p = 0.051). Our results show that LDMs can generate lesion-conditioned MRI-derived CE subtraction MIPs of the breast, however, they also indicate that the LDM tended to generate rather typical or ‘textbook representations’ of lesions.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Foundation model for cancer imaging biomarkers",
        "link": "https://www.nature.com/articles/s42256-024-00807-9",
        "publication_date": "15 Mar 2024",
        "abstract": "Foundation models in deep learning are characterized by a single large-scale model trained on vast amounts of data serving as the foundation for various downstream tasks. Foundation models are generally trained using self-supervised learning and excel in reducing the demand for training samples in downstream applications. This is especially important in medicine, where large labelled datasets are often scarce. Here, we developed a foundation model for cancer imaging biomarker discovery by training a convolutional encoder through self-supervised learning using a comprehensive dataset of 11,467 radiographic lesions. The foundation model was evaluated in distinct and clinically relevant applications of cancer imaging-based biomarkers. We found that it facilitated better and more efficient learning of imaging biomarkers and yielded task-specific models that significantly outperformed conventional supervised and other state-of-the-art pretrained implementations on downstream tasks, especially when training dataset sizes were very limited. Furthermore, the foundation model was more stable to input variations and showed strong associations with underlying biology. Our results demonstrate the tremendous potential of foundation models in discovering new imaging biomarkers that may extend to other clinical use cases and can accelerate the widespread translation of imaging biomarkers into clinical settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based algorithms applied to drug prescriptions and other healthcare services in the Sicilian claims database to identify acromegaly as a model for the earlier diagnosis of rare diseases",
        "link": "https://www.nature.com/articles/s41598-024-56240-w",
        "publication_date": "14 Mar 2024",
        "abstract": "Acromegaly is a rare disease characterized by a diagnostic delay ranging from 5 to 10 years from the symptoms’ onset. The aim of this study was to develop and internally validate machine-learning algorithms to identify a combination of variables for the early diagnosis of acromegaly. This retrospective population-based study was conducted between 2011 and 2018 using data from the claims databases of Sicily Region, in Southern Italy. To identify combinations of potential predictors of acromegaly diagnosis, conditional and unconditional penalized multivariable logistic regression models and three machine learning algorithms (i.e., the Recursive Partitioning and Regression Tree, the Random Forest and the Support Vector Machine) were used, and their performance was evaluated. The random forest (RF) algorithm achieved the highest Area under the ROC Curve value of 0.83 (95% CI 0.79–0.87). The sensitivity in the test set, computed at the optimal threshold of predicted probabilities, ranged from 28% for the unconditional logistic regression model to 69% for the RF. Overall, the only diagnosis predictor selected by all five models and algorithms was the number of immunosuppressants-related pharmacy claims. The other predictors selected by at least two models were eventually combined in an unconditional logistic regression to develop a meta-score that achieved an acceptable discrimination accuracy (AUC = 0.71, 95% CI 0.66–0.75). Findings of this study showed that data-driven machine learning algorithms may play a role in supporting the early diagnosis of rare diseases such as acromegaly.",
        "conclusions": "In this study we developed and internally validated machine-learning algorithms for the early diagnosis of acromegaly using administrative claims databases. Findings showed that data-driven machine learning algorithms can play a role in predicting the diagnosis of rare diseases such as acromegaly. Of the five predictive algorithms developed, only the RF yielded an excellent discriminatory power, while the others achieved poor diagnostic accuracy and the meta-score developed on the predictors selected by at least two algorithms achieved an acceptable accuracy. The predictor mostly associated with the presence of acromegaly was the number of pharmacy claims related to immunosuppressants, potentially suggesting that systemic inflammation and/or autoimmune diseases may be key predictors of acromegaly diagnosis.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Preserving fairness and diagnostic accuracy in private large-scale AI models for medical imaging",
        "link": "https://www.nature.com/articles/s43856-024-00462-6",
        "publication_date": "14 Mar 2024",
        "abstract": "Artificial intelligence (AI) models are increasingly used in the medical domain. However, as medical data is highly sensitive, special precautions to ensure its protection are required. The gold standard for privacy preservation is the introduction of differential privacy (DP) to model training. Prior work indicates that DP has negative implications on model accuracy and fairness, which are unacceptable in medicine and represent a main barrier to the widespread use of privacy-preserving techniques. In this work, we evaluated the effect of privacy-preserving training of AI models regarding accuracy and fairness compared to non-private training.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "membership inference",
                "model inversion",
                "data reconstruction"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Three-dimensional choroidal contour mapping in healthy population",
        "link": "https://www.nature.com/articles/s41598-024-56376-9",
        "publication_date": "14 Mar 2024",
        "abstract": "Purpose was to study 3-dimensional choroidal contour at choroidal inner boundary (CIB) and choroidal outer boundary (COB) in healthy eyes. Healthy eyes imaged on wide field swept-source optical coherence tomography were included. Delineation of CIB and COB was done based on our previously reported methods. Quantitative analysis of the surfaces of CIB and COB was based on analyzing best fit spherical radius (R) (overall and sectoral). One hundred and seven eyes of 74 subjects with a mean age of 46.4 ± 19.3 years were evaluated. Overall, R COB (mean ± SD: 22.5 ± 4.8 mm) < R CIB (32.4 ± 9.4 mm). Central sector had the least R at COB (7.2 ± 5.9 mm) as well as CIB (25.1 ± 14.3 mm) across all age groups. Regression analysis between R (CIB) and age (r = −0.31, r2 = 0.09) showed negative correlation (P < 0.001) and that between R (COB) and age was positive (r = 0.26, r2 = 0.07) (P = 0.01). To conclude, central sector is the steepest sector in comparison to all the other sectors. This is indicative of a prolate shape of choroidal contour at CIB and COB. Outer boundary of choroid is steeper than inner boundary across all age groups. However, with ageing, outer boundary becomes flatter and inner boundary becomes steeper.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identification of a hyperinflammatory sepsis phenotype using protein biomarker and clinical data in the ProCESS randomized trial",
        "link": "https://www.nature.com/articles/s41598-024-55667-5",
        "publication_date": "14 Mar 2024",
        "abstract": "Sepsis is a heterogeneous syndrome and phenotypes have been proposed using clinical data. Less is known about the contribution of protein biomarkers to clinical sepsis phenotypes and their importance for treatment effects in randomized trials of resuscitation. The objective is to use both clinical and biomarker data in the Protocol-Based Care for Early Septic Shock (ProCESS) randomized trial to determine sepsis phenotypes and to test for heterogeneity of treatment effect by phenotype comparing usual care to protocolized early, goal-directed therapy(EGDT). In this secondary analysis of a subset of patients with biomarker sampling in the ProCESS trial (n = 543), we identified sepsis phenotypes prior to randomization using latent class analysis of 20 clinical and biomarker variables. Logistic regression was used to test for interaction between phenotype and treatment arm for 60-day inpatient mortality. Among 543 patients with severe sepsis or septic shock in the ProCESS trial, a 2-class model best fit the data (p = 0.01). Phenotype 1 (n = 66, 12%) had increased IL-6, ICAM, and total bilirubin and decreased platelets compared to phenotype 2 (n = 477, 88%, p < 0.01 for all). Phenotype 1 had greater 60-day inpatient mortality compared to Phenotype 2 (41% vs 16%; p < 0.01). Treatment with EGDT was associated with worse 60-day inpatient mortality compared to usual care (58% vs. 23%) in Phenotype 1 only (p-value for interaction = 0.05). The 60-day inpatient mortality was similar comparing EGDT to usual care in Phenotype 2 (16% vs. 17%). We identified 2 sepsis phenotypes using latent class analysis of clinical and protein biomarker data at randomization in the ProCESS trial. Phenotype 1 had increased inflammation, organ dysfunction and worse clinical outcomes compared to phenotype 2. Response to EGDT versus usual care differed by phenotype.",
        "conclusions": "We used latent class analysis to identify two severe sepsis phenotypes with distinct clinical and biomarker profiles in the ProCESS trial. Phenotype 1 has increased inflammation, organ dysfunction and worse clinical outcomes. Response to EGDT versus usual care differed by phenotype. Treatment with protocolized EGDT was associated with worse 60-day inpatient mortality in phenotype 1 compared to usual care, and not associated with change in outcomes in phenotype 2.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of a crowdsourcing- and gamification-based mobile application to collect epidemiological information and promote healthy lifestyles in Mexico",
        "link": "https://www.nature.com/articles/s41598-024-56761-4",
        "publication_date": "14 Mar 2024",
        "abstract": "We developed a mobile application to promote healthy lifestyles and collect non-communicable disease (NCD) data in Mexico. Its theoretical foundations are supported by a framework-guided literature review. With design sprints, Scrum, Model-View-Controller, and Representational State Transfer architecture, we operationalized evidence-based nutrition/physical activity information into a crowdsourcing- and gamification-based application. The application was piloted for three months to monitor the response of 520 adults. Potential improvements were characterized, considering benchmarking, expert guidance, and standards. Salud Activa (English: Active Health) has two crowdsourcing modules: Nutritional scanner, scanning products' bar codes, providing nutritional data, and allowing new product registry feeding our databases; Surveys, comprising gradually-released NCD questions. Three intervention modules were generated: Drinks diary, a beverage assessment component to receive hydration recommendations; Step counter, monitoring users’ steps via Google Fit/Health—iOS; Metabolic Avatar, interconnecting modules and changing as a function of beverage and step records. The 3-month median of Salud Activa use was seven days (IQR = 3–12), up to 35% of participants completed a Survey section, and 157 food products were registered through Nutritional scanner. Better customization might benefit usability and user engagement. Quantitative and qualitative data will enhance Salud Activa’s design, user uptake, and efficacy in interventions delivered through this platform.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Super-resolution deep neural network (SRDNN) based multi-image steganography for highly secured lossless image transmission",
        "link": "https://www.nature.com/articles/s41598-024-54839-7",
        "publication_date": "13 Mar 2024",
        "abstract": "Information exchange and communication through the Internet are one of the most crucial aspects of today’s information technology world. The security of information transmitted online has grown to be a critical concern, particularly in the transfer of medical data. To overcome this, the data must be delivered securely without being altered or lost. This can be possibly done by combining the principles of cryptography and steganography. In the recent past, steganography is used with simpler methods like the least significant bit manipulation technique, in order to encode a lower-resolution image into a higher-resolution image. Here, we attempt to use deep neural networks to combine many two-dimensional colour images of the same resolution into a single cover image with the same resolution. In this technique, many secret images are concealed inside a single cover image using deep neural networks. The embedded cover image is then encrypted using a 3D chaotic map for diffusion and elliptic curve cryptography (ECC) for confusion to increase security.Supporting the fact that neural networks experience losses, the proposed system recovers up to 93% of the hidden image concealed in the original image. As the secret image features are identified and combined along with the cover image, the time complexity involved in the security process is minimized by 78% compared to securing the original data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "A risk prediction nomogram for resistant hypertension in patients with obstructive sleep apnea",
        "link": "https://www.nature.com/articles/s41598-024-56629-7",
        "publication_date": "13 Mar 2024",
        "abstract": "Patients with obstructive sleep apnea (OSA) are liable to have resistant hypertension (RH) associated with unfavorable cardiovascular events. It is of necessity to predict OSA patients who are susceptible to resistant hypertension. Hence, we conducted a retrospective study based on the clinical records of OSA patients admitted to Yixing Hospital Affiliated to Jiangsu University from January 2018 to December 2022. According to different time periods, patients diagnosed between January 2018 and December 2021 were included in the training set (n = 539) for modeling, and those diagnosed between January 2022 and December 2022 were enrolled into the validation set (n = 259) for further assessment. The incidence of RH in the training set and external validation set was comparable (P = 0.396). The related clinical data of patients enrolled were collected and analyzed through univariate analysis and least absolute shrinkage and selection operator (LASSO) logistic regression analysis to identify independent risk factors and construct a nomogram. Finally, five variables were confirmed as independent risk factors for OSA patients with RH, including smoking, heart disease, neck circumference, AHI and T90. The nomogram established on the basis of variables above was shown to have good discrimination and calibration in both the training set and validation set. Decision curve analysis indicated that the nomogram was useful for a majority of OSA patients. Therefore, our nomogram might be useful to identify OSA patients at high risk of developing RH and facilitate the individualized management of OSA patients in clinical practice.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Disease progression strikingly differs in research and real-world Parkinson’s populations",
        "link": "https://www.nature.com/articles/s41531-024-00667-5",
        "publication_date": "13 Mar 2024",
        "abstract": "Characterization of Parkinson’s disease (PD) progression using real-world evidence could guide clinical trial design and identify subpopulations. Efforts to curate research populations, the increasing availability of real-world data, and advances in natural language processing, particularly large language models, allow for a more granular comparison of populations than previously possible. This study includes two research populations and two real-world data-derived (RWD) populations. The research populations are the Harvard Biomarkers Study (HBS, N = 935), a longitudinal biomarkers cohort study with in-person structured study visits; and Fox Insights (N = 36,660), an online self-survey-based research study of the Michael J. Fox Foundation. Real-world cohorts are the Optum Integrated Claims-electronic health records (N = 157,475), representing wide-scale linked medical and claims data and de-identified data from Mass General Brigham (MGB, N = 22,949), an academic hospital system. Structured, de-identified electronic health records data at MGB are supplemented using a manually validated natural language processing with a large language model to extract measurements of PD progression. Motor and cognitive progression scores change more rapidly in MGB than HBS (median survival until H&Y 3: 5.6 years vs. >10, p < 0.001; mini-mental state exam median decline 0.28 vs. 0.11, p < 0.001; and clinically recognized cognitive decline, p = 0.001). In real-world populations, patients are diagnosed more than eleven years later (RWD mean of 72.2 vs. research mean of 60.4, p < 0.001). After diagnosis, in real-world cohorts, treatment with PD medications has initiated an average of 2.3 years later (95% CI: [2.1–2.4]; p < 0.001). This study provides a detailed characterization of Parkinson’s progression in diverse populations. It delineates systemic divergences in the patient populations enrolled in research settings vs. patients in the real-world. These divergences are likely due to a combination of selection bias and real population differences, but exact attribution of the causes is challenging. This study emphasizes a need to utilize multiple data sources and to diligently consider potential biases when planning, choosing data sources, and performing downstream tasks and analyses.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Application of machine learning algorithms for accurate determination of bilirubin level on in vitro engineered tissue phantom images",
        "link": "https://www.nature.com/articles/s41598-024-56319-4",
        "publication_date": "12 Mar 2024",
        "abstract": "Neonatal Jaundice is a common occurrence in neonates. High excess bilirubin would lead to hyperbilirubinemia, leading to irreversible adverse damage such as kernicterus. Therefore, it is necessary and important to monitor neonates’ bilirubin levels in real-time for immediate intervention. However, current screening protocols have their inherent limitations, necessitating more convenient measurements. In this proof-of-concept study, we evaluated the feasibility of using machine learning for the screening of hyperbilirubinemia in neonates from smartphone-acquired photographs. Different machine learning models were compared and evaluated to gain a better understanding of feature selection and model performance in bilirubin determination. An in vitro study was conducted with a bilirubin-containing tissue phantom to identify potential biological and environmental confounding factors. The findings of this study present a systematic characterization of the confounding effect of various factors through separate parametric tests. These tests uncover potential techniques in image pre-processing, highlighting important biological features (light scattering property and skin thickness) and external features (ISO, lighting conditions and white balance), which together contribute to robust model approaches for accurately determining bilirubin concentrations. By obtaining an accuracy of 0.848 in classification and 0.812 in regression, these findings indicate strong potential in aiding in the design of clinical studies using patient-derived images.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning radiomics based prediction of axillary lymph node metastasis in breast cancer",
        "link": "https://www.nature.com/articles/s41523-024-00628-4",
        "publication_date": "12 Mar 2024",
        "abstract": "This study aimed to develop and validate a deep learning radiomics nomogram (DLRN) for the preoperative evaluation of axillary lymph node (ALN) metastasis status in patients with a newly diagnosed unifocal breast cancer. A total of 883 eligible patients with breast cancer who underwent preoperative breast and axillary ultrasound were retrospectively enrolled between April 1, 2016, and June 30, 2022. The training cohort comprised 621 patients from Hospital I; the external validation cohorts comprised 112, 87, and 63 patients from Hospitals II, III, and IV, respectively. A DLR signature was created based on the deep learning and handcrafted features, and the DLRN was then developed based on the signature and four independent clinical parameters. The DLRN exhibited good performance, yielding areas under the receiver operating characteristic curve (AUC) of 0.914, 0.929, and 0.952 in the three external validation cohorts, respectively. Decision curve and calibration curve analyses demonstrated the favorable clinical value and calibration of the nomogram. In addition, the DLRN outperformed five experienced radiologists in all cohorts. This has the potential to guide appropriate management of the axilla in patients with breast cancer, including avoiding overtreatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Hierarchical organization of human physical activity",
        "link": "https://www.nature.com/articles/s41598-024-56185-0",
        "publication_date": "12 Mar 2024",
        "abstract": "Human physical activity (HPA), a fundamental physiological signal characteristic of bodily motion is of rapidly growing interest in multidisciplinary research. Here we report the existence of hitherto unidentified hierarchical levels in the temporal organization of HPA on the ultradian scale: on the minute's scale, passive periods are followed by activity bursts of similar intensity (‘quanta’) that are organized into superstructures on the hours- and on the daily scale. The time course of HPA can be considered a stochastic, quasi-binary process, where quanta, assigned to task-oriented actions are organized into work packages on higher levels of hierarchy. In order to grasp the essence of this complex dynamic behaviour, we established a stochastic mathematical model which could reproduce the main statistical features of real activity time series. The results are expected to provide important data for developing novel behavioural models and advancing the diagnostics of neurological or psychiatric diseases.",
        "conclusions": "The above findings imply an intrinsically stochastic and hierarchical structure of the organization of human daytime psychomotor activity on the time scale of minutes to hours, and beyond. The results are perfectly in line with the conclusions of the study of Barabási et al.34, where a statistical analysis of the timing of e-mail communications has revealed a similar ‘bursty’ nature, suggested to be a general feature of human actions, and interpreted as a fundamental consequence of decision-making. Later studies provided evidence for the bursty nature of other human actions, as well, like letter-based communications, web browsing, library visits and stock trading42. Our study contextualizes these conclusions within a broader framework, and extends their applicability to significantly shorter time scales. Benchmark behavioural studies have assumed that in the sequential structure of routine, everyday tasks there must be a pyramidal hierarchy of structural units of increasing duration and complexity, serving a corresponding hierarchy of purposes46,47. The hierarchical levels revealed by our analysis strongly support these hypotheses and are considered to provide important clues together with quantitative data for neurophysiologists developing novel brain and behavioural models47,48.One might suspect, on the other hand, that the described features are not restricted to HPA, but also appear in other physiological time series. In fact, the time course of heartbeat frequency of healthy human subjects also shows a hierarchical (multifractal) structure, that is lost in case of severe heart diseases49, and it has been assigned to an intrinsic multiscale regulatory mechanism16. Analogously, the stochastic nature and hierarchical structure of HPA signals are also expected to have an adaptive function for optimizing human performance in a complex, dynamically varying environment14. However, an essential difference in these two time series is that the rhythmic appearance of heart-rate signals is much more emphasized than that of daytime activity signals, which appear to be much more stochastic, and it is reflected by the different ratio of the charging and the noise currents in the respective integrate-and-fire models. Also, while heart rhythms are mainly controlled by the autonomic (involuntary) nervous system, daytime activities on this time scale are expected to be dominated by conscious control50,51. For a deeper understanding of the effects of autonomic nervous system and voluntary actions in human motion analysis, a combined ECG-actigraphy study is in progress.Nevertheless, already at the present state of knowledge, it is reasonable to assume that malfunctions of the cognitive mechanism should cause alterations of HPA. In fact, in case of mental disorders, like schizophrenia, bipolar psychosis, or action disorganization syndrome, characteristic anomalies in the activity patterns have been reported41,47,52,53,54. Stress has also been shown to disorganize rhythms on the ultradian scale and beyond, in various organisms including humans55,56. Given these premises, the utilization of the sophisticated statistical methods employed in our analysis is anticipated to markedly enhance the diagnostic methodology for psychiatric and neurological disorders41.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "BrainNet: a fusion assisted novel optimal framework of residual blocks and stacked autoencoders for multimodal brain tumor classification",
        "link": "https://www.nature.com/articles/s41598-024-56657-3",
        "publication_date": "11 Mar 2024",
        "abstract": "A significant issue in computer-aided diagnosis (CAD) for medical applications is brain tumor classification. Radiologists could reliably detect tumors using machine learning algorithms without extensive surgery. However, a few important challenges arise, such as (i) the selection of the most important deep learning architecture for classification (ii) an expert in the field who can assess the output of deep learning models. These difficulties motivate us to propose an efficient and accurate system based on deep learning and evolutionary optimization for the classification of four types of brain modalities (t1 tumor, t1ce tumor, t2 tumor, and flair tumor) on a large-scale MRI database. Thus, a CNN architecture is modified based on domain knowledge and connected with an evolutionary optimization algorithm to select hyperparameters. In parallel, a Stack Encoder–Decoder network is designed with ten convolutional layers. The features of both models are extracted and optimized using an improved version of Grey Wolf with updated criteria of the Jaya algorithm. The improved version speeds up the learning process and improves the accuracy. Finally, the selected features are fused using a novel parallel pooling approach that is classified using machine learning and neural networks. Two datasets, BraTS2020 and BraTS2021, have been employed for the experimental tasks and obtained an improved average accuracy of 98% and a maximum single-classifier accuracy of 99%. Comparison is also conducted with several classifiers, techniques, and neural nets; the proposed method achieved improved performance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Unsupervised ensemble-based phenotyping enhances discoverability of genes related to left-ventricular morphology",
        "link": "https://www.nature.com/articles/s42256-024-00801-1",
        "publication_date": "11 Mar 2024",
        "abstract": "Recent genome-wide association studies have successfully identified associations between genetic variants and simple cardiac morphological parameters derived from cardiac magnetic resonance images. However, the emergence of large databases, including genetic data linked to cardiac magnetic resonance facilitates the investigation of more nuanced patterns of cardiac shape variability than those studied so far. Here we propose a framework for gene discovery coined unsupervised phenotype ensembles. The unsupervised phenotype ensemble builds a redundant yet highly expressive representation by pooling a set of phenotypes learnt in an unsupervised manner, using deep learning models trained with different hyperparameters. These phenotypes are then analysed via genome-wide association studies, retaining only highly confident and stable associations across the ensemble. We applied our approach to the UK Biobank database to extract geometric features of the left ventricle from image-derived three-dimensional meshes. We demonstrate that our approach greatly improves the discoverability of genes that influence left ventricle shape, identifying 49 loci with study-wide significance and 25 with suggestive significance. We argue that our approach would enable more extensive discovery of gene associations with image-derived phenotypes for other organs or image modalities.",
        "conclusions": "In this work, we proposed a framework for LV phenotyping based on unsupervised geometric deep learning techniques in image-derived 3D meshes to discover genetic variations that affect the shape of the LV through GWAS. The proposed methodology is based on finding a latent low-dimensional representation of the CMR-derived LV 3D meshes using CoMAs and then performing GWAS on the learnt latent features. As proposed, this dimensionality reduction method, using Kullback–Leibler regularization, yielded phenotypes with statistically significant genetic associations.The methodology of ensembling SNP associations across representations obtained through different network metaparameters, followed by the correction in the Bonferroni threshold necessary to control for false discovery rate, has proven effective in identifying novel associations of mesh-derived phenotypes with genetic loci. In addition to previously identified loci, namely TTN, PLN, GOSR2 and ATXN2, we report 40 additional genetic loci that have not been discovered in recent GWAS of LV phenotypes. Moreover, we report 24 independent associations that do not exceed our corrected Bonferroni threshold; however, their association remains suggestive by virtue of exceeding the usual genome-wide significance threshold of PGW = 5 × 10−8 in more than five unsupervised phenotypes, obtained from independently trained autoencoder networks. Some of the last genes, such as S100A1, LMCD1, RBM20 and FBN1, have been previously linked to cardiac pathways.We argue that the proposed assembly approach is not only useful for discovering novel associations but also enables a deeper understanding of the effect of previously known genes: in fact, the effect of the latent variables with the strongest associations P values for each locus can be used as suggestive evidence of the role of that locus in LV shape. For example, we found that the TTN and PLN variants, which had been previously found to correlate with LV volume, actually have a distinct effect on the shape of the LV. Whereas the TTN variant shows in fact a clear effect on LV size, the PLN variant is linked to a more complex phenotype that involves a concomitant change in LV volume and sphericity.More generally, these results validate our methodology to extract knowledge about the genetics driving the morphology of organs, leveraging databases that provide linked genetic and imaging data, such as the UKBB. This methodology can be used seamlessly to study surface meshes of other organs, such as the brain or the skull64,65. Additionally, the algorithm proposed here can be extended to process 3D cardiac meshes throughout the cardiac cycle to capture anatomy and quantitative features related to contraction and relaxation patterns. Future studies will explore these directions.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Objective sleep quality predicts subjective sleep ratings",
        "link": "https://www.nature.com/articles/s41598-024-56668-0",
        "publication_date": "11 Mar 2024",
        "abstract": "In both clinical and observational studies, sleep quality is usually assessed by subjective self-report. The literature is mixed about how accurately these self-reports track objectively (e.g. via polysomnography) assessed sleep quality, with frequent reports of little to no association. However, previous research on this question focused on between-subject designs, which may be confounded by trait-level variables. In the current study, we used the novel Budapest Sleep, Experiences and Traits Study (BSETS) dataset to investigate if within-subject differences in subjectively reported sleep quality are related to sleep macrostructure and quantitative EEG variables assessed using a mobile EEG headband. We found clear evidence that self-reported sleep quality in the morning is influenced by within-subject variations in sleep onset latency, wake after sleep onset, total sleep time, and sleep efficiency. These effects were replicated if detailed sleep composition metrics (percentage and latency of specific vigilance states) or two alternative measures of subjective sleep quality were used instead. We found no effect of the number of awakenings or relative EEG delta and sigma power. Between-subject effects (relationships between individual mean values of sleep metrics and subjective sleep quality) were also found, highlighting that analyses focusing only on these may be erroneous. Our findings show that while previous investigations of this issue may have been confounded by between-subject effects, objective sleep quality is indeed reflected in subjective sleep ratings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "AI supported fetal echocardiography with quality assessment",
        "link": "https://www.nature.com/articles/s41598-024-56476-6",
        "publication_date": "09 Mar 2024",
        "abstract": "This study aimed to develop a deep learning model to assess the quality of fetal echocardiography and to perform prospective clinical validation. The model was trained on data from the 18–22-week anomaly scan conducted in seven hospitals from 2008 to 2018. Prospective validation involved 100 patients from two hospitals. A total of 5363 images from 2551 pregnancies were used for training and validation. The model's segmentation accuracy depended on image quality measured by a quality score (QS). It achieved an overall average accuracy of 0.91 (SD 0.09) across the test set, with images having above-average QS scoring 0.97 (SD 0.03). During prospective validation of 192 images, clinicians rated 44.8% (SD 9.8) of images as equal in quality, 18.69% (SD 5.7) favoring auto-captured images and 36.51% (SD 9.0) preferring manually captured ones. Images with above average QS showed better agreement on segmentations (p < 0.001) and QS (p < 0.001) with fetal medicine experts. Auto-capture saved additional planes beyond protocol requirements, resulting in more comprehensive echocardiographies. Low QS had adverse effect on both model performance and clinician’s agreement with model feedback. The findings highlight the importance of developing and evaluating AI models based on ‘noisy’ real-life data rather than pursuing the highest accuracy possible with retrospective academic-grade data.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Mixture effects of trace element levels on cardiovascular diseases and type 2 diabetes risk in adults using G-computation analysis",
        "link": "https://www.nature.com/articles/s41598-024-56468-6",
        "publication_date": "08 Mar 2024",
        "abstract": "There is an increasing concern about the health effects of exposure to a mixture of pollutants. This study aimed to evaluate the associations between serum levels of heavy/essential metals ([Arsenic (As), Cadmium (Cd), Mercury (Hg), Lead (Pb), Nickel (Ni), Chromium (Cr), Copper (Cu), Iron (Fe), and Zinc (Zn)]) and the risk of developing cardiovascular diseases (CVDs) and type 2 diabetes mellitus (T2D). Data were collected from 450 participants (150 with CVDs, 150 with T2D, and 150 healthy subjects) randomly selected from the Ravansar Non-Communicable Disease (RaNCD) cohort in Western Iran, covering the years 2018–2023. Trace element levels in the serum samples were assayed using ICP-MS. Logistic regression was performed to estimate the adjusted risk of exposure to single and multi-metals and CVD/T2D. Odds ratios were adjusted for age, sex, education, residential areas, hypertension, and BMI. The mixture effect of exposure to multi-metals and CVD/T2D was obtained using Quantile G-computation (QGC). In the logistic regression model, chromium, nickel, and zinc levels were associated with CVD, and significant trends were observed for these chemical quartiles (P < 0.001). Arsenic, chromium, and copper levels were also associated with T2D. The weight quartile sum (WQS) index was significantly associated with both CVD (OR 4.17, 95% CI 2.16–7.69) and T2D (OR 11.96, 95% CI 5.65–18.26). Cd, Pb, and Ni were the most heavily weighed chemicals in these models.The Cd had the highest weight among the metals in the CVD model (weighted at 0.78), followed by Hg weighted at 0.197. For T2D, the serum Pb (weighted at 0.32), Ni (weighted at 0.19), Cr (weighted at 0.17), and Cd (weighted at 0.14) were the most weighted in the G-computation model. The results showed the significant role of toxic and essential elements in CVDs and T2D risk. This association may be driven primarily by cadmium and mercury for CVDs and Pb, Ni, Cr, and Cd for T2D, respectively. Prospective studies with higher sample sizes are necessary to confirm or refute our preliminary results as well as to determine other important elements.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Preliminary characterization of rectification for transradial prosthetic sockets",
        "link": "https://www.nature.com/articles/s41598-024-56333-6",
        "publication_date": "08 Mar 2024",
        "abstract": "Achieving proper socket fit is crucial for the effective use of a prosthesis. However, digital socket design lacks standardization and presents a steep learning curve for prosthetists. While research has focused on digital socket design for the lower-limb population, there is a research gap in upper-limb socket design. This study aimed to characterize the design (rectification) process for the transradial socket, specifically the three-quarter Northwestern-style design, towards the development of a more systematic, data-driven socket design approach. Fourteen (n = 14) pairs of unrectified and rectified plaster models were compared. Six common rectification zones were identified through shape analysis, with zones of plaster addition being the most prominent in terms of volume and surface area. A novel 3D vector mapping technique was employed, which revealed that most of the shape changes occurred in the anterior–posterior and proximal–distal directions. Overall, the interquartile range of each rectification zone demonstrated reasonable consistency in terms of volume, surface deviation, and 3D vector representation. The initial findings from this study support the potential for quantitively modelling the transradial socket design process. This opens the door for developing tools for categorizing and predicting socket designs across diverse populations through the application of techniques such as machine learning.",
        "conclusions": "This study is the first of its kind to characterize the design process of the transradial socket by analyzing the shape variation between unrectified and rectified models. By identifying and quantifying rectification features and patterns, this work facilitates the future development of digital socket design using techniques such as those based on machine learning. Similar to research conducted on the lower limb, such models have the potential to categorize and predict socket designs across diverse populations. When combined with prosthetists’ expertise, it can enhance prosthetic design and expedite fabrication, ultimately improving the design and outcomes of transradial prosthetic care.",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical electromagnetic brain scanner",
        "link": "https://www.nature.com/articles/s41598-024-55360-7",
        "publication_date": "08 Mar 2024",
        "abstract": "Stroke is a leading cause of death and disability worldwide, and early diagnosis and prompt medical intervention are thus crucial. Frequent monitoring of stroke patients is also essential to assess treatment efficacy and detect complications earlier. While computed tomography (CT) and magnetic resonance imaging (MRI) are commonly used for stroke diagnosis, they cannot be easily used onsite, nor for frequent monitoring purposes. To meet those requirements, an electromagnetic imaging (EMI) device, which is portable, non-invasive, and non-ionizing, has been developed. It uses a headset with an antenna array that irradiates the head with a safe low-frequency EM field and captures scattered fields to map the brain using a complementary set of physics-based and data-driven algorithms, enabling quasi-real-time detection, two-dimensional localization, and classification of strokes. This study reports clinical findings from the first time the device was used on stroke patients. The clinical results on 50 patients indicate achieving an overall accuracy of 98% in classification and 80% in two-dimensional quadrant localization. With its lightweight design and potential for use by a single para-medical staff at the point of care, the device can be used in intensive care units, emergency departments, and by paramedics for onsite diagnosis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development of risk models of incident hypertension using machine learning on the HUNT study data",
        "link": "https://www.nature.com/articles/s41598-024-56170-7",
        "publication_date": "07 Mar 2024",
        "abstract": "In this study, we aimed to create an 11-year hypertension risk prediction model using data from the Trøndelag Health (HUNT) Study in Norway, involving 17 852 individuals (20–85 years; 38% male; 24% incidence rate) with blood pressure (BP) below the hypertension threshold at baseline (1995–1997). We assessed 18 clinical, behavioral, and socioeconomic features, employing machine learning models such as eXtreme Gradient Boosting (XGBoost), Elastic regression, K-Nearest Neighbor, Support Vector Machines (SVM) and Random Forest. For comparison, we used logistic regression and a decision rule as reference models and validated six external models, with focus on the Framingham risk model. The top-performing models consistently included XGBoost, Elastic regression and SVM. These models efficiently identified hypertension risk, even among individuals with optimal baseline BP (< 120/80 mmHg), although improvement over reference models was modest. The recalibrated Framingham risk model outperformed the reference models, approaching the best-performing ML models. Important features included age, systolic and diastolic BP, body mass index, height, and family history of hypertension. In conclusion, our study demonstrated that linear effects sufficed for a well-performing model. The best models efficiently predicted hypertension risk, even among those with optimal or normal baseline BP, using few features. The recalibrated Framingham risk model proved effective in our cohort.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multimodal artificial intelligence-based pathogenomics improves survival prediction in oral squamous cell carcinoma",
        "link": "https://www.nature.com/articles/s41598-024-56172-5",
        "publication_date": "07 Mar 2024",
        "abstract": "In this study, we aimed to develop a novel prognostic algorithm for oral squamous cell carcinoma (OSCC) using a combination of pathogenomics and AI-based techniques. We collected comprehensive clinical, genomic, and pathology data from a cohort of OSCC patients in the TCGA dataset and used machine learning and deep learning algorithms to identify relevant features that are predictive of survival outcomes. Our analyses included 406 OSCC patients. Initial analyses involved gene expression analyses, principal component analyses, gene enrichment analyses, and feature importance analyses. These insights were foundational for subsequent model development. Furthermore, we applied five machine learning/deep learning algorithms (Random Survival Forest, Gradient Boosting Survival Analysis, Cox PH, Fast Survival SVM, and DeepSurv) for survival prediction. Our initial analyses revealed relevant gene expression variations and biological pathways, laying the groundwork for robust feature selection in model building. The results showed that the multimodal model outperformed the unimodal models across all methods, with c-index values of 0.722 for RSF, 0.633 for GBSA, 0.625 for FastSVM, 0.633 for CoxPH, and 0.515 for DeepSurv. When considering only important features, the multimodal model continued to outperform the unimodal models, with c-index values of 0.834 for RSF, 0.747 for GBSA, 0.718 for FastSVM, 0.742 for CoxPH, and 0.635 for DeepSurv. Our results demonstrate the potential of pathogenomics and AI-based techniques in improving the accuracy of prognostic prediction in OSCC, which may ultimately aid in the development of personalized treatment strategies for patients with this devastating disease.",
        "conclusions": "In this study, we present an approach for predicting the survival of OSCC cancer patients using multimodal data processing techniques. We have applied a stratification method to distinguish unimodal and multimodal data processing with regard to evaluation metrics. By using a multimodal data fusion technique, we evaluated several model architectures across multiple data modalities. Our results demonstrate that the use of multimodal data processing techniques can significantly improve the accuracy of predictive algorithms, leading to more accurate long-term survival predictions for patients with OSCC. These hybrid algorithms are capable of leveraging the rich and complex information provided by multiple high-dimensional data modalities in precision medicine-based clinical practices. By providing clinicians with accurate and reproducible predictions of patient prognosis, these algorithms hold great promise for enhancing the management of cancer patients.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Classifying autism in a clinical population based on motion synchrony: a proof-of-concept study using real-life diagnostic interviews",
        "link": "https://www.nature.com/articles/s41598-024-56098-y",
        "publication_date": "07 Mar 2024",
        "abstract": "Predictive modeling strategies are increasingly studied as a means to overcome clinical bottlenecks in the diagnostic classification of autism spectrum disorder. However, while some findings are promising in the light of diagnostic marker research, many of these approaches lack the scalability for adequate and effective translation to everyday clinical practice. In this study, our aim was to explore the use of objective computer vision video analysis of real-world autism diagnostic interviews in a clinical sample of children and young individuals in the transition to adulthood to predict diagnosis. Specifically, we trained a support vector machine learning model on interpersonal synchrony data recorded in Autism Diagnostic Observation Schedule (ADOS-2) interviews of patient-clinician dyads. Our model was able to classify dyads involving an autistic patient (n = 56) with a balanced accuracy of 63.4% against dyads including a patient with other psychiatric diagnoses (n = 38). Further analyses revealed no significant associations between our classification metrics with clinical ratings. We argue that, given the above-chance performance of our classifier in a highly heterogeneous sample both in age and diagnosis, with few adjustments this highly scalable approach presents a viable route for future diagnostic marker research in autism.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]