[
    {
        "title": "Pathogenic nsSNPs that increase the risks of cancers among the Orang Asli and Malays",
        "link": "https://www.nature.com/articles/s41598-021-95618-y",
        "publication_date": "09 Aug 2021",
        "abstract": "Single-nucleotide polymorphisms (SNPs) are the most common genetic variations for various complex human diseases, including cancers. Genome-wide association studies (GWAS) have identified numerous SNPs that increase cancer risks, such as breast cancer, colorectal cancer, and leukemia. These SNPs were cataloged for scientific use. However, GWAS are often conducted on certain populations in which the Orang Asli and Malays were not included. Therefore, we have developed a bioinformatic pipeline to mine the whole-genome sequence databases of the Orang Asli and Malays to determine the presence of pathogenic SNPs that might increase the risks of cancers among them. Five different in silico tools, SIFT, PROVEAN, Poly-Phen-2, Condel, and PANTHER, were used to predict and assess the functional impacts of the SNPs. Out of the 80 cancer-related nsSNPs from the GWAS dataset, 52 nsSNPs were found among the Orang Asli and Malays. They were further analyzed using the bioinformatic pipeline to identify the pathogenic variants. Three nsSNPs; rs1126809 (TYR), rs10936600 (LRRC34), and rs757978 (FARP2), were found as the most damaging cancer pathogenic variants. These mutations alter the protein interface and change the allosteric sites of the respective proteins. As TYR, LRRC34, and FARP2 genes play important roles in numerous cellular processes such as cell proliferation, differentiation, growth, and cell survival; therefore, any impairment on the protein function could be involved in the development of cancer. rs1126809, rs10936600, and rs757978 are the important pathogenic variants that increase the risks of cancers among the Orang Asli and Malays. The roles and impacts of these variants in cancers will require further investigations using in vitro cancer models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Subclinical cardiac impairment relates to traditional pulmonary function test parameters and lung volume as derived from whole-body MRI in a population-based cohort study",
        "link": "https://www.nature.com/articles/s41598-021-95655-7",
        "publication_date": "09 Aug 2021",
        "abstract": "To evaluate the relationship of cardiac function, including time-volume-curves, with lung volumes derived from pulmonary function tests (PFT) and MRI in subjects without cardiovascular diseases. 216 subjects underwent whole-body MRI and spirometry as part of the KORA-FF4 cohort study. Lung volumes derived semi-automatically using an in-house algorithm. Forced expiratory volume in one second (FEV1), forced vital capacity (FVC), and residual volume were measured. Cardiac parameters derived from Cine-SSFP-sequence using cvi42, while left ventricle (LV) time-volume-curves were evaluated using pyHeart. Linear regression analyses assessed the relationships of cardiac parameters with PFT and MRI-based lung volumes. Mean age was 56.3 ± 9.2 years (57% males). LV and right ventricular (RV) end-diastolic-, end-systolic-, stroke volume, LV peak ejection- and early/late diastolic filling rate were associated with FEV1, FVC, and residual volume (excluding late diastolic filling rate with FEV1, LV end-systolic/stroke volume and RV end-diastolic/end-systolic volumes with residual volume). In contrast, LV end-diastolic volume (ß = − 0.14, p = 0.01), early diastolic filling rate (ß = − 0.11, p = 0.04), and LV/RV stroke volume (ß = − 0.14, p = 0.01; ß = − 0.11, p = 0.01) were inversely associated with MRI-based lung volume. Subclinical cardiac impairment was associated with reduced FEV1, FVC, and residual volume. Cardiac parameters decreased with increasing MRI-based lung volume contrasting the results of PFT.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Examination of the predicted prevalence of Gitelman syndrome by ethnicity based on genome databases",
        "link": "https://www.nature.com/articles/s41598-021-95521-6",
        "publication_date": "09 Aug 2021",
        "abstract": "Gitelman syndrome is an autosomal recessive inherited salt-losing tubulopathy. It has a prevalence of around 1 in 40,000 people, and heterozygous carriers are estimated at approximately 1%, although the exact prevalence is unknown. We estimated the predicted prevalence of Gitelman syndrome based on multiple genome databases, HGVD and jMorp for the Japanese population and gnomAD for other ethnicities, and included all 274 pathogenic missense or nonsense variants registered in HGMD Professional. The frequencies of all these alleles were summed to calculate the total variant allele frequency in SLC12A3. The carrier frequency and the disease prevalence were assumed to be twice and the square of the total allele frequency, respectively, according to the Hardy–Weinberg principle. In the Japanese population, the total carrier frequencies were 0.0948 (9.5%) and 0.0868 (8.7%) and the calculated prevalence was 0.00225 (2.3 in 1000 people) and 0.00188 (1.9 in 1000 people) in HGVD and jMorp, respectively. Other ethnicities showed a prevalence varying from 0.000012 to 0.00083. These findings indicate that the prevalence of Gitelman syndrome in the Japanese population is higher than expected and that some other ethnicities also have a higher prevalence than has previously been considered.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Towards precision cardiometabolic prevention: results from a machine learning, semi-supervised clustering approach in the nationwide population-based ORISCAV-LUX 2 study",
        "link": "https://www.nature.com/articles/s41598-021-95487-5",
        "publication_date": "06 Aug 2021",
        "abstract": "Given the rapid increase in the incidence of cardiometabolic conditions, there is an urgent need for better approaches to prevent as many cases as possible and move from a one-size-fits-all approach to a precision cardiometabolic prevention strategy in the general population. We used data from ORISCAV-LUX 2, a nationwide, cross-sectional, population-based study. On the 1356 participants, we used a machine learning semi-supervised cluster method guided by body mass index (BMI) and glycated hemoglobin (HbA1c), and a set of 29 cardiometabolic variables, to identify subgroups of interest for cardiometabolic health. Cluster stability was assessed with the Jaccard similarity index. We have observed 4 clusters with a very high stability (ranging between 92 and 100%). Based on distinctive features that deviate from the overall population distribution, we have labeled Cluster 1 (N = 729, 53.76%) as “Healthy”, Cluster 2 (N = 508, 37.46%) as “Family history—Overweight—High Cholesterol “, Cluster 3 (N = 91, 6.71%) as “Severe Obesity—Prediabetes—Inflammation” and Cluster 4 (N = 28, 2.06%) as “Diabetes—Hypertension—Poor CV Health”. Our work provides an in-depth characterization and thus, a better understanding of cardiometabolic health in the general population. Our data suggest that such a clustering approach could now be used to define more targeted and tailored strategies for the prevention of cardiometabolic diseases at a population level. This study provides a first step towards precision cardiometabolic prevention and should be externally validated in other contexts.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Whole blood gene expression within days after total-body irradiation predicts long term survival in Gottingen minipigs",
        "link": "https://www.nature.com/articles/s41598-021-95120-5",
        "publication_date": "05 Aug 2021",
        "abstract": "Gottingen minipigs mirror the physiological radiation response observed in humans and hence make an ideal candidate model for studying radiation biodosimetry for both limited-sized and mass casualty incidents. We examined the whole blood gene expression profiles starting one day after total-body irradiation with increasing doses of gamma-rays. The minipigs were monitored for up to 45 days or time to euthanasia necessitated by radiation effects. We successfully identified dose- and time-agnostic (over a 1–7 day period after radiation), survival-predictive gene expression signatures derived using machine-learning algorithms with high sensitivity and specificity. These survival-predictive signatures fare better than an optimally performing dose-differentiating signature or blood cellular profiles. These findings suggest that prediction of survival is a much more useful parameter for making triage, resource-utilization and treatment decisions in a resource-constrained environment compared to predictions of total dose received. It should hopefully be possible to build such classifiers for humans in the future.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automated tumor proportion score analysis for PD-L1 (22C3) expression in lung squamous cell carcinoma",
        "link": "https://www.nature.com/articles/s41598-021-95372-1",
        "publication_date": "05 Aug 2021",
        "abstract": "Programmed cell death ligend-1 (PD-L1) expression by immunohistochemistry (IHC) assays is a predictive marker of anti-PD-1/PD-L1 therapy response. With the popularity of anti-PD-1/PD-L1 inhibitor drugs, quantitative assessment of PD-L1 expression becomes a new labor for pathologists. Manually counting the PD-L1 positive stained tumor cells is an obviously subjective and time-consuming process. In this paper, we developed a new computer aided Automated Tumor Proportion Scoring System (ATPSS) to determine the comparability of image analysis with pathologist scores. A three-stage process was performed using both image processing and deep learning techniques to mimic the actual diagnostic flow of the pathologists. We conducted a multi-reader multi-case study to evaluate the agreement between pathologists and ATPSS. Fifty-one surgically resected lung squamous cell carcinoma were prepared and stained using the Dako PD-L1 (22C3) assay, and six pathologists with different experience levels were involved in this study. The TPS predicted by the proposed model had high and statistically significant correlation with sub-specialty pathologists’ scores with Mean Absolute Error (MAE) of 8.65 (95% confidence interval (CI): 6.42–10.90) and Pearson Correlation Coefficient (PCC) of 0.9436 (\\(p < 0.001\\)), and the performance on PD-L1 positive cases achieved by our method surpassed that of non-subspecialty and trainee pathologists. Those experimental results indicate that the proposed automated system can be a powerful tool to improve the PD-L1 TPS assessment of pathologists.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning for pulmonary embolism detection on computed tomography pulmonary angiogram: a systematic review and meta-analysis",
        "link": "https://www.nature.com/articles/s41598-021-95249-3",
        "publication_date": "04 Aug 2021",
        "abstract": "Computed tomographic pulmonary angiography (CTPA) is the gold standard for pulmonary embolism (PE) diagnosis. However, this diagnosis is susceptible to misdiagnosis. In this study, we aimed to perform a systematic review of current literature applying deep learning for the diagnosis of PE on CTPA. MEDLINE/PUBMED were searched for studies that reported on the accuracy of deep learning algorithms for PE on CTPA. The risk of bias was evaluated using the QUADAS-2 tool. Pooled sensitivity and specificity were calculated. Summary receiver operating characteristic curves were plotted. Seven studies met our inclusion criteria. A total of 36,847 CTPA studies were analyzed. All studies were retrospective. Five studies provided enough data to calculate summary estimates. The pooled sensitivity and specificity for PE detection were 0.88 (95% CI 0.803–0.927) and 0.86 (95% CI 0.756–0.924), respectively. Most studies had a high risk of bias. Our study suggests that deep learning models can detect PE on CTPA with satisfactory sensitivity and an acceptable number of false positive cases. Yet, these are only preliminary retrospective works, indicating the need for future research to determine the clinical impact of automated PE detection on patient care. Deep learning models are gradually being implemented in hospital systems, and it is important to understand the strengths and limitations of these algorithms.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep graph neural network-based prediction of acute suicidal ideation in young adults",
        "link": "https://www.nature.com/articles/s41598-021-95102-7",
        "publication_date": "04 Aug 2021",
        "abstract": "Precise remote evaluation of both suicide risk and psychiatric disorders is critical for suicide prevention as well as for psychiatric well-being. Using questionnaires is an alternative to labor-intensive diagnostic interviews in a large general population, but previous models for predicting suicide attempts suffered from low sensitivity. We developed and validated a deep graph neural network model that increased the prediction sensitivity of suicide risk in young adults (n = 17,482 for training; n = 14,238 for testing) using multi-dimensional questionnaires and suicidal ideation within 2 weeks as the prediction target. The best model achieved a sensitivity of 76.3%, specificity of 83.4%, and an area under curve of 0.878 (95% confidence interval, 0.855–0.899). We demonstrated that multi-dimensional deep features covering depression, anxiety, resilience, self-esteem, and clinico-demographic information contribute to the prediction of suicidal ideation. Our model might be useful for the remote evaluation of suicide risk in the general population of young adults for specific situations such as the COVID-19 pandemic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Imputation of the continuous arterial line blood pressure waveform from non-invasive measurements using deep learning",
        "link": "https://www.nature.com/articles/s41598-021-94913-y",
        "publication_date": "03 Aug 2021",
        "abstract": "In two-thirds of intensive care unit (ICU) patients and 90% of surgical patients, arterial blood pressure (ABP) is monitored non-invasively but intermittently using a blood pressure cuff. Since even a few minutes of hypotension increases the risk of mortality and morbidity, for the remaining (high-risk) patients ABP is measured continuously using invasive devices, and derived values are extracted from the recorded waveforms. However, since invasive monitoring is associated with major complications (infection, bleeding, thrombosis), the ideal ABP monitor should be both non-invasive and continuous. With large volumes of high-fidelity physiological waveforms, it may be possible today to impute a physiological waveform from other available signals. Currently, the state-of-the-art approaches for ABP imputation only aim at intermittent systolic and diastolic blood pressure imputation, and there is no method that imputes the continuous ABP waveform. Here, we developed a novel approach to impute the continuous ABP waveform non-invasively using two continuously-monitored waveforms that are currently part of the standard-of-care, the electrocardiogram (ECG) and photo-plethysmogram (PPG), by adapting a deep learning architecture designed for image segmentation. Using over 150,000 min of data collected at two separate health systems from 463 patients, we demonstrate that our model provides a highly accurate prediction of the continuous ABP waveform (root mean square error 5.823 (95% CI 5.806–5.840) mmHg), as well as the derived systolic (mean difference 2.398 ± 5.623 mmHg) and diastolic blood pressure (mean difference − 2.497 ± 3.785 mmHg) compared to arterial line measurements. Our approach can potentially be used to measure blood pressure continuously and non-invasively for all patients in the acute care setting, without the need for any additional instrumentation beyond the current standard-of-care.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automated detection of retinal exudates and drusen in ultra-widefield fundus images based on deep learning",
        "link": "https://www.nature.com/articles/s41433-021-01715-7",
        "publication_date": "03 Aug 2021",
        "abstract": "Retinal exudates and/or drusen (RED) can be signs of many fundus diseases that can lead to irreversible vision loss. Early detection and treatment of these diseases are critical for improving vision prognosis. However, manual RED screening on a large scale is time-consuming and labour-intensive. Here, we aim to develop and assess a deep learning system for automated detection of RED using ultra-widefield fundus (UWF) images.",
        "conclusions": "We have developed and evaluated a deep learning system capable of detecting RED using UWF images obtained from multiple clinical settings. This system achieves high sensitivity and specificity, comparable to those of an experienced retina specialist. Our system has great potential to provide a timely referral for positive cases, promoting the early detection and treatment of RED-related fundus diseases. Prospective multicentre validation is expected to obtain high-level evidence for real-world application in subsequent studies.Summary\nWhat was known before\n\n\nRetinal exudates and drusen (RED) are signs of many ocular fundus diseases (e.g., uveoencephalitis, referable diabetic retinopathy [DR], and age-related macular degeneration [AMD]) that can result in irreversible vision loss. Early detection and treatment of these RED-related diseases can help reduce retinal damage and improve vision prognosis. Manual screening for RED is time-consuming and labor-intensive, and automated diagnosis systems based on traditional fundus images (30- to 60-degree visible scope of the retina) often miss RED located in the peripheral retina.\n\n\nWhat this study adds\n\n\nWe developed a deep learning system to detect the RED of a variety of ocular fundus diseases from ultra-widefield fundus images (200-degree) that can provide information of almost the entire retina. This system achieves high sensitivity and specificity, comparable to an experienced retinal specialist. Due to the automation characteristics and reliable performance, our deep learning-based system has the high potential to be applied to screen for RED from UWF images as a part of ophthalmic health evaluations in physical examination centres or be applied in undeveloped areas that lack retinal specialists to provide timely referrals for cases with RED-related ocular fundus diseases, such as uveoencephalitis, referable DR, and AMD.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Eye tracking based dyslexia detection using a holistic approach",
        "link": "https://www.nature.com/articles/s41598-021-95275-1",
        "publication_date": "03 Aug 2021",
        "abstract": "A new detection method for cognitive impairments is presented utilizing an eye tracking signals in a text reading test. This research enhances published articles that extract combination of various features. It does so by processing entire eye-tracking records either in time or frequency whereas applying only basic signal pre-processing. Such signals were classified as a whole by Convolutional Neural Networks (CNN) that hierarchically extract substantial features scatter either in time or frequency and nonlinearly binds them using machine learning to minimize a detection error. In the experiments we used a 100 fold cross validation and a dataset containing signals of 185 subjects (88 subjects with low risk and 97 subjects with high risk of dyslexia). In a series of experiments it was found that magnitude spectrum based representation of time interpolated eye-tracking signals recorded the best results, i.e. an average accuracy of 96.6% was reached in comparison to 95.6% that is the best published result on the same database. These findings suggest that a holistic approach involving small but complex enough CNNs applied to properly pre-process and expressed signals provides even better results than a combination of meticulously selected well-known features.",
        "conclusions": "We have designed, presented and analysed a novel holistic method for dyslexia detection in a text reading scenario. Unlike competing methods our system process entire signals with only minor pre-processing and two representations. This removes additional errors introduced by the feature detection-extraction methods. Furthermore, we let the machine learning represented by a CNN to learn implicit features and classify them at the same time. This is important as the usually extracted well-known features are not proven to be optimal for the detection process.In comparison to the best scoring reference method SVM-RFE16 utilizing meticulously selected combination of global features we were able on average to improve the detection process from 95.6 to 96.6% by applying a holistic approach This was achieved by a rather simple signal pre-processing, representation (magnitude spectrum) and a suitable classification model (CNN).Furthermore, our approach is between the 3 best scoring methods in terms of TPR, e.g. 97.8% compared to 97.88% as provided by SVM-RBR and SVM-linear methods. This can play a role in cases where TPR is more important than the overall performance. It is usually the case in medical diagnostics, where the misclassification of healthy patients would be less dangerous than not providing the treatment to seriously ill subjects. False negativity in this case can make it more difficult for a child to receive further education, as it will not be adequately adapted to his/her reading disorder30.The reading time is predominant and provides by itself a high accuracy, i.e. 95.67%. This was also observed in other experiments i.e. the time domain zero padded signals (have implicit reading time information, i.e. number of padded zeros) reached a high accuracy of 95.6%, whereas for the time domain interpolated signals that are stripped off any time related information the detection accuracy dropped significantly to 73.5%.As it was already mentioned, in the vast majority of cases, children with dyslexia read significantly slower than the healthy ones. However, there are still healthy children who naturally read slowly. The proposed method that uses the magnitude spectrum representation of time domain interpolated signals recorded the best accuracy, and it is obvious the time interpolation eliminates the effect of time. Thus this successful method is rather independent of the predominant reading time parameter that is observed in the dyslexia detection.Another advantage of our system is that the input to a classifier is a vector of coordinates (x-axis) and thus there is no needed for other classification/detection of events that express different eye movement types and parameters e.g. number of fixations, length of fixations or length of saccades; moreover, there is no subsequent selection and combination of such features e.g. by recursive feature elimination. It should be noted that the detection of saccades and fixations is not errorless and may introduce additional noise that can affect the accuracy.Observing the performance of our approach in relation to the complexity of CNN structures it is clear that relatively a simple structure (3–4 layers) can extract relevant information vital to classify dyslectic subjects in the text reading—eye tracking scenario.The combination of eye-tracking and text reading task proves to be very powerful for the detection of dyslexia and other disorders. Thus it would be interesting to test if this or similar holistic approach would be as successful as it is in this task. For example, applying this approach for the detection of subjects with an increased risk of developing dementia based on eye-movements during a reading activity test18. Such test could complement some comprehensive assessment of mild cognitive impairment, such as Montreal Cognitive Assessment (MoCA)31.",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Metabolomics-based discrimination of patients with remitted depression from healthy controls using 1H-NMR spectroscopy",
        "link": "https://www.nature.com/articles/s41598-021-95221-1",
        "publication_date": "02 Aug 2021",
        "abstract": "The aim of the study was to investigate differences in metabolic profiles between patients with major depressive disorder (MDD) with full remission (FR) and healthy controls (HCs). A total of 119 age-matched MDD patients with FR (n = 47) and HCs (n = 72) were enrolled and randomly split into training and testing sets. A 1H-nuclear magnetic resonance (NMR) spectroscopy-based metabolomics approach was used to identify differences in expressions of plasma metabolite biomarkers. Eight metabolites, including histidine, succinic acid, proline, acetic acid, creatine, glutamine, glycine, and pyruvic acid, were significantly differentially-expressed in the MDD patients with FR in comparison with the HCs. Metabolic pathway analysis revealed that pyruvate metabolism via the tricarboxylic acid cycle linked to amino acid metabolism was significantly associated with the MDD patients with FR. An algorithm based on these metabolites employing a linear support vector machine differentiated the MDD patients with FR from the HCs with a predictive accuracy, sensitivity, and specificity of nearly 0.85. A metabolomics-based approach could effectively differentiate MDD patients with FR from HCs. Metabolomic signatures might exist long-term in MDD patients, with metabolic impacts on physical health even in patients with FR.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A neural pathomics framework for classifying colorectal cancer histopathology images based on wavelet multi-scale texture analysis",
        "link": "https://www.nature.com/articles/s41598-021-94781-6",
        "publication_date": "30 Jul 2021",
        "abstract": "Colorectal cancer (CRC) constitutes the third most commonly diagnosed cancer in males and the second in females. Precise histopathological classification of CRC tissue pathology is the cornerstone not only for diagnosis but also for patients’ management decision making. An automated system able to accurately classify different CRC tissue regions may increase diagnostic precision and alleviate clinical workload. However, tissue classification is a challenging task due to the variability in morphological and textural characteristics present in histopathology images. In this study, an artificial neural network was trained to classify between eight classes of CRC tissue image patches derived from a public dataset with 5000 CRC histopathology image tiles. A total of 532 multi-level pathomics features examined at different scales were extracted by visual descriptors such as local binary patterns, wavelet transforms and Gabor filters. An exhaustive evaluation involving a variety of wavelet families and parameters was performed in order to shed light on the impact of scale on pathomics based CRC tissue differentiation. Our model achieved a performance accuracy of 95.3% with tenfold cross validation demonstrating superior performance compared to 87.4% reported in recent studies. Furthermore, we experimentally showed that the first and the second levels of the wavelet approximations can be used without compromising classification performance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The food patterns of a multicenter cohort of Brazilian nulliparous pregnant women",
        "link": "https://www.nature.com/articles/s41598-021-95185-2",
        "publication_date": "30 Jul 2021",
        "abstract": "Assessment of human nutrition is a complex process, in pregnant women identify dietary patterns through mean nutrient consumption can be an opportunity to better educate women on how to improve their overall health through better eating. This exploratory study aimed to identify a posteriori dietary patterns in a cohort of nulliparous pregnant women. The principal component analysis (PCA) technique was performed, with Varimax orthogonal rotation of data extracted from the 24-h dietary recall, applied at 20 weeks of gestation. We analysed 1.145 dietary recalls, identifying five main components that explained 81% of the dietary pattern of the sample. Dietary patterns found were: Obesogenic, represented by ultra-processed foods, processed foods, and food groups rich in carbohydrates, fats and sugars; Traditional, most influenced by natural, minimally processed foods, groups of animal proteins and beans; Intermediate was similar to the obesogenic, although there were lower loads; Vegetarian, which was the only good representation of fruits, vegetables and dairy products; and Protein, which best represented the groups of proteins (animal and vegetable). The obesogenic and intermediate patterns represented over 37% of the variation in food consumption highlighting the opportunity to improve maternal health especially for women at first mothering.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sociodemographic characteristics of missing data in digital phenotyping",
        "link": "https://www.nature.com/articles/s41598-021-94516-7",
        "publication_date": "29 Jul 2021",
        "abstract": "The ubiquity of smartphones, with their increasingly sophisticated array of sensors, presents an unprecedented opportunity for researchers to collect longitudinal, diverse, temporally-dense data about human behavior while minimizing participant burden. Researchers increasingly make use of smartphones for “digital phenotyping,” the collection and analysis of raw phone sensor and log data to study the lived experiences of subjects in their natural environments using their own devices. While digital phenotyping has shown promise in fields such as psychiatry and neuroscience, there are fundamental gaps in our knowledge about data collection and non-collection (i.e., missing data) in smartphone-based digital phenotyping. In this meta-study using individual-level data from six different studies, we examined accelerometer and GPS sensor data of 211 participants, amounting to 29,500 person-days of observation, using Bayesian hierarchical negative binomial regression with study- and user-level random intercepts. Sensitivity analyses including alternative model specification and stratified models were conducted. We found that iOS users had lower GPS non-collection than Android users. For GPS data, rates of non-collection did not differ by race/ethnicity, education, age, or gender. For accelerometer data, Black participants had higher rates of non-collection, but rates did not differ by sex, education, or age. For both sensors, non-collection increased by 0.5% to 0.9% per week. These results demonstrate the feasibility of using smartphone-based digital phenotyping across diverse populations, for extended periods of time, and within diverse cohorts. As smartphones become increasingly embedded in everyday life, the insights of this study will help guide the design, planning, and analysis of digital phenotyping studies.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep-learning framework and computer assisted fatty infiltration analysis for the supraspinatus muscle in MRI",
        "link": "https://www.nature.com/articles/s41598-021-93026-w",
        "publication_date": "23 Jul 2021",
        "abstract": "Occupation ratio and fatty infiltration are important parameters for evaluating patients with rotator cuff tears. We analyzed the occupation ratio using a deep-learning framework and studied the fatty infiltration of the supraspinatus muscle using an automated region-based Otsu thresholding technique. To calculate the amount of fatty infiltration of the supraspinatus muscle using an automated region-based Otsu thresholding technique. The mean Dice similarity coefficient, accuracy, sensitivity, specificity, and relative area difference for the segmented lesion, measuring the similarity of clinician assessment and that of a deep neural network, were 0.97, 99.84, 96.89, 99.92, and 0.07, respectively, for the supraspinatus fossa and 0.94, 99.89, 93.34, 99.95, and 2.03, respectively, for the supraspinatus muscle. The fatty infiltration measure using the Otsu thresholding method significantly differed among the Goutallier grades (Grade 0; 0.06, Grade 1; 4.68, Grade 2; 20.10, Grade 3; 42.86, Grade 4; 55.79, p < 0.0001). The occupation ratio and fatty infiltration using Otsu thresholding demonstrated a moderate negative correlation (ρ = − 0.75, p < 0.0001). This study included 240 randomly selected patients who underwent shoulder magnetic resonance imaging (MRI) from January 2015 to December 2016.  We used a fully convolutional deep-learning algorithm to quantitatively detect the fossa and muscle regions by measuring the occupation ratio of the supraspinatus muscle. Fatty infiltration was objectively evaluated using the Otsu thresholding method. The proposed convolutional neural network exhibited fast and accurate segmentation of the supraspinatus muscle and fossa from shoulder MRI, allowing automatic calculation of the occupation ratio. Quantitative evaluation using a modified Otsu thresholding method can be used to calculate the proportion of fatty infiltration in the supraspinatus muscle. We expect that this will improve the efficiency and objectivity of diagnoses by quantifying the index used for shoulder MRI.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Using 2D video-based pose estimation for automated prediction of autism spectrum disorders in young children",
        "link": "https://www.nature.com/articles/s41598-021-94378-z",
        "publication_date": "23 Jul 2021",
        "abstract": "Clinical research in autism has recently witnessed promising digital phenotyping results, mainly focused on single feature extraction, such as gaze, head turn on name-calling or visual tracking of the moving object. The main drawback of these studies is the focus on relatively isolated behaviors elicited by largely controlled prompts. We recognize that while the diagnosis process understands the indexing of the specific behaviors, ASD also comes with broad impairments that often transcend single behavioral acts. For instance, the atypical nonverbal behaviors manifest through global patterns of atypical postures and movements, fewer gestures used and often decoupled from visual contact, facial affect, speech. Here, we tested the hypothesis that a deep neural network trained on the non-verbal aspects of social interaction can effectively differentiate between children with ASD and their typically developing peers. Our model achieves an accuracy of 80.9% (F1 score: 0.818; precision: 0.784; recall: 0.854) with the prediction probability positively correlated to the overall level of symptoms of autism in social affect and repetitive and restricted behaviors domain. Provided the non-invasive and affordable nature of computer vision, our approach carries reasonable promises that a reliable machine-learning-based ASD screening may become a reality not too far in the future.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "A data-driven performance dashboard for surgical dissection",
        "link": "https://www.nature.com/articles/s41598-021-94487-9",
        "publication_date": "22 Jul 2021",
        "abstract": "Surgical error and resulting complication have significant patient and economic consequences. Inappropriate exertion of tool-tissue force is a common variable for such error, that can be objectively monitored by sensorized tools. The rich digital output establishes a powerful skill assessment and sharing platform for surgical performance and training. Here we present SmartForceps data app incorporating an Expert Room environment for tracking and analysing the objective performance and surgical finesse through multiple interfaces specific for surgeons and data scientists. The app is enriched by incoming geospatial information, data distribution for engineered features, performance dashboard compared to expert surgeon, and interactive skill prediction and task recognition tools to develop artificial intelligence models. The study launches the concept of democratizing surgical data through a connectivity interface between surgeons with a broad and deep capability of geographic reach through mobile devices with highly interactive infographics and tools for performance monitoring, comparison, and improvement.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinically applicable artificial intelligence system for dental diagnosis with CBCT",
        "link": "https://www.nature.com/articles/s41598-021-94093-9",
        "publication_date": "22 Jul 2021",
        "abstract": "In this study, a novel AI system based on deep learning methods was evaluated to determine its real-time performance of CBCT imaging diagnosis of anatomical landmarks, pathologies, clinical effectiveness, and safety when used by dentists in a clinical setting. The system consists of 5 modules: ROI-localization-module (segmentation of teeth and jaws), tooth-localization and numeration-module, periodontitis-module, caries-localization-module, and periapical-lesion-localization-module. These modules use CNN based on state-of-the-art architectures. In total, 1346 CBCT scans were used to train the modules. After annotation and model development, the AI system was tested for diagnostic capabilities of the Diagnocat AI system. 24 dentists participated in the clinical evaluation of the system. 30 CBCT scans were examined by two groups of dentists, where one group was aided by Diagnocat and the other was unaided. The results for the overall sensitivity and specificity for aided and unaided groups were calculated as an aggregate of all conditions. The sensitivity values for aided and unaided groups were 0.8537 and 0.7672 while specificity was 0.9672 and 0.9616 respectively. There was a statistically significant difference between the groups (p = 0.032). This study showed that the proposed AI system significantly improved the diagnostic capabilities of dentists.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning-based preoperative datamining can predict the therapeutic outcome of sleep surgery in OSA subjects",
        "link": "https://www.nature.com/articles/s41598-021-94454-4",
        "publication_date": "21 Jul 2021",
        "abstract": "Increasing recognition of anatomical obstruction has resulted in a large variety of sleep surgeries to improve anatomic collapse of obstructive sleep apnea (OSA) and the prediction of whether sleep surgery will have successful outcome is very important. The aim of this study is to assess a machine learning-based clinical model that predict the success rate of sleep surgery in OSA subjects. The predicted success rate from machine learning and the predicted subjective surgical outcome from the physician were compared with the actual success rate in 163 male dominated-OSA subjects. Predicted success rate of sleep surgery from machine learning models based on sleep parameters and endoscopic findings of upper airway demonstrated higher accuracy than subjective predicted value of sleep surgeon. The gradient boosting model showed the best performance to predict the surgical success that is evaluated by pre- and post-operative polysomnography or home sleep apnea testing among the logistic regression and three machine learning models, and the accuracy of gradient boosting model (0.708) was significantly higher than logistic regression model (0.542). Our data demonstrate that the data mining-driven prediction such as gradient boosting exhibited higher accuracy for prediction of surgical outcome and we can provide accurate information on surgical outcomes before surgery to OSA subjects using machine learning models.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The impact of site-specific digital histology signatures on deep learning model accuracy and bias",
        "link": "https://www.nature.com/articles/s41467-021-24698-1",
        "publication_date": "20 Jul 2021",
        "abstract": "The Cancer Genome Atlas (TCGA) is one of the largest biorepositories of digital histology. Deep learning (DL) models have been trained on TCGA to predict numerous features directly from histology, including survival, gene expression patterns, and driver mutations. However, we demonstrate that these features vary substantially across tissue submitting sites in TCGA for over 3,000 patients with six cancer subtypes. Additionally, we show that histologic image differences between submitting sites can easily be identified with DL. Site detection remains possible despite commonly used color normalization and augmentation methods, and we quantify the image characteristics constituting this site-specific digital histology signature. We demonstrate that these site-specific signatures lead to biased accuracy for prediction of features including survival, genomic mutations, and tumor stage. Furthermore, ethnicity can also be inferred from site-specific signatures, which must be accounted for to ensure equitable application of DL. These site-specific signatures can lead to overoptimistic estimates of model performance, and we propose a quadratic programming method that abrogates this bias by ensuring models are not trained and validated on samples from the same site.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A multispeaker dataset of raw and reconstructed speech production real-time MRI video and 3D volumetric images",
        "link": "https://www.nature.com/articles/s41597-021-00976-x",
        "publication_date": "20 Jul 2021",
        "abstract": "Real-time magnetic resonance imaging (RT-MRI) of human speech production is enabling significant advances in speech science, linguistics, bio-inspired speech technology development, and clinical applications. Easy access to RT-MRI is however limited, and comprehensive datasets with broad access are needed to catalyze research across numerous domains. The imaging of the rapidly moving articulators and dynamic airway shaping during speech demands high spatio-temporal resolution and robust reconstruction methods. Further, while reconstructed images have been published, to-date there is no open dataset providing raw multi-coil RT-MRI data from an optimized speech production experimental setup. Such datasets could enable new and improved methods for dynamic image reconstruction, artifact correction, feature extraction, and direct extraction of linguistically-relevant biomarkers. The present dataset offers a unique corpus of 2D sagittal-view RT-MRI videos along with synchronized audio for 75 participants performing linguistically motivated speech tasks, alongside the corresponding public domain raw RT-MRI data. The dataset also includes 3D volumetric vocal tract MRI during sustained speech sounds and high-resolution static anatomical T2-weighted upper airway MRI for each participant.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Associations between dimensions of behaviour, personality traits, and mental-health during the COVID-19 pandemic in the United Kingdom",
        "link": "https://www.nature.com/articles/s41467-021-24365-5",
        "publication_date": "16 Jul 2021",
        "abstract": "The COVID-19 pandemic (including lockdown) is likely to have had profound but diverse implications for mental health and well-being, yet little is known about individual experiences of the pandemic (positive and negative) and how this relates to mental health and well-being, as well as other important contextual variables. Here, we analyse data sampled in a large-scale manner from 379,875 people in the United Kingdom (UK) during 2020 to identify population variables associated with mood and mental health during the COVID-19 pandemic, and to investigate self-perceived pandemic impact in relation to those variables. We report that while there are relatively small population-level differences in mood assessment scores pre- to peak-UK lockdown, the size of the differences is larger for people from specific groups, e.g. older adults and people with lower incomes. Multiple dimensions underlie peoples’ perceptions, both positive and negative, of the pandemic’s impact on daily life. These dimensions explain variance in mental health and can be statistically predicted from age, demographics, home and work circumstances, pre-existing conditions, maladaptive technology use and personality traits (e.g., compulsivity). We conclude that a holistic view, incorporating the broad range of relevant population factors, can better characterise people whose mental health is most at risk during the COVID-19 pandemic.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A hybrid computational framework for intelligent inter-continent SARS-CoV-2 sub-strains characterization and prediction",
        "link": "https://www.nature.com/articles/s41598-021-93757-w",
        "publication_date": "15 Jul 2021",
        "abstract": "Whereas accelerated attention beclouded early stages of the coronavirus spread, knowledge of actual pathogenicity and origin of possible sub-strains remained unclear. By harvesting the Global initiative on Sharing All Influenza Data (GISAID) database (https://www.gisaid.org/), between December 2019 and January 15, 2021, a total of 8864 human SARS-CoV-2 complete genome sequences processed by gender, across 6 continents (88 countries) of the world, Antarctica exempt, were analyzed. We hypothesized that data speak for itself and can discern true and explainable patterns of the disease. Identical genome diversity and pattern correlates analysis performed using a hybrid of biotechnology and machine learning methods corroborate the emergence of inter- and intra- SARS-CoV-2 sub-strains transmission and sustain an increase in sub-strains within the various continents, with nucleotide mutations dynamically varying between individuals in close association with the virus as it adapts to its host/environment. Interestingly, some viral sub-strain patterns progressively transformed into new sub-strain clusters indicating varying amino acid, and strong nucleotide association derived from same lineage. A novel cognitive approach to knowledge mining helped the discovery of transmission routes and seamless contact tracing protocol. Our classification results were better than state-of-the-art methods, indicating a more robust system for predicting emerging or new viral sub-strain(s). The results therefore offer explanations for the growing concerns about the virus and its next wave(s). A future direction of this work is a defuzzification of confusable pattern clusters for precise intra-country SARS-CoV-2 sub-strains analytics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Sensing leg movement enhances wearable monitoring of energy expenditure",
        "link": "https://www.nature.com/articles/s41467-021-24173-x",
        "publication_date": "13 Jul 2021",
        "abstract": "Physical inactivity is the fourth leading cause of global mortality. Health organizations have requested a tool to objectively measure physical activity. Respirometry and doubly labeled water accurately estimate energy expenditure, but are infeasible for everyday use. Smartwatches are portable, but have significant errors. Existing wearable methods poorly estimate time-varying activity, which comprises 40% of daily steps. Here, we present a Wearable System that estimates metabolic energy expenditure in real-time during common steady-state and time-varying activities with substantially lower error than state-of-the-art methods. We perform experiments to select sensors, collect training data, and validate the Wearable System with new subjects and new conditions for walking, running, stair climbing, and biking. The Wearable System uses inertial measurement units worn on the shank and thigh as they distinguish lower-limb activity better than wrist or trunk kinematics and converge more quickly than physiological signals. When evaluated with a diverse group of new subjects, the Wearable System has a cumulative error of 13% across common activities, significantly less than 42% for a smartwatch and 44% for an activity-specific smartwatch. This approach enables accurate physical activity monitoring which could enable new energy balance systems for weight management or large-scale activity monitoring.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep learning identifies antigenic determinants of severe SARS-CoV-2 infection within T-cell repertoires",
        "link": "https://www.nature.com/articles/s41598-021-93608-8",
        "publication_date": "12 Jul 2021",
        "abstract": "SARS-CoV-2 infection is characterized by a highly variable clinical course with patients experiencing asymptomatic infection all the way to requiring critical care support. This variation in clinical course has led physicians and scientists to study factors that may predispose certain individuals to more severe clinical presentations in hopes of either identifying these individuals early in their illness or improving their medical management. We sought to understand immunogenomic differences that may result in varied clinical outcomes through analysis of T-cell receptor sequencing (TCR-Seq) data in the open access ImmuneCODE database. We identified two cohorts within the database that had clinical outcomes data reflecting severity of illness and utilized DeepTCR, a multiple-instance deep learning repertoire classifier, to predict patients with severe SARS-CoV-2 infection from their repertoire sequencing. We demonstrate that patients with severe infection have repertoires with higher T-cell responses associated with SARS-CoV-2 epitopes and identify the epitopes that result in these responses. Our results provide evidence that the highly variable clinical course seen in SARS-CoV-2 infection is associated to certain antigen-specific responses.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Impact of rescanning and repositioning on radiomic features employing a multi-object phantom in magnetic resonance imaging",
        "link": "https://www.nature.com/articles/s41598-021-93756-x",
        "publication_date": "09 Jul 2021",
        "abstract": "Our purpose was to analyze the robustness and reproducibility of magnetic resonance imaging (MRI) radiomic features. We constructed a multi-object fruit phantom to perform MRI acquisition as scan-rescan using a 3 Tesla MRI scanner. We applied T2-weighted (T2w) half-Fourier acquisition single-shot turbo spin-echo (HASTE), T2w turbo spin-echo (TSE), T2w fluid-attenuated inversion recovery (FLAIR), T2 map and T1-weighted (T1w) TSE. Images were resampled to isotropic voxels. Fruits were segmented. The workflow was repeated by a second reader and the first reader after a pause of one month. We applied PyRadiomics to extract 107 radiomic features per fruit and sequence from seven feature classes. We calculated concordance correlation coefficients (CCC) and dynamic range (DR) to obtain measurements of feature robustness. Intraclass correlation coefficient (ICC) was calculated to assess intra- and inter-observer reproducibility. We calculated Gini scores to test the pairwise discriminative power specific for the features and MRI sequences. We depict Bland Altmann plots of features with top discriminative power (Mann–Whitney U test). Shape features were the most robust feature class. T2 map was the most robust imaging technique (robust features (rf), n = 84). HASTE sequence led to the least amount of rf (n = 20). Intra-observer ICC was excellent (≥ 0.75) for nearly all features (max–min; 99.1–97.2%). Deterioration of ICC values was seen in the inter-observer analyses (max–min; 88.7–81.1%). Complete robustness across all sequences was found for 8 features. Shape features and T2 map yielded the highest pairwise discriminative performance. Radiomics validity depends on the MRI sequence and feature class. T2 map seems to be the most promising imaging technique with the highest feature robustness, high intra-/inter-observer reproducibility and most promising discriminative power.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Transforming obstetric ultrasound into data science using eye tracking, voice recording, transducer motion and ultrasound video",
        "link": "https://www.nature.com/articles/s41598-021-92829-1",
        "publication_date": "08 Jul 2021",
        "abstract": "Ultrasound is the primary modality for obstetric imaging and is highly sonographer dependent. Long training period, insufficient recruitment and poor retention of sonographers are among the global challenges in the expansion of ultrasound use. For the past several decades, technical advancements in clinical obstetric ultrasound scanning have largely concerned improving image quality and processing speed. By contrast, sonographers have been acquiring ultrasound images in a similar fashion for several decades. The PULSE (Perception Ultrasound by Learning Sonographer Experience) project is an interdisciplinary multi-modal imaging study aiming to offer clinical sonography insights and transform the process of obstetric ultrasound acquisition and image analysis by applying deep learning to large-scale multi-modal clinical data. A key novelty of the study is that we record full-length ultrasound video with concurrent tracking of the sonographer’s eyes, voice and the transducer while performing routine obstetric scans on pregnant women. We provide a detailed description of the novel acquisition system and illustrate how our data can be used to describe clinical ultrasound. Being able to measure different sonographer actions or model tasks will lead to a better understanding of several topics including how to effectively train new sonographers, monitor the learning progress, and enhance the scanning workflow of experts.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Fuzzy rank-based fusion of CNN models using Gompertz function for screening COVID-19 CT-scans",
        "link": "https://www.nature.com/articles/s41598-021-93658-y",
        "publication_date": "08 Jul 2021",
        "abstract": "COVID-19 has crippled the world’s healthcare systems, setting back the economy and taking the lives of several people. Although potential vaccines are being tested and supplied around the world, it will take a long time to reach every human being, more so with new variants of the virus emerging, enforcing a lockdown-like situation on parts of the world. Thus, there is a dire need for early and accurate detection of COVID-19 to prevent the spread of the disease, even more. The current gold-standard RT-PCR test is only 71% sensitive and is a laborious test to perform, leading to the incapability of conducting the population-wide screening. To this end, in this paper, we propose an automated COVID-19 detection system that uses CT-scan images of the lungs for classifying the same into COVID and Non-COVID cases. The proposed method applies an ensemble strategy that generates fuzzy ranks of the base classification models using the Gompertz function and fuses the decision scores of the base models adaptively to make the final predictions on the test cases. Three transfer learning-based convolutional neural network models are used, namely VGG-11, Wide ResNet-50-2, and Inception v3, to generate the decision scores to be fused by the proposed ensemble model. The framework has been evaluated on two publicly available chest CT scan datasets achieving state-of-the-art performance, justifying the reliability of the model. The relevant source codes related to the present work is available in: GitHub.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A comparison of time to event analysis methods, using weight status and breast cancer as a case study",
        "link": "https://www.nature.com/articles/s41598-021-92944-z",
        "publication_date": "07 Jul 2021",
        "abstract": "Survival analysis with cohort study data has been traditionally performed using Cox proportional hazards models. Random survival forests (RSFs), a machine learning method, now present an alternative method. Using the UK Women’s Cohort Study (n = 34,493) we evaluate two methods: a Cox model and an RSF, to investigate the association between Body Mass Index and time to breast cancer incidence. Robustness of the models were assessed by cross validation and bootstraping. Histograms of bootstrap coefficients are reported. C-Indices and Integrated Brier Scores are reported for all models. In post-menopausal women, the Cox model Hazard Ratios (HR) for Overweight (OW) and Obese (O) were 1.25 (1.04, 1.51) and 1.28 (0.98, 1.68) respectively and the RSF Odds Ratios (OR) with partial dependence on menopause for OW and O were 1.34 (1.31, 1.70) and 1.45 (1.42, 1.48). HR are non-significant results. Only the RSF appears confident about the effect of weight status on time to event. Bootstrapping demonstrated Cox model coefficients can vary significantly, weakening interpretation potential. An RSF was used to produce partial dependence plots (PDPs) showing OW and O weight status increase the probability of breast cancer incidence in post-menopausal women. All models have relatively low C-Index and high Integrated Brier Score. The RSF overfits the data. In our study, RSF can identify complex non-proportional hazard type patterns in the data, and allow more complicated relationships to be investigated using PDPs, but it overfits limiting extrapolation of results to new instances. Moreover, it is less easily interpreted than Cox models. The value of survival analysis remains paramount and therefore machine learning techniques like RSF should be considered as another method for analysis.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical characterization of dysautonomia in long COVID-19 patients",
        "link": "https://www.nature.com/articles/s41598-021-93546-5",
        "publication_date": "07 Jul 2021",
        "abstract": "Increasing numbers of COVID-19 patients, continue to experience symptoms months after recovering from mild cases of COVID-19. Amongst these symptoms, several are related to neurological manifestations, including fatigue, anosmia, hypogeusia, headaches and hypoxia. However, the involvement of the autonomic nervous system, expressed by a dysautonomia, which can aggregate all these neurological symptoms has not been prominently reported. Here, we hypothesize that dysautonomia, could occur in secondary COVID-19 infection, also referred to as “long COVID” infection. 39 participants were included from December 2020 to January 2021 for assessment by the Department of physical medicine to enhance their physical capabilities: 12 participants with COVID-19 diagnosis and fatigue, 15 participants with COVID-19 diagnosis without fatigue and 12 control participants without COVID-19 diagnosis and without fatigue. Heart rate variability (HRV) during a change in position is commonly measured to diagnose autonomic dysregulation. In this cohort, to reflect HRV, parasympathetic/sympathetic balance was estimated using the NOL index, a multiparameter artificial intelligence-driven index calculated from extracted physiological signals by the PMD-200 pain monitoring system. Repeated-measures mixed-models testing group effect were performed to analyze NOL index changes over time between groups. A significant NOL index dissociation over time between long COVID-19 participants with fatigue and control participants was observed (p = 0.046). A trend towards significant NOL index dissociation over time was observed between long COVID-19 participants without fatigue and control participants (p = 0.109). No difference over time was observed between the two groups of long COVID-19 participants (p = 0.904). Long COVID-19 participants with fatigue may exhibit a dysautonomia characterized by dysregulation of the HRV, that is reflected by the NOL index measurements, compared to control participants. Dysautonomia may explain the persistent symptoms observed in long COVID-19 patients, such as fatigue and hypoxia.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An automatic multi-tissue human fetal brain segmentation benchmark using the Fetal Tissue Annotation Dataset",
        "link": "https://www.nature.com/articles/s41597-021-00946-3",
        "publication_date": "06 Jul 2021",
        "abstract": "It is critical to quantitatively analyse the developing human fetal brain in order to fully understand neurodevelopment in both normal fetuses and those with congenital disorders. To facilitate this analysis, automatic multi-tissue fetal brain segmentation algorithms are needed, which in turn requires open datasets of segmented fetal brains. Here we introduce a publicly available dataset of 50 manually segmented pathological and non-pathological fetal magnetic resonance brain volume reconstructions across a range of gestational ages (20 to 33 weeks) into 7 different tissue categories (external cerebrospinal fluid, grey matter, white matter, ventricles, cerebellum, deep grey matter, brainstem/spinal cord). In addition, we quantitatively evaluate the accuracy of several automatic multi-tissue segmentation algorithms of the developing human fetal brain. Four research groups participated, submitting a total of 10 algorithms, demonstrating the benefits the dataset for the development of automatic algorithms.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Impact of surgical resection of butterfly glioblastoma on survival: a meta-analysis based on comparative studies",
        "link": "https://www.nature.com/articles/s41598-021-93441-z",
        "publication_date": "06 Jul 2021",
        "abstract": "Butterfly glioblastoma (bGBM) is a rare brain tumor that invades both hemispheres by crossing the corpus callosum. bGBM is associated with a dismal prognosis with a median survival time of a few months. Surgical resection is a rare treatment option due to the unfavorable location and assumed poor risk-to-benefit ratio. Therefore, a biopsy-alone approach is considered the main treatment option. This meta-analysis aimed to systematically evaluate whether resection of bGBM is associated with improved overall survival compared with biopsy alone. We searched three databases to find studies that compare resection with biopsy in 6-, 12- and 18-months overall survival in patients with bGBM. We calculated the pooled relative risk (RR) of mortality using a random-effects model. Five studies with 194 patients were included in the meta-analysis. Mortality was decreased for resection compared with biopsy at 6-months (RR 0.63 [95% CI 0.44–0.91]). No significant differences in overall survival were found at 12 (RR 0.76 [95% CI 0.50–1.14]) and 18-months (RR 0.84 [95% CI 0.56–1.26]). Surgical resection of bGBM is associated with an improved 6-months overall survival compared with biopsy alone. We have not found strong evidence supporting the superiority of resection over biopsy alone in overall survival at 12 and 18-months.",
        "conclusions": "Our findings suggest that surgical resection is associated with an improved 6-months survival rate in patients diagnosed with bGBM, as compared with biopsy alone. We have not found significant differences in survival rate at 12 and 18-months between resection and biopsy. In every case, an individual approach assessing the risk-to-benefit ratio of resection is necessary. There is also a need to develop new treatment strategies that will prolong survival in patients diagnosed with bGBM. Results of this meta-analysis should be interpreted with caution due to the retrospective nature of included studies. In the future, a more precise machine-learning model can be constructed to predict the impact of surgical resection of butterfly glioblastoma on survival when evaluating additional genomic and clinical information, including immune environment, genomic mutations, RNA, and protein modifications, and family history38,39.",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Effects of adiposity on the human plasma proteome: observational and Mendelian randomisation estimates",
        "link": "https://www.nature.com/articles/s41366-021-00896-1",
        "publication_date": "05 Jul 2021",
        "abstract": "Variation in adiposity is associated with cardiometabolic disease outcomes, but mechanisms leading from this exposure to disease are unclear. This study aimed to estimate effects of body mass index (BMI) on an extensive set of circulating proteins.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A deep learning algorithm for automated measurement of vertebral body compression from X-ray images",
        "link": "https://www.nature.com/articles/s41598-021-93017-x",
        "publication_date": "02 Jul 2021",
        "abstract": "The vertebral compression is a significant factor for determining the prognosis of osteoporotic vertebral compression fractures and is generally measured manually by specialists. The consequent misdiagnosis or delayed diagnosis can be fatal for patients. In this study, we trained and evaluated the performance of a vertebral body segmentation model and a vertebral compression measurement model based on convolutional neural networks. For vertebral body segmentation, we used a recurrent residual U-Net model, with an average sensitivity of 0.934 (± 0.086), an average specificity of 0.997 (± 0.002), an average accuracy of 0.987 (± 0.005), and an average dice similarity coefficient of 0.923 (± 0.073). We then generated 1134 data points on the images of three vertebral bodies by labeling each segment of the segmented vertebral body. These were used in the vertebral compression measurement model based on linear regression and multi-scale residual dilated blocks. The model yielded an average mean absolute error of 2.637 (± 1.872) (%), an average mean square error of 13.985 (± 24.107) (%), and an average root mean square error of 3.739 (± 2.187) (%) in fractured vertebral body data. The proposed algorithm has significant potential for aiding the diagnosis of vertebral compression fractures.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Radiomics models based on enhanced computed tomography to distinguish clear cell from non-clear cell renal cell carcinomas",
        "link": "https://www.nature.com/articles/s41598-021-93069-z",
        "publication_date": "02 Jul 2021",
        "abstract": "This study was to assess the effect of the predictive model for distinguishing clear cell RCC (ccRCC) from non-clear cell RCC (non-ccRCC) by establishing predictive radiomic models based on enhanced-computed tomography (CT) images of renal cell carcinoma (RCC). A total of 190 cases with RCC confirmed by pathology were retrospectively analyzed, with the patients being randomly divided into two groups, including the training set and testing set according to the ratio of 7:3. A total of 396 radiomic features were computationally obtained and analyzed with the Correlation between features, Univariate Logistics and Multivariate Logistics. Finally, 4 features were selected, and three machine models (Random Forest (RF), Support Vector Machine (SVM) and Logistic Regression (LR)) were established to discriminate RCC subtypes. The radiomics performance was compared with that of radiologist diagnosis. In the testing set, the RF model had an area under the curve (AUC) value of 0.909, a sensitivity of 0.956, and a specificity of 0.538. The SVM model had an AUC value of 0.841, a sensitivity of 1.0, and a specificity of 0.231, in the testing set. The LR model had an AUC value of 0.906, a sensitivity of 0.956, and a specificity of 0.692, in the testing set. The sensitivity and specificity of radiologist diagnosis to differentiate ccRCC from non-ccRCC were 0.850 and 0.581, respectively, with the AUC value of the radiologist diagnosis as 0.69. In conclusion, radiomics models based on CT imaging data show promise for augmenting radiological diagnosis in renal cancer, especially for differentiating ccRCC from non-ccRCC.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Identifying acute exacerbations of chronic obstructive pulmonary disease using patient-reported symptoms and cough feature analysis",
        "link": "https://www.nature.com/articles/s41746-021-00472-x",
        "publication_date": "02 Jul 2021",
        "abstract": "Acute exacerbations of chronic obstructive pulmonary disease (AECOPD) are commonly encountered in the primary care setting, though the accurate and timely diagnosis is problematic. Using technology like that employed in speech recognition technology, we developed a smartphone-based algorithm for rapid and accurate diagnosis of AECOPD. The algorithm incorporates patient-reported features (age, fever, and new cough), audio data from five coughs and can be deployed by novice users. We compared the accuracy of the algorithm to expert clinical assessment. In patients with known COPD, the algorithm correctly identified the presence of AECOPD in 82.6% (95% CI: 72.9–89.9%) of subjects (n = 86). The absence of AECOPD was correctly identified in 91.0% (95% CI: 82.4–96.3%) of individuals (n = 78). The diagnostic agreement was maintained in milder cases of AECOPD (PPA: 79.2%, 95% CI: 68.0–87.8%), who typically comprise the cohort presenting to primary care. The algorithm may aid early identification of AECOPD and be incorporated in patient self-management plans.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cellphone enabled point-of-care assessment of breast tumor cytology and molecular HER2 expression from fine-needle aspirates",
        "link": "https://www.nature.com/articles/s41523-021-00290-0",
        "publication_date": "02 Jul 2021",
        "abstract": "Management of breast cancer in limited-resource settings is hindered by a lack of low-cost, logistically sustainable approaches toward molecular and cellular diagnostic pathology services that are needed to guide therapy. To address these limitations, we have developed a multimodal cellphone-based platform—the EpiView-D4—that can evaluate both cellular morphology and molecular expression of clinically relevant biomarkers directly from fine-needle aspiration (FNA) of breast tissue specimens within 1 h. The EpiView-D4 is comprised of two components: (1) an immunodiagnostic chip built upon a “non-fouling” polymer brush-coating (the “D4”) which quantifies expression of protein biomarkers directly from crude cell lysates, and (2) a custom cellphone-based optical microscope (“EpiView”) designed for imaging cytology preparations and D4 assay readout. As a proof-of-concept, we used the EpiView-D4 for assessment of human epidermal growth factor receptor-2 (HER2) expression and validated the performance using cancer cell lines, animal models, and human tissue specimens. We found that FNA cytology specimens (prepared in less than 5 min with rapid staining kits) imaged by the EpiView-D4 were adequate for assessment of lesional cellularity and tumor content. We also found our device could reliably distinguish between HER2 expression levels across multiple different cell lines and animal xenografts. In a pilot study with human tissue (n = 19), we were able to accurately categorize HER2-negative and HER2-positve tumors from FNA specimens. Taken together, the EpiView-D4 offers a promising alternative to invasive—and often unavailable—pathology services and may enable the democratization of effective breast cancer management in limited-resource settings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Early and long term antibody kinetics of asymptomatic and mild disease COVID-19 patients",
        "link": "https://www.nature.com/articles/s41598-021-93175-y",
        "publication_date": "02 Jul 2021",
        "abstract": "Most patients infected with SARS-CoV-2 are asymptomatic or mildly symptomatic. However, the early and late antibody kinetics, and the association between antibody levels, clinical symptoms, and disease phase in these patients have not yet been fully defined. Confirmed SARS-CoV-2 patients and their household contacts were evaluated over a period four months. The evaluation procedure included symptom monitoring, viral load and serology analysis every ten days. A total of 1334 serum samples were collected from 135 patients and analyzed using three assays for IgG-N, IgG-S and IgM antibodies. Of the study participants, 97% were seropositive during the study, and two distinct clusters were identified. These clusters were significantly different in their inflammatory related symptoms. Peak IgG-S was 40.0 AU/ml for the non-inflammatory cluster and 71.5 AU/ml for the inflammatory cluster (P = 0.006), whereas IgG-N peaks were 4.3 and 5.87 (P = 0.023) respectively. Finally, a decision tree model was designed to predict the disease phase based on the serological titer levels, and had an overall accuracy of 80.7%. The specific profile of seroconversion and decay of serum antibodies can be used to predict the time-course from the acute infection.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Computer-aided interpretation of chest radiography reveals the spectrum of tuberculosis in rural South Africa",
        "link": "https://www.nature.com/articles/s41746-021-00471-y",
        "publication_date": "02 Jul 2021",
        "abstract": "Computer-aided digital chest radiograph interpretation (CAD) can facilitate high-throughput screening for tuberculosis (TB), but its use in population-based active case-finding programs has been limited. In an HIV-endemic area in rural South Africa, we used a CAD algorithm (CAD4TBv5) to interpret digital chest x-rays (CXR) as part of a mobile health screening effort. Participants with TB symptoms or CAD4TBv5 score above the triaging threshold were referred for microbiological sputum assessment. During an initial pilot phase, a low CAD4TBv5 triaging threshold of 25 was selected to maximize TB case finding. We report the performance of CAD4TBv5 in screening 9,914 participants, 99 (1.0%) of whom were found to have microbiologically proven TB. CAD4TBv5 was able to identify TB cases at the same sensitivity but lower specificity as a blinded radiologist, whereas the next generation of the algorithm (CAD4TBv6) achieved comparable sensitivity and specificity to the radiologist. The CXRs of people with microbiologically confirmed TB spanned a range of lung field abnormality, including 19 (19.2%) cases deemed normal by the radiologist. HIV serostatus did not impact CAD4TB’s performance. Notably, 78.8% of the TB cases identified during this population-based survey were asymptomatic and therefore triaged for sputum collection on the basis of CAD4TBv5 score alone. While CAD4TBv6 has the potential to replace radiologists for triaging CXRs in TB prevalence surveys, population-specific piloting is necessary to set the appropriate triaging thresholds. Further work on image analysis strategies is needed to identify radiologically subtle active TB.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Optical tissue clearing and machine learning can precisely characterize extravasation and blood vessel architecture in brain tumors",
        "link": "https://www.nature.com/articles/s42003-021-02275-y",
        "publication_date": "01 Jul 2021",
        "abstract": "Precise methods for quantifying drug accumulation in brain tissue are currently very limited, challenging the development of new therapeutics for brain disorders. Transcardial perfusion is instrumental for removing the intravascular fraction of an injected compound, thereby allowing for ex vivo assessment of extravasation into the brain. However, pathological remodeling of tissue microenvironment can affect the efficiency of transcardial perfusion, which has been largely overlooked. We show that, in contrast to healthy vasculature, transcardial perfusion cannot remove an injected compound from the tumor vasculature to a sufficient extent leading to considerable overestimation of compound extravasation. We demonstrate that 3D deep imaging of optically cleared tumor samples overcomes this limitation. We developed two machine learning-based semi-automated image analysis workflows, which provide detailed quantitative characterization of compound extravasation patterns as well as tumor angioarchitecture in large three-dimensional datasets from optically cleared samples. This methodology provides a precise and comprehensive analysis of extravasation in brain tumors and allows for correlation of extravasation patterns with specific features of the heterogeneous brain tumor vasculature.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Relevance of circulating hybrid cells as a non-invasive biomarker for myriad solid tumors",
        "link": "https://www.nature.com/articles/s41598-021-93053-7",
        "publication_date": "01 Jul 2021",
        "abstract": "Metastatic progression defines the final stages of tumor evolution and underlies the majority of cancer-related deaths. The heterogeneity in disseminated tumor cell populations capable of seeding and growing in distant organ sites contributes to the development of treatment resistant disease. We recently reported the identification of a novel tumor-derived cell population, circulating hybrid cells (CHCs), harboring attributes from both macrophages and neoplastic cells, including functional characteristics important to metastatic spread. These disseminated hybrids outnumber conventionally defined circulating tumor cells (CTCs) in cancer patients. It is unknown if CHCs represent a generalized cancer mechanism for cell dissemination, or if this population is relevant to the metastatic cascade. Herein, we detect CHCs in the peripheral blood of patients with cancer in myriad disease sites encompassing epithelial and non-epithelial malignancies. Further, we demonstrate that in vivo-derived hybrid cells harbor tumor-initiating capacity in murine cancer models and that CHCs from human breast cancer patients express stem cell antigens, features consistent with the potential to seed and grow at metastatic sites. Finally, we reveal heterogeneity of CHC phenotypes reflect key tumor features, including oncogenic mutations and functional protein expression. Importantly, this novel population of disseminated neoplastic cells opens a new area in cancer biology and renewed opportunity for battling metastatic disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Untangling introductions and persistence in COVID-19 resurgence in Europe",
        "link": "https://www.nature.com/articles/s41586-021-03754-2",
        "publication_date": "30 Jun 2021",
        "abstract": "After the first wave of SARS-CoV-2 infections in spring 2020, Europe experienced a resurgence of the virus starting in late summer 2020 that was deadlier and more difficult to contain1. Relaxed intervention measures and summer travel have been implicated as drivers of the second wave2. Here we build a phylogeographical model to evaluate how newly introduced lineages, as opposed to the rekindling of persistent lineages, contributed to the resurgence of COVID-19 in Europe. We inform this model using genomic, mobility and epidemiological data from 10 European countries and estimate that in many countries more than half of the lineages circulating in late summer resulted from new introductions since 15 June 2020. The success in onward transmission of newly introduced lineages was negatively associated with the local incidence of COVID-19 during this period. The pervasive spread of variants in summer 2020 highlights the threat of viral dissemination when restrictions are lifted, and this needs to be carefully considered in strategies to control the current spread of variants that are more transmissible and/or evade immunity. Our findings indicate that more effective and coordinated measures are required to contain the spread through cross-border travel even as vaccination is reducing disease burden.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Influence of stroke infarct location on quality of life assessed in a multivariate lesion-symptom mapping study",
        "link": "https://www.nature.com/articles/s41598-021-92865-x",
        "publication_date": "29 Jun 2021",
        "abstract": "Stroke has a deleterious impact on quality of life. However, it is less well known if stroke lesions in different brain regions are associated with reduced quality of life (QoL). We therefore investigated this association by multivariate lesion-symptom mapping. We analyzed magnetic resonance imaging and clinical data from the WAKE-UP trial. European Quality of Life 5 Dimensions (EQ-5D) 3 level questionnaires were completed 90 days after stroke. Lesion symptom mapping was performed using a multivariate machine learning algorithm (support vector regression) based on stroke lesions 22–36 h after stroke. Brain regions with significant associations were explored in reference to white matter tracts. Of 503 randomized patients, 329 were included in the analysis (mean age 65.4 years, SD 11.5; median NIHSS = 6, IQR 4–9; median EQ-5D score 90 days after stroke 1, IQR 0–4, median lesion volume 3.3 ml, IQR 1.1–16.9 ml). After controlling for lesion volume, significant associations between lesions and EQ-5D score were detected for the right putamen, and internal capsules of both hemispheres. Multivariate lesion inference analysis revealed an association between injuries of the cortico-spinal tracts with worse self-reported quality of life 90 days after stroke in comparably small stroke lesions, extending previous reports of the association of striato-capsular lesions with worse functional outcome. Our findings are of value to identify patients at risk of impaired QoL after stroke.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The amniotic fluid cell-free transcriptome in spontaneous preterm labor",
        "link": "https://www.nature.com/articles/s41598-021-92439-x",
        "publication_date": "29 Jun 2021",
        "abstract": "The amniotic fluid (AF) cell-free RNA was shown to reflect physiological and pathological processes in pregnancy, but its value in the prediction of spontaneous preterm delivery is unknown. Herein we profiled cell-free RNA in AF samples collected from women who underwent transabdominal amniocentesis after an episode of spontaneous preterm labor and subsequently delivered within 24 h (n = 10) or later (n = 28) in gestation. Expression of known placental single-cell RNA-Seq signatures was quantified in AF cell-free RNA and compared between the groups. Random forest models were applied to predict time-to-delivery after amniocentesis. There were 2385 genes differentially expressed in AF samples of women who delivered within 24 h of amniocentesis compared to gestational age-matched samples from women who delivered after 24 h of amniocentesis. Genes with cell-free RNA changes were associated with immune and inflammatory processes related to the onset of labor, and the expression of placental single-cell RNA-Seq signatures of immune cells was increased with imminent delivery. AF transcriptomic prediction models captured these effects and predicted delivery within 24 h of amniocentesis (AUROC = 0.81). These results may inform the development of biomarkers for spontaneous preterm birth.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Leveraging network analysis to evaluate biomedical named entity recognition tools",
        "link": "https://www.nature.com/articles/s41598-021-93018-w",
        "publication_date": "29 Jun 2021",
        "abstract": "The ever-growing availability of biomedical text sources has resulted in a boost in clinical studies based on their exploitation. Biomedical named-entity recognition (bio-NER) techniques have evolved remarkably in recent years and their application in research is increasingly successful. Still, the disparity of tools and the limited available validation resources are barriers preventing a wider diffusion, especially within clinical practice. We here propose the use of omics data and network analysis as an alternative for the assessment of bio-NER tools. Specifically, our method introduces quality criteria based on edge overlap and community detection. The application of these criteria to four bio-NER solutions yielded comparable results to strategies based on annotated corpora, without suffering from their limitations. Our approach can constitute a guide both for the selection of the best bio-NER tool given a specific task, and for the creation and validation of novel approaches.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Long-term effect of task-oriented functional electrical stimulation in chronic Guillain Barré syndrome–a single-subject study",
        "link": "https://www.nature.com/articles/s41394-021-00419-0",
        "publication_date": "28 Jun 2021",
        "abstract": "Functional electrical stimulation (FES) can enhance motor learning of hand fine motor skills in neurological diseases with upper motoneuron lesions. Nevertheless, FES is rarely applied in patients with chronic Guillan-Barré syndrome (GBS) with preserved deep tendon reflexes allowing for stimulation via nerve. This single case report documents the results of an FES-supported, task-oriented grasp training to regain hand closure and pinch grip.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Deep neural network-based classification of cardiotocograms outperformed conventional algorithms",
        "link": "https://www.nature.com/articles/s41598-021-92805-9",
        "publication_date": "28 Jun 2021",
        "abstract": "Cardiotocography records fetal heart rates and their temporal relationship to uterine contractions. To identify high risk fetuses, obstetricians inspect cardiotocograms (CTGs) by eye. Therefore, CTG traces are often interpreted differently among obstetricians, resulting in inappropriate interventions. However, few studies have focused on quantitative and nonbiased algorithms for CTG evaluation. In this study, we propose a newly constructed deep neural network model (CTG-net) to detect compromised fetal status. CTG-net consists of three convolutional layers that extract temporal patterns and interrelationships between fetal heart rate and uterine contraction signals. We aimed to classify the abnormal group (umbilical artery pH < 7.20 or Apgar score at 1 min < 7) and the normal group from CTG data. We evaluated the performance of the CTG-net with the F1 score and compared it with conventional algorithms, namely, support vector machine and k-means clustering, and another deep neural network model, long short-term memory. CTG-net showed the area under the receiver operating characteristic curve of 0.73 ± 0.04, which was significantly higher than that of long short-term memory. CTG-net, a quantitative and automated diagnostic aid system, enables early intervention for putatively abnormal fetuses, resulting in a reduction in the number of cases of hypoxic injury.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Impact of an accelerated melting of Greenland on malaria distribution over Africa",
        "link": "https://www.nature.com/articles/s41467-021-24134-4",
        "publication_date": "25 Jun 2021",
        "abstract": "Studies about the impact of future climate change on diseases have mostly focused on standard Representative Concentration Pathway climate change scenarios. These scenarios do not account for the non-linear dynamics of the climate system. A rapid ice-sheet melting could occur, impacting climate and consequently societies. Here, we investigate the additional impact of a rapid ice-sheet melting of Greenland on climate and malaria transmission in Africa using several malaria models driven by Institute Pierre Simon Laplace climate simulations. Results reveal that our melting scenario could moderate the simulated increase in malaria risk over East Africa, due to cooling and drying effects, cause a largest decrease in malaria transmission risk over West Africa and drive malaria emergence in southern Africa associated with a significant southward shift of the African rain-belt. We argue that the effect of such ice-sheet melting should be investigated further in future public health and agriculture climate change risk assessments.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Evaluating microbiome-directed fibre snacks in gnotobiotic mice and humans",
        "link": "https://www.nature.com/articles/s41586-021-03671-4",
        "publication_date": "23 Jun 2021",
        "abstract": "Changing food preferences brought about by westernization that have deleterious health effects1,2—combined with myriad forces that are contributing to increased food insecurity—are catalysing efforts to identify more nutritious and affordable foods3. Consumption of dietary fibre can help to prevent cardiovascular disease, type 2 diabetes and obesity4,5,6. A substantial number of reports have explored the effects of dietary fibre on the gut microbial community7,8,9. However, the microbiome is complex, dynamic and exhibits considerable intra- and interpersonal variation in its composition and functions. The large number of potential interactions between the components of the microbiome makes it challenging to define the mechanisms by which food ingredients affect community properties. Here we address the question of how foods containing different fibre preparations can be designed to alter functions associated with specific components of the microbiome. Because a marked increase in snack consumption is associated with westernization, we formulated snack prototypes using plant fibres from different sustainable sources that targeted distinct features of the gut microbiomes of individuals with obesity when transplanted into gnotobiotic mice. We used these snacks to supplement controlled diets that were consumed by adult individuals with obesity or who were overweight. Fibre-specific changes in their microbiomes were linked to changes in their plasma proteomes indicative of an altered physiological state.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    }
]