[
    {
        "title": "Label-free imaging flow cytometry for analysis and sorting of enzymatically dissociated tissues",
        "link": "https://www.nature.com/articles/s41598-022-05007-2",
        "publication_date": "19 Jan 2022",
        "abstract": "Biomedical research relies on identification and isolation of specific cell types using molecular biomarkers and sorting methods such as fluorescence or magnetic activated cell sorting. Labelling processes potentially alter the cells’ properties and should be avoided, especially when purifying cells for clinical applications. A promising alternative is the label-free identification of cells based on physical properties. Sorting real-time deformability cytometry (soRT-DC) is a microfluidic technique for label-free analysis and sorting of single cells. In soRT-FDC, bright-field images of cells are analyzed by a deep neural net (DNN) to obtain a sorting decision, but sorting was so far only demonstrated for blood cells which show clear morphological differences and are naturally in suspension. Most cells, however, grow in tissues, requiring dissociation before cell sorting which is associated with challenges including changes in morphology, or presence of aggregates. Here, we introduce methods to improve robustness of analysis and sorting of single cells from nervous tissue and provide DNNs which can distinguish visually similar cells. We employ the DNN for image-based sorting to enrich photoreceptor cells from dissociated retina for transplantation into the mouse eye.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Automated evaluation of retinal pigment epithelium disease area in eyes with age-related macular degeneration",
        "link": "https://www.nature.com/articles/s41598-022-05006-3",
        "publication_date": "18 Jan 2022",
        "abstract": "The retinal pigment epithelium (RPE) is essential for the survival and function of retinal photoreceptor cells. RPE dysfunction causes various retinal diseases including age-related macular degeneration (AMD). Clinical studies on ES/iPS cell-derived RPE transplantation for RPE dysfunction-triggered diseases are currently underway. Quantification of the diseased RPE area is important to evaluate disease progression or the therapeutic effect of RPE transplantation. However, there are no standard protocols. To address this issue, we developed a 2-step software that enables objective and efficient quantification of RPE-disease area changes by analyzing the early-phase hyperfluorescent area in fluorescein angiography (FA) images. We extracted the Abnormal region. This extraction was based on deep learning-based discrimination. We scored the binarized extracted area using an automated program. Our program’s performance for the same eye from the serial image captures was within 3.1 ± 7.8% error. In progressive AMD, the trend was consistent with human assessment, even when FA images from two different visits were compared. This method was applicable to quantifying RPE-disease area changes over time, evaluating iPSC-RPE transplantation images, and a disease other than AMD. Our program may contribute to the assessment of the clinical course of RPE-disease areas in routine clinics and reduce the workload of researchers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Objective evaluation of deep uncertainty predictions for COVID-19 detection",
        "link": "https://www.nature.com/articles/s41598-022-05052-x",
        "publication_date": "17 Jan 2022",
        "abstract": "Deep neural networks (DNNs) have been widely applied for detecting COVID-19 in medical images. Existing studies mainly apply transfer learning and other data representation strategies to generate accurate point estimates. The generalization power of these networks is always questionable due to being developed using small datasets and failing to report their predictive confidence. Quantifying uncertainties associated with DNN predictions is a prerequisite for their trusted deployment in medical settings. Here we apply and evaluate three uncertainty quantification techniques for COVID-19 detection using chest X-Ray (CXR) images. The novel concept of uncertainty confusion matrix is proposed and new performance metrics for the objective evaluation of uncertainty estimates are introduced. Through comprehensive experiments, it is shown that networks pertained on CXR images outperform networks pretrained on natural image datasets such as ImageNet. Qualitatively and quantitatively evaluations also reveal that the predictive uncertainty estimates are statistically higher for erroneous predictions than correct predictions. Accordingly, uncertainty quantification methods are capable of flagging risky predictions with high uncertainty estimates. We also observe that ensemble methods more reliably capture uncertainties during the inference. DNN-based solutions for COVID-19 detection have been mainly proposed without any principled mechanism for risk mitigation. Previous studies have mainly focused on on generating single-valued predictions using pretrained DNNs. In this paper, we comprehensively apply and comparatively evaluate three uncertainty quantification techniques for COVID-19 detection using chest X-Ray images. The novel concept of uncertainty confusion matrix is proposed and new performance metrics for the objective evaluation of uncertainty estimates are introduced for the first time. Using these new uncertainty performance metrics, we quantitatively demonstrate when we could trust DNN predictions for COVID-19 detection from chest X-rays. It is important to note the proposed novel uncertainty evaluation metrics are generic and could be applied for evaluation of probabilistic forecasts in all classification problems.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Distinct kinetics of antibodies to 111 Plasmodium falciparum proteins identifies markers of recent malaria exposure",
        "link": "https://www.nature.com/articles/s41467-021-27863-8",
        "publication_date": "17 Jan 2022",
        "abstract": "Strengthening malaria surveillance is a key intervention needed to reduce the global disease burden. Reliable serological markers of recent malaria exposure could improve current surveillance methods by allowing for accurate estimates of infection incidence from limited data. We studied the IgG antibody response to 111 Plasmodium falciparum proteins in 65 adult travellers followed longitudinally after a natural malaria infection in complete absence of re-exposure. We identified a combination of five serological markers that detect exposure within the previous three months with >80% sensitivity and specificity. Using mathematical modelling, we examined the antibody kinetics and determined that responses informative of recent exposure display several distinct characteristics: rapid initial boosting and decay, less inter-individual variation in response kinetics, and minimal persistence over time. Such serological exposure markers could be incorporated into routine malaria surveillance to guide efforts for malaria control and elimination.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prioritizing high-contact occupations raises effectiveness of vaccination campaigns",
        "link": "https://www.nature.com/articles/s41598-021-04428-9",
        "publication_date": "14 Jan 2022",
        "abstract": "A twenty-year-old idea from network science is that vaccination campaigns would be more effective if high-contact individuals were preferentially targeted. Implementation is impeded by the ethical and practical problem of differentiating vaccine access based on a personal characteristic that is hard-to-measure and private. Here, we propose the use of occupational category as a proxy for connectedness in a contact network. Using survey data on occupation-specific contact frequencies, we calibrate a model of disease propagation in populations undergoing varying vaccination campaigns. We find that vaccination campaigns that prioritize high-contact occupational groups achieve similar infection levels with half the number of vaccines, while also reducing and delaying peaks. The paper thus identifies a concrete, operational strategy for dramatically improving vaccination efficiency in ongoing pandemics.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient",
                "healthcare practitioner"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "International Globe and Adnexal Trauma Epidemiology Study (IGATES): Visual outcomes in open globe injuries in rural West India",
        "link": "https://www.nature.com/articles/s41433-021-01895-2",
        "publication_date": "13 Jan 2022",
        "abstract": "To evaluate the factors influencing final visual outcome after surgical repair of open globe injuries (OGIs) in a rural population using the International Globe and Adnexal Trauma Epidemiology Study (IGATES) online registry.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An explainable machine learning framework for lung cancer hospital length of stay prediction",
        "link": "https://www.nature.com/articles/s41598-021-04608-7",
        "publication_date": "12 Jan 2022",
        "abstract": "This work introduces a predictive Length of Stay (LOS) framework for lung cancer patients using machine learning (ML) models. The framework proposed to deal with imbalanced datasets for classification-based approaches using electronic healthcare records (EHR). We have utilized supervised ML methods to predict lung cancer inpatients LOS during ICU hospitalization using the MIMIC-III dataset. Random Forest (RF) Model outperformed other models and achieved predicted results during the three framework phases. With clinical significance features selection, over-sampling methods (SMOTE and ADASYN) achieved the highest AUC results (98% with CI 95%: 95.3–100%, and 100% respectively). The combination of Over-sampling and under-sampling achieved the second-highest AUC results (98%, with CI 95%: 95.3–100%, and 97%, CI 95%: 93.7–100% SMOTE-Tomek, and SMOTE-ENN respectively). Under-sampling methods reported the least important AUC results (50%, with CI 95%: 40.2–59.8%) for both (ENN and Tomek- Links). Using ML explainable technique called SHAP, we explained the outcome of the predictive model (RF) with SMOTE class balancing technique to understand the most significant clinical features that contributed to predicting lung cancer LOS with the RF model. Our promising framework allows us to employ ML techniques in-hospital clinical information systems to predict lung cancer admissions into ICU.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning algorithms as new screening approach for patients with endometriosis",
        "link": "https://www.nature.com/articles/s41598-021-04637-2",
        "publication_date": "12 Jan 2022",
        "abstract": "Endometriosis—a systemic and chronic condition occurring in women of childbearing age—is a highly enigmatic disease with unresolved questions. While multiple biomarkers, genomic analysis, questionnaires, and imaging techniques have been advocated as screening and triage tests for endometriosis to replace diagnostic laparoscopy, none have been implemented routinely in clinical practice. We investigated the use of machine learning algorithms (MLA) in the diagnosis and screening of endometriosis based on 16 key clinical and patient-based symptom features. The sensitivity, specificity, F1-score and AUCs of the MLA to diagnose endometriosis in the training and validation sets varied from 0.82 to 1, 0–0.8, 0–0.88, 0.5–0.89, and from 0.91 to 0.95, 0.66–0.92, 0.77–0.92, respectively. Our data suggest that MLA could be a promising screening test for general practitioners, gynecologists, and other front-line health care providers. Introducing MLA in this setting represents a paradigm change in clinical practice as it could replace diagnostic laparoscopy. Furthermore, this patient-based screening tool empowers patients with endometriosis to self-identify potential symptoms and initiate dialogue with physicians about diagnosis and treatment, and hence contribute to shared decision making.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "DeepNull models non-linear covariate effects to improve phenotypic prediction and association power",
        "link": "https://www.nature.com/articles/s41467-021-27930-0",
        "publication_date": "11 Jan 2022",
        "abstract": "Genome-wide association studies (GWASs) examine the association between genotype and phenotype while adjusting for a set of covariates. Although the covariates may have non-linear or interactive effects, due to the challenge of specifying the model, GWAS often neglect such terms. Here we introduce DeepNull, a method that identifies and adjusts for non-linear and interactive covariate effects using a deep neural network. In analyses of simulated and real data, we demonstrate that DeepNull maintains tight control of the type I error while increasing statistical power by up to 20% in the presence of non-linear and interactive effects. Moreover, in the absence of such effects, DeepNull incurs no loss of power. When applied to 10 phenotypes from the UK Biobank (n = 370K), DeepNull discovered more hits (+6%) and loci (+7%), on average, than conventional association analyses, many of which are biologically plausible or have previously been reported. Finally, DeepNull improves upon linear modeling for phenotypic prediction (+23% on average).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Cuffless blood pressure monitoring from a wristband with calibration-free algorithms for sensing location based on bio-impedance sensor array and autoencoder",
        "link": "https://www.nature.com/articles/s41598-021-03612-1",
        "publication_date": "10 Jan 2022",
        "abstract": "Continuous monitoring of blood pressure (BP) is essential for the prediction and the prevention of cardiovascular diseases. Cuffless BP methods based on non-invasive sensors integrated into wearable devices can translate blood pulsatile activity into continuous BP data. However, local blood pulsatile sensors from wearable devices suffer from inaccurate pulsatile activity measurement based on superficial capillaries, large form-factor devices and BP variation with sensor location which degrade the accuracy of BP estimation and the device wearability. This study presents a cuffless BP monitoring method based on a novel bio-impedance (Bio-Z) sensor array built in a flexible wristband with small-form factor that provides a robust blood pulsatile sensing and BP estimation without calibration methods for the sensing location. We use a convolutional neural network (CNN) autoencoder that reconstructs an accurate estimate of the arterial pulse signal independent of sensing location from a group of six Bio-Z sensors within the sensor array. We rely on an Adaptive Boosting regression model which maps the features of the estimated arterial pulse signal to systolic and diastolic BP readings. BP was accurately estimated with average error and correlation coefficient of 0.5 ± 5.0 mmHg and 0.80 for diastolic BP, and 0.2 ± 6.5 mmHg and 0.79 for systolic BP, respectively.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Developing and assessing a new web-based tapping test for measuring distal movement in Parkinson’s disease: a Distal Finger Tapping test",
        "link": "https://www.nature.com/articles/s41598-021-03563-7",
        "publication_date": "10 Jan 2022",
        "abstract": "Disability in Parkinson’s disease (PD) is measured by standardised scales including the MDS-UPDRS, which are subject to high inter and intra-rater variability and fail to capture subtle motor impairment. The BRadykinesia Akinesia INcoordination (BRAIN) test is a validated keyboard tapping test, evaluating proximal upper-limb motor impairment. Here, a new Distal Finger Tapping (DFT) test was developed to assess distal upper-limb function. Kinetic parameters of the test include kinesia score (KS20, key taps over 20 s), akinesia time (AT20, mean dwell-time on each key) and incoordination score (IS20, variance of travelling time between key taps). To develop and evaluate a new keyboard-tapping test for objective and remote distal motor function in PD patients. The DFT and BRAIN tests were assessed in 55 PD patients and 65 controls. Test scores were compared between groups and correlated with the MDS-UPDRS-III finger tapping sub-scores. Nine additional PD patients were recruited for monitoring motor fluctuations. All three parameters discriminated effectively between PD patients and controls, with KS20 performing best, yielding 79% sensitivity for 85% specificity; area under the receiver operating characteristic curve (AUC) = 0.90. A combination of DFT and BRAIN tests improved discrimination (AUC = 0.95). Among three parameters, KS20 showed a moderate correlation with the MDS-UPDRS finger-tapping sub-score (Pearson’s r = − 0.40, p = 0.002). Further, the DFT test detected subtle changes in motor fluctuation states which were not reflected clearly by the MDS-UPDRS-III finger tapping sub-scores. The DFT test is an online tool for assessing distal movements in PD, with future scope for longitudinal monitoring of motor complications.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Region-specific complexity of the intracranial EEG in the sleeping human brain",
        "link": "https://www.nature.com/articles/s41598-021-04213-8",
        "publication_date": "10 Jan 2022",
        "abstract": "As the brain is a complex system with occurrence of self-similarity at different levels, a dedicated analysis of the complexity of brain signals is of interest to elucidate the functional role of various brain regions across the various stages of vigilance. We exploited intracranial electroencephalogram data from 38 cortical regions using the Higuchi fractal dimension (HFD) as measure to assess brain complexity, on a dataset of 1772 electrode locations. HFD values depended on sleep stage and topography. HFD increased with higher levels of vigilance, being highest during wakefulness in the frontal lobe. HFD did not change from wake to stage N2 in temporo-occipital regions. The transverse temporal gyrus was the only area in which the HFD did not differ between any two vigilance stages. Interestingly, HFD of wakefulness and stage R were different mainly in the precentral gyrus, possibly reflecting motor inhibition in stage R. The fusiform and parahippocampal gyri were the only areas showing no difference between wakefulness and N2. Stages R and N2 were similar only for the postcentral gyrus. Topographical analysis of brain complexity revealed that sleep stages are clearly differentiated in fronto-central brain regions, but that temporo-occipital regions sleep differently.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Intravital microscopic observation of the microvasculature during hemodialysis in healthy rats",
        "link": "https://www.nature.com/articles/s41598-021-03681-2",
        "publication_date": "07 Jan 2022",
        "abstract": "Hemodialysis (HD) provides life-saving treatment for kidney failure. Patient mortality is extremely high, with cardiovascular disease (CVD) being the leading cause of death. This results from both a high underlying burden of cardiovascular disease, as well as additional physiological stress from the HD procedure itself. Clinical observations indicate that HD is associated with microvascular dysfunction (MD), underlining the need for a fundamental pathophysiological assessment of the microcirculatory consequences of HD. We therefore successfully developed an experimental small animal model, that allows for a simultaneous real-time assessment of the microvasculature. Using in-house built ultra-low surface area dialyzers and miniaturized extracorporeal circuit, we successfully dialyzed male Wistar Kyoto rats and combined this with a simultaneous intravital microscopic observation of the EDL microvasculature. Our results show that even in healthy animals, a euvolemic HD procedure can induce a significant systemic hemodynamic disturbance and induce disruption of microvascular perfusion (as evidence by a reduction in the proportion of the observed microcirculation receiving blood flow). This study, using a new small animal hemodialysis model, has allowed direct demonstration that microvascular blood flow in tissue in skeletal muscle is acutely reduced during HD, potentially in concert with other microvascular beds. It shows that preclinical small animal models can be used to further investigate HD-induced ischemic organ injury and allow rapid throughput of putative interventions directed at reducing HD-induced multi-organ ischemic injury.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Light sheet based volume flow cytometry (VFC) for rapid volume reconstruction and parameter estimation on the go",
        "link": "https://www.nature.com/articles/s41598-021-03902-8",
        "publication_date": "07 Jan 2022",
        "abstract": "Optical imaging is paramount for disease diagnosis and to access its progression over time. The proposed optical flow imaging (VFC/iLIFE) is a powerful technique that adds new capabilities (3D volume visualization, organelle-level resolution, and multi-organelle screening) to the existing system. Unlike state-of-the-art point-illumination-based biomedical imaging techniques, the sheet-based VFC technique is capable of single-shot sectional visualization, high throughput interrogation, real-time parameter estimation, and instant volume reconstruction with organelle-level resolution of live specimens. The specimen flow system was realized on a multichannel (Y-type) microfluidic chip that enables visualization of organelle distribution in several cells in-parallel at a relatively high flow-rate (2000 nl/min). The calibration of VFC system requires the study of point emitters (fluorescent beads) at physiologically relevant flow-rates (500–2000 nl/min) for determining flow-induced optical aberration in the system point spread function (PSF). Subsequently, the recorded raw images and volumes were computationally deconvolved with flow-variant PSF to reconstruct the cell volume. High throughput investigation of the mitochondrial network in HeLa cancer cell was carried out at sub-cellular resolution in real-time and critical parameters (mitochondria count and size distribution, morphology, entropy, and cell strain statistics) were determined on-the-go. These parameters determine the physiological state of cells, and the changes over-time, revealing the metastatic progression of diseases. Overall, the developed VFC system enables real-time monitoring of sub-cellular organelle organization at a high-throughput with high-content capacity.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [],
            "Attacker Capability": []
        }
    },
    {
        "title": "Diagnostic assessment of glaucoma and non-glaucomatous optic neuropathies via optical texture analysis of the retinal nerve fibre layer",
        "link": "https://www.nature.com/articles/s41551-021-00813-x",
        "publication_date": "06 Jan 2022",
        "abstract": "The clinical diagnostic evaluation of optic neuropathies relies on the analysis of the thickness of the retinal nerve fibre layer (RNFL) by optical coherence tomography (OCT). However, false positives and false negatives in the detection of RNFL abnormalities are common. Here we show that an algorithm integrating measurements of RNFL thickness and reflectance from standard wide-field OCT scans can be used to uncover the trajectories and optical texture of individual axonal fibre bundles in the retina and to discern distinctive patterns of loss of axonal fibre bundles in glaucoma, compressive optic neuropathy, optic neuritis and non-arteritic anterior ischaemic optic neuropathy. Such optical texture analysis can detect focal RNFL defects in early optic neuropathy, as well as residual axonal fibre bundles in end-stage optic neuropathy that were indiscernible by conventional OCT analysis and by red-free RNFL photography. In a diagnostic-performance study, optical texture analysis of the RNFL outperformed conventional OCT in the detection of glaucoma, as defined by visual-field testing or red-free photography. Our findings show that optical texture analysis of the RNFL for the detection of optic neuropathies is highly sensitive and specific.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Improving local prevalence estimates of SARS-CoV-2 infections using a causal debiasing framework",
        "link": "https://www.nature.com/articles/s41564-021-01029-0",
        "publication_date": "31 Dec 2021",
        "abstract": "Global and national surveillance of SARS-CoV-2 epidemiology is mostly based on targeted schemes focused on testing individuals with symptoms. These tested groups are often unrepresentative of the wider population and exhibit test positivity rates that are biased upwards compared with the true population prevalence. Such data are routinely used to infer infection prevalence and the effective reproduction number, Rt, which affects public health policy. Here, we describe a causal framework that provides debiased fine-scale spatiotemporal estimates by combining targeted test counts with data from a randomized surveillance study in the United Kingdom called REACT. Our probabilistic model includes a bias parameter that captures the increased probability of an infected individual being tested, relative to a non-infected individual, and transforms observed test counts to debiased estimates of the true underlying local prevalence and Rt. We validated our approach on held-out REACT data over a 7-month period. Furthermore, our local estimates of Rt are indicative of 1-week- and 2-week-ahead changes in SARS-CoV-2-positive case numbers. We also observed increases in estimated local prevalence and Rt that reflect the spread of the Alpha and Delta variants. Our results illustrate how randomized surveys can augment targeted testing to improve statistical accuracy in monitoring the spread of emerging and ongoing infectious disease.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A generative adversarial approach to facilitate archival-quality histopathologic diagnoses from frozen tissue sections",
        "link": "https://www.nature.com/articles/s41374-021-00718-y",
        "publication_date": "28 Dec 2021",
        "abstract": "In clinical diagnostics and research involving histopathology, formalin-fixed paraffin-embedded (FFPE) tissue is almost universally favored for its superb image quality. However, tissue processing time (>24 h) can slow decision-making. In contrast, fresh frozen (FF) processing (<1 h) can yield rapid information but diagnostic accuracy is suboptimal due to lack of clearing, morphologic deformation and more frequent artifacts. Here, we bridge this gap using artificial intelligence. We synthesize FFPE-like images (“virtual FFPE”) from FF images using a generative adversarial network (GAN) from 98 paired kidney samples derived from 40 patients. Five board-certified pathologists evaluated the results in a blinded test. Image quality of the virtual FFPE data was assessed to be high and showed a close resemblance to real FFPE images. Clinical assessments of disease on the virtual FFPE images showed a higher inter-observer agreement compared to FF images. The nearly instantaneously generated virtual FFPE images can not only reduce time to information but can facilitate more precise diagnosis from routine FF images without extraneous costs and effort.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting changes in glycemic control among adults with prediabetes from activity patterns collected by wearable devices",
        "link": "https://www.nature.com/articles/s41746-021-00541-1",
        "publication_date": "21 Dec 2021",
        "abstract": "The use of wearables is increasing and data from these devices could improve the prediction of changes in glycemic control. We conducted a randomized trial with adults with prediabetes who were given either a waist-worn or wrist-worn wearable to track activity patterns. We collected baseline information on demographics, medical history, and laboratory testing. We tested three models that predicted changes in hemoglobin A1c that were continuous, improved glycemic control by 5% or worsened glycemic control by 5%. Consistently in all three models, prediction improved when (a) machine learning was used vs. traditional regression, with ensemble methods performing the best; (b) baseline information with wearable data was used vs. baseline information alone; and (c) wrist-worn wearables were used vs. waist-worn wearables. These findings indicate that models can accurately identify changes in glycemic control among prediabetic adults, and this could be used to better allocate resources and target interventions to prevent progression to diabetes.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting surgical outcomes for chronic exertional compartment syndrome using a machine learning framework with embedded trust by interrogation strategies",
        "link": "https://www.nature.com/articles/s41598-021-03825-4",
        "publication_date": "20 Dec 2021",
        "abstract": "Chronic exertional compartment syndrome (CECS) is a condition occurring most frequently in the lower limbs and often requires corrective surgery to alleviate symptoms. Amongst military personnel, the success rates of this surgery can be as low as 20%, presenting a challenge in determining whether surgery is worthwhile. In this study, the data of 132 fasciotomies for CECS was analysed and using combinatorial feature selection methods, coupled with input from clinicians, identified a set of key clinical features contributing to the occupational outcomes of surgery. Features were utilised to develop a machine learning model for predicting return-to-work outcomes 12-months post-surgery. An AUC of 0.85 ± 0.08 was achieved using a linear-SVM, trained using 6 features (height, mean arterial pressure, pre-surgical score on the exercise-induced leg pain questionnaire, time from initial presentation to surgery, and whether a patient had received a prior surgery for CECS). To facilitate trust and transparency, interrogation strategies were used to identify reasons why certain patients were misclassified, using instance hardness measures. Model interrogation revealed that patient difficulty was associated with an overlap in the clinical characteristics of surgical outcomes, which was best handled by XGBoost and SVM-based models. The methodology was compiled into a machine learning framework, termed AITIA, which can be applied to other clinical problems. AITIA extends the typical machine learning pipeline, integrating the proposed interrogation strategy, allowing to user to reason and decide whether to trust the developed model based on the sensibility of its decision-making.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Comparisons of deep learning algorithms for diagnosing bacterial keratitis via external eye photographs",
        "link": "https://www.nature.com/articles/s41598-021-03572-6",
        "publication_date": "20 Dec 2021",
        "abstract": "Bacterial keratitis (BK), a painful and fulminant bacterial infection of the cornea, is the most common type of vision-threatening infectious keratitis (IK). A rapid clinical diagnosis by an ophthalmologist may often help prevent BK patients from progression to corneal melting or even perforation, but many rural areas cannot afford an ophthalmologist. Thanks to the rapid development of deep learning (DL) algorithms, artificial intelligence via image could provide an immediate screening and recommendation for patients with red and painful eyes. Therefore, this study aims to elucidate the potentials of different DL algorithms for diagnosing BK via external eye photos. External eye photos of clinically suspected IK were consecutively collected from five referral centers. The candidate DL frameworks, including ResNet50, ResNeXt50, DenseNet121, SE-ResNet50, EfficientNets B0, B1, B2, and B3, were trained to recognize BK from the photo toward the target with the greatest area under the receiver operating characteristic curve (AUROC). Via five-cross validation, EfficientNet B3 showed the most excellent average AUROC, in which the average percentage of sensitivity, specificity, positive predictive value, and negative predictive value was 74, 64, 77, and 61. There was no statistical difference in diagnostic accuracy and AUROC between any two of these DL frameworks. The diagnostic accuracy of these models (ranged from 69 to 72%) is comparable to that of the ophthalmologist (66% to 74%). Therefore, all these models are promising tools for diagnosing BK in first-line medical care units without ophthalmologists.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Clinical response to nivolumab in an INI1-deficient pediatric chordoma correlates with immunogenic recognition of brachyury",
        "link": "https://www.nature.com/articles/s41698-021-00238-4",
        "publication_date": "20 Dec 2021",
        "abstract": "Poorly differentiated chordoma (PDC) is a recently recognized subtype of chordoma characterized by expression of the embryonic transcription factor, brachyury, and loss of INI1. PDC primarily affects children and is associated with a poor prognosis and limited treatment options. Here we describe the molecular and immune tumour microenvironment profiles of two paediatric PDCs produced using whole-genome, transcriptome and whole-genome bisulfite sequencing (WGBS) and multiplex immunohistochemistry. Our analyses revealed the presence of tumour-associated immune cells, including CD8+ T cells, and expression of the immune checkpoint protein, PD-L1, in both patient samples. Molecular profiling provided the rationale for immune checkpoint inhibitor (ICI) therapy, which resulted in a clinical and radiographic response. A dominant T cell receptor (TCR) clone specific for a brachyury peptide–MHC complex was identified from bulk RNA sequencing, suggesting that targeting of the brachyury tumour antigen by tumour-associated T cells may underlie this clinical response to ICI. Correlative analysis with rhabdoid tumours, another INI1-deficient paediatric malignancy, suggests that a subset of tumours may share common immune phenotypes, indicating the potential for a therapeutically targetable subgroup of challenging paediatric cancers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Customizing skills for assistive robotic manipulators, an inverse reinforcement learning approach with error-related potentials",
        "link": "https://www.nature.com/articles/s42003-021-02891-8",
        "publication_date": "16 Dec 2021",
        "abstract": "Robotic assistance via motorized robotic arm manipulators can be of valuable assistance to individuals with upper-limb motor disabilities. Brain-computer interfaces (BCI) offer an intuitive means to control such assistive robotic manipulators. However, BCI performance may vary due to the non-stationary nature of the electroencephalogram (EEG) signals. It, hence, cannot be used safely for controlling tasks where errors may be detrimental to the user. Avoiding obstacles is one such task. As there exist many techniques to avoid obstacles in robotics, we propose to give the control to the robot to avoid obstacles and to leave to the user the choice of the robot behavior to do so a matter of personal preference as some users may be more daring while others more careful. We enable the users to train the robot controller to adapt its way to approach obstacles relying on BCI that detects error-related potentials (ErrP), indicative of the user’s error expectation of the robot’s current strategy to meet their preferences. Gaussian process-based inverse reinforcement learning, in combination with the ErrP-BCI, infers the user’s preference and updates the obstacle avoidance controller so as to generate personalized robot trajectories. We validate the approach in experiments with thirteen able-bodied subjects using a robotic arm that picks up, places and avoids real-life objects. Results show that the algorithm can learn user’s preference and adapt the robot behavior rapidly using less than five demonstrations not necessarily optimal.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Development and validation of a practical machine-learning triage algorithm for the detection of patients in need of critical care in the emergency department",
        "link": "https://www.nature.com/articles/s41598-021-03104-2",
        "publication_date": "15 Dec 2021",
        "abstract": "Identifying critically ill patients is a key challenge in emergency department (ED) triage. Mis-triage errors are still widespread in triage systems around the world. Here, we present a machine learning system (MLS) to assist ED triage officers better recognize critically ill patients and provide a text-based explanation of the MLS recommendation. To derive the MLS, an existing dataset of 22,272 patient encounters from 2012 to 2019 from our institution’s electronic emergency triage system (EETS) was used for algorithm training and validation. The area under the receiver operating characteristic curve (AUC) was 0.875 ± 0.006 (CI:95%) in retrospective dataset using fivefold cross validation, higher than that of reference model (0.843 ± 0.005 (CI:95%)). In the prospective cohort study, compared to the traditional triage system’s 1.2% mis-triage rate, the mis-triage rate in the MLS-assisted group was 0.9%. This MLS method with a real-time explanation for triage officers was able to lower the mis-triage rate of critically ill ED patients.",
        "conclusions": "It is challenging to accurately differentiate critically ill from stable patients in the ED, which can lead to life-threatening cases of mis-triage. This study’s MLS was able to reduce the life-threatening mis-triage rate from 1.2 to 0.9% in the prospective arm. Compared to previous studies, our MLS approach also provided a detailed explanation of each patient’s risk of mis-triage, and caused nearly 25% more triage calls to supervising ED physicians. Although MLS protocols can lower mis-triage rates, future prospective studies may shed more light on potential reductions in patient morbidity and mortality.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Prediction across healthcare settings: a case study in predicting emergency department disposition",
        "link": "https://www.nature.com/articles/s41746-021-00537-x",
        "publication_date": "15 Dec 2021",
        "abstract": "Several approaches exist today for developing predictive models across multiple clinical sites, yet there is a lack of comparative data on their performance, especially within the context of EHR-based prediction models. We set out to provide a framework for prediction across healthcare settings. As a case study, we examined an ED disposition prediction model across three geographically and demographically diverse sites. We conducted a 1-year retrospective study, including all visits in which the outcome was either discharge-to-home or hospitalization. Four modeling approaches were compared: a ready-made model trained at one site and validated at other sites, a centralized uniform model incorporating data from all sites, multiple site-specific models, and a hybrid approach of a ready-made model re-calibrated using site-specific data. Predictions were performed using XGBoost. The study included 288,962 visits with an overall admission rate of 16.8% (7.9–26.9%). Some risk factors for admission were prominent across all sites (e.g., high-acuity triage emergency severity index score, high prior admissions rate), while others were prominent at only some sites (multiple lab tests ordered at the pediatric sites, early use of ECG at the adult site). The XGBoost model achieved its best performance using the uniform and site-specific approaches (AUC = 0.9–0.93), followed by the calibrated-model approach (AUC = 0.87–0.92), and the ready-made approach (AUC = 0.62–0.85). Our results show that site-specific customization is a key driver of predictive model performance.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Preliminary feasibility assessment of CDM-based active surveillance using current status of medical device data in medical records and OMOP-CDM",
        "link": "https://www.nature.com/articles/s41598-021-03332-6",
        "publication_date": "15 Dec 2021",
        "abstract": "In recent years, there has been an emerging interest in the use of claims and electronic health record (EHR) data for evaluation of medical device safety and effectiveness. In Korea, national insurance electronic data interchange (EDI) code has been used as a medical device data source for common data model (CDM). This study performed a preliminary feasibility assessment of CDM-based vigilance. A cross-sectional study of target medical device data in EHR and CDM was conducted. A total of 155 medical devices were finally enrolled, with 58.7% of them having EDI codes. Femoral head prosthesis was selected as a focus group. It was registered in our institute with 11 EDI codes. However, only three EDI codes were converted to systematized nomenclature of medicine clinical terms concept. EDI code was matched in one-to-many (up to 104) with unique device identifier (UDI), including devices classified as different global medical device nomenclature. The use of UDI rather than EDI code as a medical device data source is recommended. We hope that this study will share the current state of medical device data recorded in the EHR and contribute to the introduction of CDM-based medical device vigilance by selecting appropriate medical device data sources.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "The illusion of having a large virtual body biases action-specific perception in patients with mild cognitive impairment",
        "link": "https://www.nature.com/articles/s41598-021-03571-7",
        "publication_date": "15 Dec 2021",
        "abstract": "The illusion of having a large body makes us perceive objects as smaller than they really are. This action-specific perception effect occurs because we perceive the property of an object (i.e., size) differently according to our unique action capability (i.e., the affordance of body size). Although the body-ownership illusion contributing to this action-specific perception has been studied, its effects remain unclear in neurological patients. We examined the action-specific perception impairments of MCI patients by means of body-ownership illusion in a non-immersive virtual reality environment. Twenty healthy young adults, 21 healthy older adults, and 15 MCI patients were recruited. We assessed their “original-body action-specific perception” and “enlarged-body action-specific perception” using the original and enlarged sizes of their virtual bodies, respectively. The MCI patients’ original-body action-specific perception was no different than that of the healthy controls (p = 0.679). However, the enlarged-body action-specific perception of the MCI patients was significantly biased (p < 0.001). The inclusion of the enlarged-body action-specific perception provides additional discriminative power for early diagnosis of MCI (89.3% accuracy, 75.0% sensitivity, 100.0% specificity, and 87.5% balanced accuracy).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "A machine and human reader study on AI diagnosis model safety under attacks of adversarial images",
        "link": "https://www.nature.com/articles/s41467-021-27577-x",
        "publication_date": "14 Dec 2021",
        "abstract": "While active efforts are advancing medical artificial intelligence (AI) model development and clinical translation, safety issues of the AI models emerge, but little research has been done. We perform a study to investigate the behaviors of an AI diagnosis model under adversarial images generated by Generative Adversarial Network (GAN) models and to evaluate the effects on human experts when visually identifying potential adversarial images. Our GAN model makes intentional modifications to the diagnosis-sensitive contents of mammogram images in deep learning-based computer-aided diagnosis (CAD) of breast cancer. In our experiments the adversarial samples fool the AI-CAD model to output a wrong diagnosis on 69.1% of the cases that are initially correctly classified by the AI-CAD model. Five breast imaging radiologists visually identify 29%-71% of the adversarial samples. Our study suggests an imperative need for continuing research on medical AI model’s safety issues and for developing potential defensive solutions against adversarial attacks.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Fusion of multi-scale bag of deep visual words features of chest X-ray images to detect COVID-19 infection",
        "link": "https://www.nature.com/articles/s41598-021-03287-8",
        "publication_date": "13 Dec 2021",
        "abstract": "Chest X-ray (CXR) images have been one of the important diagnosis tools used in the COVID-19 disease diagnosis. Deep learning (DL)-based methods have been used heavily to analyze these images. Compared to other DL-based methods, the bag of deep visual words-based method (BoDVW) proposed recently is shown to be a prominent representation of CXR images for their better discriminability. However, single-scale BoDVW features are insufficient to capture the detailed semantic information of the infected regions in the lungs as the resolution of such images varies in real application. In this paper, we propose a new multi-scale bag of deep visual words (MBoDVW) features, which exploits three different scales of the 4th pooling layer’s output feature map achieved from VGG-16 model. For MBoDVW-based features, we perform the Convolution with Max pooling operation over the 4th pooling layer using three different kernels: \\(1 \\times 1\\), \\(2 \\times 2\\), and \\(3 \\times 3\\). We evaluate our proposed features with the Support Vector Machine (SVM) classification algorithm on four CXR public datasets (CD1, CD2, CD3, and CD4) with over 5000 CXR images. Experimental results show that our method produces stable and prominent classification accuracy (84.37%, 88.88%, 90.29%, and 83.65% on CD1, CD2, CD3, and CD4, respectively).",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Determining chromosomal arms 1p/19q co-deletion status in low graded glioma by cross correlation-periodogram pattern analysis",
        "link": "https://www.nature.com/articles/s41598-021-03078-1",
        "publication_date": "13 Dec 2021",
        "abstract": "Prediction of mutational status of different graded glioma is extremely crucial for its diagnosis and treatment planning. Currently FISH and the surgical biopsy techniques are the ‘gold standard’ in the field of diagnostics; the analyses of which helps to decide appropriate treatment regime. In this study we proposed a novel approach to analyze structural MRI image signature pattern for predicting 1p/19q co-deletion status non-invasively. A total of 159 patients with grade-II and grade-III glioma were included in the analysis. These patients earlier underwent biopsy; the report of which confirmed 57 cases with no 1p/19q co-deletion and 102 cases with 1p/19q co-deletion. Tumor tissue heterogeneity was investigated by variance of cross correlation (VoCC). Significant differences in the pattern of VoCC between two classes was quantified using Lomb-Scargle (LS) periodogram. Energy and the cut-off frequency of LS power spectral density were derived and utilized as the features for classification. RUSBoost classifier was used that yield highest classification accuracy of 84% for G-II and 87% for G-III glioma respectively in classifying 1p/19q co-deleted and 1p/19q non-deleted glioma. In clinical practice the proposed technique can be utilized as a non-invasive pre-confirmatory test of glioma mutation, before wet-lab validation.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Effectiveness of LODS, OASIS, and SAPS II to predict in-hospital mortality for intensive care patients with ST elevation myocardial infarction",
        "link": "https://www.nature.com/articles/s41598-021-03397-3",
        "publication_date": "13 Dec 2021",
        "abstract": "The relationship between three scoring systems (LODS, OASIS, and SAPS II) and in-hospital mortality of intensive care patients with ST segment elevation myocardial infarction (STEMI) is currently inconclusive. The baseline data, LODS score, OASIS score, SAPS II score, and in-hospital prognosis of intensive care patients with STEMI were retrieved from the Medical Information Mart for Intensive Care IV database. Propensity score matching analysis was performed to reduce bias. Receiver operating characteristic curves (ROC) were drawn for the three scoring systems, and comparisons between the areas under the ROC curves (AUC) were conducted. Decision curve analysis (DCA) was performed to determine the net benefits of the three scoring systems. LODS and SAPS II were independent risk factors for in-hospital mortality. For the study cohort, the AUCs of LODS, OASIS, SAPS II were 0.867, 0.827, and 0.894; after PSM, the AUCs of LODS, OASIS, SAPS II were 0.877, 0.821, and 0.881. A stratified analysis of the patients who underwent percutaneous coronary intervention/coronary artery bypass grafting (PCI/CABG) or not was conducted. In the PCI/CABG group, the AUCs of LODS, OASIS, SAPS II were 0.853, 0.825, and 0.867, while in the non-PCI/CABG group, the AUCs of LODS, OASIS, SAPS II were 0.857, 0.804, and 0.897. The results of the Z test suggest that the predictive value of LODS and SAPS II was not statistically different, but both were higher than OASIS. According to the DCA, the net clinical benefit of LODS was the greatest. LODS and SAPS II have excellent predictive value, and in most cases, both were higher than OASIS. With a more concise composition and greater clinical benefit, LODS may be a better predictor of in-hospital mortality for intensive care patients with STEMI.",
        "conclusions": "Among the three scoring systems, LODS and SAPS II have excellent predictive value, and in most cases, both were higher than OASIS. With a more concise composition and greater clinical benefit, LODS may be a better predictor of in-hospital mortality for intensive care patients with STEMI.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Randomized trial of two artificial intelligence coaching interventions to increase physical activity in cancer survivors",
        "link": "https://www.nature.com/articles/s41746-021-00539-9",
        "publication_date": "09 Dec 2021",
        "abstract": "Physical activity (PA) has numerous health benefits. Personalized coaching may increase adherence to PA recommendations, but it is challenging to deliver personalized coaching in a scalable manner. The objective of our study was to determine whether novel artificially intelligent (AI) coaching interventions increase PA among overweight or obese, physically inactive cancer survivors compared to a control arm that receives health information. We conducted a single-center, three-arm randomized trial with equal allocation to (1) voice-assisted AI coaching delivered by smart speaker (MyCoach), (2) autonomous AI coaching delivered by text message (SmartText), and (3) control. Data collection was automated via sensors and voice technology, effectively masking outcome ascertainment. The primary outcome was change in mean steps per day from baseline to the end of follow-up at 4 weeks. Of the 42 randomized participants, 91% were female, and 36% were Black; mean age was 62.1 years, and mean BMI was 32.9 kg/m2. The majority were breast cancer survivors (85.7%). At the end of 4 weeks follow-up, steps increased in the MyCoach arm by an average of 3618.2 steps/day; the net gain in this arm was significantly greater [net difference = 3568.9 steps/day (95% CI: 1483–5655), P value <0.001] compared to control arm, and [net difference = 2160.6 steps/day (95% CI: 11–4310), P value 0.049] compared to SmartText. In conclusion, AI-based voice-assisted coaching shows promise as a practical method of delivering scalable, individualized coaching to increase physical activity in sedentary cancer survivors. Additional research is needed to replicate these findings in a broader population of cancer survivors and to investigate the effects of these interventions in the general population.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Long-term ecological assessment of intracranial electrophysiology synchronized to behavioral markers in obsessive-compulsive disorder",
        "link": "https://www.nature.com/articles/s41591-021-01550-z",
        "publication_date": "09 Dec 2021",
        "abstract": "Detection of neural signatures related to pathological behavioral states could enable adaptive deep brain stimulation (DBS), a potential strategy for improving efficacy of DBS for neurological and psychiatric disorders. This approach requires identifying neural biomarkers of relevant behavioral states, a task best performed in ecologically valid environments. Here, in human participants with obsessive-compulsive disorder (OCD) implanted with recording-capable DBS devices, we synchronized chronic ventral striatum local field potentials with relevant, disease-specific behaviors. We captured over 1,000 h of local field potentials in the clinic and at home during unstructured activity, as well as during DBS and exposure therapy. The wide range of symptom severity over which the data were captured allowed us to identify candidate neural biomarkers of OCD symptom intensity. This work demonstrates the feasibility and utility of capturing chronic intracranial electrophysiology during daily symptom fluctuations to enable neural biomarker identification, a prerequisite for future development of adaptive DBS for OCD and other psychiatric disorders.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Machine learning of native T1 mapping radiomics for classification of hypertrophic cardiomyopathy phenotypes",
        "link": "https://www.nature.com/articles/s41598-021-02971-z",
        "publication_date": "08 Dec 2021",
        "abstract": "We explored whether radiomic features from T1 maps by cardiac magnetic resonance (CMR) could enhance the diagnostic value of T1 mapping in distinguishing health from disease and classifying cardiac disease phenotypes. A total of 149 patients (n = 30 with no heart disease, n = 30 with LVH, n = 61 with hypertrophic cardiomyopathy (HCM) and n = 28 with cardiac amyloidosis) undergoing a CMR scan were included in this study. We extracted a total of 850 radiomic features and explored their value in disease classification. We applied principal component analysis and unsupervised clustering in exploratory analysis, and then machine learning for feature selection of the best radiomic features that maximized the diagnostic value for cardiac disease classification. The first three principal components of the T1 radiomics were distinctively correlated with cardiac disease type. Unsupervised hierarchical clustering of the population by myocardial T1 radiomics was significantly associated with myocardial disease type (chi2 = 55.98, p < 0.0001). After feature selection, internal validation and external testing, a model of T1 radiomics had good diagnostic performance (AUC 0.753) for multinomial classification of disease phenotype (normal vs. LVH vs. HCM vs. cardiac amyloid). A subset of six radiomic features outperformed mean native T1 values for classification between myocardial health vs. disease and HCM phenocopies (AUC of T1 vs. radiomics model, for normal: 0.549 vs. 0.888; for LVH: 0.645 vs. 0.790; for HCM 0.541 vs. 0.638; and for cardiac amyloid 0.769 vs. 0.840). We show that myocardial texture assessed by native T1 maps is linked to features of cardiac disease. Myocardial radiomic phenotyping could enhance the diagnostic yield of T1 mapping for myocardial disease detection and classification.",
        "conclusions": "In conclusion, we have presented a novel approach for myocardial texture phenotyping using T1 radiomics analysis. We demonstrated and validated by a machine learning approach that radiomic features provide added diagnostic value for distinction between healthy and diseased myocardium, as well as for differentiation between HCM and relevant phenocopies, such as amyloidosis, on top of native T1. The application of radiomics to standard native T1 mapping is a promising approach for the texture characterization of the human myocardium and for further enhancing the diagnostic value of CMR.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Predicting anesthetic infusion events using machine learning",
        "link": "https://www.nature.com/articles/s41598-021-03112-2",
        "publication_date": "08 Dec 2021",
        "abstract": "Recently, research has been conducted to automatically control anesthesia using machine learning, with the aim of alleviating the shortage of anesthesiologists. In this study, we address the problem of predicting decisions made by anesthesiologists during surgery using machine learning; specifically, we formulate a decision making problem by increasing the flow rate at each time point in the continuous administration of analgesic remifentanil as a supervised binary classification problem. The experiments were conducted to evaluate the prediction performance using six machine learning models: logistic regression, support vector machine, random forest, LightGBM, artificial neural network, and long short-term memory (LSTM), using 210 case data collected during actual surgeries. The results demonstrated that when predicting the future increase in flow rate of remifentanil after 1 min, the model using LSTM was able to predict with scores of 0.659 for sensitivity, 0.732 for specificity, and 0.753 for ROC-AUC; this demonstrates the potential to predict the decisions made by anesthesiologists using machine learning. Furthermore, we examined the importance and contribution of the features of each model using Shapley additive explanations—a method for interpreting predictions made by machine learning models. The trends indicated by the results were partially consistent with known clinical findings.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Intraoperative discrimination of native meningioma and dura mater by Raman spectroscopy",
        "link": "https://www.nature.com/articles/s41598-021-02977-7",
        "publication_date": "08 Dec 2021",
        "abstract": "Meningiomas are among the most frequent tumors of the central nervous system. For a total resection, shown to decrease recurrences, it is paramount to reliably discriminate tumor tissue from normal dura mater intraoperatively. Raman spectroscopy (RS) is a non-destructive, label-free method for vibrational analysis of biochemical molecules. On the microscopic level, RS was already used to differentiate meningioma from dura mater. In this study we test its suitability for intraoperative macroscopic meningioma diagnostics. RS is applied to surgical specimen of intracranial meningiomas. The main purpose is the differentiation of tumor from normal dura mater, in order to potentially accelerate the diagnostic workflow. The collected meningioma and dura mater samples (n = 223 tissue samples from a total of 59 patients) are analyzed under untreated conditions using a new partially robotized RS acquisition system. Spectra (n = 1273) are combined with the according histopathological analysis for each sample. Based on this, a classifier is trained via machine learning. Our trained classifier separates meningioma and dura mater with a sensitivity of 96.06 \\(\\pm \\) 0.03% and a specificity of 95.44 \\(\\pm \\) 0.02% for internal fivefold cross validation and 100% and 93.97% if validated with an external test set. RS is an efficient method to discriminate meningioma from healthy dura mater in fresh tissue samples without additional processing or histopathological imaging. It is a quick and reliable complementary diagnostic tool to the neuropathological workflow and has potential for guided surgery. RS offers a safe way to examine unfixed surgical specimens in a perioperative setting.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Multi-omic machine learning predictor of breast cancer therapy response",
        "link": "https://www.nature.com/articles/s41586-021-04278-5",
        "publication_date": "07 Dec 2021",
        "abstract": "Breast cancers are complex ecosystems of malignant cells and the tumour microenvironment1. The composition of these tumour ecosystems and interactions within them contribute to responses to cytotoxic therapy2. Efforts to build response predictors have not incorporated this knowledge. We collected clinical, digital pathology, genomic and transcriptomic profiles of pre-treatment biopsies of breast tumours from 168 patients treated with chemotherapy with or without HER2 (encoded by ERBB2)-targeted therapy before surgery. Pathology end points (complete response or residual disease) at surgery3 were then correlated with multi-omic features in these diagnostic biopsies. Here we show that response to treatment is modulated by the pre-treated tumour ecosystem, and its multi-omics landscape can be integrated in predictive models using machine learning. The degree of residual disease following therapy is monotonically associated with pre-therapy features, including tumour mutational and copy number landscapes, tumour proliferation, immune infiltration and T cell dysfunction and exclusion. Combining these features into a multi-omic machine learning model predicted a pathological complete response in an external validation cohort (75 patients) with an area under the curve of 0.87. In conclusion, response to therapy is determined by the baseline characteristics of the totality of the tumour ecosystem captured through data integration and machine learning. This approach could be used to develop predictors for other cancers.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [
                "evasion"
            ],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Quantum deep reinforcement learning for clinical decision support in oncology: application to adaptive radiotherapy",
        "link": "https://www.nature.com/articles/s41598-021-02910-y",
        "publication_date": "07 Dec 2021",
        "abstract": "Subtle differences in a patient’s genetics and physiology may alter radiotherapy (RT) treatment responses, motivating the need for a more personalized treatment plan. Accordingly, we have developed a novel quantum deep reinforcement learning (qDRL) framework for clinical decision support that can estimate an individual patient’s dose response mid-treatment and recommend an optimal dose adjustment. Our framework considers patients’ specific information including biological, physical, genetic, clinical, and dosimetric factors. Recognizing that physicians must make decisions amidst uncertainty in RT treatment outcomes, we employed indeterministic quantum states to represent human decision making in a real-life scenario. We paired quantum decision states with a model-based deep q-learning algorithm to optimize the clinical decision-making process in RT. We trained our proposed qDRL framework on an institutional dataset of 67 stage III non-small cell lung cancer (NSCLC) patients treated on prospective adaptive protocols and independently validated our framework in an external multi-institutional dataset of 174 NSCLC patients. For a comprehensive evaluation, we compared three frameworks: DRL, qDRL trained in a Qiskit quantum computing simulator, and qDRL trained in an IBM quantum computer. Two metrics were considered to evaluate our framework: (1) similarity score, defined as the root mean square error between retrospective clinical decisions and the AI recommendations, and (2) self-evaluation scheme that compares retrospective clinical decisions and AI recommendations based on the improvement in the observed clinical outcomes. Our analysis shows that our framework, which takes into consideration individual patient dose response in its decision-making, can potentially improve clinical RT decision-making by at least about 10% compared to unaided clinical practice. Further validation of our novel quantitative approach in a prospective study will provide a necessary framework for improving the standard of care in personalized RT.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Personalized modulation of coagulation factors using a thrombin dynamics model to treat trauma-induced coagulopathy",
        "link": "https://www.nature.com/articles/s41540-021-00202-9",
        "publication_date": "07 Dec 2021",
        "abstract": "Current trauma-induced coagulopathy resuscitation protocols use slow laboratory measurements, rules-of-thumb, and clinician gestalt to administer large volumes of uncharacterized, non-tailored blood products. These one-size-fits-all treatment approaches have high mortality. Here, we provide significant evidence that trauma patient survival 24 h after hospital admission occurs if and only if blood protein coagulation factor concentrations equilibrate at a normal value, either from inadvertent plasma-based modulation or from innate compensation. This result motivates quantitatively guiding trauma patient coagulation factor levels while accounting for protein interactions. Toward such treatment, we develop a Goal-oriented Coagulation Management (GCM) algorithm, a personalized and automated ordered sequence of operations to compute and specify coagulation factor concentrations that rectify clotting. This novel GCM algorithm also integrates new control-oriented advancements that we make in this work: an improvement of a prior thrombin dynamics model that captures the coagulation process to control, a use of rapidly-measurable concentrations to help predict patient state, and an accounting of patient-specific effects and limitations when adding coagulation factors to remedy coagulopathy. Validation of the GCM algorithm’s guidance shows superior performance over clinical practice in attaining normal coagulation factor concentrations and normal clotting profiles simultaneously.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Rib fracture detection system based on deep learning",
        "link": "https://www.nature.com/articles/s41598-021-03002-7",
        "publication_date": "06 Dec 2021",
        "abstract": "Rib fracture detection is time-consuming and demanding work for radiologists. This study aimed to introduce a novel rib fracture detection system based on deep learning which can help radiologists to diagnose rib fractures in chest computer tomography (CT) images conveniently and accurately. A total of 1707 patients were included in this study from a single center. We developed a novel rib fracture detection system on chest CT using a three-step algorithm. According to the examination time, 1507, 100 and 100 patients were allocated to the training set, the validation set and the testing set, respectively. Free Response ROC analysis was performed to evaluate the sensitivity and false positivity of the deep learning algorithm. Precision, recall, F1-score, negative predictive value (NPV) and detection and diagnosis were selected as evaluation metrics to compare the diagnostic efficiency of this system with radiologists. The radiologist-only study was used as a benchmark and the radiologist-model collaboration study was evaluated to assess the model’s clinical applicability. A total of 50,170,399 blocks (fracture blocks, 91,574; normal blocks, 50,078,825) were labelled for training. The F1-score of the Rib Fracture Detection System was 0.890 and the precision, recall and NPV values were 0.869, 0.913 and 0.969, respectively. By interacting with this detection system, the F1-score of the junior and the experienced radiologists had improved from 0.796 to 0.925 and 0.889 to 0.970, respectively; the recall scores had increased from 0.693 to 0.920 and 0.853 to 0.972, respectively. On average, the diagnosis time of radiologist assisted with this detection system was reduced by 65.3 s. The constructed Rib Fracture Detection System has a comparable performance with the experienced radiologist and is readily available to automatically detect rib fracture in the clinical setting with high efficacy, which could reduce diagnosis time and radiologists’ workload in the clinical practice.",
        "conclusions": "This study developed a Rib Fracture Detection System that achieved high performance in rib fracture detection on chest CT images based on the deep learning algorithm. By radiologist-model collaboration, radiologists can significantly reduce their workload, and minimize misdiagnosis. This Rib Fracture Detection System is readily available in the clinical setting.",
        "ml_techniques": [
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Pilot imaging study of o-BMVC foci for discrimination of indeterminate cytology in diagnosing fine-needle aspiration of thyroid nodules",
        "link": "https://www.nature.com/articles/s41598-021-02887-8",
        "publication_date": "06 Dec 2021",
        "abstract": "Fluorescence lifetime imaging microscopy of a fluorescence probe, 3,6-bis(1-methyl-2-vinylpyridinium) carbazole diiodide (o-BMVC), provides an objective method for preoperative diagnosis of fine-needle aspiration (FNA) of thyroid nodules. The key of this o-BMVC test of FNA smears is the measurement of the digital number of o-BMVC foci in the nucleus. Thus, there are three categories classified in the o-BMVC test, which are nondiagnostic for unsatisfactory samples, benign for less numbers of o-BMVC foci, and malignant for more numbers of o-BMVC foci. The discrimination of indeterminate (including atypia, follicular neoplasm, suspicious) cytology into benign or malignant cases can reduce diagnostic uncertainty and benefit clinical decision making. This pilot study strongly suggests that the o-BMVC test is an invaluable method for diagnosing FNA samples. Particularly, the combination of FNA cytology and the o-BMVC test holds great promise to improve the efficacy of diagnosis and reduce the healthcare costs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Azvudine is a thymus-homing anti-SARS-CoV-2 drug effective in treating COVID-19 patients",
        "link": "https://www.nature.com/articles/s41392-021-00835-6",
        "publication_date": "06 Dec 2021",
        "abstract": "Azvudine (FNC) is a nucleoside analog that inhibits HIV-1 RNA-dependent RNA polymerase (RdRp). Recently, we discovered FNC an agent against SARS-CoV-2, and have taken it into Phase III trial for COVID-19 patients. FNC monophosphate analog inhibited SARS-CoV-2 and HCoV-OC43 coronavirus with an EC50 between 1.2 and 4.3 μM, depending on viruses or cells, and selective index (SI) in 15–83 range. Oral administration of FNC in rats revealed a substantial thymus-homing feature, with FNC triphosphate (the active form) concentrated in the thymus and peripheral blood mononuclear cells (PBMC). Treating SARS-CoV-2 infected rhesus macaques with FNC (0.07 mg/kg, qd, orally) reduced viral load, recuperated the thymus, improved lymphocyte profiles, alleviated inflammation and organ damage, and lessened ground-glass opacities in chest X-ray. Single-cell sequencing suggested the promotion of thymus function by FNC. A randomized, single-arm clinical trial of FNC on compassionate use (n = 31) showed that oral FNC (5 mg, qd) cured all COVID-19 patients, with 100% viral ribonucleic acid negative conversion in 3.29 ± 2.22 days (range: 1–9 days) and 100% hospital discharge rate in 9.00 ± 4.93 days (range: 2–25 days). The side-effect of FNC is minor and transient dizziness and nausea in 16.12% (5/31) patients. Thus, FNC might cure COVID-19 through its anti-SARS-CoV-2 activity concentrated in the thymus, followed by promoted immunity.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Antimicrobial resistance in commensal opportunistic pathogens isolated from non-sterile sites can be an effective proxy for surveillance in bloodstream infections",
        "link": "https://www.nature.com/articles/s41598-021-02755-5",
        "publication_date": "03 Dec 2021",
        "abstract": "Antimicrobial resistance (AMR) surveillance in bloodstream infections (BSIs) is challenging in low/middle-income countries (LMICs) given limited laboratory capacity. Other specimens are easier to collect and process and are more likely to be culture-positive. In 8102 E. coli BSIs, 322,087 E. coli urinary tract infections, 6952 S. aureus BSIs and 112,074 S. aureus non-sterile site cultures from Oxfordshire (1998–2018), and other (55,296 isolates) rarer commensal opportunistic pathogens, antibiotic resistance trends over time in blood were strongly associated with those in other specimens (maximum cross-correlation per drug 0.51–0.99). Resistance prevalence was congruent across drug-years for each species (276/312 (88%) species-drug-years with prevalence within ± 10% between blood/other isolates). Results were similar across multiple countries in high/middle/low income-settings in the independent ATLAS dataset (103,559 isolates, 2004–2017) and three further LMIC hospitals/programmes (6154 isolates, 2008–2019). AMR in commensal opportunistic pathogens cultured from BSIs is strongly associated with AMR in commensal opportunistic pathogens cultured from non-sterile sites over calendar time, suggesting the latter could be used as an effective proxy for AMR surveillance in BSIs.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Validation of expert system enhanced deep learning algorithm for automated screening for COVID-Pneumonia on chest X-rays",
        "link": "https://www.nature.com/articles/s41598-021-02003-w",
        "publication_date": "01 Dec 2021",
        "abstract": "SARS-CoV2 pandemic exposed the limitations of artificial intelligence based medical imaging systems. Earlier in the pandemic, the absence of sufficient training data prevented effective deep learning (DL) solutions for the diagnosis of COVID-19 based on X-Ray data. Here, addressing the lacunae in existing literature and algorithms with the paucity of initial training data; we describe CovBaseAI, an explainable tool using an ensemble of three DL models and an expert decision system (EDS) for COVID-Pneumonia diagnosis, trained entirely on pre-COVID-19 datasets. The performance and explainability of CovBaseAI was primarily validated on two independent datasets. Firstly, 1401 randomly selected CxR from an Indian quarantine center to assess effectiveness in excluding radiological COVID-Pneumonia requiring higher care. Second, curated dataset; 434 RT-PCR positive cases and 471 non-COVID/Normal historical scans, to assess performance in advanced medical settings. CovBaseAI had an accuracy of 87% with a negative predictive value of 98% in the quarantine-center data. However, sensitivity was 0.66–0.90 taking RT-PCR/radiologist opinion as ground truth. This work provides new insights on the usage of EDS with DL methods and the ability of algorithms to confidently predict COVID-Pneumonia while reinforcing the established learning; that benchmarking based on RT-PCR may not serve as reliable ground truth in radiological diagnosis. Such tools can pave the path for multi-modal high throughput detection of COVID-Pneumonia in screening and referral.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": [
                "model control"
            ]
        }
    },
    {
        "title": "Drug repurposing for COVID-19 using graph neural network and harmonizing multiple evidence",
        "link": "https://www.nature.com/articles/s41598-021-02353-5",
        "publication_date": "30 Nov 2021",
        "abstract": "Since the 2019 novel coronavirus disease (COVID-19) outbreak in 2019 and the pandemic continues for more than one year, a vast amount of drug research has been conducted and few of them got FDA approval. Our objective is to prioritize repurposable drugs using a pipeline that systematically integrates the interaction between COVID-19 and drugs, deep graph neural networks, and in vitro/population-based validations. We first collected all available drugs (n = 3635) related to COVID-19 patient treatment through CTDbase. We built a COVID-19 knowledge graph based on the interactions among virus baits, host genes, pathways, drugs, and phenotypes. A deep graph neural network approach was used to derive the candidate drug’s representation based on the biological interactions. We prioritized the candidate drugs using clinical trial history, and then validated them with their genetic profiles, in vitro experimental efficacy, and population-based treatment effect. We highlight the top 22 drugs including Azithromycin, Atorvastatin, Aspirin, Acetaminophen, and Albuterol. We further pinpointed drug combinations that may synergistically target COVID-19. In summary, we demonstrated that the integration of extensive interactions, deep neural networks, and multiple evidence can facilitate the rapid identification of candidate drugs for COVID-19 treatment.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Is tumour volume an independent predictor of outcome after radical prostatectomy for high-risk prostate cancer?",
        "link": "https://www.nature.com/articles/s41391-021-00468-4",
        "publication_date": "29 Nov 2021",
        "abstract": "Preoperative PSA, ISUP grade group (GG), prostate examination and multiparametric MRI (mpMRI) form the basis of prostate cancer staging. Unlike other solid organ tumours, tumour volume (TV) is not routinely used aside from crude estimates such as maximum cancer core length. The aim of this study is to assess the role of TV as a marker for oncological outcomes in high-risk non-metastatic prostate cancer.",
        "conclusions": "We conclude that reasonable experimental evidence of measured pathological TV as independent oncological prognosticator exists in this cohort of patients despite the limited value over existing markers. Our results support the following working hypothesis for future studies: segmented TV from preoperative mpMRI scans correlates with pathological TV and independently predicts oncological outcome.",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Distinctive prosodic features of people with autism spectrum disorder: a systematic review and meta-analysis study",
        "link": "https://www.nature.com/articles/s41598-021-02487-6",
        "publication_date": "29 Nov 2021",
        "abstract": "In this systematic review, we analyzed and evaluated the findings of studies on prosodic features of vocal productions of people with autism spectrum disorder (ASD) in order to recognize the statistically significant, most confirmed and reliable prosodic differences distinguishing people with ASD from typically developing individuals. Using suitable keywords, three major databases including Web of Science, PubMed and Scopus, were searched. The results for prosodic features such as mean pitch, pitch range and variability, speech rate, intensity and voice duration were extracted from eligible studies. The pooled standard mean difference between ASD and control groups was extracted or calculated. Using I2 statistic and Cochrane Q-test, between-study heterogeneity was evaluated. Furthermore, publication bias was assessed using funnel plot and its significance was evaluated using Egger’s and Begg’s tests. Thirty-nine eligible studies were retrieved (including 910 and 850 participants for ASD and control groups, respectively). This systematic review and meta-analysis showed that ASD group members had a significantly larger mean pitch (SMD =  − 0.4, 95% CI [− 0.70, − 0.10]), larger pitch range (SMD =  − 0.78, 95% CI [− 1.34, − 0.21]), longer voice duration (SMD =  − 0.43, 95% CI [− 0.72, − 0.15]), and larger pitch variability (SMD = − 0.46, 95% CI [− 0.84, − 0.08]), compared with typically developing control group. However, no significant differences in pitch standard deviation, voice intensity and speech rate were found between groups. Chronological age of participants and voice elicitation tasks were two sources of between-study heterogeneity. Furthermore, no publication bias was observed during analyses (p > 0.05). Mean pitch, pitch range, pitch variability and voice duration were recognized as the prosodic features reliably distinguishing people with ASD from TD individuals.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Combining machine learning and conventional statistical approaches for risk factor discovery in a large cohort study",
        "link": "https://www.nature.com/articles/s41598-021-02476-9",
        "publication_date": "26 Nov 2021",
        "abstract": "We present a simple and efficient hypothesis-free machine learning pipeline for risk factor discovery that accounts for non-linearity and interaction in large biomedical databases with minimal variable pre-processing. In this study, mortality models were built using gradient boosting decision trees (GBDT) and important predictors were identified using a Shapley values-based feature attribution method, SHAP values. Cox models controlled for false discovery rate were used for confounder adjustment, interpretability, and further validation. The pipeline was tested using information from 502,506 UK Biobank participants, aged 37–73 years at recruitment and followed over seven years for mortality registrations. From the 11,639 predictors included in GBDT, 193 potential risk factors had SHAP values ≥ 0.05, passed the correlation test, and were selected for further modelling. Of the total variable importance summed up, 60% was directly health related, and baseline characteristics, sociodemographics, and lifestyle factors each contributed about 10%. Cox models adjusted for baseline characteristics, showed evidence for an association with mortality for 166 out of the 193 predictors. These included mostly well-known risk factors (e.g., age, sex, ethnicity, education, material deprivation, smoking, physical activity, self-rated health, BMI, and many disease outcomes). For 19 predictors we saw evidence for an association in the unadjusted but not adjusted analyses, suggesting bias by confounding. Our GBDT-SHAP pipeline was able to identify relevant predictors ‘hidden’ within thousands of variables, providing an efficient and pragmatic solution for the first stage of hypothesis free risk factor identification.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "DNN"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "Direct pixel to pixel principal strain mapping from tagging MRI using end to end deep convolutional neural network (DeepStrain)",
        "link": "https://www.nature.com/articles/s41598-021-02279-y",
        "publication_date": "26 Nov 2021",
        "abstract": "Regional soft tissue mechanical strain offers crucial insights into tissue's mechanical function and vital indicators for different related disorders. Tagging magnetic resonance imaging (tMRI) has been the standard method for assessing the mechanical characteristics of organs such as the heart, the liver, and the brain. However, constructing accurate artifact-free pixelwise strain maps at the native resolution of the tagged images has for decades been a challenging unsolved task. In this work, we developed an end-to-end deep-learning framework for pixel-to-pixel mapping of the two-dimensional Eulerian principal strains \\(\\varvec{{\\varepsilon }}_{\\boldsymbol{p1}}\\) and \\(\\varvec{{\\varepsilon }}_{\\boldsymbol{p2}}\\) directly from 1-1 spatial modulation of magnetization (SPAMM) tMRI at native image resolution using convolutional neural network (CNN). Four different deep learning conditional generative adversarial network (cGAN) approaches were examined. Validations were performed using Monte Carlo computational model simulations, and in-vivo datasets, and compared to the harmonic phase (HARP) method, a conventional and validated method for tMRI analysis, with six different filter settings. Principal strain maps of Monte Carlo tMRI simulations with various anatomical, functional, and imaging parameters demonstrate artifact-free solid agreements with the corresponding ground-truth maps. Correlations with the ground-truth strain maps were R = 0.90 and 0.92 for the best-proposed cGAN approach compared to R = 0.12 and 0.73 for the best HARP method for \\(\\varvec{{\\varepsilon }}_{\\boldsymbol{p1}}\\) and \\(\\varvec{{\\varepsilon }}_{\\boldsymbol{p2}}\\), respectively. The proposed cGAN approach's error was substantially lower than the error in the best HARP method at all strain ranges. In-vivo results are presented for both healthy subjects and patients with cardiac conditions (Pulmonary Hypertension). Strain maps, obtained directly from their corresponding tagged MR images, depict for the first time anatomical, functional, and temporal details at pixelwise native high resolution with unprecedented clarity. This work demonstrates the feasibility of using the deep learning cGAN for direct myocardial and liver Eulerian strain mapping from tMRI at native image resolution with minimal artifacts.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "DNN",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "An ensemble-based approach for estimating personalized intraocular lens power",
        "link": "https://www.nature.com/articles/s41598-021-02288-x",
        "publication_date": "25 Nov 2021",
        "abstract": "The fundamental difference between modern formulae for intraocular lens (IOL) power calculation lies on the single ad hoc regression model they use to estimate the effective lens position (ELP). The ELP is very difficult to predict and its estimation is considered critical for an accurate prediction of the required IOL power of the lens to be implanted during cataract surgery. Hence, more advanced prediction techniques, which improve the prediction accuracy of the ELP, could play a decisive role in improving patient refractive outcomes. This study introduced a new approach for the calculation of personalized IOL power, which used an ensemble of regression models to devise a more accurate and robust prediction of the ELP. The concept of cross-validation was used to rigorously assess the performance of the devised formula against the most commonly used and published formulae. The results from this study show that overall, the proposed approach outperforms the most commonly used modern formulae (namely, Haigis, Holladay I, Hoffer Q and SRK/T) in terms of mean absolute prediction errors and prediction accuracy i.e., the percentage of eyes within ± 0.5D and ± 1 D ranges of prediction, for various ranges of axial lengths of the eyes. The new formula proposed in this study exhibited some promising features in terms of robustness. This enables the new formula to cope with variations in the axial length, the pre-operative anterior chamber depth and the keratometry readings of the corneal power; hence mitigating the impact of their measurement accuracy. Furthermore, the new formula performed well for both monofocal and multifocal lenses.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    },
    {
        "title": "COVID-19 assessment in family practice—A clinical decision rule based on self-rated symptoms and contact history",
        "link": "https://www.nature.com/articles/s41533-021-00258-4",
        "publication_date": "25 Nov 2021",
        "abstract": "The study aimed to evaluate the diagnostic accuracy of contact history and clinical symptoms and to develop decision rules for ruling-in and ruling-out SARS-CoV-2 infection in family practice. We performed a prospective diagnostic study. Consecutive inclusion of patients coming for COVID-PCR testing to 19 general practices. Contact history and self-reported symptoms served as index test. PCR testing of nasopharyngeal swabs served as reference standard. Complete data were available from 1141 patients, 605 (53.0%) female, average age 42.2 years, 182 (16.0%) COVID-PCR positive. Multivariable logistic regression showed highest odds ratios (ORs) for “contact with infected person” (OR 9.22, 95% CI 5.61–15.41), anosmia/ageusia (8.79, 4.89–15.95), fever (4.25, 2.56–7.09), and “sudden disease onset” (2.52, 1.55–4.14). Patients with “contact with infected person” or “anosmia/ageusia” with or without self-reported “fever” had a high probability of COVID infection up to 84.8%. Negative response to the four items “contact with infected person, anosmia/ageusia, fever, sudden disease onset” showed a negative predictive value (NPV) of 0.98 (95% CI 0.96–0.99). This was present in 446 (39.1%) patients. NPV of “completely asymptomatic,” “no contact,” “no risk area” was 1.0 (0.96–1.0). This was present in 84 (7.4%) patients. To conclude, the combination of four key items allowed exclusion of SARS-CoV-2 infection with high certainty. With the goal of 100% exclusion of SARS-CoV-2 infection to prevent the spread of SARS-CoV-2 to the population level, COVID-PCR testing could be saved only for patients with negative response in all items. The decision rule might also help for ruling-in SARS-CoV-2 infection in terms of rapid assessment of infection risk.",
        "conclusions": "Conclusions not available",
        "ml_techniques": [
            "Traditional ML",
            "Gen AI"
        ],
        "security_privacy": {
            "Attack Types": [],
            "Attacker Identity": [
                "patient"
            ],
            "Attacker Capability": []
        }
    }
]